
#Область ПрограммныйИнтерфейс

Процедура ОповеститьОЗавершенииДлительнойОперацииЭТД(Результат, ПараметрыОповещения) Экспорт

	Если ПараметрыОповещения.ИмяФормы = "Обработка.ОбменЭТД.Форма.РабочееМестоЭТД"
		ИЛИ ПараметрыОповещения.ИмяФормы = "Документ.ЭТД.Форма.ФормаДокумента" Тогда
		
		Если ПараметрыОповещения.Свойство("ДополнительныеОповещения") Тогда
			
			Для Каждого ДополнительноеОповещение Из ПараметрыОповещения.ДополнительныеОповещения Цикл
				Оповестить(ДополнительноеОповещение.Ключ, Результат, ПараметрыОповещения.ИмяФормы);
			КонецЦикла;
			
		Иначе
			
			Оповестить("ФоновоеЗаданиеЭТД", Результат, ПараметрыОповещения.ИмяФормы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверятьОповещенияФоновогоЗадания(ЭтаФорма, РезультатРаботыЗадания) Экспорт

	Если РезультатРаботыЗадания = Неопределено
		ИЛИ НЕ ТипЗнч(РезультатРаботыЗадания) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатРаботыЗадания.Статус = "Выполнено" Тогда
		
		СообщенияПользователю = РезультатРаботыЗадания.Сообщения;
		
		Если СообщенияПользователю <> Неопределено Тогда
			Для Каждого СообщениеФоновогоЗадания Из СообщенияПользователю Цикл
				СообщениеФоновогоЗадания.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
				СообщениеФоновогоЗадания.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ДополнительныеОповещения = ?(РезультатРаботыЗадания.Свойство("ДополнительныеОповещения"), РезультатРаботыЗадания.ДополнительныеОповещения, Новый Структура);
		Для Каждого ДополнительноеОповещение Из ДополнительныеОповещения Цикл
			Оповестить(ДополнительноеОповещение.Ключ, РезультатРаботыЗадания, ЭтаФорма);
		КонецЦикла;

	Иначе
	
		ПараметрыДлительнойОперации = Новый Структура;
		ПараметрыДлительнойОперации.Вставить("ИдентификаторЗадания", РезультатРаботыЗадания.ИдентификаторЗадания);
		ПараметрыДлительнойОперации.Вставить("ВыводитьОкноОжидания", Истина);
		ПараметрыДлительнойОперации.Вставить("АдресРезультата", РезультатРаботыЗадания.АдресРезультата);
		ПараметрыДлительнойОперации.Вставить("ВыводитьСообщения", Истина);
		
		Если РезультатРаботыЗадания.Свойство("ТекстСообщения") Тогда
			ПараметрыДлительнойОперации.Вставить("ТекстСообщения", РезультатРаботыЗадания.ТекстСообщения);
		КонецЕсли;
		
		ПараметрыОповещения = Новый Структура("ИмяФормы", ЭтаФорма.ИмяФормы);
		
		Если РезультатРаботыЗадания.Свойство("ДополнительныеОповещения") Тогда
			ПараметрыОповещения.Вставить("ДополнительныеОповещения", РезультатРаботыЗадания.ДополнительныеОповещения);
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповеститьОЗавершенииДлительнойОперацииЭТД", ЭТДКлиентПереопределяемый, ПараметрыОповещения);
		
		ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", ПараметрыДлительнойОперации, ЭтаФорма,,,, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнительныеСоглашенияМестоРаботыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт
	
	
	
КонецПроцедуры

Процедура ОсновныеДоговорыМестоРаботыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт
	
	
	
КонецПроцедуры

Функция ПолучитьСписокВыбораДокументОснованиеЭТД() Экспорт
	
	Возврат ПолучитьСписокВыбораДокументОснованиеЭТДЗУП();
	
КонецФункции

Процедура ОткрытиеФормыВыбораВладельцаПрофиля(ВыбранныйЭлемент, Организация, Форма) Экспорт
	
	ОткрытиеФормыВыбораВладельцаПрофиляЗУП(ВыбранныйЭлемент, Организация, Форма);
	
КонецПроцедуры

Процедура ОткрытиеФормыВыбораСотрудника(Организация, Элемент) Экспорт
	
	ОткрытиеФормыВыбораСотрудникаЗУП(Организация, Элемент);
	
КонецПроцедуры

Процедура ОткрытиеФормыВыбораДокументаОснования(ВыбранныйЭлемент, Организация, Сотрудник, Форма) Экспорт
	
	ИмяОткрываемойФормы = ПолучитьИмяФормыВыбораДокументаОснованияЗУП(ВыбранныйЭлемент);
	
	ПараметрыОтбора = Новый Структура("Организация, Сотрудник", Организация, Сотрудник);
	ПараметрыФормы = Новый Структура("РежимВыбора, Отбор", Истина, ПараметрыОтбора);
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораДокументаОснования", Форма);
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, Форма, , , , Оповещение);
	
КонецПроцедуры

Процедура ОткрытиеФормыВыбораДолжностиПоШтатномуРасписанию(Организация, Элемент) Экспорт
	
	ОткрытиеФормыВыбораДолжностиПоШтатномуРасписаниюЗУП(Организация, Элемент);
	
КонецПроцедуры

Процедура ОсновныеДоговорыДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка, Форма) Экспорт
	
	
	
КонецПроцедуры

Процедура ДополнительныеСоглашенияДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка, Форма) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокВыбораДокументОснованиеЭТДЗУП()
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("ДокументСсылка.КадровыйПеревод"));
	СписокТипов.Добавить(Тип("ДокументСсылка.КадровыйПереводСписком"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПеремещениеВДругоеПодразделение"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПриемНаРаботу"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПриемНаРаботуСписком"));
	
	Возврат СписокТипов;
	
КонецФункции

Процедура ОткрытиеФормыВыбораВладельцаПрофиляЗУП(ВыбранныйЭлемент, Организация, Форма)
	
	ПолеОтбора = "";
	Если ВыбранныйЭлемент.Значение = Тип("СправочникСсылка.Сотрудники") Тогда
		ИмяОткрываемойФормы = "Справочник.Сотрудники.ФормаВыбора";
		ПолеОтбора = "Организация";
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		ИмяОткрываемойФормы = "Справочник.ШтатноеРасписание.ФормаВыбора";
		ПолеОтбора = "Владелец";
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("СправочникСсылка.Должности") Тогда
		ИмяОткрываемойФормы = "Справочник.Должности.ФормаВыбора";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолеОтбора) Тогда
		ПараметрыОтбора = Новый Структура(ПолеОтбора, Организация);
		ПараметрыФормы = Новый Структура("РежимВыбора, Отбор", Истина, ПараметрыОтбора);
	Иначе
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораВладельцаПрофиля", Форма);
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, Форма, , , , Оповещение);
	
КонецПроцедуры

Процедура ОткрытиеФормыВыбораСотрудникаЗУП(Организация, Элемент)
	
	ПараметрыОтбора = Новый Структура("Организация", Организация);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

Процедура ОткрытиеФормыВыбораДолжностиПоШтатномуРасписаниюЗУП(Организация, Элемент)
	
	ПараметрыОтбора = Новый Структура("Владелец", Организация);
	ПараметрыФормы = Новый Структура("Отбор,РежимВыбора", ПараметрыОтбора, Истина);
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаСписка", ПараметрыФормы, Элемент);
	
КонецПроцедуры

Функция ПолучитьИмяФормыВыбораДокументаОснованияЗУП(ВыбранныйЭлемент)
	
	ИмяОткрываемойФормы = "";
	
	Если ВыбранныйЭлемент.Значение = Тип("ДокументСсылка.КадровыйПеревод") Тогда
		ИмяОткрываемойФормы = "Документ.КадровыйПеревод.ФормаСписка";
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
		ИмяОткрываемойФормы = "Документ.КадровыйПереводСписком.ФормаСписка";
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("ДокументСсылка.ПеремещениеВДругоеПодразделение") Тогда
		ИмяОткрываемойФормы = "Документ.ПеремещениеВДругоеПодразделение.ФормаСписка";
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		ИмяОткрываемойФормы = "Документ.ПриемНаРаботу.ФормаСписка";
	ИначеЕсли ВыбранныйЭлемент.Значение = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда
		ИмяОткрываемойФормы = "Документ.ПриемНаРаботуСписком.ФормаСписка";
	КонецЕсли;
	
	Возврат ИмяОткрываемойФормы;
	
КонецФункции

#КонецОбласти
