#Область ПрограммныйИнтерфейс

// Получает параметры ключа ЭЦП, учитывая тип провайдера криптографии.
//
// Параметры:
//   ОбработчикОповещения - Процедура/Функция - обработчик оповещения, вызываемый после получения параметров.
//   ДополнительныеПараметры - Любой - дополнительные параметры для передачи в форму.
//
Функция ПолучитьПараметрыКлючаЭЦП(ОбработчикОповещения = Неопределено, ДополнительныеПараметры = Неопределено, ВыбиратьПутьКлючаДляNCALayer = Ложь) Экспорт
	ПровайдерКриптографии = КриптографияВызовСервера.ПолучитьТипПровайдераКриптографии();
	
	Если ПровайдерКриптографии = ПредопределенноеЗначение("Перечисление.ТипПровайдераКриптографии.NCALayer")
		И Не ВыбиратьПутьКлючаДляNCALayer Тогда
		
		ДанныеЭЦП                  = КриптографияКлиентСервер.ПолучитьПараметрыДанныхЭЦП();
		ДанныеЭЦП.ПровайдерСсылка  = ПредопределенноеЗначение("Перечисление.ТипПровайдераКриптографии.NCALayer");
		ДанныеЭЦП.ПровайдерСтрокой = "NCALAYER";
		
		ВыполнитьОбработкуОповещения(ОбработчикОповещения,ДанныеЭЦП);
	Иначе
		ОткрытьФормуВводаДанныхКриптография(ОбработчикОповещения, ДополнительныеПараметры);
	КонецЕсли;
КонецФункции

// Открывает форму ввода данных ключа ЭЦП.
//
// Параметры:
//   ОбработчикОповещения - Процедура/Функция - обработчик, вызываемый после закрытия формы.
//   ПараметрыФормы - Структура - параметры для передачи в форму.
//
Процедура ОткрытьФормуВводаДанныхКриптография(ОбработчикОповещения = Неопределено, ПараметрыФормы = Неопределено) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ВводДанныхКриптографии", ПараметрыФормы,,,,,ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Возвращает текст вопроса при изменении места установки библиотеки.
//
// Возвращаемое значение:
//   Строка – Локализованный текст вопроса для пользователя.
//
Функция ТекстВопросаМестоУстановкиБиблиотекиПриИзменении() Экспорт
	Возврат НСтр("ru='При использовании варианта ""На компьютерах пользователей"" возможно потребуется настройка клиентской среды.
			|После сохранения настроек, включение варианта ""На сервере 1С:Предприятие"" будет недоступно. Продолжить?'");
КонецФункции

// Проверяет использование веб клиента на форме настроек и настраивает видимость и комментарии для элементов, если включен Калкан.
//
// Параметры:
//   Форма (Форма) – Форма, на которой настраиваются элементы и комментарии.
//   МестоУстановкиБиблиотеки (ПеречислениеСсылка.МестаВыполненияКриптографическихОпераций) – Текущее место установки библиотеки.
//
Процедура ПроверитьИспользованиеВебКлиентаФормыНастройки(Форма, МестоУстановкиБиблиотеки, ПровайдерКриптографии) Экспорт
	
	#Если ВебКлиент Тогда
		
		ГруппаКомментарийПровайдерКалкан = Форма.Элементы.Найти("ГруппаКомментарийПровайдерКалкан");
		КомментарийПровайдерКалкан = Форма.Элементы.Найти("КомментарийПровайдерКалкан");
		
		Если ГруппаКомментарийПровайдерКалкан = Неопределено
			ИЛИ КомментарийПровайдерКалкан = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ГруппаКомментарийПровайдерКалкан.ЦветФона = Новый Цвет(251, 212, 212);
		КомментарийПровайдерКалкан.Заголовок = НСтр("ru = 'При использовании веб-клиента настройка провайдера криптографии Kalkan в режиме ""На компьютерах пользователей"" не поддерживается.'");
		
		Если МестоУстановкиБиблиотеки = ПредопределенноеЗначение("Перечисление.МестаВыполненияКриптографическихОпераций.НаКлиенте")
			И ПровайдерКриптографии = ПредопределенноеЗначение("Перечисление.ТипПровайдераКриптографии.Kalkan") Тогда
			ГруппаКомментарийПровайдерКалкан.Видимость = Истина;
			КомментарийПровайдерКалкан.Видимость = Истина;
		Иначе
			ГруппаКомментарийПровайдерКалкан.Видимость = Ложь;
			КомментарийПровайдерКалкан.Видимость = Ложь;
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

#Область ПодписьCMS

// Создает цифровую подпись (ЭЦП) в формате CMS.
// Параметры:
//  ДанныеДляПодписи - Массив или Строка – данные для подписания.
//  ПараметрыВзаимодействия - Структура – настройки взаимодействия с криптопровайдером.
// Возвращаемое значение:
//   Структура – результат подписи, включая статус и служебные данные.
//
Функция СоздатьЭЦП_CMS(Знач ДанныеДляПодписи, ПараметрыВзаимодействия, ИспользоватьНастройкуМестаКриптографии = Истина) Экспорт
	
	Если ИспользоватьНастройкуМестаКриптографии Тогда
		Если Не КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
			Результат = КриптографияВызовСервера.СоздатьЭЦП_CMS(ДанныеДляПодписи, ПараметрыВзаимодействия);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Результат = КриптографияКлиентСервер.СоздатьЭЦП_CMS(ДанныеДляПодписи, ПараметрыВзаимодействия);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПодписьXML

// Создает цифровую подпись (ЭЦП) в формате XML.
// Параметры:
//  ДанныеДляПодписи - Массив или Строка – данные для подписания.
//  ПараметрыВзаимодействия - Структура – настройки взаимодействия с криптопровайдером.
// Возвращаемое значение:
//   Структура – результат подписи, включая статус и служебные данные.
//
Функция СоздатьЭЦП_XML(Знач ДанныеДляПодписи, ПараметрыВзаимодействия, ИспользоватьНастройкуМестаКриптографии = Истина) Экспорт
	
	Если ИспользоватьНастройкуМестаКриптографии Тогда
		Если Не КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
			Результат = КриптографияВызовСервера.СоздатьЭЦП_XML(ДанныеДляПодписи, ПараметрыВзаимодействия);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Результат = КриптографияКлиентСервер.СоздатьЭЦП_XML(ДанныеДляПодписи, ПараметрыВзаимодействия);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПодписьRaw

// Создает цифровую подпись (ЭЦП) в формате сырой подписи Raw.
// Параметры:
//  ДанныеДляПодписи - Массив или Строка – данные для подписания.
//  ПараметрыВзаимодействия - Структура – настройки взаимодействия с криптопровайдером.
// Возвращаемое значение:
//   Структура – результат подписи, включая статус и служебные данные.
//
Функция СоздатьЭЦП_Raw(Знач ДанныеДляПодписи, ПараметрыВзаимодействия, ИспользоватьНастройкуМестаКриптографии = Истина) Экспорт
	
	Если ИспользоватьНастройкуМестаКриптографии Тогда
		Если Не КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
			Результат = КриптографияВызовСервера.СоздатьЭЦП_Raw(ДанныеДляПодписи, ПараметрыВзаимодействия);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Результат = КриптографияКлиентСервер.СоздатьЭЦП_Raw(ДанныеДляПодписи, ПараметрыВзаимодействия);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДанныеСертификата

// Получает данный сертификата ключа.
// Параметры:
//  ПараметрыВзаимодействия - Структура – настройки взаимодействия с криптопровайдером.
// Возвращаемое значение:
//   Структура – результат, включая статус и служебные данные.
//
Функция ПолучитьДанныеСертификата(ПараметрыВзаимодействия, ИспользоватьНастройкуМестаКриптографии = Истина) Экспорт
	
	Если ИспользоватьНастройкуМестаКриптографии Тогда
		Если Не КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
			Результат = КриптографияВызовСервера.ПолучитьДанныеСертификата(ПараметрыВзаимодействия);
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Результат = КриптографияКлиентСервер.ПолучитьДанныеСертификата(ПараметрыВзаимодействия);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроверкаВозможностиРаботы

// Проверяет, поддерживается ли выполнение криптографических операций в текущем клиентском окружении.
// Если используется веб-клиент и выбран провайдер криптографии Kalkan в режиме "На компьютерах пользователей",
// выполнение криптографических операций невозможно.
// Параметры:
//   ПоказыватьОповещния – Булево – определяет, нужно ли отображать пользователю сообщение при невозможности работы
//   криптографии в текущем клиенте. По умолчанию Истина.
//
// Возвращаемое значение:
//   Булево – Истина, если работа с криптографией поддерживается в текущем клиенте;
//             Ложь, если выполнение невозможно (например, при использовании веб-клиента и провайдера Kalkan).
Функция ВозможнаРаботаВТекущемКлиенте(ПоказыватьОповещния = Истина) Экспорт
	
	РаботаПоддерживается = Истина;
	#Если ВебКлиент Тогда
		
		ТипПровайдераКриптографии = КриптографияВызовСервера.ПолучитьТипПровайдераКриптографии();
		
		Если ТипПровайдераКриптографии = ПредопределенноеЗначение("Перечисление.ТипПровайдераКриптографии.Kalkan") 
			И КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
			РаботаПоддерживается = Ложь;
		КонецЕсли;
		
	#КонецЕсли
	
	Если НЕ РаботаПоддерживается И ПоказыватьОповещния Тогда
		КриптографияКлиентСерверПереопределяемый.СообщитьПользователю(
			НСтр("ru = 'При использовании веб-клиента и настройках криптографии с провайдером Kalkan в режиме ""На компьютерах пользователей"" работа с сертификатами не поддерживается.'")
		);
	КонецЕсли;
	
	Возврат РаботаПоддерживается;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти