#Область СлужебныеПроцедурыИФункции

// Возвращает параметры вызова rest-метода для чтения данных одной или нескольких организаций.
//
// Параметры:
//  orgTypeId - Число - тип организации:
//      1 - Государственное или муниципальное юридическое лицо. 
//      2 - Частное юридическое лицо.
//      3 - Индивидуальный предприниматель.
//  offset    - Число - количество записей, которые нужно пропустить (отступ).
//  limit     - Число - количество записей, которые нужно получить.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистрыКлиентСервер.ПараметрыВызоваМетода.
//
Функция GetOrgList(orgTypeId, offset, limit) Экспорт 
	
	Шаблон = "org?orgTypeId=%1&offset=%2&limit=%3";
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.Команда = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Шаблон, 
		Формат(orgTypeId, "ЧГ=0"), Формат(offset, "ЧГ=0"), Формат(limit, "ЧГ=0")
		);	
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для чтения данных указанной организации.
//
// Параметры:
//  oid - Строка - идентификатор организации в ЕГИСЗ.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистрыКлиентСервер.ПараметрыВызоваМетода.
//
Функция GetOrg(oid) Экспорт 
	
	Шаблон = "org/%1";
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.Команда = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, oid);
	Возврат ПараметрыВызоваМетода;	
    
КонецФункции

// Возвращает параметры вызова rest-метода для чтения данных одного или нескольких подразделений.
//
// Параметры:
//  departTypeId - Число - тип подразделения:
//		1 -	Амбулаторный. 	
//		2 -	Стационарный. 	
//		3 -	Лабораторно-диагностический. 	
//		4 -	Инструментально-диагностический. 	
//		5 -	Скорая медицинская помощь. 	
//		6 -	Административно-хозяйственный (вспомогательный). 	
//		7 -	Фармацевтический.
//  oid - Строка - Идентификатор организации.
//  offset - Число - количество записей, которые нужно пропустить (отступ).
//  limit - Число - количество записей, которые нужно получить.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистрыКлиентСервер.ПараметрыВызоваМетода.
//
Функция GetOrgDepart(departTypeId, oid, offset, limit) Экспорт 
	
	Шаблон = "org/depart?departTypeId=%1&oid=%2&offset=%3&limit=%4";
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.Команда = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Шаблон, 
		Формат(departTypeId, "ЧГ=0; ЧН="), oid, Формат(offset, "ЧГ=0; ЧН="), Формат(limit, "ЧГ=0; ЧН=")
		);	
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для чтения всех сведений медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetOrgStaff(oid) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "org/staff";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?oid=" + oid;
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) 
// или обновления (update) сведений о штатном расписании.
//
// Параметры:
//  oid - Строка - идентификатор организации в ЕГИСЗ.
//  entityId - Строка(36) – Идентификатор (GUID) записи блока данных о штатном расписании,
//                          которые необходимо изменить методом PUT (update)
//                          Для метода POST (create) оставлять в значении Неопределено.
//  StaffData - Структура - Данные штатного расписания.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистрыКлиентСервер.ПараметрыВызоваМетода.
//
Функция PostPutOrgStaff(oid, entityId, StaffData) Экспорт 
	
	ПозицииШР = "";
	Если ТипЗнч(StaffData.staffDetails)=Тип("Массив") Тогда 
		ДокументыРаботника = "";
		Для ИндексПозиции = 0 По StaffData.staffDetails.Количество()-1 Цикл
			ДанныеПозиции = StaffData.staffDetails[ИндексПозиции];
			ЭлементыJSON = Новый Массив;
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "nrPmuDepartId", ДанныеПозиции.nrPmuDepartId, "Строка"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "departName", ДанныеПозиции.departName, "Строка"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "nrPmuDepartHospitalSubdivisionId", ДанныеПозиции.nrPmuDepartHospitalSubdivisionId, "Строка"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "hospitalName", ДанныеПозиции.hospitalName, "Строка"); 
			
			ЭлементыФедеральнойДолжности = Новый Массив;
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыФедеральнойДолжности, "code", ДанныеПозиции.postFedCode.code, "Число"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыФедеральнойДолжности, "name", ДанныеПозиции.postFedCode.name, "Строка"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "postFedCode", "{" + СтрСоединить(ЭлементыФедеральнойДолжности, ",") + "}", "JSON"); 
			
			ЭлементыДолжности = Новый Массив;
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыДолжности, "code", ДанныеПозиции.post.code, "Число"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыДолжности, "name", ДанныеПозиции.post.name, "Строка"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "post", "{" + СтрСоединить(ЭлементыДолжности, ",") + "}", "JSON"); 
			
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "flCount", ДанныеПозиции.flCount, "Число"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "averageAge", ДанныеПозиции.averageAge, "Число", 4); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "rate", ДанныеПозиции.rate, "Число", 4); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "busyRate", ДанныеПозиции.busyRate, "Число", 4); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "busyRateMain", ДанныеПозиции.busyRateMain, "Число", 4); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "externalRate", ДанныеПозиции.externalRate, "Число", 4); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "vacancy", ДанныеПозиции.vacancy, "Число", 4); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "staffNote", ДанныеПозиции.staffNote, "Строка"); 
			
			ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
			Если ИндексПозиции = 0 Тогда 
				ПозицииШР = ЗаписьJSON;
			Иначе 
				ПозицииШР = ПозицииШР + "," + Символы.ПС + ЗаписьJSON;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;

	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "staffNum", StaffData.staffNum, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "staffCreateDate", StaffData.staffCreateDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "beginDate", StaffData.beginDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "endDate", StaffData.endDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "staffDetails", "[" + ПозицииШР + "]", "JSON"); 
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если ПустаяСтрока(entityId) Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		ПараметрыВызоваМетода.Команда = "org/staff?oid=" + oid;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		ПараметрыВызоваМетода.Команда = "org/staff?oid=" + oid + "&entityId=" + entityId;
	КонецЕсли;
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Конструктор структуры данных о штатном расписании.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	staffNum - Строка(20) – Номер штатного расписания.
//  	staffCreateDate - Дата – Дата утверждения.
//  	beginDate - Дата – Дата начала действия.
//  	endDate - Дата – Дата окончания действия.
//  	staffDetails - Массив – Записи штатного расписания (см. Функция staffDetails).
//
Функция StaffData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("staffNum", Неопределено);
	Результат.Вставить("staffCreateDate", Неопределено);
	Результат.Вставить("beginDate", Неопределено);
	Результат.Вставить("endDate", Неопределено);
	Результат.Вставить("staffDetails", Неопределено);
	Возврат Результат;
КонецФункции

// Конструктор структуры данных о позиции штатного расписания.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	nrPmuDepartId - Строка – Идентификатор структурного подразделения МО (OID).
//  	departName - Строка – Наименование структурного подразделения МО.
//  	nrPmuDepartHospitalSubdivisionId - Строка – Идентификатор отделений стационарного подразделения (oid).
//  	hospitalName - Строка – Наименование отделения стационарного подразделения.
//  	postFedCode_code - Число – Код должности по Федеральному справочнику (1.2.643.5.1.13.13.99.2.885).
//  	postFedCode_name - Строка – Наименование должности по Федеральному справочнику (1.2.643.5.1.13.13.99.2.885).
//  	post_code - Число – Код должности (1.2.643.5.1.13.13.99.2.181).
//  	post_name - Строка – Наименование должности (1.2.643.5.1.13.13.99.2.181).
//  	flCount - Число – Количество физических лиц (человек).
//  	averageAge - Число – Средний возраст.
//  	rate - Число – Ставка, ед.
//  	busyRate - Число – Количество занятых штатных единиц.
//  	busyRateMain - Число – Количество занятых штатных единиц по основному месту работы.
//  	externalRate - Число – Количество внешних совместителей.
//  	vacancy - Число – Вакансий.
//  	staffNote - Строка(256) – Примечания к штатному расписанию.
//
Функция StaffDetails() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("nrPmuDepartId", Неопределено);
	Результат.Вставить("departName", Неопределено);
	Результат.Вставить("nrPmuDepartHospitalSubdivisionId", Неопределено);
	Результат.Вставить("hospitalName", Неопределено);
	Результат.Вставить("postFedCode", Новый Структура("code,name", Неопределено, Неопределено));
	Результат.Вставить("post", Новый Структура("code,name", Неопределено, Неопределено));
	Результат.Вставить("flCount", Неопределено);
	Результат.Вставить("averageAge", Неопределено);
	Результат.Вставить("rate", Неопределено);
	Результат.Вставить("busyRate", Неопределено);
	Результат.Вставить("busyRateMain", Неопределено);
	Результат.Вставить("externalRate", Неопределено);
	Результат.Вставить("vacancy", Неопределено);
	Результат.Вставить("staffNote", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти