#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ЗакрытьПослеЗаписи;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПравоРедактированияЕНВД = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОценочныеОбязательстваОблагаетсяЕНВД",
		"ТолькоПросмотр",
		НЕ ПравоРедактированияЕНВД);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОценочныеОбязательстваПоСотрудникамОблагаетсяЕНВД",
		"ТолькоПросмотр",
		НЕ ПравоРедактированияЕНВД);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		// ЗУПК
		СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		// ЗУПК
		
		// создается новый документ
		ЗначенияДляЗаполнения = Новый Структура("ПредыдущийМесяц, Организация, Ответственный", 
			"Объект.ПериодРегистрации",
			"Объект.Организация",
			"Объект.Ответственный");
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		ПриПолученииДанныхНаСервере();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// ЗУПК
	СобытияФормЗУПК.ПриЧтенииНаСервере(ЭтаФорма);
	// ЗУПК

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы <> Неопределено Тогда	
		Если ЗавершениеРаботы И Модифицированность Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗакрытьПослеЗаписи = Истина;
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ РассчитыватьДокументыПриРедактировании И ДанныеОтредактированы И НЕ Объект.КорректировкаОбязательств Тогда
		
		Если Объект.РасчетРезерваОтпусков.Количество() = 0
			И Объект.ОценочныеОбязательства.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюОкончание", ЭтотОбъект, ПараметрыЗаписи);
		
		ТекстВопроса = НСтр("ru='Перед записью документа необходимо рассчитать обязательства и резервы текущего месяца.
			|Продолжить?'");
			
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.КорректировкаОбязательств Тогда
		Если ТекущийОбъект.РасчетРезерваОтпусков.Количество() <> 0 Тогда
			ТекущийОбъект.РасчетРезерваОтпусков.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЗакрытьПослеЗаписи Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОбязательствПриИзменении(Элемент)
	
	Объект.КорректировкаОбязательств = НЕ КорректировкаПредставление;
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбязательстваОтраженыВБухучетеПриИзменении(Элемент)
	
	Если Объект.ОбязательстваОтраженыВБухучете Тогда
		Объект.Бухгалтер = ПользователиКлиент.ТекущийПользователь();
	Иначе
		Объект.Бухгалтер = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасчетРезерваОтпусков

&НаКлиенте
Процедура РасчетРезерваОтпусковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ЗаполнитьНадписиВСтроке(Элементы.РасчетРезерваОтпусков.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСотрудникПриИзменении(Элемент)
	
	СтрокаТаблицы    = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ТекущийСотрудник = СтрокаТаблицы.Сотрудник;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковФОТПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ФОТ");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковОстатокОтпускаПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ОстатокОтпуска");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковОтпускАвансомПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ОтпускАвансом");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСреднийЗаработокПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СреднийЗаработок");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСреднийЗаработокОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуСреднегоЗаработка();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСтраховыеВзносыПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СтраховыеВзносы");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковТекущаяСтавкаСтраховыхВзносовПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ТекущаяСтавкаСтраховыхВзносов");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковФССНесчастныеСлучаиПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ФССНесчастныеСлучаи");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковТекущаяСтавкаФССНесчастныеСлучаиПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ТекущаяСтавкаФССНесчастныеСлучаи");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваИсчислено");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваИсчисленоНУПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваИсчислено", "НУ");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваНакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваНакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваНакопленоНУПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваНакоплено", "НУ");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваСтраховыхВзносовИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСтраховыхВзносовИсчислено");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваСтраховыхВзносовИсчисленоНУПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСтраховыхВзносовИсчислено", "НУ");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваСтраховыхВзносовНакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСтраховыхВзносовНакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваСтраховыхВзносовНакопленоНУПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСтраховыхВзносовНакоплено", "НУ");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваФССНесчастныеСлучаиИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаиИсчислено");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваФССНесчастныеСлучаиИсчисленоНУПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаиИсчислено", "НУ");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваФССНесчастныеСлучаиНакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаиНакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковСуммаРезерваФССНесчастныеСлучаиНакопленоНУПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаиНакоплено", "НУ");
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущийСотрудник = ТекущиеДанные.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	ДобавитьИзмененныеДанные("РасчетРезерваОтпусков", ТекущийСотрудник);
	
	Если РассчитыватьДокументыПриРедактировании Тогда
		ПересчитатьДокументНаКлиенте();
	Иначе
		ДанныеОтредактированы                          = Истина;
		ОценочныеОбязательстваНеактуальны              = Истина;
		ОценочныеОбязательстваПоСотрудникамНеактуальны = Истина;
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Истина);
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
	ТекущийСотрудник = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетРезерваОтпусковПослеУдаления(Элемент)
	
	Если РассчитыватьДокументыПриРедактировании Тогда
		ПересчитатьДокументНаКлиенте();
	Иначе
		ДанныеОтредактированы                          = Истина;
		ОценочныеОбязательстваНеактуальны              = Истина;
		ОценочныеОбязательстваПоСотрудникамНеактуальны = Истина;
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Истина);
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаПоОтпускам(Команда)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(СтрокаТаблицы.Сотрудник);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадрыРасширенная") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("РезервОтпусковКлиентРасширенный");
		Модуль.СправкаПоОтпускам(ЭтотОбъект, МассивСотрудников);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОценочныеОбязательства

&НаКлиенте
Процедура ОценочныеОбязательстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ЗаполнитьНадписиВСтроке(Элементы.ОценочныеОбязательства.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОценочныеОбязательстваПоСотрудникам

&НаКлиенте
Процедура ОценочныеОбязательстваПоСотрудникамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ЗаполнитьНадписиВСтроке(Элементы.ОценочныеОбязательстваПоСотрудникам.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОценочныеОбязательстваПоСотрудникамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если РассчитыватьДокументыПриРедактировании Тогда
		ОбновитьОтражениеВУчетеНаКлиенте();
	Иначе
		ДанныеОтредактированы             = Истина;
		ОценочныеОбязательстваНеактуальны = Истина;
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Истина, , "ПересчитатьОбязательстваТекущегоМесяца");
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОценочныеОбязательстваПоСотрудникамПослеУдаления(Элемент)
	
	Если РассчитыватьДокументыПриРедактировании Тогда
		ОбновитьОтражениеВУчетеНаКлиенте();
	Иначе
		ДанныеОтредактированы             = Истина;
		ОценочныеОбязательстваНеактуальны = Истина;
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Истина, , "ПересчитатьОбязательстваТекущегоМесяца");
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ЗарплатаКадрыКлиент.ОрганизацияЗаполнена(Объект) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ДокументДоступен Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для организации ""%1"" за %2 г. обнаружены действующие настройки резервов по оплате труда.
		|Для исключения конфликтов при использовании архивного механизма в %3 г., удалите настройки из справочника ""Настройки расчета резервов по оплате труда"" за периоды до %4 г.
		|В противном случае воспользуйтесь документом ""Резервы по оплате труда"".'"),
			Объект.Организация,
			ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации),
			Формат(Год(Объект.ПериодРегистрации), "ЧГ="),
			Формат(Год(Объект.ПериодРегистрации)+1, "ЧГ="));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если Объект.РасчетРезерваОтпусков.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Табличные части документа будут очищены. Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокумент(Команда)
	
	Если ОценочныеОбязательстваПоСотрудникамНеактуальны Тогда
		ПересчитатьДокументНаКлиенте();
	Иначе
		ОбновитьОтражениеВУчетеНаКлиенте();
	КонецЕсли;
	УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Ложь);
	УстановитьДоступностьТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбязательстваПоСотрудникам(Команда)
	
	ПеречитатьОценочныеОбязательстваПоСотрудникамНаКлиенте();
	УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, ОценочныеОбязательстваПоСотрудникамНеактуальны, , ?(ДанныеОтредактированы, "ПересчитатьОбязательстваПоСотрудникам", ""));
	УстановитьДоступностьТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбязательстваТекущегоМесяца(Команда)
	
	ОбновитьОтражениеВУчетеНаКлиенте();
	УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, ОценочныеОбязательстваНеактуальны, , ?(ДанныеОтредактированы, "ПересчитатьОбязательстваТекущегоМесяца", ""));
	УстановитьДоступностьТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСреднийЗаработок(Команда)
	
	ОткрытьФормуСреднегоЗаработка();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ЗагрузитьРезультат();
				УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Ложь);
				УстановитьДоступностьТабличнойЧасти();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания", 
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
					Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОписаниеДокумента()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	ОписаниеДокумента = Новый Структура("Ссылка,
		|Организация, Дата, ПериодРегистрации,
		|КорректировкаОбязательств, ДоляРасходов");
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента, ТекущийОбъект);
	
	ОписаниеДокумента.Вставить("РасчетРезерваОтпусков",               ТекущийОбъект.РасчетРезерваОтпусков.Выгрузить());
	ОписаниеДокумента.Вставить("ОценочныеОбязательства",              ТекущийОбъект.ОценочныеОбязательства.Выгрузить());
	ОписаниеДокумента.Вставить("ФизическиеЛица",                      ТекущийОбъект.ФизическиеЛица.Выгрузить());
	ОписаниеДокумента.Вставить("ОценочныеОбязательстваПоСотрудникам", ТекущийОбъект.ОценочныеОбязательстваПоСотрудникам.Выгрузить());
	ОписаниеДокумента.Вставить("ИзмененныеДанные",                    ИзмененныеДанные.Выгрузить());
	
	Возврат ОписаниеДокумента;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = ЗаполнитьНаСервере();
	
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
	Иначе
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Ложь);
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСреднийЗаработокЗавершение(РезультатРедактирования, ДополнительныеПараметры) Экспорт
	
	Если РезультатРедактирования <> Неопределено Тогда
		
		СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
		Если СтрокаТаблицы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(РезультатРедактирования.СреднийЗаработок) = Тип("Соответствие") Тогда
			Для Каждого ЗаписьСоответствия Из РезультатРедактирования.СреднийЗаработок Цикл 
				СтрокаТаблицы.СреднийЗаработок = ЗаписьСоответствия.Значение;
				Прервать;
			КонецЦикла;
		Иначе
			СтрокаТаблицы.СреднийЗаработок = РезультатРедактирования.СреднийЗаработок;
		КонецЕсли;
		
		Если НачалоМесяца(РезультатРедактирования.НачалоПериодаРасчета) = НачалоМесяца(ДобавитьМесяц(Объект.ПериодРегистрации, -11))
			И НачалоМесяца(РезультатРедактирования.ОкончаниеПериодаРасчета) = НачалоМесяца(Объект.ПериодРегистрации) Тогда
			СтрокаТаблицы.ПериодРасчетаСреднегоЗаработкаНачало    = "";
			СтрокаТаблицы.ПериодРасчетаСреднегоЗаработкаОкончание = "";
		Иначе
			СтрокаТаблицы.ПериодРасчетаСреднегоЗаработкаНачало    = РезультатРедактирования.НачалоПериодаРасчета;
			СтрокаТаблицы.ПериодРасчетаСреднегоЗаработкаОкончание = РезультатРедактирования.ОкончаниеПериодаРасчета;
		КонецЕсли;
		
		ПересчитатьНаКлиенте(СтрокаТаблицы, "СреднийЗаработок");

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзмененныеДанные(ИмяТаблицы, Сотрудник)
	
	НоваяСтрока = ИзмененныеДанные.Добавить();
	НоваяСтрока.Сотрудник = Сотрудник;
	
КонецПроцедуры

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьНаСервере()
	
	ПараметрыЗаполнения = Новый Структура("Объект", СформироватьОписаниеДокумента());
	
	НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Начисление оценочных обязательств по отпускам""'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Документы.НачислениеОценочныхОбязательствПоОтпускам.ЗаполнитьНачислениеОценочныхОбязательствПоОтпускам", 
		ПараметрыЗаполнения, 
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьРезультат();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой");
	
	КорректировкаПредставление = НЕ Объект.КорректировкаОбязательств;
	
	РезервыРассчитываются = Истина;
	РезервОтпусковПереопределяемый.ПолучитьЗначениеРезервыРассчитываются(РезервыРассчитываются); 
	РассчитыватьДокументыПриРедактировании = Константы.РассчитыватьДокументыПриРедактировании.Получить();
	
	НастройкиРезервовОтпусков();
	
	УстановитьФункциональныеОпцииФормы();
	ПроверитьИспользованиеОбмена();
	
	Если ОбменИспользуется Тогда
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадры") Тогда
			ТолькоПросмотр = Объект.ОбязательстваОтраженыВБухучете;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбязательстваОтраженыВБухучете", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Бухгалтер", "ТолькоПросмотр", Истина);
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Заполнить", "Видимость", Ложь);
			
			ПользователюРазрешеноФормированиеПроводок = ПравоДоступа("Редактирование", Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбязательстваОтраженыВБухучете", "ТолькоПросмотр", Не ПользователюРазрешеноФормированиеПроводок);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Бухгалтер", "ТолькоПросмотр", Не ПользователюРазрешеноФормированиеПроводок);
			
			Если НЕ ПользователюРазрешеноФормированиеПроводок Тогда
				ТолькоПросмотр = Объект.ОбязательстваОтраженыВБухучете;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		Модуль.ДополнитьФормуДокументаНачислениеОценочныхОбязательствПоОтпускам(ЭтотОбъект);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадрыРасширенная") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетРезерваОтпусковКонтекстноеМенюСправкаПоОтпускам", "Видимость", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетРезерваОтпусковКонтекстноеМенюСправкаПоОтпускам", "Видимость", Ложь);
	КонецЕсли;
	
    // ЗУПК
    ЗаполнитьТаблицуСтавкиНалоговВзносовОтчислений(ЭтаФорма["ТаблицаСтавкиНалоговВзносовОтчислений"], Объект.Организация, Объект.ПериодРегистрации);
    // ЗУПК
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИспользованиеОбмена()

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОбменЗарплата3Бухгалтерия3") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиЗарплата3Бухгалтерия3");
		ОбменИспользуется = Модуль.ОбменИспользуется(Объект.Организация);
	КонецЕсли;
	
	РезервОтпусковПереопределяемый.ИспользуетсяОбменЗУПБП(ОбменИспользуется, Объект.Организация);

КонецПроцедуры


&НаСервере
Процедура УправлениеФормой()
	
	Если Объект.КорректировкаОбязательств И Элементы.ОсновныеКоманды.Видимость Тогда
		Элементы.Страницы.ТекущаяСтраница    = Элементы.ГруппаОценочныеОбязательства;
		Элементы.ГруппаРасчетРезерваОтпусков.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ПересчитатьДокумент",
			"Видимость",
			Ложь);
	ИначеЕсли НЕ Объект.КорректировкаОбязательств И НЕ Элементы.ОсновныеКоманды.Видимость Тогда
		Элементы.ГруппаРасчетРезерваОтпусков.Видимость = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПересчитатьДокумент",
		"Видимость",
		НЕ РассчитыватьДокументыПриРедактировании И НЕ Объект.КорректировкаОбязательств);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПересчитатьОбязательстваПоСотрудникам",
		"Видимость",
		НЕ РассчитыватьДокументыПриРедактировании И НЕ Объект.КорректировкаОбязательств);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПересчитатьОбязательстваТекущегоМесяца",
		"Видимость",
		НЕ РассчитыватьДокументыПриРедактировании);
		
	Инвентаризация = КонецМесяца(Объект.ПериодРегистрации) = КонецГода(Объект.ПериодРегистрации);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковОстатокОтпуска",
		"Видимость",
		МетодОбязательств ИЛИ Инвентаризация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковОтпускАвансом",
		"Видимость",
		МетодОбязательств ИЛИ Инвентаризация);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковСреднийЗаработок",
		"Видимость",
		МетодОбязательств ИЛИ Инвентаризация);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковТекущаяСтавкаСтраховыхВзносов",
		"Видимость",
		МетодОбязательств ИЛИ Инвентаризация);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковТекущаяСтавкаФССНесчастныеСлучаи",
		"Видимость",
		МетодОбязательств ИЛИ Инвентаризация);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковКонтекстноеМенюСправкаПоОтпускам",
		"Видимость",
		(МетодОбязательств ИЛИ Инвентаризация)
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадрыРасширенная"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОсновныеКоманды",
		"Видимость",
		РезервОтпусковПереопределяемый.РезервыРассчитываютсяАвтоматически() И НЕ Объект.КорректировкаОбязательств);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаКорректировкаОбязательств",
		"Видимость",
		РезервыРассчитываются);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОценочныеОбязательстваПоСотрудникам",
		"Видимость",
		РезервыРассчитываются);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Страницы",
		"ОтображениеСтраниц",
		?(РезервыРассчитываются, ОтображениеСтраницФормы.ЗакладкиСверху, ОтображениеСтраницФормы.Нет));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтраженияВБухУчете",
		"Видимость",
		ОбменИспользуется);

    // ЗУПК
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковСО",
		"Видимость",
		НЕ (МетодОбязательств ИЛИ Инвентаризация));
        
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковСН",
		"Видимость",
		НЕ (МетодОбязательств ИЛИ Инвентаризация));
        
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковОтчисленияОСМС",
		"Видимость",
		НЕ (МетодОбязательств ИЛИ Инвентаризация));
 
     ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РасчетРезерваОтпусковФОТ",
		"Видимость",
		НЕ (МетодОбязательств ИЛИ Инвентаризация));

	ЭлементыОППВ = Новый Массив;
	ЭлементыОППВ.Добавить("ОценочныеОбязательстваГруппаРезервОППВ");
	ЭлементыОППВ.Добавить("ОценочныеОбязательстваПоСотрудникамСуммаРезерваОППВ");
	ЭлементыОППВ.Добавить("РасчетРезерваОтпусковОППВ");
	ЭлементыОППВ.Добавить("РасчетРезерваГруппаОППВ");
	
	ИспользуетсяОППВ = ПолучитьФункциональнуюОпцию("ИспользуетсяОППВ")
					И ПолучитьФункциональнуюОпцию("ПлательщикОППВЗарплатаКадры", Новый Структура("Период, Организация", Объект.ПериодРегистрации, Объект.Организация));
	
	Для Каждого ЭлементОППВ Из ЭлементыОППВ Цикл
		
		Если ЭлементОППВ = "РасчетРезерваОтпусковОППВ" Тогда
			УслвиеВидимости = ИспользуетсяОППВ И НЕ (МетодОбязательств ИЛИ Инвентаризация);
		Иначе
			УслвиеВидимости = ИспользуетсяОППВ;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		ЭлементОППВ,
		"Видимость",
		УслвиеВидимости);
		
	КонецЦикла;
	
	ЭлементыОПВР = Новый Массив;
	ЭлементыОПВР.Добавить("ОценочныеОбязательстваГруппаРезервОПВР");
	ЭлементыОПВР.Добавить("ОценочныеОбязательстваПоСотрудникамСуммаРезерваОПВР");
	ЭлементыОПВР.Добавить("РасчетРезерваОтпусковОПВР");
	ЭлементыОПВР.Добавить("РасчетРезерваГруппаОПВР");
	
	ИспользуетсяОПВР = (Объект.ПериодРегистрации >= Дата(2024, 1, 1));

 	Для Каждого ЭлементОПВР Из ЭлементыОПВР Цикл
		
		Если ЭлементОПВР = "РасчетРезерваОтпусковОПВР" Тогда
			УслвиеВидимости = ИспользуетсяОПВР И НЕ (МетодОбязательств ИЛИ Инвентаризация);
		Иначе
			УслвиеВидимости = ИспользуетсяОПВР;
		КонецЕсли;
		
	   ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			ЭлементОПВР,
			"Видимость",
			УслвиеВидимости);
		
	КонецЦикла;
	// ЗУПК

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТаблицы = "")
	
	Если ИмяТаблицы = "" Тогда
		Для Каждого СтрокаТаблицы Из Объект.РасчетРезерваОтпусков Цикл
			ЗаполнитьНадписиВСтроке(СтрокаТаблицы);
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из Объект.ОценочныеОбязательстваПоСотрудникам Цикл
			ЗаполнитьНадписиВСтроке(СтрокаТаблицы);
		КонецЦикла;
		Для Каждого СтрокаТаблицы Из Объект.ОценочныеОбязательства Цикл
			ЗаполнитьНадписиВСтроке(СтрокаТаблицы);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТаблицы Из Объект[ИмяТаблицы] Цикл
			ЗаполнитьНадписиВСтроке(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНадписиВСтроке(ТекущиеДанные)
	
	ТекущиеДанные.НадписьБУ = НСтр("ru = 'БУ:'");
	ТекущиеДанные.НадписьНУ = НСтр("ru = 'НУ:'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьНаКлиенте(ПараметрыСтроки, ИмяРеквизита, Показатель = "")
	
	Инвентаризация   = КонецМесяца(Объект.ПериодРегистрации) = КонецГода(Объект.ПериодРегистрации);
	ДоступноСписание = (МетодОбязательств И ОпределятьИзлишкиЕжемесячно) ИЛИ Инвентаризация;
	
	Если ИмяРеквизита = "ОстатокОтпуска" Тогда
		Если ПараметрыСтроки.ОстатокОтпуска <= 0 Тогда
			ПараметрыСтроки.ОтпускАвансом = 0;
		КонецЕсли;
	КонецЕсли;
	
    // ЗУПК
	СтавкаСО = 0;
    СтавкаСН = 0;
    СтавкаОПВ = 0;
    СтавкаОППВ = 0;
    СтавкаООСМС = 0;
    СтавкаВОСМС = 0;
    СтавкаОПВР = 0;
    Для Каждого СтрокаСтавок Из ЭтаФорма["ТаблицаСтавкиНалоговВзносовОтчислений"] Цикл
        Если СтрокаСтавок.Налог = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
            СтавкаСО = СтрокаСтавок.Ставка;
        ИначеЕсли СтрокаСтавок.Налог = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СН") Тогда
            СтавкаСН = СтрокаСтавок.Ставка;
        ИначеЕсли СтрокаСтавок.Налог = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
            СтавкаОПВ = СтрокаСтавок.Ставка;
        ИначеЕсли СтрокаСтавок.Налог = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ")
            И ПолучитьФункциональнуюОпциюФормы("ИспользуетсяОППВ") Тогда
            СтавкаОППВ = СтрокаСтавок.Ставка;
        ИначеЕсли СтрокаСтавок.Налог = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
            СтавкаООСМС = СтрокаСтавок.Ставка;
        ИначеЕсли СтрокаСтавок.Налог = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС") Тогда
            СтавкаВОСМС = СтрокаСтавок.Ставка;
		ИначеЕсли СтрокаСтавок.Налог = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР")
			И Объект.ПериодРегистрации >= Дата(2024, 1, 1) Тогда
            СтавкаОПВР = СтрокаСтавок.Ставка;
        КонецЕсли;
    КонецЦикла;
    // ЗУПК


	Если ИмяРеквизита = "ОстатокОтпуска" ИЛИ ИмяРеквизита = "ОтпускАвансом" ИЛИ ИмяРеквизита = "СреднийЗаработок" ИЛИ ИмяРеквизита = "ФОТ" Тогда
        
       Если МетодОбязательств ИЛИ Инвентаризация Тогда 
            ПараметрыСтроки.СуммаРезерваИсчислено                     = ПараметрыСтроки.СреднийЗаработок* Макс(0, ПараметрыСтроки.ОстатокОтпуска - ПараметрыСтроки.ОтпускАвансом);
            ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчислено     = ПараметрыСтроки.СуммаРезерваИсчислено*ПараметрыСтроки.ТекущаяСтавкаСтраховыхВзносов/100;
            ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчислено  = ПараметрыСтроки.СуммаРезерваИсчислено*ПараметрыСтроки.ТекущаяСтавкаФССНесчастныеСлучаи/100;
            Если ПараметрыСтроки.СО = 0
                И ПараметрыСтроки.СН = 0
                И ПараметрыСтроки.ОППВ = 0
                И ПараметрыСтроки.ОПВР = 0
                И ПараметрыСтроки.ОтчисленияОСМС = 0 Тогда
                ПараметрыСтроки.СуммаРезерваСОИсчислено                   = Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2);
                Если ЭтаФорма["ОрганизацияЯвляетсяИП"] И ПараметрыСтроки.СуммаРезерваИсчислено <> 0 Тогда
                    ФизическоеЛицо = ПолучитьФизическоеЛицоНаСервере(ПараметрыСтроки.Сотрудник);
                    Если ФизическоеЛицо = ЭтаФорма["ФизическоеЛицоИП"] Тогда
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);                            
                    Иначе
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);
                    КонецЕсли;
                Иначе
                    ПараметрыСтроки.СуммаРезерваСНИсчислено               = Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2);
                КонецЕсли; 
                ПараметрыСтроки.СуммаРезерваОППВИсчислено                 = 0;
                ПараметрыСтроки.СуммаРезерваОПВРИсчислено                 = Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаОПВР/100, 2);
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено       = Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаООСМС/100, 2);
            Иначе
                ПараметрыСтроки.СуммаРезерваСОИсчислено                   = ?(ПараметрыСтроки.СО = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2));
                Если ЭтаФорма["ОрганизацияЯвляетсяИП"] И ПараметрыСтроки.СуммаРезерваИсчислено <> 0 Тогда
                    ФизическоеЛицо = ПолучитьФизическоеЛицоНаСервере(ПараметрыСтроки.Сотрудник);
                    Если ФизическоеЛицо = ЭтаФорма["ФизическоеЛицоИП"] Тогда
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);                            
                    Иначе
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);
                    КонецЕсли;
                Иначе
                    ПараметрыСтроки.СуммаРезерваСНИсчислено               = ?(ПараметрыСтроки.СН = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2));
                КонецЕсли; 
                ПараметрыСтроки.СуммаРезерваОППВИсчислено                 = ?(ПараметрыСтроки.ОППВ = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаОППВ/100, 2));
                ПараметрыСтроки.СуммаРезерваОПВРИсчислено                 = ?(ПараметрыСтроки.ОПВР = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаОПВР/100, 2));
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено       = ?(ПараметрыСтроки.ОтчисленияОСМС = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаООСМС/100, 2));
            КонецЕсли;
            ПараметрыСтроки.СуммаРезерва                      = ПараметрыСтроки.СуммаРезерваИсчислено - ПараметрыСтроки.СуммаРезерваНакоплено;
            ПараметрыСтроки.СуммаРезерваСО                    = ПараметрыСтроки.СуммаРезерваСОИсчислено - ПараметрыСтроки.СуммаРезерваСОНакоплено;
            ПараметрыСтроки.СуммаРезерваСН                    = ПараметрыСтроки.СуммаРезерваСНИсчислено - ПараметрыСтроки.СуммаРезерваСННакоплено;
            ПараметрыСтроки.СуммаРезерваОППВ                  = ПараметрыСтроки.СуммаРезерваОППВИсчислено - ПараметрыСтроки.СуммаРезерваОППВНакоплено;
            ПараметрыСтроки.СуммаРезерваОПВР                  = Макс(0, ПараметрыСтроки.СуммаРезерваОПВРИсчислено - ПараметрыСтроки.СуммаРезерваОПВРНакоплено);
            ПараметрыСтроки.СуммаРезерваОтчисленияОСМС        = ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено - ПараметрыСтроки.СуммаРезерваОтчисленияОСМСНакоплено;
        Иначе
            ПараметрыСтроки.СуммаРезерваИсчислено = Окр(ПараметрыСтроки.ФОТ*НормативОтчисленийВРезервОтпусков/100,2);
        КонецЕсли;
              
		Если НЕ ДоступноСписание Тогда
            ПараметрыСтроки.СуммаРезерва                      = Макс(0, ПараметрыСтроки.СуммаРезерва);
            ПараметрыСтроки.СуммаРезерваСО                    = Макс(0, ПараметрыСтроки.СуммаРезерваСО);
            ПараметрыСтроки.СуммаРезерваСН                    = Макс(0, ПараметрыСтроки.СуммаРезерваСН);
            ПараметрыСтроки.СуммаРезерваОППВ                  = Макс(0, ПараметрыСтроки.СуммаРезерваОППВИсчислено);
            ПараметрыСтроки.СуммаРезерваОПВР                  = Макс(0, ПараметрыСтроки.СуммаРезерваОПВР);
            ПараметрыСтроки.СуммаРезерваОтчисленияОСМС        = Макс(0, ПараметрыСтроки.СуммаРезерваОтчисленияОСМС);
        КонецЕсли;
        
		ПараметрыСтроки.СуммаРезерваСтраховыхВзносов      = ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчислено - ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНакоплено;
		ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаи   = ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчислено - ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНакоплено;

		Если ФормироватьРезервыОтпусковВНалоговомУчете И Инвентаризация Тогда
			ПараметрыСтроки.СуммаРезерваИсчисленоНУ                    = ПараметрыСтроки.СуммаРезерваИсчислено;
			ПараметрыСтроки.СуммаРезерваНУ                             = ПараметрыСтроки.СуммаРезерваИсчисленоНУ - ПараметрыСтроки.СуммаРезерваНакопленоНУ;
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчисленоНУ    = ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчислено;
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ             = ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчисленоНУ - ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНакопленоНУ;
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ = ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчислено;
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ          = ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ - ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНакопленоНУ;
		ИначеЕсли ФормироватьРезервыОтпусковВНалоговомУчете Тогда
			ПараметрыСтроки.СуммаРезерваИсчисленоНУ                    = Окр(ПараметрыСтроки.ФОТ*НормативОтчисленийВРезервОтпусков/100,2);
			ПараметрыСтроки.СуммаРезерваНУ                             = ПараметрыСтроки.СуммаРезерваИсчисленоНУ - ПараметрыСтроки.СуммаРезерваНакопленоНУ;
		Иначе
			ПараметрыСтроки.СуммаРезерваИсчисленоНУ                    = 0;
			ПараметрыСтроки.СуммаРезерваНУ                             = 0;
		КонецЕсли;
		
		Если НЕ ДоступноСписание Тогда
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносов      = Макс(0, ПараметрыСтроки.СуммаРезерваСтраховыхВзносов);
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаи   = Макс(0, ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаи);
			ПараметрыСтроки.СуммаРезерва                      = Макс(0, ПараметрыСтроки.СуммаРезерва);
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ    = Макс(0, ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ);
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ = Макс(0, ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ);
			ПараметрыСтроки.СуммаРезерваНУ                    = Макс(0, ПараметрыСтроки.СуммаРезерваНУ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяРеквизита = "СтраховыеВзносы"
		ИЛИ ИмяРеквизита = "ТекущаяСтавкаСтраховыхВзносов" Тогда
		
		Если МетодОбязательств ИЛИ Инвентаризация Тогда
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчислено = ПараметрыСтроки.СуммаРезерваИсчислено*ПараметрыСтроки.ТекущаяСтавкаСтраховыхВзносов/100;
		Иначе
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчислено = Окр(ПараметрыСтроки.СтраховыеВзносы*НормативОтчисленийВРезервОтпусков/100,2);
		КонецЕсли;
		ПараметрыСтроки.СуммаРезерваСтраховыхВзносов = ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчислено - ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНакоплено;
		
		Если ФормироватьРезервыОтпусковВНалоговомУчете И Инвентаризация Тогда
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчисленоНУ  = ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчислено;
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ           = ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчисленоНУ - ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНакопленоНУ;
		ИначеЕсли ФормироватьРезервыОтпусковВНалоговомУчете Тогда 
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчисленоНУ  = Окр(ПараметрыСтроки.СтраховыеВзносы*НормативОтчисленийВРезервОтпусков/100,2);
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ           = ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчисленоНУ - ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНакопленоНУ;
		Иначе
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовИсчисленоНУ  = 0;
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ           = 0;
		КонецЕсли;
		
		Если НЕ ДоступноСписание Тогда
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносов      = Макс(0, ПараметрыСтроки.СуммаРезерваСтраховыхВзносов);
			ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ    = Макс(0, ПараметрыСтроки.СуммаРезерваСтраховыхВзносовНУ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяРеквизита = "ФССНесчастныеСлучаи"
		ИЛИ ИмяРеквизита = "ТекущаяСтавкаФССНесчастныеСлучаи" Тогда
		
		Если МетодОбязательств ИЛИ Инвентаризация Тогда
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчислено = ПараметрыСтроки.СуммаРезерваИсчислено*ПараметрыСтроки.ТекущаяСтавкаФССНесчастныеСлучаи/100;
		Иначе
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчислено = Окр(ПараметрыСтроки.ФССНесчастныеСлучаи*НормативОтчисленийВРезервОтпусков/100,2);
		КонецЕсли;
		ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаи = ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчислено - ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНакоплено;
		
		Если ФормироватьРезервыОтпусковВНалоговомУчете И Инвентаризация Тогда
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ = ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчислено;
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ          = ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ - ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНакопленоНУ;
		ИначеЕсли ФормироватьРезервыОтпусковВНалоговомУчете Тогда 
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ = Окр(ПараметрыСтроки.ФССНесчастныеСлучаи*НормативОтчисленийВРезервОтпусков/100,2);
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ          = ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ - ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНакопленоНУ;
		Иначе
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ = 0;
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ          = 0;
		КонецЕсли;
		
		Если НЕ ДоступноСписание Тогда
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаи   = Макс(0, ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаи);
			ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ = Макс(0, ПараметрыСтроки.СуммаРезерваФССНесчастныеСлучаиНУ);
		КонецЕсли;
		
	КонецЕсли;
	
    Если МетодОбязательств И Показатель = "" Тогда
        Если ИмяРеквизита = "СуммаРезерваИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваНакоплено" Тогда
            
            Если ПараметрыСтроки.СО = 0
                И ПараметрыСтроки.СН = 0
                И ПараметрыСтроки.ОППВ = 0
                И ПараметрыСтроки.ОПВР = 0
                И ПараметрыСтроки.ОтчисленияОСМС = 0 Тогда
                ПараметрыСтроки.СуммаРезерваСОИсчислено             = Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2);
                ПараметрыСтроки.СуммаРезерваСОНакоплено             = Окр(ПараметрыСтроки.СуммаРезерваНакоплено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2);
                Если ЭтаФорма["ОрганизацияЯвляетсяИП"] И ПараметрыСтроки.СуммаРезерваИсчислено <> 0 Тогда
                    ФизическоеЛицо = ПолучитьФизическоеЛицоНаСервере(ПараметрыСтроки.Сотрудник);
                    Если ФизическоеЛицо = ЭтаФорма["ФизическоеЛицоИП"] Тогда
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);                            
                        ПараметрыСтроки.СуммаРезерваСННакоплено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] > ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] - ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                0), 2);                            
                     Иначе
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);                            
                        ПараметрыСтроки.СуммаРезерваСННакоплено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] > ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] - ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                0), 2);                            
                    КонецЕсли;
                Иначе
                    ПараметрыСтроки.СуммаРезерваСНИсчислено             = Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2);
                    ПараметрыСтроки.СуммаРезерваСННакоплено             = Окр(ПараметрыСтроки.СуммаРезерваНакоплено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2);
                КонецЕсли;
                ПараметрыСтроки.СуммаРезерваОППВИсчислено           = ?(ПараметрыСтроки.ОППВ = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаОППВ/100, 2));
                ПараметрыСтроки.СуммаРезерваОППВНакоплено           = ?(ПараметрыСтроки.ОППВ = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваНакоплено*СтавкаОППВ/100, 2));
                ПараметрыСтроки.СуммаРезерваОПВРИсчислено           = ?(ПараметрыСтроки.ОПВР = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаОПВР/100, 2));
                ПараметрыСтроки.СуммаРезерваОПВРНакоплено           = ?(ПараметрыСтроки.ОПВР = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваНакоплено*СтавкаОПВР/100, 2));
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено = Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаООСМС/100, 2);
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМСНакоплено = Окр(ПараметрыСтроки.СуммаРезерваНакоплено*СтавкаООСМС/100, 2);
            Иначе
                ПараметрыСтроки.СуммаРезерваСОИсчислено             = ?(ПараметрыСтроки.СО = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2));
                ПараметрыСтроки.СуммаРезерваСОНакоплено             = ?(ПараметрыСтроки.СО = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваНакоплено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2));
                Если ЭтаФорма["ОрганизацияЯвляетсяИП"] И ПараметрыСтроки.СуммаРезерваИсчислено <> 0 Тогда
                    ФизическоеЛицо = ПолучитьФизическоеЛицоНаСервере(ПараметрыСтроки.Сотрудник);
                    Если ФизическоеЛицо = ЭтаФорма["ФизическоеЛицоИП"] Тогда
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);                            
                        ПараметрыСтроки.СуммаРезерваСННакоплено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] > ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] - ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                0), 2);                            
                     Иначе
                        ПараметрыСтроки.СуммаРезерваСНИсчислено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] > ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] - ПараметрыСтроки.СуммаРезерваСОИсчислено,
                                                                                0), 2);                            
                        ПараметрыСтроки.СуммаРезерваСННакоплено       = Окр(?(ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] > ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                ЭтаФорма["РазмерМРП"]*ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] - ПараметрыСтроки.СуммаРезерваСОНакоплено,
                                                                                0), 2);                            
                    КонецЕсли;
                Иначе
                    ПараметрыСтроки.СуммаРезерваСНИсчислено             = ?(ПараметрыСтроки.СН = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2));
                    ПараметрыСтроки.СуммаРезерваСННакоплено             = ?(ПараметрыСтроки.СН = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваНакоплено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2));
                КонецЕсли;
                ПараметрыСтроки.СуммаРезерваОППВИсчислено           = ?(ПараметрыСтроки.ОППВ = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаОППВ/100, 2));
                ПараметрыСтроки.СуммаРезерваОППВНакоплено           = ?(ПараметрыСтроки.ОППВ = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваНакоплено*СтавкаОППВ/100, 2));
                ПараметрыСтроки.СуммаРезерваОПВРИсчислено           = ?(ПараметрыСтроки.ОПВР = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаОПВР/100, 2));
                ПараметрыСтроки.СуммаРезерваОПВРНакоплено           = ?(ПараметрыСтроки.ОПВР = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваНакоплено*СтавкаОПВР/100, 2));
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено = ?(ПараметрыСтроки.ОтчисленияОСМС = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваИсчислено*СтавкаООСМС/100, 2));
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМСНакоплено = ?(ПараметрыСтроки.ОтчисленияОСМС = 0, 0, Окр(ПараметрыСтроки.СуммаРезерваНакоплено*СтавкаООСМС/100, 2));
            КонецЕсли;
            Если МетодОбязательств ИЛИ Инвентаризация Тогда 
                
                ПараметрыСтроки["СуммаРезерва" + Показатель]      = ПараметрыСтроки["СуммаРезерваИсчислено" + Показатель] - ПараметрыСтроки["СуммаРезерваНакоплено" + Показатель];
                ПараметрыСтроки.СуммаРезерваСО                    = ПараметрыСтроки.СуммаРезерваСОИсчислено - ПараметрыСтроки.СуммаРезерваСОНакоплено;
                ПараметрыСтроки.СуммаРезерваСН                    = ПараметрыСтроки.СуммаРезерваСНИсчислено - ПараметрыСтроки.СуммаРезерваСННакоплено;
                ПараметрыСтроки.СуммаРезерваОППВ                  = ПараметрыСтроки.СуммаРезерваОППВИсчислено - ПараметрыСтроки.СуммаРезерваОППВНакоплено;
                ПараметрыСтроки.СуммаРезерваОПВР                  = ПараметрыСтроки.СуммаРезерваОПВРИсчислено - ПараметрыСтроки.СуммаРезерваОПВРНакоплено;
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМС        = ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено - ПараметрыСтроки.СуммаРезерваОтчисленияОСМСНакоплено;
            КонецЕсли;
            Если НЕ ДоступноСписание Тогда
                ПараметрыСтроки["СуммаРезерва" + Показатель]      = Макс(0, ПараметрыСтроки["СуммаРезерва" + Показатель]);
                ПараметрыСтроки.СуммаРезерваСО                    = Макс(0, ПараметрыСтроки.СуммаРезерваСО);
                ПараметрыСтроки.СуммаРезерваСН                    = Макс(0, ПараметрыСтроки.СуммаРезерваСН);
                ПараметрыСтроки.СуммаРезерваОППВ                  = Макс(0, ПараметрыСтроки.СуммаРезерваОППВИсчислено);
                ПараметрыСтроки.СуммаРезерваОПВР                  = Макс(0, ПараметрыСтроки.СуммаРезерваОПВРИсчислено);
                ПараметрыСтроки.СуммаРезерваОтчисленияОСМС        = Макс(0, ПараметрыСтроки.СуммаРезерваОтчисленияОСМС);
            КонецЕсли;
        КонецЕсли;
        Если ИмяРеквизита = "СуммаРезерваСтраховыхВзносовИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваСтраховыхВзносовНакоплено" Тогда
            ПараметрыСтроки["СуммаРезерваСтраховыхВзносов" + Показатель] = ПараметрыСтроки["СуммаРезерваСтраховыхВзносовИсчислено" + Показатель] - ПараметрыСтроки["СуммаРезерваСтраховыхВзносовНакоплено" + Показатель];
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваФССНесчастныеСлучаиИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваФССНесчастныеСлучаиНакоплено" Тогда
            ПараметрыСтроки["СуммаРезерваФССНесчастныеСлучаи" + Показатель] = ПараметрыСтроки["СуммаРезерваФССНесчастныеСлучаиИсчислено" + Показатель] - ПараметрыСтроки["СуммаРезерваФССНесчастныеСлучаиНакоплено" + Показатель];
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваСОИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваСОНакоплено" Тогда
            ПараметрыСтроки.СуммаРезерваСО = ПараметрыСтроки.СуммаРезерваСОИсчислено - ПараметрыСтроки.СуммаРезерваСОНакоплено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваСНИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваСННакоплено" Тогда
            ПараметрыСтроки.СуммаРезерваСН = ПараметрыСтроки.СуммаРезерваСНИсчислено - ПараметрыСтроки.СуммаРезерваСННакоплено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваОППВИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваОППВНакоплено" Тогда
            ПараметрыСтроки.СуммаРезерваОППВ = ПараметрыСтроки.СуммаРезерваОППВИсчислено - ПараметрыСтроки.СуммаРезерваОППВНакоплено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваОПВРИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваОПВРНакоплено" Тогда
            ПараметрыСтроки.СуммаРезерваОПВР = ПараметрыСтроки.СуммаРезерваОПВРИсчислено - ПараметрыСтроки.СуммаРезерваОПВРНакоплено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваОтчисленияОСМСИсчислено"
            ИЛИ ИмяРеквизита = "СуммаРезерваОтчисленияОСМСНакоплено" Тогда
            ПараметрыСтроки.СуммаРезерваОтчисленияОСМС = ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено - ПараметрыСтроки.СуммаРезерваОтчисленияОСМСНакоплено;
        КонецЕсли;
    Иначе
        Если ИмяРеквизита = "СуммаРезерваИсчислено" Тогда
            ПараметрыСтроки["СуммаРезерва" + Показатель] = ПараметрыСтроки["СуммаРезерваИсчислено" + Показатель];
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваСтраховыхВзносовИсчислено" Тогда
            ПараметрыСтроки["СуммаРезерваСтраховыхВзносов" + Показатель] = ПараметрыСтроки["СуммаРезерваСтраховыхВзносовИсчислено" + Показатель];
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваФССНесчастныеСлучаиИсчислено" Тогда
            ПараметрыСтроки["СуммаРезерваФССНесчастныеСлучаи" + Показатель] = ПараметрыСтроки["СуммаРезерваФССНесчастныеСлучаиИсчислено" + Показатель];
        КонецЕсли;
        
        Если ИмяРеквизита = "СО" Тогда
            ПараметрыСтроки.СуммаРезерваСОИсчислено = Окр(ПараметрыСтроки.СО*НормативОтчисленийВРезервОтпусков/100,2);
            ПараметрыСтроки.СуммаРезерваСО = ПараметрыСтроки.СуммаРезерваСОИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СН" Тогда
            ПараметрыСтроки.СуммаРезерваСНИсчислено = Окр(ПараметрыСтроки.СН*НормативОтчисленийВРезервОтпусков/100,2);
            ПараметрыСтроки.СуммаРезерваСН = ПараметрыСтроки.СуммаРезерваСНИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "ОППВ" Тогда
            ПараметрыСтроки.СуммаРезерваОППВИсчислено = Окр(ПараметрыСтроки.ОППВ*НормативОтчисленийВРезервОтпусков/100,2);
            ПараметрыСтроки.СуммаРезерваОППВ = ПараметрыСтроки.СуммаРезерваОППВИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "ОПВР" Тогда
            ПараметрыСтроки.СуммаРезерваОПВРИсчислено = Окр(ПараметрыСтроки.ОПВР*НормативОтчисленийВРезервОтпусков/100,2);
            ПараметрыСтроки.СуммаРезерваОПВР = ПараметрыСтроки.СуммаРезерваОПВРИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "ОтчисленияОСМС" Тогда
            ПараметрыСтроки.СуммаРезерваОтчисленияОСМСНакоплено = Окр(ПараметрыСтроки.ОтчисленияОСМС*НормативОтчисленийВРезервОтпусков/100,2);
            ПараметрыСтроки.СуммаРезерваОтчисленияОСМС = ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваСОИсчислено" Тогда
            ПараметрыСтроки.СуммаРезерваСО = ПараметрыСтроки.СуммаРезерваСОИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваСНИсчислено" Тогда
            ПараметрыСтроки.СуммаРезерваСН = ПараметрыСтроки.СуммаРезерваСНИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваОПВРИсчислено" Тогда
            ПараметрыСтроки.СуммаРезерваОПВР = ПараметрыСтроки.СуммаРезерваОПВРИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваОППВИсчислено" Тогда
            ПараметрыСтроки.СуммаРезерваОППВ = ПараметрыСтроки.СуммаРезерваОППВИсчислено;
        КонецЕсли;
        
        Если ИмяРеквизита = "СуммаРезерваОтчисленияОСМСИсчислено" Тогда
            ПараметрыСтроки.СуммаРезерваОтчисленияОСМС = ПараметрыСтроки.СуммаРезерваОтчисленияОСМСИсчислено;
        КонецЕсли;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте()
	
	Результат = ПересчитатьНаСервере();
	
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
	Иначе
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, Ложь);
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьНаСервере()
	
	ПараметрыЗаполнения = Новый Структура("Объект", СформироватьОписаниеДокумента());
	
	НаименованиеЗадания = НСтр("ru = 'Пересчет документа ""Начисление оценочных обязательств по отпускам""'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Документы.НачислениеОценочныхОбязательствПоОтпускам.ПеречитатьОценочныеОбязательства", 
		ПараметрыЗаполнения, 
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьРезультат();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтражениеВУчетеНаКлиенте()
	
	Результат = ОбновитьОтражениеВУчетеНаСервере();
	
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
	Иначе
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, ОценочныеОбязательстваНеактуальны, , "ПересчитатьОбязательстваТекущегоМесяца");
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьОтражениеВУчетеНаСервере()
	
	ПараметрыЗаполнения = Новый Структура("Объект", СформироватьОписаниеДокумента());
	
	НаименованиеЗадания = НСтр("ru = 'Пересчет документа ""Начисление оценочных обязательств по отпускам""'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Документы.НачислениеОценочныхОбязательствПоОтпускам.ОбновитьОтражениеВУчете", 
		ПараметрыЗаполнения, 
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьРезультат();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПеречитатьОценочныеОбязательстваПоСотрудникамНаКлиенте()
	
	Результат = ПеречитатьОценочныеОбязательстваПоСотрудникамНаСервере();
	
	Если НЕ Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
	Иначе
		УстановитьОтображениеКнопкиПересчитать(ЭтотОбъект, ОценочныеОбязательстваПоСотрудникамНеактуальны, , "ПересчитатьОбязательстваПоСотрудникам");
		УстановитьДоступностьТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеречитатьОценочныеОбязательстваПоСотрудникамНаСервере()
	
	ПараметрыЗаполнения = Новый Структура("Объект", СформироватьОписаниеДокумента());
	
	НаименованиеЗадания = НСтр("ru = 'Пересчет документа ""Начисление оценочных обязательств по отпускам""'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Документы.НачислениеОценочныхОбязательствПоОтпускам.ПеречитатьОценочныеОбязательстваПоСотрудникам", 
		ПараметрыЗаполнения, 
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьРезультат();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьРезультат()
		
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если Результат.Свойство("Объект") Тогда
		
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		
		РезультатОбъект = Результат.Объект;
		
		ТекущийОбъект.РасчетРезерваОтпусков.Загрузить(РезультатОбъект.РасчетРезерваОтпусков);
		ТекущийОбъект.ОценочныеОбязательства.Загрузить(РезультатОбъект.ОценочныеОбязательства);
		ТекущийОбъект.ОценочныеОбязательстваПоСотрудникам.Загрузить(РезультатОбъект.ОценочныеОбязательстваПоСотрудникам);
		ТекущийОбъект.ФизическиеЛица.Загрузить(РезультатОбъект.ФизическиеЛица);
		
		ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
		
		Если Результат.Свойство("ИмяТаблицы") Тогда
			
			Если Результат.ИмяТаблицы = "ОценочныеОбязательстваПоСотрудникам" Тогда
				ОценочныеОбязательстваПоСотрудникамНеактуальны = Ложь;
			ИначеЕсли Результат.ИмяТаблицы = "ОценочныеОбязательства" Тогда
				Если НЕ ОценочныеОбязательстваПоСотрудникамНеактуальны Тогда
					ОценочныеОбязательстваНеактуальны = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			ДанныеОтредактированы = ОценочныеОбязательстваПоСотрудникамНеактуальны
				ИЛИ ОценочныеОбязательстваНеактуальны;
			
		Иначе
			ДанныеОтредактированы                          = Ложь;
			ОценочныеОбязательстваНеактуальны              = Ложь;
			ОценочныеОбязательстваПоСотрудникамНеактуальны = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ИзмененныеДанные.Очистить();
	
	ПриПолученииДанныхНаСервере();
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюОкончание(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если Объект.РасчетРезерваОтпусков.Количество() = 0 Тогда
			Объект.ОценочныеОбязательства.Очистить();
			Объект.ОценочныеОбязательстваПоСотрудникам.Очистить();
			ДанныеОтредактированы = Ложь;
		Иначе
			ПересчитатьДокументНаКлиенте();
		КонецЕсли;
		Записать(Параметры);
	Иначе
		ЗакрытьПослеЗаписи = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеКнопкиПересчитать(Форма, УстановитьАктивность = Ложь, ОтображатьКнопкуПересчета = Истина, ИмяКнопки = "") Экспорт
	
	Если УстановитьАктивность Тогда
		ЦветТекстаКнопки = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветОсобогоТекста");
		ЦветФонаКнопки = ОбщегоНазначенияКлиент.ЦветСтиля("ВыделеннаяКнопкаФон");
	Иначе
		ЦветТекстаКнопки = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветТекстаКнопки");
		ЦветФонаКнопки = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветФонаКнопки");
	КонецЕсли;
	
	МассивИменКнопок = Новый Массив;
	Если ИмяКнопки = "" Тогда
		МассивИменКнопок.Добавить("ПересчитатьДокумент");
		МассивИменКнопок.Добавить("ПересчитатьОбязательстваПоСотрудникам");
		МассивИменКнопок.Добавить("ПересчитатьОбязательстваТекущегоМесяца");
	Иначе
		Если УстановитьАктивность Тогда
			МассивИменКнопок.Добавить("ПересчитатьДокумент");
		КонецЕсли;
		МассивИменКнопок.Добавить(ИмяКнопки);
	КонецЕсли;
	
	Для Каждого ИмяКнопкиПересчитать Из МассивИменКнопок Цикл
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			ИмяКнопкиПересчитать,
			"ЦветТекста",
			ЦветТекстаКнопки);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			ИмяКнопкиПересчитать,
			"ЦветФона",
			ЦветФонаКнопки);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			ИмяКнопкиПересчитать,
			"Доступность",
			УстановитьАктивность);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			ИмяКнопкиПересчитать,
			"Видимость",
			ОтображатьКнопкуПересчета И НЕ Форма.РассчитыватьДокументыПриРедактировании);
			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьТабличнойЧасти()
	
	Если РассчитыватьДокументыПриРедактировании Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОценочныеОбязательстваПоСотрудникам",
		"ТолькоПросмотр",
		ОценочныеОбязательстваПоСотрудникамНеактуальны);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОценочныеОбязательства",
		"ТолькоПросмотр",
		ОценочныеОбязательстваНеактуальны);
		
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
    // ЗУПК
    ЗаполнитьТаблицуСтавкиНалоговВзносовОтчислений(ЭтаФорма["ТаблицаСтавкиНалоговВзносовОтчислений"], Объект.Организация, Объект.ПериодРегистрации);
    // ЗУПК
	НастройкиРезервовОтпусков();
	УстановитьФункциональныеОпцииФормы();
	ПроверитьИспользованиеОбмена();
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Модифицированность);
	ОбработатьИзменениеМесяцНачисленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеВыбрано Тогда
		ОбработатьИзменениеМесяцНачисленияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.ПериодРегистрации", "ПериодРегистрацииСтрокой", Направление, Модифицированность);
	ПодключитьОбработчикОжидания("ОбработчикОжиданияМесяцНачисленияПриИзменении", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияМесяцНачисленияПриИзменении()

	ОбработатьИзменениеМесяцНачисленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеМесяцНачисленияНаСервере()
	
    // ЗУПК
	ЗаполнитьТаблицуСтавкиНалоговВзносовОтчислений(ЭтаФорма["ТаблицаСтавкиНалоговВзносовОтчислений"], Объект.Организация, Объект.ПериодРегистрации);
    // ЗУПК
	НастройкиРезервовОтпусков();
	УстановитьФункциональныеОпцииФормы();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация, Период", Объект.Организация, НачалоДня(Объект.ПериодРегистрации));
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	ФормироватьРезервыОтпусковВНалоговомУчете = ПолучитьФункциональнуюОпциюФормы("ФормироватьРезервыОтпусковВНалоговомУчете");
	
КонецПроцедуры

&НаСервере
Процедура НастройкиРезервовОтпусков()
	
	НастройкиРезервовОтпусков = РезервОтпусков.НастройкиРезервовОтпусков(Объект.Организация, Объект.ПериодРегистрации);
	МетодОбязательств                  = НастройкиРезервовОтпусков.МетодНачисленияРезерваОтпусков = Перечисления.МетодыНачисленияРезервовПоОплатеТруда.МетодОбязательств;
	НормативОтчисленийВРезервОтпусков  = НастройкиРезервовОтпусков.НормативОтчисленийВРезервОтпусков;
	ОпределятьИзлишкиЕжемесячно        = НастройкиРезервовОтпусков.ОпределятьИзлишкиЕжемесячно;

	//ЗУПК
    // Получаем применение вычета в месяц отсутствия дохода
    УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Объект.ПериодРегистрации, Новый Структура("Организация", Объект.Организация));
    ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация, "ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель");
    ЭтаФорма["ОрганизацияЯвляетсяИП"] = (ДанныеОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
    ЭтаФорма["ФизическоеЛицоИП"] = ДанныеОрганизации.ИндивидуальныйПредприниматель;
    
    РежимНалогообложения = Перечисления.СистемыНалогообложения.Общая;
    ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] = 0;
    ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] = 0;
    
    // в расчете учитываем все три возможные положения 
    // РежимНалогообложения = ПустаяСсылка
    // для ИП и юр лица считаем как раньше
    //
    // РежимНалогообложения = Общая
    // для ИП считаем СН с учетом Коэффициентов
    // для юр лица считаем как раньше
    //
    // РежимНалогообложения = Упрощенная
    // для ИП и юр лица не считаем СН
    Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
        
        РежимНалогообложения = УчетнаяПолитикаНУ[0].СистемаНалогообложения;
        
        Если ЭтаФорма["ОрганизацияЯвляетсяИП"] Тогда
            
            ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя;
            ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника;
            
        КонецЕсли;
        
        // не плательщик СН, независимо что в регистре
        Если РежимНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
            ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя"] = 0;
            ЭтаФорма["КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника"] 			   = 0;
        КонецЕсли;
        
    КонецЕсли;
    
    МесячныйРасчетныйПоказатель = РегистрыСведений.МесячныйРасчетныйПоказатель.СрезПоследних(Объект.ПериодРегистрации);
    ЭтаФорма["РазмерМРП"] = 0;
    Если МесячныйРасчетныйПоказатель.Количество() > 0 Тогда
        ЭтаФорма["РазмерМРП"] = МесячныйРасчетныйПоказатель[0].Размер;
    КонецЕсли;
    //ЗУПК
	
	ДокументДоступен = РезервОтпусков.ДоступенВводДокументаРезервОтпусков(Объект.Организация, Объект.ПериодРегистрации);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуСреднегоЗаработка()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадрыРасширенная") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("РезервОтпусковКлиентРасширенный");
		Модуль.ОткрытьФормуСреднегоЗаработка(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// ЗУПК
&НаСервере
Процедура ЗаполнитьТаблицуСтавкиНалоговВзносовОтчислений(ТаблицаСтавкиНалоговВзносовОтчислений, Организация, ПериодРегистрации)
    
    УчетНалоговВзносовОтчислений.ЗаполнитьТаблицуСтавкиНалоговВзносовОтчисленийДляОценочныхОбязательств(ТаблицаСтавкиНалоговВзносовОтчислений, Организация, ПериодРегистрации);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковОППВПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ОППВ");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваОППВИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваОППВИсчислено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваОППВНакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваОППВНакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковОтчисленияОСМСПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ОтчисленияОСМС");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваОтчисленияОСМСИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваОтчисленияОСМСИсчислено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваОтчисленияОСМСНакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваОтчисленияОСМСНакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСНПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СН");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваСНИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСНИсчислено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваСННакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСННакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСОПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СО");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваСОИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСОИсчислено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваСОНакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваСОНакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковОПВРПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "ОПВР");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваОПВРНакопленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваОПВРНакоплено");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасчетРезерваОтпусковСуммаРезерваОПВРИсчисленоПриИзменении(Элемент)
	
	СтрокаТаблицы   = Элементы.РасчетРезерваОтпусков.ТекущиеДанные;
	ПересчитатьНаКлиенте(СтрокаТаблицы, "СуммаРезерваОПВРИсчислено");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФизическоеЛицоНаСервере(Сотрудник)

    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");	

КонецФункции 


// ЗУПК

#КонецОбласти

#Область Инициализация

ЗакрытьПослеЗаписи    = Ложь;

#КонецОбласти
