
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Соединение; // HTTPСоединение

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Подключить(ПолученноеИмяПользователя, ПолученныйПароль) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	ИмяПользователя = ПолученноеИмяПользователя;
	Пароль = ПолученныйПароль;
	
	СтруктураМаркеров = СтруктураМаркеров();
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИмяПользователя;
		Результат.Пароль = Пароль;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьПодключение() Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если ЗначениеЗаполнено(РеквизитыСайта) Тогда
		УстановитьПривилегированныйРежим(Истина);
		РеквизитыСайта.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Пользователь, "ПарольRabota");
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
		Результат.Подключен = МаркерАктивен();
		Результат.ИмяПользователя = РеквизитыСайта.ИмяПользователя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьКлассификаторы() Экспорт
	
	Классификаторы = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("КлассификаторыRabota");
	
	Если Классификаторы <> Неопределено Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	КлассификаторыRabota = СправочникиWebApi("Rabota");
	
	Если Не ЗначениеЗаполнено(КлассификаторыRabota) Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	КлассификаторыRabotaНовый = Новый Структура;
	
	Для Каждого КлючИЗначение Из КлассификаторыRabota Цикл
		Запрос = НовыйHTTPЗапрос(КлючИЗначение.Ключ);
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеЗагрузкиКлассификаторов(Сайт, ЭтотОбъект, РезультатЗапроса);
		Иначе
			ОписаниеЭлементов = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
			ОписаниеЭлементовФикс = ОбщегоНазначения.ФиксированныеДанные(ОписаниеЭлементов);
			
			Если КлючИЗначение.Ключ = "offer-trades" Тогда
				НовоеОписаниеЭлементов = Новый Массив;
				
				Для Каждого Элемент Из ОписаниеЭлементовФикс Цикл
					Если Не Элемент.hidden Тогда
						НовоеОписаниеЭлементов.Добавить(Элемент);
					КонецЕсли;
				КонецЦикла;
				
				ОписаниеЭлементовФикс = ОбщегоНазначения.ФиксированныеДанные(НовоеОписаниеЭлементов);
			КонецЕсли;
			
			КлассификаторыRabotaНовый.Вставить(СтрЗаменить(КлючИЗначение.Ключ, "-", "_"), ОписаниеЭлементовФикс);
		КонецЕсли;
	КонецЦикла;
	
	ВариантыОпытаРаботы = Новый Массив;
	ВариантыОпытаРаботы.Добавить(СтруктураДанных(Неопределено, НСтр("ru = 'Не имеет значения'")));
	ВариантыОпытаРаботы.Добавить(СтруктураДанных(-1, НСтр("ru = 'Без опыта'")));
	ВариантыОпытаРаботы.Добавить(СтруктураДанных(0, НСтр("ru = 'Менее года'")));
	ВариантыОпытаРаботы.Добавить(СтруктураДанных(1, НСтр("ru = 'от 1 года'")));
	
	КолВоЛет = 2;
	Пока КолВоЛет < 11 Цикл
		ВариантыОпытаРаботы.Добавить(СтруктураДанных(КолВоЛет, СтрШаблон(НСтр("ru = 'от %1 лет'"), КолВоЛет)));
		КолВоЛет = КолВоЛет + 1;
	КонецЦикла;
	
	КлассификаторыRabotaНовый.Вставить("experience", ОбщегоНазначения.ФиксированныеДанные(ВариантыОпытаРаботы));
	
	ВариантыПола = Новый Массив;
	ВариантыПола.Добавить(СтруктураДанных(Неопределено, НСтр("ru = 'Не важно'")));
	ВариантыПола.Добавить(СтруктураДанных("female", НСтр("ru = 'Женский'")));
	ВариантыПола.Добавить(СтруктураДанных("male", НСтр("ru = 'Мужской'")));
	
	КлассификаторыRabotaНовый.Вставить("gender", ОбщегоНазначения.ФиксированныеДанные(ВариантыПола));
	
	КатегорииПрав = Новый Массив;
	КатегорииПрав.Добавить(СтруктураДанных("A", "A"));
	КатегорииПрав.Добавить(СтруктураДанных("B", "B"));
	КатегорииПрав.Добавить(СтруктураДанных("C", "C"));
	КатегорииПрав.Добавить(СтруктураДанных("D", "D"));
	КатегорииПрав.Добавить(СтруктураДанных("E", "E"));
	
	КлассификаторыRabotaНовый.Вставить("driving_licence", ОбщегоНазначения.ФиксированныеДанные(КатегорииПрав));
	
	Периоды = Новый Массив;
	Периоды.Добавить(СтруктураДанных(-2005, НСтр("ru = 'За все время'")));
	Периоды.Добавить(СтруктураДанных(1, НСтр("ru = 'За последние 24 часа'")));
	Периоды.Добавить(СтруктураДанных(3, НСтр("ru = 'За последние 3 дня'")));
	Периоды.Добавить(СтруктураДанных(7, НСтр("ru = 'За последнюю неделю'")));
	Периоды.Добавить(СтруктураДанных(14, НСтр("ru = 'За последние 2 недели'")));
	Периоды.Добавить(СтруктураДанных(30, НСтр("ru = 'За последний 1 месяц'")));
	Периоды.Добавить(СтруктураДанных(60, НСтр("ru = 'За последние 2 месяца'")));
	
	КлассификаторыRabotaНовый.Вставить("periods", ОбщегоНазначения.ФиксированныеДанные(Периоды));
	
	Классификаторы = Новый ФиксированнаяСтруктура(КлассификаторыRabotaНовый);
	
	ТекущиеПараметры =
		РекрутинговыеСайтыСлужебный.СоответствиеПоФиксированномуСоответствию(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	ТекущиеПараметры.Вставить("КлассификаторыRabota", Классификаторы);
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ТекущиеПараметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Классификаторы;
	
КонецФункции

Процедура НайтиКандидатов(ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска) Экспорт
	
	НомерСтраницы = ПараметрыПоиска.НомерСтраницы;
	ПолеСортировки = ПараметрыПоиска.ПолеСортировки;
	ВсегоКандидатов = ПараметрыПоиска.ВсегоКандидатов;
	
	СтрокаОтбора = СтрокаОтбора(СтруктураОтбора, НомерСтраницы);
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("search-resumes/?" + СтрокаОтбора);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоискаРезюме(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		РезультатПоискаРезюме = ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса);
		
		Если РезультатПоискаРезюме.data = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВсегоКандидатов = РезультатПоискаРезюме.count;
		ПараметрыПоиска.ВсегоКандидатов = Мин(Число(ВсегоКандидатов), 2000);
		
		ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьДеревоКлассификатора(Классификатор, Дерево) Экспорт
	
	Результат = Ложь;
	
	Если Классификатор = "offer_trades" Тогда
		Результат = ЗаполнитьДеревоРубрик(Дерево);
	ИначеЕсли Классификатор = "regions" Или Классификатор = "areas_towns" Тогда
		Результат = ЗаполнитьДеревоРегионов(Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлементКлассификатора(ИмяСписка, Значение) Экспорт
	
	ЭлементКлассификатора = Неопределено;
	ИмяКлассификатора = "";
	
	ИменаСписковВыбора = РекрутинговыеСайтыСлужебный.ИменаСписковВыбора();
	Если ИмяСписка = ИменаСписковВыбора.Пол Тогда
		ИмяКлассификатора = "gender";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.УровеньОбразования Тогда
		ИмяКлассификатора = "offer_educations";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.ПериодРазмещения Тогда
		ИмяКлассификатора = "periods";
	Иначе
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	Классификаторы = КлассификаторыСайта();
	
	Классификатор = Классификаторы[ИмяКлассификатора];
	
	Если Не ЗначениеЗаполнено(Классификатор) Тогда
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	// АПК:1297-выкл Значения классификаторов, не локализуются.
	СоответствиеЗамены = Новый Соответствие;
	СоответствиеЗамены.Вставить("среднее", "среднее общее");
	// АПК:1297-вкл
	
	Найдено = Ложь;
	Для Каждого Элемент Из Классификатор Цикл
		ЗначениеСравнения = НРег(СокрЛП(Элемент.name));
		
		ЗначениеЗамены = СоответствиеЗамены.Получить(ЗначениеСравнения);
		Если ЗначениеЗаполнено(ЗначениеЗамены) Тогда
			ЗначениеСравнения = ЗначениеЗамены;
		КонецЕсли;
		
		Если ЗначениеСравнения = НРег(Значение) Тогда
			Найдено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Найдено Тогда
		ЭлементКлассификатора = Элемент.id;
	КонецЕсли;
	
	Возврат ЭлементКлассификатора;
	
КонецФункции

Функция ИдентификаторРезюмеПоАдресу(АдресРезюме) Экспорт
	
	Разделитель = "resume";
	
	ИдентификаторРезюме = СтрЗаменить(АдресРезюме, ".html", "");
	
	Пока РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель) > 0 Цикл
		НомерВхожденияРазделителя = 
			РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
		ИдентификаторРезюме = 
			Сред(ИдентификаторРезюме, 
				НомерВхожденияРазделителя + СтрДлина(Разделитель), 
				СтрДлина(ИдентификаторРезюме) - НомерВхожденияРазделителя);
	КонецЦикла;
	
	Возврат ИдентификаторРезюме;

КонецФункции

Функция ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме) Экспорт
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	Если ЗначениеЗаполнено(СтруктураРезюме) Тогда
		ДанныеКандидата = ДанныеКандидатаПоРезюме(СтруктураРезюме);
		
		ДанныеКандидата.Комментарии = ЗначениеСвойстваУзла(СтруктураРезюме, "Комментарии");
		ДанныеКандидата.ДанныеПубликации = СтруктураРезюме;
	Иначе
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстИсключенияПриОшибкеЗагрузкиРезюмеПоСсылке(Сайт);
	КонецЕсли;
	
	Возврат ДанныеКандидата;

КонецФункции

Функция ВакансииССайта(БылиОшибки = Ложь) Экспорт
	
	МассивВакансий = Новый Массив;
	
	Если Не УстановитьСоединение() Тогда
		БылиОшибки = Истина;
		Возврат МассивВакансий;
	КонецЕсли;
	
	ЗагрузитьКлассификаторы();
	
	Запрос = НовыйHTTPЗапрос("vacancies");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		БылиОшибки = Истина;
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансий(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		Вакансии = ПрочитатьОтветВакансииССайта(РезультатЗапроса);
		Для Каждого Вакансия Из Вакансии Цикл
			Описание = ОписаниеПубликацииВакансии(Формат(Вакансия.id, "ЧГ=0"));
			Если ЗначениеЗаполнено(Описание) Тогда
				МассивВакансий.Добавить(Описание);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВакансий;
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Реквизит = "Наименование" Тогда
		Результат = ?(ЗначениеЗаполнено(Вакансия.name), Вакансия.name, "");
	ИначеЕсли Реквизит = "ПредполагаемыйДоход" Тогда
		Результат = ?(ЗначениеЗаполнено(Вакансия.salaryTo), Вакансия.salaryTo, ?(ЗначениеЗаполнено(Вакансия.salaryFrom), Вакансия.salaryFrom, 0));
	ИначеЕсли Реквизит = "ДатаОткрытия" И ЗначениеЗаполнено(Вакансия.publishDate) Тогда
		Результат = РекрутинговыеСайтыСлужебный.СтрокаВДату(Вакансия.publishDate);
	ИначеЕсли Реквизит = "ПланируемаяДатаЗакрытия" И ЗначениеЗаполнено(Вакансия.expiresDate) Тогда
		Результат = РекрутинговыеСайтыСлужебный.СтрокаВДату(Вакансия.expiresDate);
	ИначеЕсли Реквизит = "Требования" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(Вакансия.description).Требования;
	ИначеЕсли Реквизит = "Обязанности" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(Вакансия.description).Обязанности;
	ИначеЕсли Реквизит = "Условия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(Вакансия.description).Условия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Показатель = Вакансия;
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "name";
	НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "name");
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "isStudyCourse")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "isStudyCourse";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "isStudyCourse");
	КонецЕсли;
	
	Профессии = Новый СписокЗначений;
	Для Каждого Профессия Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "offerTrades") Цикл
		Профессии.Добавить(Профессия.id, Профессия.name);
	КонецЦикла;
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "offerTrades";
	НовоеПоле.ПубликацияВакансии = Профессии;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salaryFrom")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salaryFrom";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salaryFrom");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salaryTo")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salaryTo";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salaryTo");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "agreementSalary")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "agreementSalary";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "agreementSalary");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "noSalary")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "noSalary";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "noSalary");
	КонецЕсли;
	
	Валюты = Новый СписокЗначений;
	Валюты.Добавить(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "currency", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "currency", "name"));
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "currency";
	НовоеПоле.ПубликацияВакансии = Валюты;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "isNonresident")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "isNonresident";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "isNonresident");
	КонецЕсли;
	
	Регионы = Новый СписокЗначений;
	Для Каждого Регион Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "region") Цикл
		Регионы.Добавить(Регион.id, Регион.name);
	КонецЦикла;
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "region";
	НовоеПоле.ПубликацияВакансии = Регионы;
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "description";
	НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "description");
	
	Графики = Новый СписокЗначений;
	Графики.Добавить(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "operatingSchedule", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "operatingSchedule", "name"));
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "operatingSchedule";
	НовоеПоле.ПубликацияВакансии = Графики;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "operatingScheduleComment")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "operatingScheduleComment";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "operatingScheduleComment");
	КонецЕсли;
	
	ИдентификаторОпытаРаботы = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "experienceYearCount");
	Если ТипЗнч(ИдентификаторОпытаРаботы) = Тип("Число") Тогда
		
		ВариантыОпытаРаботы = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("КлассификаторыRabota").experience;
		
		СведенияОбОпыте = Новый СписокЗначений;
		СведенияОбОпыте.Добавить(ИдентификаторОпытаРаботы, ПредставлениеДанныхПоИдентификатору(ВариантыОпытаРаботы, ИдентификаторОпытаРаботы));
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "experienceYearCount";
		НовоеПоле.ПубликацияВакансии = СведенияОбОпыте;
		
	КонецЕсли;
	
	Образование = Новый СписокЗначений;
	Образование.Добавить(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "education", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "education", "name"));
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "education")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "education";
		НовоеПоле.ПубликацияВакансии = Образование;
	КонецЕсли;
	
	ИдентификаторПола = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "gender");
	ВариантыПола = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("КлассификаторыRabota").gender;
	
	СведенияОПоле = Новый СписокЗначений;
	СведенияОПоле.Добавить(ИдентификаторПола, ПредставлениеДанныхПоИдентификатору(ВариантыПола, ИдентификаторПола));
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "gender";
	НовоеПоле.ПубликацияВакансии = СведенияОПоле;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "ageFrom")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "ageFrom";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "ageFrom");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "ageTo")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "ageTo";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "ageTo");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contactFio")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "contactFio";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contactFio");
	КонецЕсли;
	
	НовоеПоле = НоваяСтрока.Строки.Добавить();
	НовоеПоле.Путь = "contactEmail";
	НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contactEmail");
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "wantResponseByMail")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "wantResponseByMail";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "wantResponseByMail");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "address")) Тогда
		
		Адреса = Новый СписокЗначений;
		Для Каждого Адрес Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "address") Цикл
			
			Если ЗначениеЗаполнено(Адрес.representation) Тогда 
				Адреса.Добавить(Адрес.representation, Адрес.name);
			КонецЕсли;
			
		КонецЦикла;
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "address";
		НовоеПоле.ПубликацияВакансии = Адреса;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "phones")) Тогда
		
		Телефоны = Новый СписокЗначений;
		Для Каждого Телефон Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "phones") Цикл
			
			ДанныеТелефона = Новый Структура("countryCode,code,number,comment");
			ЗаполнитьЗначенияСвойств(ДанныеТелефона, Телефон);
			
			Если ЗначениеЗаполнено(Телефон.comment) Тогда
				Представление = СтрШаблон("%1 (%2) %3 (%4)", Телефон.countryCode, Телефон.code, Телефон.number, Телефон.comment);
			Иначе
				Представление = СтрШаблон("%1 (%2) %3", Телефон.countryCode, Телефон.code, Телефон.number);
			КонецЕсли;
			Телефоны.Добавить(ДанныеТелефона, Представление);
			
		КонецЦикла;
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "phones";
		НовоеПоле.ПубликацияВакансии = Телефоны;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "language")) Тогда
		
		ЗнанияЯзыков = Новый СписокЗначений;
		
		Для Каждого ЗнаниеЯзыка Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "language") Цикл
			
			СтруктураДанных = Новый Структура("offerLanguage, offerLanguageLevel");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, ЗнаниеЯзыка);
			
			Представление= СтрШаблон("%1 (%2)", ЗнаниеЯзыка.offerLanguage.name, ЗнаниеЯзыка.offerLanguageLevel.name);
			ЗнанияЯзыков.Добавить(СтруктураДанных, Представление);
			
		КонецЦикла;
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "language";
		НовоеПоле.ПубликацияВакансии = ЗнанияЯзыков;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "additionalInformation")) Тогда
		
		Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "additionalInformation", "auto")) Тогда
			
			НовоеПоле = НоваяСтрока.Строки.Добавить();
			НовоеПоле.Путь = "additionalInformation.auto";
			НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "additionalInformation", "auto");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "additionalInformation", "drivingLicense")) Тогда
			
			КатегорииПрав = Новый СписокЗначений;
			
			Для Каждого КатегорияПрав Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "additionalInformation", "drivingLicense") Цикл
				КатегорииПрав.Добавить(КатегорияПрав, КатегорияПрав);
			КонецЦикла;
			
			НовоеПоле = НоваяСтрока.Строки.Добавить();
			НовоеПоле.Путь = "additionalInformation.drivingLicense";
			НовоеПоле.ПубликацияВакансии = КатегорииПрав;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВидыПолей(ОбновлениеПубликации) Экспорт
	
	ВидыПолей = РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	
	ВидыПолей.СОдиночнымВыборомИзСписка = ПоляВакансииСОдиночнымВыборомИзСписка();
	ВидыПолей.СМножественнымВыборомИзСписка = ПоляВакансииСМножественнымВыборомИзСписка();
	ВидыПолей.СМножественнымВыборомИзДерева = ПоляВакансииСМножественнымВыборомИзДерева();
	ВидыПолей.НедоступныеДляРедактирования = ПоляВакансииНедоступныеДляРедактирования(ОбновлениеПубликации);
	ВидыПолей.СоСпециальнойФормойРедактированияСписка = ПоляВакансииСоСпециальнойФормойРедактированияСписка();
	ВидыПолей.СТекстомВHTML = ПоляВакансииСТекстомВHTML();
	
	Возврат ВидыПолей;
	
КонецФункции

Функция ПоляВакансии(ОбновлениеПубликации = Ложь) Экспорт
	
	ТипЗначенияJSONСтрока = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONСтрока();
	ТипЗначенияJSONНачалоМассива = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоМассива();
	ТипЗначенияJSONНачалоОбъекта = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоОбъекта();
	ТипЗначенияJSONЧисло = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONЧисло();
	ТипЗначенияJSONБулево = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONБулево();

	МассивПолей = Новый Массив;
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "name";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Название вакансии'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "isStudyCourse";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Это стажировка'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "offerTrades";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Рубрика размещения (не более 3)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "salaryFrom"; // может быть не указано, если agreementSalary = true
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Зарплата от'");
	СтруктураПоля.СвязанноеПолеПуть = "agreementSalary";
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "salaryTo";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Зарплата до'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "agreementSalary"; // может быть не указано, если указано salaryFrom
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Зарплата по договоренности'");
	СтруктураПоля.СвязанноеПолеПуть = "salaryFrom";
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "noSalary"; // значение true допустимо при isStudyCourse = true
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Без оплаты (только для стажировок)'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "currency";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Валюта'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "isNonresident"; 
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Рассматриваются иногородние'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "region";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Регион показа'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "description";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Описание вакансии'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "operatingSchedule";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'График работы'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "operatingScheduleComment";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Комментарий к графику работы'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "experienceYearCount";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Опыт работы'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "education";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Образование'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "gender";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Предпочтительный пол'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "ageFrom";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Возраст от'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "ageTo";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Возраст до'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "contactFio";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Контактное лицо'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "contactEmail";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'E-mail'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "wantResponseByMail";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Получать отклики на e-mail'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "address";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Адреса работы'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "phones";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Телефоны'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "language";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Значение языков'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "additionalInformation";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Доп. информация'");
	
	ПодчиненныеЭлементы = Новый Массив;
	
	СтруктураПоля_auto = СтруктураПоля();
	СтруктураПоля_auto.Путь = "auto";
	СтруктураПоля_auto.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля_auto.Описание = НСтр("ru = 'Есть личный автомобиль'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_auto);
	
	СтруктураПоля_drivingLicense = СтруктураПоля();
	СтруктураПоля_drivingLicense.Путь = "drivingLicense";
	СтруктураПоля_drivingLicense.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля_drivingLicense.Описание = НСтр("ru = 'Категории водительских прав'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_drivingLicense);
	
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	Возврат МассивПолей;
	
КонецФункции

Функция АдресВакансии(Идентификатор) Экспорт
	
	Возврат СтрШаблон("https://www.rabota.ru/vacancy/%1/", Идентификатор);
	
КонецФункции

Функция ОпубликоватьВакансию(Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	ОписаниеВакансииДляПубликацииRabota = JSONОписаниеВакансии(Дерево);
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСозданияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("vacancies");
	Запрос.УстановитьТелоИзСтроки(ОписаниеВакансииДляПубликацииRabota);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 201 Тогда
		Публикации = ПрочитатьОтветПубликацияВакансии(РезультатЗапроса);
		ИдентификаторВакансии = Публикации[0];
		
		Запрос = НовыйHTTPЗапрос(СтрШаблон("vacancies/%1/content-packages", ИдентификаторВакансии));
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			Тарифы = ПрочитатьОтветТарифы(РезультатЗапроса);
			
			Для Каждого Тариф Из Тарифы Цикл
				Результат.Тарифы.Вставить(Тариф.name, Тариф.id);
			КонецЦикла;
		КонецЕсли;
		
		Результат.ИдентификаторВакансии = ИдентификаторВакансии;
	Иначе
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойСозданияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрименитьТарифКВакансии(Идентификатор, Тариф) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСозданияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("action", "publish");
	ПараметрыЗапроса.Вставить("periodDays", 14);
	ПараметрыЗапроса.Вставить("hideContact", Ложь);
	ПараметрыЗапроса.Вставить("useTrap", Истина);
	ПараметрыЗапроса.Вставить("contentPackageId", Число(Тариф));
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("vacancies/%1", Формат(Идентификатор, "ЧГ=0")));
	Запрос.УстановитьТелоИзСтроки(РекрутинговыеСайтыСлужебный.ЗаписьJSON(ПараметрыЗапроса));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Если РезультатЗапроса.КодСостояния = 500 Тогда
			Результат.Успешно = Ложь;
			Результат.ТекстОшибки = НСтр("ru = 'Возможно, выбранный тариф не активирован.'");
		Иначе
			Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Результат.ИдентификаторВакансии = Идентификатор;
	
	Возврат Результат;
	
КонецФункции

Функция СписокВыбораПоКлассификатору(Путь) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	КлассификаторыRabota = КлассификаторыСайта();
	Если КлассификаторыRabota = Неопределено Или Не КлассификаторыRabota.Свойство(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	МассивДанных = КлассификаторыRabota[Путь];
	
	Для Каждого ЭлементМассива Из МассивДанных Цикл
		СписокВыбора.Добавить(ЭлементМассива.id, ЭлементМассива.name);
	КонецЦикла;
	
	Возврат СписокВыбора;

КонецФункции

Функция СнятьПубликациюВакансии(ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("id", ИдентификаторВакансии);
	ПараметрыЗапроса.Вставить("action", "unpublish");
	ПараметрыЗапроса.Вставить("sessionId", МаркерДоступа);
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("vacancies/%1", ИдентификаторВакансии));
	Запрос.УстановитьТелоИзСтроки(РекрутинговыеСайтыСлужебный.ЗаписьJSON(ПараметрыЗапроса));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Если Не УстановитьСоединение() Тогда
		Возврат СвойстваПубликации;
	КонецЕсли;
	
	Описание = ОписаниеПубликацииВакансии(ИдентификаторВакансии, Ложь);
	Если ЗначениеЗаполнено(Описание) Тогда
		СвойстваПубликации.Опубликована = Описание.isPublishStatus;
		
		Если СвойстваПубликации.Опубликована Тогда
			СвойстваПубликации.ДатаПубликации = РекрутинговыеСайтыСлужебный.СтрокаВДату(Описание.publishDate);
			СвойстваПубликации.ДатаОбновления = РекрутинговыеСайтыСлужебный.СтрокаВДату(Описание.modifiedDate);
		Иначе
			СвойстваПубликации.ДатаСнятияСПубликации = РекрутинговыеСайтыСлужебный.СтрокаВДату(Описание.modifiedDate);
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СвойстваПубликации;
	
КонецФункции

Функция ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево, Истина);
	
	Если Не ЗначениеЗаполнено(JSONОписаниеВакансии) Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("vacancies/%1", ИдентификаторВакансии));
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПовторноОпубликоватьВакансию(Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево, Истина);
	
	Если Не ЗначениеЗаполнено(JSONОписаниеВакансии) Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("vacancies/%1", ИдентификаторВакансии));
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Если Результат.Успешно Тогда
		ДатаСеанса = ТекущаяДатаСеанса();
		
		СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
		СвойстваПубликации.Опубликована = Истина;
		СвойстваПубликации.ДатаПубликации = ДатаСеанса;
		СвойстваПубликации.ДатаОбновления = ДатаСеанса;
		
		РекрутинговыеСайтыСлужебный.ЗаписьВРегистрИнформацииОПубликации(Вакансия, Сайт, , , СвойстваПубликации);
	КонецЕсли;
	
	Результат.ИдентификаторВакансии = ИдентификаторВакансии;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("vacancies/%1/content-packages", ИдентификаторВакансии));
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		Тарифы = ПрочитатьОтветТарифы(РезультатЗапроса);
		
		Для Каждого Тариф Из Тарифы Цикл
			Результат.Тарифы.Вставить(Тариф.name, Тариф.id);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьОтклики(Вакансия) Экспорт
	
	ИдентификаторВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторВакансии(Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторВакансии) Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОтсутствииПубликации(Сайт);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуПолученияОткликов(Сайт, Пользователь);
		Возврат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("responses/vacancy/%1?period=365", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияОткликов(Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат;
	Иначе
		КоллекцияОткликов = ПрочитатьОтветОтклики(РезультатЗапроса);
	КонецЕсли;
	
	МаксимальныйНомерОтклика = РекрутинговыеСайтыСлужебный.МаксимальныйНомерОтклика(Вакансия);
	ЗагруженныеОткликиВакансии = РекрутинговыеСайтыСлужебный.ЗагруженныеОткликиВакансии(Вакансия);
	
	Отклики = ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("ОткликиКандидатов");
	
	Для Каждого Отклик Из КоллекцияОткликов Цикл
		Если Формат(Отклик.vacancy.id,"ЧГ=") <> ИдентификаторВакансии Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отклик.resume) Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос = НовыйHTTPЗапрос(СтрШаблон("search-resumes/%1", Формат(Отклик.resume.id,"ЧГ=")));
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияРезюме(Сайт, ЭтотОбъект, РезультатЗапроса);
			Возврат;
		Иначе
			ОписаниеРезюме = ПрочитатьОтветОписаниеРезюме(РезультатЗапроса);
			ИдентификаторРезюме = Формат(ОписаниеРезюме.id, "ЧГ=");
			
			Если ЗагруженныеОткликиВакансии.Найти(ИдентификаторРезюме) = Неопределено Тогда
				НоваяЗапись = Отклики.Добавить();
				НоваяЗапись.Вакансия = Вакансия;
				НоваяЗапись.НомерОтклика = МаксимальныйНомерОтклика + 1;
				НоваяЗапись.Имя = ЗначениеСвойстваУзла(ОписаниеРезюме, "personName");
				НоваяЗапись.Фамилия = ЗначениеСвойстваУзла(ОписаниеРезюме, "surname");
				НоваяЗапись.Отчество = ЗначениеСвойстваУзла(ОписаниеРезюме, "secondName");
				НоваяЗапись.Источник = Сайт;
				НоваяЗапись.ИдентификаторРезюме = ИдентификаторРезюме;
				НоваяЗапись.EMail = ЗначениеСвойстваУзла(ОписаниеРезюме, "contactEmail");
				
				Если ЗначениеЗаполнено(ОписаниеРезюме.birthDate) Тогда
					НоваяЗапись.ДатаРождения = Дата(СтрЗаменить(Лев(ОписаниеРезюме.birthDate, 10), "-", ""));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОписаниеРезюме.phones) Тогда
					Контакт = ОписаниеРезюме.phones[0];
					НоваяЗапись.Телефон = СтрШаблон("%1 (%2) %3", Контакт.countryCode, Контакт.Code, Контакт.Number);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОписаниеРезюме.region) Тогда
					НоваяЗапись.Адрес = ОписаниеРезюме.city.name;
				КонецЕсли;
				
				// Получим текст сопроводительного письма
				Запрос = НовыйHTTPЗапрос(СтрШаблон("/responses/%1/messages", Формат(Отклик.id,"ЧГ=")));
				
				РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
				
				Если РезультатЗапроса.КодСостояния = 200 Тогда
					СообщенияПоОтклику = ПрочитатьОтветСообщенияПоОтклику(РезультатЗапроса);
					Если ЗначениеЗаполнено(СообщенияПоОтклику) Тогда
						СообщенияКандидата = Новый Массив();
						
						Для Каждого СообщениеПоОтклику Из СообщенияПоОтклику Цикл
							Если Не СообщениеПоОтклику.fromEmployer Тогда
								СообщенияКандидата.Добавить(СообщениеПоОтклику);
							КонецЕсли;
						КонецЦикла;
						
						Если СообщенияКандидата.Количество() = 1 Тогда
							НоваяЗапись.Сообщение = СообщенияКандидата[0].text;
							НоваяЗапись.ДатаОтклика = Дата(СтрЗаменить(Лев(СообщенияКандидата[0].date, 10), "-", ""));
						ИначеЕсли СообщенияКандидата.Количество() > 1 Тогда
							НоваяЗапись.Сообщение = ?(ЗначениеЗаполнено(СообщенияКандидата[0].text),
								СообщенияКандидата[0].text, СообщенияКандидата[1].text);
							НоваяЗапись.ДатаОтклика = Дата(СтрЗаменить(Лев(СообщенияКандидата[0].date, 10), "-", ""));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(НоваяЗапись.ДатаОтклика) Тогда
					НоваяЗапись.ДатаОтклика = Дата(СтрЗаменить(Лев(Отклик.lastModified, 10), "-", ""));
				КонецЕсли;
				
				НоваяЗапись.Рассмотрено = (Отклик.status.id > 0);
				НоваяЗапись.АдресРезюме = Отклик.resume.link;
				МаксимальныйНомерОтклика = МаксимальныйНомерОтклика + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	РекрутинговыеСайтыСлужебный.ЗаписатьОтклики(Сайт, Вакансия, Отклики);
	
КонецПроцедуры

Функция ДоступныеДляПолученияКонтакты(АдресРезюме) Экспорт
	
	Возврат ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
КонецФункции

Процедура ЗагрузитьКомментарииКандидата(Кандидат, ДанныеРезюме) Экспорт
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("МестоПубликации", Сайт);
	ОтборСтрок.Вставить("ИмяПоля", "id");
	
	НайденныеСтроки = ДанныеРезюме.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРезюме = НайденныеСтроки[0].СодержимоеПоля;
	
	Комментарии = КомментарииКандидата(ИдентификаторРезюме, Кандидат);
	
	РекрутинговыеСайтыСлужебный.ЗаписатьТаблицуКомментариевКандидата(Комментарии, Кандидат, Сайт);
	
КонецПроцедуры

Функция УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки) Экспорт
	
	УточненноеОписаниеОшибки = "";
	
	Если СтрНайти(ОписаниеОшибки, "phoneContainerNumber") <> 0 Тогда
		Поле = РекрутинговыеСайтыСлужебный.ПредставлениеПоля(Сайт, ЭтотОбъект, "phones");
		УточненноеОписаниеОшибки =
			РекрутинговыеСайтыСлужебный.ОписаниеНезаполненногоПоля(Поле, ОписаниеНеверногоНомераТелефона());
	КонецЕсли;
	
	Если СтрНайти(ОписаниеОшибки, "vacancy_workplace") <> 0 Тогда
		Поле = РекрутинговыеСайтыСлужебный.ПредставлениеПоля(Сайт, ЭтотОбъект, "address");
		УточненноеОписаниеОшибки = УточненноеОписаниеОшибки
			+ ?(ЗначениеЗаполнено(УточненноеОписаниеОшибки), Символы.ПС, "")
			+ РекрутинговыеСайтыСлужебный.ОписаниеНезаполненногоПоля(Поле, ОписаниеНеверногоАдресаРаботы());
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(УточненноеОписаниеОшибки) И КодСостояния = 500 Тогда
		Ошибка = ПарсерJSON(ОписаниеОшибки, Истина).Получить("error");
		Если Ошибка <> Неопределено И Ошибка.Получить("message") <> Неопределено Тогда
			УточненноеОписаниеОшибки = Ошибка.Получить("message");
		КонецЕсли;
	КонецЕсли;
	
	Возврат УточненноеОписаниеОшибки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьСоединение()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(МаркерДоступа) Тогда
		Результат = Инициализировать();
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Соединение = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Инициализировать()
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если РеквизитыСайта = Неопределено Или Не ЗначениеЗаполнено(РеквизитыСайта.МаркерДоступа) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не настроена интеграция с %1.'"), АдресСайта());
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
	
	УстановитьПривилегированныйРежим(Истина);
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Пользователь, "ПарольRabota");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МаркерАктивен();
	
КонецФункции

Функция МетодыЗапросов()
	
	Возврат РекрутинговыеСайтыСлужебный.МетодыЗапросов();
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Метод, Запрос, ВызыватьИсключение = Истина) Экспорт
	
	Возврат РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос, ВызыватьИсключение);
	
КонецФункции

Функция СтруктураМаркеров()
	
	СтруктураМаркеров = РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров();
	
	СоединениеАутентификации = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера(), Истина);
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("login?mail=%1", ИмяПользователя));
	
	РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
		СоединениеАутентификации, МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		Ключ = ПарсерJSON(РезультатЗапроса.ТелоОтвета).key;
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("mail", ИмяПользователя);
		ПараметрыЗапроса.Вставить("key", Ключ);
		ПараметрыЗапроса.Вставить("raw_password", Пароль);
		
		Запрос = НовыйHTTPЗапрос("login");
		Запрос.УстановитьТелоИзСтроки(РекрутинговыеСайтыСлужебный.ЗаписьJSON(ПараметрыЗапроса));
		
		РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
			СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		Иначе
			ОтветОбъект = ПрочитатьОтветМаркерыДоступа(РезультатЗапроса);
			
			СтруктураМаркеров.МаркерДоступа = ОтветОбъект.sessionId;
			СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа = ТекущаяДатаСеанса() + 1800;
	
			МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
			ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураМаркеров;
	
КонецФункции

Функция МаркерАктивен()
	
	МаркерАктивен = ЗначениеЗаполнено(МаркерДоступа)
			И ДатаОкончанияДействияМаркераДоступа > ТекущаяДатаСеанса();
		
	Если Не МаркерАктивен Тогда
		РезультатОбновления = ОбновитьМаркеры();
		Если ЗначениеЗаполнено(РезультатОбновления.МаркерДоступа) Тогда
			МаркерАктивен = Истина;
			РезультатОбновления.Пользователь = Пользователь;
			РекрутинговыеСайтыСлужебный.СохранитьНастройкиАвторизации(РезультатОбновления);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МаркерАктивен;
	
КонецФункции

Функция ОбновитьМаркеры()
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	Результат.Сайт = Сайт;
	
	СтруктураМаркеров = СтруктураМаркеров();
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИмяПользователя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйHTTPЗапрос(ТекстЗапроса)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	
	Если ЗначениеЗаполнено(МаркерДоступа) Тогда
		Заголовки.Вставить("X-Authorization", МаркерДоступа);
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(СтрШаблон("/v2/%1", ТекстЗапроса), Заголовки);
	
	Возврат Запрос;
	
КонецФункции

Функция АдресСервера()
	
	Возврат ДанныеСайта.АдресЗапроса;
	
КонецФункции

Функция АдресСайта()
	
	Возврат ДанныеСайта.ИмяСайта;
	
КонецФункции

Функция КлассификаторыСайта()
	
	Возврат ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("Классификаторы" + ДанныеСайта.Имя);
	
КонецФункции

Функция ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветМаркерыДоступа(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветПубликацияВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - см. РекрутинговыеСайтыСлужебный.НовыйРезультатЗапроса
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * id - Строка
//  * name - Строка
Функция ПрочитатьОтветТарифы(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветОписаниеРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветСообщенияПоОтклику(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветОткрытьКонтакты(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветВакансииССайта(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветОтклики(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветСтруктураРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветКомментарииКандидата(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция СправочникиWebAPI(ПсевдонимWebAPI)
	
	СправочникиWebAPI = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ПсевдонимWebAPI) Тогда
		ТабличныйДокумент = Обработки.ПубликацияВакансийНаРекрутинговыхСайтах.ПолучитьМакет("Классификаторы");
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(ТабличныйДокумент.ПолучитьТекст());
		
		Чтение.Прочитать();
		Псевдоним = "";
		
		Пока Псевдоним <> ПсевдонимWebAPI Цикл
			Если ПустаяСтрока(Псевдоним) Тогда
				Чтение.Прочитать();
			Иначе
				Чтение.Пропустить();
			КонецЕсли;
			Псевдоним = Чтение.ПолучитьАтрибут("Alias");
		КонецЦикла;
		
		Пока Чтение.Прочитать() Цикл
			Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента 
				И Чтение.Имя = "Dictionaries" Тогда
				Прервать;
			КонецЕсли;
			
			Если Чтение.Имя = "Dictionary" Тогда
				Ключ = Чтение.ПолучитьАтрибут("ID");
				Представление = Чтение.ПолучитьАтрибут("Name");
				
				СправочникиWebAPI.Вставить(Ключ, Представление);
			КонецЕсли;
		КонецЦикла;
		
		Чтение.Закрыть();
	КонецЕсли;
	
	Возврат СправочникиWebAPI;
	
КонецФункции

Функция СтруктураДанных(id = Неопределено, name = Неопределено)
	Возврат Новый Структура("id, name", id, name);
КонецФункции

Функция ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь)
	
	Возврат РекрутинговыеСайтыСлужебный.ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие);
	
КонецФункции

Функция ЗначениеСвойстваУзла(Узел, ИмяСвойства, ИмяСвойстваВторогоУровня = Неопределено, ИмяСвойстваТретьегоУровня = Неопределено, ЗначениеПоУмолчанию = "")
	
	Возврат РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(
				Узел, ИмяСвойства, ИмяСвойстваВторогоУровня, ИмяСвойстваТретьегоУровня, ЗначениеПоУмолчанию);
	
КонецФункции

Функция СтрокаОтбора(СтруктураОтбора, НомерСтраницы)
	
	СтрокаОтбора = "qot[]=1&";
	
	Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = КлючИЗначение.Значение;
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Значение = КодироватьСтроку(Значение, СпособКодированияСтроки.КодировкаURL);
		ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
			Значение = Формат(Значение, "ЧГ=0");
		ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
			Значение = Формат(Значение, "ДЛФ=Д");
		ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
			Если КлючИЗначение.Ключ = "ТолькоВНазвании" Тогда
				СтрокаОтбора = СтрШаблон("%1qsa[0][]=%2&", СтрокаОтбора, ?(Значение, 2, 1));
			ИначеЕсли КлючИЗначение.Ключ = "СкрыватьРезюмеБезЗарплаты" И Значение Тогда
				СтрокаОтбора = СтрШаблон("%1cs=%2&",  СтрокаОтбора, "t");
			КонецЕсли;
			
			Продолжить;
		ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из Значение Цикл
				Идентификатор = "";
				
				Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
					Если Не ЭлементСписка.Значение.Свойство("IDRabota", Идентификатор) Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					Идентификатор = ЭлементСписка.Значение;
				КонецЕсли;
				
				СтрокаОтбора = СтрокаОтбора + СтрШаблон("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ), Строка(Идентификатор));
			КонецЦикла;
			
			Продолжить;
		КонецЕсли;
		
		СтрокаОтбора = СтрокаОтбора + СтрШаблон("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ), Значение);
	КонецЦикла;
	
	СтрокаОтбора = СтрокаОтбора + "sm=2&pp=50&start=" + НомерСтраницы * 50;
	
	Возврат СтрокаОтбора;
	
КонецФункции

Функция СоответствиеПолейПоискаКандидатов()
	
	СоответствиеПолейПоиска = Новый Соответствие;
	
	СоответствиеПолейПоиска.Вставить("КлючевоеСлово", "qk[]");
	СоответствиеПолейПоиска.Вставить("ВозрастОт", "af");
	СоответствиеПолейПоиска.Вставить("ВозрастДо", "at");
	СоответствиеПолейПоиска.Вставить("Регион", "krl[]");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыОт", "sf");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыДо", "st");
	СоответствиеПолейПоиска.Вставить("Пол", "sex");
	СоответствиеПолейПоиска.Вставить("УровеньОбразования", "e[]");
	СоответствиеПолейПоиска.Вставить("ПериодРазмещения", "p");
	
	Возврат СоответствиеПолейПоиска;
	
КонецФункции

Процедура ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки)
	
	Для Каждого Резюме Из РезультатПоискаРезюме.data Цикл
		НоваяСтрока = ТаблицаНайденныхКандидатов.Добавить();
		
		ФИО = СтрШаблон("%1 %2 %3", ЗначениеСвойстваУзла(Резюме, "surname"), ЗначениеСвойстваУзла(Резюме, "personName"), ЗначениеСвойстваУзла(Резюме, "secondName"));
		УровеньЗарплаты = ЗначениеСвойстваУзла(Резюме, "salaryFrom");
		Возраст = ЗначениеСвойстваУзла(Резюме, "age");
		
		НоваяСтрока.НазваниеРезюме = ЗначениеСвойстваУзла(Резюме, "name");
		НоваяСтрока.ФИО = ?(ЗначениеЗаполнено(ФИО), СокрЛП(ФИО), "-");
		НоваяСтрока.Регион = ЗначениеСвойстваУзла(Резюме, "region", "name");
		НоваяСтрока.ГдеНайден = Сайт;
		НоваяСтрока.УровеньЗарплаты = ?(ЗначениеЗаполнено(УровеньЗарплаты), СтрШаблон("%1 %2", УровеньЗарплаты, ЗначениеСвойстваУзла(Резюме, "currency", "name")), "-");
		НоваяСтрока.Возраст = ?(ЗначениеЗаполнено(Возраст), Возраст, "-");
		НоваяСтрока.ИдентификаторРезюме = Формат(ЗначениеСвойстваУзла(Резюме, "id"), "ЧГ=0");
		Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "publishDate")) Тогда
			НоваяСтрока.ДатаРазмещения = ПрочитатьДатуJSON(ЗначениеСвойстваУзла(Резюме, "publishDate"), ФорматДатыJSON.ISO);
		ИначеЕсли ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "modifiedDate")) Тогда
			НоваяСтрока.ДатаРазмещения = ПрочитатьДатуJSON(ЗначениеСвойстваУзла(Резюме, "modifiedDate"), ФорматДатыJSON.ISO);
		КонецЕсли;
		НоваяСтрока.СсылкаНаРезюме = ЗначениеСвойстваУзла(Резюме, "link");
		
		ПоследнееМестоРаботы = ЗначениеСвойстваУзла(Резюме, "lastExperience");
		Если ЗначениеЗаполнено(ПоследнееМестоРаботы) Тогда 
			
			Организация =  ПодставитьСпецСимволы(ПоследнееМестоРаботы.organizationName);
			Должность = ПоследнееМестоРаботы.positionName;
			ДатаНачала = Формат(ПрочитатьДатуJSON(ПоследнееМестоРаботы.dateStart, ФорматДатыJSON.ISO), "ДЛФ=D");
			ДатаОкончания = ?(ПоследнееМестоРаботы.dateEnd = "по наст. время", // АПК:1297 Строка не видна пользователю и не локализуется.
				НСтр("ru = 'по настоящее время'"),
				Формат(ПрочитатьДатуJSON(ПоследнееМестоРаботы.dateEnd, ФорматДатыJSON.ISO), "ДЛФ=D"));
			
			НоваяСтрока.ПоследнееМестоРаботы = СтрШаблон("%1, %2 с %3 %4", Организация, Должность, ДатаНачала, ДатаОкончания);
			
		КонецЕсли;
		
		НоваяСтрока.Пол = ?(Резюме.isMale,
			РекрутинговыеСайтыСлужебный.МужскойПол(), РекрутинговыеСайтыСлужебный.ЖенскийПол());
		НоваяСтрока.ПолеСортировки = ПолеСортировки;
		
		ПолеСортировки = ПолеСортировки + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодставитьСпецСимволы(Знач Текст)
	
	Текст = СтрЗаменить(Текст, "&amp;", "&");
	Текст = СтрЗаменить(Текст, "&quot;", """");
	Текст = СтрЗаменить(Текст, "&#8470;", "№");
	Текст = СтрЗаменить(Текст, "&sbquo;", ",");
	Текст = СтрЗаменить(Текст, "&raquo;", "»");
	Текст = СтрЗаменить(Текст, "&laquo;", "«");
	Текст = СтрЗаменить(Текст, "&ndash;", Символ(45));
	Текст = СтрЗаменить(Текст, "&mdash;", Символ(150));
	Текст = СтрЗаменить(Текст, "&bull;", "•");
	Текст = СтрЗаменить(Текст, "&nbsp;", " ");
	
	Возврат Текст;
	
КонецФункции

Функция ОткрытоеРезюме(ИдентификаторРезюме, ТекстОшибки = "")
	
	Резюме = Неопределено;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("search-resumes/open-contacts/%1", ИдентификаторРезюме));
	Запрос.УстановитьТелоИзСтроки("{}");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		РезультатЗапроса = ПрочитатьОтветОткрытьКонтакты(РезультатЗапроса);
		
		Если РезультатЗапроса.code = 1 Тогда
			Запрос = НовыйHTTPЗапрос(СтрШаблон("search-resumes/%1", ИдентификаторРезюме));
			
			РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
			Резюме = ПрочитатьОтветРезюме(РезультатЗапроса);
		Иначе
			Если РезультатЗапроса.code = 0 Тогда
				ОписаниеОшибки = НСтр("ru = 'соискатель скрыл свои контакты. С ним можно связаться через почту сайта.'");
			ИначеЕсли РезультатЗапроса.code = 4 Тогда
				ОписаниеОшибки = НСтр("ru = 'использованы все лимиты по открытию контактов.'");
			ИначеЕсли РезультатЗапроса.code = 5 Тогда
				ОписаниеОшибки = НСтр("ru = 'контактные данные не доступны.'");
			ИначеЕсли РезультатЗапроса.code = 11 Тогда
				ОписаниеОшибки = НСтр("ru = 'необходимо активировать доступ к контактам в регионе размещения резюме.'");
			Иначе
				ОписаниеОшибки = РезультатЗапроса.description;
			КонецЕсли;
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка открытия контактов: %1'"), ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Резюме;
	
КонецФункции

Функция ЗаполнитьДеревоРубрик(Дерево)
	
	Результат = Ложь;
	
	КлассификаторыRabota = КлассификаторыСайта();
	
	Если КлассификаторыRabota = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Рубрики = КлассификаторыRabota.offer_trades;
	СтрокиДереваПоId = Новый Соответствие;
	
	Для Каждого Рубрика Из Рубрики Цикл
		СтрокаРодителя = СтрокиДереваПоId.Получить(Рубрика.parentId);
		
		Если СтрокаРодителя <> Неопределено Тогда
			НоваяСтрока = СтрокаРодителя.Строки.Добавить();
		Иначе
			НоваяСтрока = Дерево.Строки.Добавить();
		КонецЕсли;
		
		НоваяСтрока.Идентификатор = Рубрика.id;
		НоваяСтрока.Значение = Рубрика.name;
		
		СтрокиДереваПоId.Вставить(Рубрика.id, НоваяСтрока);
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Значение", Истина);
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДеревоРегионов(Дерево)
	
	Результат = Ложь;
	
	КлассификаторыRabota = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("КлассификаторыRabota");
	
	Если КлассификаторыRabota = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Страны = КлассификаторыRabota.countries;
	
	IdsДоступныхСтран = Новый Массив;
	IdsДоступныхСтран.Добавить(1);
	IdsДоступныхСтран.Добавить(5);
	IdsДоступныхСтран.Добавить(2);
	IdsДоступныхСтран.Добавить(6);
	
	IdsСтрокСтран = Новый Соответствие;
	
	Для Каждого Страна Из Страны Цикл
		Если IdsДоступныхСтран.Найти(Страна.id) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.Идентификатор = Страна.id;
		НоваяСтрока.Значение = Страна.name;
		
		IdsСтрокСтран.Вставить(Страна.id, НоваяСтрока);
	КонецЦикла;
	
	Регионы = КлассификаторыRabota.regions;
	IdsРегионов = Новый Соответствие;
	IdsСтрокРодителей = Новый Соответствие;
	
	Для Каждого Регион Из Регионы Цикл
		IdsРегионов.Вставить(Регион.id, Регион);
	КонецЦикла;
	
	Для Каждого Регион Из Регионы Цикл
		Страна = IdsСтрокСтран.Получить(Регион.countryId);
		Если Страна = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Путь = Регион.path;
		
		Если Регион.regionTypeId <> 2 // город
			И Регион.regionTypeId <> 10 // поселок городского типа
			И Регион.regionTypeId <> 13 Тогда // станица
			Продолжить;
		КонецЕсли;
			
		Если Путь.Количество() = 1 Тогда 
			СтрокаРодителя = Страна;
		Иначе
			СтрокаРодителя = IdsСтрокРодителей.Получить(Путь[0]);
			
			Если СтрокаРодителя = Неопределено Тогда
				
				СтрокаРегиона = IdsРегионов.Получить(Путь[0]);
				
				СтрокаРодителя = Страна.Строки.Добавить();
				СтрокаРодителя.Идентификатор = СтрокаРегиона.id;
				СтрокаРодителя.Значение = ПолноеНазваниеРегиона(СтрокаРегиона.name, СтрокаРегиона.regionTypeId);
				
				IdsСтрокРодителей.Вставить(СтрокаРегиона.id, СтрокаРодителя);
				
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = СтрокаРодителя.Строки.Добавить();
		НоваяСтрока.Идентификатор = Регион.id;
		НоваяСтрока.Значение = ПолноеНазваниеРегиона(Регион.name, Регион.regionTypeId);
	КонецЦикла;
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Строка.Строки.Сортировать("Значение", Истина);
	КонецЦикла;
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ПолноеНазваниеРегиона(Знач НазваниеРегиона, IdТипаРегиона)
	
	ПолноеНазвание = РекрутинговыеСайтыСлужебный.УдалитьУточнениеВСкобках(НазваниеРегиона);
	
	Если IdТипаРегиона = IdТипаРегионаКрай() Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 край'"), ПолноеНазвание);
	ИначеЕсли IdТипаРегиона = IdТипаРегионаОбласть() Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 область'"), ПолноеНазвание);
	ИначеЕсли IdТипаРегиона = IdТипаРегионаРеспублика() Тогда
		Возврат СтрШаблон(НСтр("ru = 'Республика %1'"), ПолноеНазвание);
	ИначеЕсли IdТипаРегиона = IdТипаРегионаАвтономныйОкруг() Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 АО'"), ПолноеНазвание);
	ИначеЕсли IdТипаРегиона = IdТипаРегионаРеспубликаОсобая() Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 республика'"), ПолноеНазвание);
	ИначеЕсли IdТипаРегиона = IdТипаРегионаАвтономнаяОбласть() Тогда
		Возврат СтрШаблон(НСтр("ru = '%1 автономная область'"), ПолноеНазвание);
	КонецЕсли;
	
	Возврат ПолноеНазвание;
	
КонецФункции

Функция IdТипаРегионаКрай()
	Возврат 3;
КонецФункции

Функция IdТипаРегионаОбласть()
	Возврат 4;
КонецФункции

Функция IdТипаРегионаРеспублика()
	Возврат 5;
КонецФункции

Функция IdТипаРегионаАвтономныйОкруг()
	Возврат 6;
КонецФункции

Функция IdТипаРегионаРеспубликаОсобая()
	Возврат 8;
КонецФункции

Функция IdТипаРегионаАвтономнаяОбласть()
	Возврат 9;
КонецФункции

Функция ДанныеКандидатаПоРезюме(СтруктураРезюме)
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	ДанныеКандидата.Фамилия = ЗначениеСвойстваУзла(СтруктураРезюме, "surname");
	ДанныеКандидата.Имя = ЗначениеСвойстваУзла(СтруктураРезюме, "personName");
	ДанныеКандидата.Отчество = ЗначениеСвойстваУзла(СтруктураРезюме, "secondName");
	
	ДанныеКандидата.ДатаРождения = ПрочитатьДатуJSON(ЗначениеСвойстваУзла(СтруктураРезюме, "birthDate"), ФорматДатыJSON.ISO);
	
	ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, ДанныеКандидата.КонтактнаяИнформация);

	МассивГражданство = Новый Массив;
	МассивСостояниеВБраке = Новый Массив;
	Женат = Ложь;
	Для Каждого ДопИнформация Из ЗначениеСвойстваУзла(СтруктураРезюме, "additional") Цикл
		Страна = ЗначениеСвойстваУзла(ДопИнформация, "citizenship", "name");
		Если ЗначениеЗаполнено(Страна) Тогда
			МассивГражданство.Добавить(Новый Структура("Страна, Дата", Страна));
		КонецЕсли;
		Женат = ЗначениеСвойстваУзла(ДопИнформация, "isMarried");
		СтрокаОСебе = ЗначениеСвойстваУзла(ДопИнформация, "comment");
		Если ЗначениеЗаполнено(СтрокаОСебе) Тогда
			РекрутинговыеСайтыСлужебный.ЗаменитьУпрСимволы(СтрокаОСебе);
			ДанныеКандидата.ОСебе = СтрокаОСебе;
		КонецЕсли;
	КонецЦикла;
	
	МассивСостояниеВБраке.Добавить(Новый Структура("СостояниеВБраке, Дата",
		?(ЗначениеЗаполнено(Женат) И Женат, НСтр("ru = 'Женат'"), НСтр("ru = 'Не женат'"))));
	
	ДанныеКандидата.СостояниеВБраке = МассивСостояниеВБраке;
	ДанныеКандидата.Гражданство = МассивГражданство;
	
	ЗаполнитьМассивОбразование(СтруктураРезюме, ДанныеКандидата.Образование);

	Для Каждого ТрудоваяДеятельность Из ЗначениеСвойстваУзла(СтруктураРезюме, "experience") Цикл
		Если Не ЗначениеЗаполнено(ТрудоваяДеятельность) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураТрудоваяДеятельность = РекрутинговыеСайтыСлужебный.НовыйОпытРаботы();
		СтруктураТрудоваяДеятельность.Компания = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "name");
		ДатаНачала = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "dateFrom");
		ДатаНачала = ?(ЗначениеЗаполнено(ДатаНачала), ПрочитатьДатуJSON(ЗначениеСвойстваУзла(ТрудоваяДеятельность, "dateFrom"), ФорматДатыJSON.ISO), Дата(1,1,1));
		ДатаОкончания = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "dateTo");
		ДатаОкончания = ?(ЗначениеЗаполнено(ДатаОкончания), ПрочитатьДатуJSON(ЗначениеСвойстваУзла(ТрудоваяДеятельность, "dateTo"), ФорматДатыJSON.ISO), Дата(1,1,1));
		СтруктураТрудоваяДеятельность.ДатаНачала = ДатаНачала;
		СтруктураТрудоваяДеятельность.ДатаОкончания = ДатаОкончания;
		СтруктураТрудоваяДеятельность.Должность = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "position"); 
		СтруктураТрудоваяДеятельность.Обязанности = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "comment");
		СфераДеятельностиКомпании = "";
		Для Каждого СфераДеятельности Из ЗначениеСвойстваУзла(ТрудоваяДеятельность, "branch") Цикл
			Если ЗначениеЗаполнено(СфераДеятельности) Тогда
				СфераДеятельностиКомпании = СфераДеятельностиКомпании + ?(ЗначениеЗаполнено(СфераДеятельностиКомпании), ", ", "") + ЗначениеСвойстваУзла(СфераДеятельности, "name");
			КонецЕсли;
		КонецЦикла;
		СтруктураТрудоваяДеятельность.СфераДеятельностиКомпании = СфераДеятельностиКомпании;
		ДанныеКандидата.ТрудоваяДеятельность.Добавить(СтруктураТрудоваяДеятельность);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "gender")) Тогда
		Если ЗначениеСвойстваУзла(СтруктураРезюме, "gender") = "male" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		Иначе
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "salaryFrom")) Тогда
		ДанныеКандидата.ОжидаемыйДоход = ЗначениеСвойстваУзла(СтруктураРезюме, "salaryFrom");
	КонецЕсли;
	
	Для Каждого ЗнаниеЯзыка Из ЗначениеСвойстваУзла(СтруктураРезюме, "language") Цикл
		СтруктураЗнаниеЯзыков = РекрутинговыеСайтыСлужебный.НовоеЗнаниеЯзыка();
		СтруктураЗнаниеЯзыков.Язык = ЗначениеСвойстваУзла(ЗнаниеЯзыка, "name");
		СтруктураЗнаниеЯзыков.СтепеньЗнанияЯзыкаКандидата =
			СтепеньЗнанияЯзыкаПоИдентификатору(ЗначениеСвойстваУзла(ЗнаниеЯзыка, "offerLanguageLevel"));
		ДанныеКандидата.ЗнаниеЯзыков.Добавить(СтруктураЗнаниеЯзыков);
	КонецЦикла;
	
	ДанныеКандидата.ИсточникИнформации = Сайт;
	ДанныеКандидата.АдресРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "link");
	ДанныеКандидата.Фото = ЗначениеСвойстваУзла(СтруктураРезюме, "Фото");
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "ТекстОшибки")) Тогда
		РекрутинговыеСайтыСлужебный.СообщитьПользователю(ЗначениеСвойстваУзла(СтруктураРезюме, "ТекстОшибки"));
	КонецЕсли;

	Возврат ДанныеКандидата;
	
КонецФункции

Функция СтруктураРезюмеССайта(ИдентификаторРезюме)
	
	Резюме = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Резюме;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("search-resumes/%1", ИдентификаторРезюме));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоОписанию(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Резюме = ПрочитатьОтветСтруктураРезюме(РезультатЗапроса);
	
	Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "contactEmail"))
		И Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "phones")) Тогда
		ТекстОшибки = "";
		ОткрытоеРезюме = ОткрытоеРезюме(ИдентификаторРезюме, ТекстОшибки);
		Резюме = ?(ОткрытоеРезюме <> Неопределено, ОткрытоеРезюме, Резюме);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Резюме.Вставить("ТекстОшибки", ТекстОшибки);
		КонецЕсли;
	КонецЕсли;

	КомментарииКандидата = МассивКомментариевКандидата(ИдентификаторРезюме);
	Резюме.Вставить("Комментарии", КомментарииКандидата);
	
	Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "photo")) Тогда
		Возврат Резюме;
	КонецЕсли;
	
	АдресФото = Резюме.Получить("photo");
	Резюме.Вставить("Фото", РекрутинговыеСайтыСлужебный.КартинкаПоАдресу(АдресФото));
	
	Возврат Резюме;
	
КонецФункции

Процедура ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, МассивКИ)
	
	АдресПочты = СтруктураРезюме.Получить("contactEmail");
	Если ЗначениеЗаполнено(АдресПочты) Тогда
		СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = АдресПочты;
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
	КонтактныеТелефоны = СтруктураРезюме.Получить("phones");
	Если ЗначениеЗаполнено(КонтактныеТелефоны) Тогда
		Для Каждого КонтактнаяИнформация Из КонтактныеТелефоны Цикл
			СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
			Если КонтактнаяИнформация.Получить("offerTelephoneType").Получить("id") = 2 Тогда
				СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
			ИначеЕсли КонтактнаяИнформация.Получить("offerTelephoneType").Получить("id") = 1 Тогда
				СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
			ИначеЕсли КонтактнаяИнформация.Получить("offerTelephoneType").Получить("id") = 3 Тогда
				СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
			КонецЕсли;
			Если ЗначениеЗаполнено(СтруктураКИ.Вид) Тогда
				СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				СтруктураКИ.Представление = СтрШаблон("%1 (%2) %3", КонтактнаяИнформация.Получить("countryCode"), КонтактнаяИнформация.Получить("code"), Формат(КонтактнаяИнформация.Получить("number"), "ЧГ="));
				МассивКИ.Добавить(СтруктураКИ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РегионыРаботы = СтруктураРезюме.Получить("leavingRegion");
	Если ЗначениеЗаполнено(РегионыРаботы) Тогда
		Для Каждого Регион Из РегионыРаботы Цикл
			СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов");
			СтруктураКИ.Представление = Регион.Получить("name");
			МассивКИ.Добавить(СтруктураКИ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СтепеньЗнанияЯзыкаПоИдентификатору(Идентификатор) 
	
	Если Идентификатор = 1 Тогда // начальный
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.A1;
	ИначеЕсли Идентификатор = 2 Тогда // средний
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B1;
	ИначеЕсли Идентификатор = 3 Тогда // продвинутый
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B2;
	Иначе // свободное владение
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.C2;
	КонецЕсли;
	
	Возврат Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(УровеньВладенияЯзыком);
	
КонецФункции

Функция МассивКомментариевКандидата(ИдентификаторРезюме, Кандидат = Неопределено)
	
	КомментарииТаблица = КомментарииКандидата(ИдентификаторРезюме, Кандидат);
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(КомментарииТаблица);
	
КонецФункции

Функция КомментарииКандидата(ИдентификаторРезюме, Кандидат = Неопределено)
	
	Комментарии = РекрутинговыеСайтыСлужебный.ТаблицаКомментарииКандидатов();
	МестоПубликации = Сайт;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Комментарии;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("search-resumes/%1/comments", ИдентификаторРезюме));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	КоллекцияКомментариев = ПрочитатьОтветКомментарииКандидата(РезультатЗапроса);
	ПочтаАвторов = Новый Соответствие;
	
	Для Каждого ОписаниеКомментария Из КоллекцияКомментариев Цикл
		ОписаниеАвтора = ОписаниеКомментария.person;
		
		НоваяСтрока = Комментарии.Добавить();
		НоваяСтрока.Период = ПрочитатьДатуJSON(ОписаниеКомментария.created, ФорматДатыJSON.ISO);
		НоваяСтрока.Идентификатор = Формат(ОписаниеКомментария.id, "ЧГ=");
		
		НоваяСтрока.Комментарий = ОписаниеКомментария.text;
		НоваяСтрока.Автор = СокрП(СтрШаблон("%1 %2 %3", ОписаниеАвтора.surname, ОписаниеАвтора.name, ОписаниеАвтора.secondName));
		НоваяСтрока.ТолькоДляАвтора = ОписаниеКомментария.forMe;
		
		Если ПочтаАвторов.Получить(НоваяСтрока.Автор) = Неопределено Тогда
			ПочтаАвторов.Вставить(НоваяСтрока.Автор, ОписаниеАвтора.email[0]);
		КонецЕсли;
		
		НоваяСтрока.МестоПубликации = МестоПубликации;
	КонецЦикла;
	
	Если Не РекрутинговыеСайтыСлужебный.ЕстьИзмененияКомментариев(Кандидат, МестоПубликации, Комментарии) Тогда
		Возврат Комментарии;
	КонецЕсли;
	
	ПодобратьПользователейПоАвторамКомментариев(Комментарии, ПочтаАвторов);
	
	Возврат Комментарии;
	
КонецФункции

Процедура ПодобратьПользователейПоАвторамКомментариев(Комментарии, ПочтаАвторов)
	
	ОтборСтрок = Новый Структура("ПринадлежитАвторизованномуПользователю");
	ОтборСтрок.ПринадлежитАвторизованномуПользователю = Ложь;
	
	НайденныеСтроки = Комментарии.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		// Все комментарии принадлежат текущему пользователю.
		Комментарии.ЗаполнитьЗначения(Пользователи.АвторизованныйПользователь(), "Пользователь");
		Возврат;
	КонецЕсли;
	
	АдресаАвторов = РекрутинговыеСайтыСлужебный.НоваяТаблицаАдресаАвторов();
	Для Каждого АвторИПочта Из ПочтаАвторов Цикл
		НоваяСтрока = АдресаАвторов.Добавить();
		НоваяСтрока.ИмяАвтора = АвторИПочта.Ключ;
		НоваяСтрока.АдресПочты = АвторИПочта.Значение;
	КонецЦикла;
	
	ПользователиПоАвторам = РекрутинговыеСайтыСлужебный.ПользователиПоАвторам(АдресаАвторов);
	
	Для Каждого Строка Из Комментарии Цикл
		Если Строка.ПринадлежитАвторизованномуПользователю Тогда
			Строка.Пользователь = Пользователи.АвторизованныйПользователь();
			Продолжить;
		КонецЕсли;
		
		Пользователь = ПользователиПоАвторам[Строка.Автор];
		Если Пользователь <> Неопределено Тогда
			Строка.Пользователь = Пользователь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПоляВакансии

Функция ПоляВакансииСОдиночнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("currency");
	Поля.Добавить("operatingSchedule");
	Поля.Добавить("experienceYearCount");
	Поля.Добавить("education");
	Поля.Добавить("gender");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСМножественнымВыборомИзДерева()
	
	Поля = Новый Массив;
	Поля.Добавить("offerTrades");
	Поля.Добавить("region");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСоСпециальнойФормойРедактированияСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("phones");
	Поля.Добавить("language");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСМножественнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("address");
	Поля.Добавить("additionalInformation.drivingLicense");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииНедоступныеДляРедактирования(ОбновлениеПубликации = Ложь)
	
	Поля = Новый Массив;
	Поля.Добавить("additionalInformation");
	
	Если ОбновлениеПубликации Тогда
		Поля.Добавить("name");
		Поля.Добавить("region");
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСТекстомВHTML()
	
	Поля = Новый Массив;
	Поля.Добавить("description");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

#КонецОбласти

Функция СтруктураПоля()
	
	Возврат РекрутинговыеСайтыСлужебный.СтруктураПоля();
	
КонецФункции

Функция JSONОписаниеВакансии(Дерево, Обновление = Ложь)
	
	СтрокаJSON = "";
	
	СтруктураОписанияВакансии = СтруктураОписанияВакансии(Дерево, Обновление);
	СтрокаJSON = РекрутинговыеСайтыСлужебный.ЗаписьJSON(СтруктураОписанияВакансии);
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция СтруктураОписанияВакансии(Дерево, Обновление = Ложь)
	
	ПоляВакансии = Новый Структура;
	ПоляСТекстомВHTML = ПоляВакансииСТекстомВHTML();
	КлассификаторыRabota = КлассификаторыСайта();
	Представительства = КлассификаторыRabota.representations;
	
	Если Обновление Тогда
		ПоляВакансии.Вставить("action", "edit");
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если ТипЗнч(СтрокаДерева.Показатель) <> Тип("СправочникСсылка.Вакансии") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
			
			ИмяПоля = СтрокаДереваПодчиненная.Путь;
			ИмяПоля = СтрЗаменить(ИмяПоля, "language", "languages");
			
			Если СтрокаДереваПодчиненная.ТипРеквизита <> РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоОбъекта()
				И СтрокаДереваПодчиненная.ПубликацияВакансии = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаДереваПодчиненная.ТипРеквизита = "Строка" Тогда
				
				Если ПоляСТекстомВHTML.Найти(ИмяПоля) <> Неопределено Тогда
					ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансииТекст;
				Иначе
					ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансии;
				КонецЕсли;
				
				ПоляВакансии.Вставить(ИмяПоля, ЗначениеПоля);
				
			ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = "Булево" 
				Или СтрокаДереваПодчиненная.ТипРеквизита = "Число" Тогда
				
				ПоляВакансии.Вставить(ИмяПоля, СтрокаДереваПодчиненная.ПубликацияВакансии);
				
			ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоОбъекта() Тогда
				
				СвойстваОбъекта = СтрокаДереваПодчиненная.Строки;
				
				Если ИмяПоля = "additionalInformation" Тогда
					
					Для Каждого Свойство Из СвойстваОбъекта Цикл
						
						ЗначениеСвойства = ЗначениеСвойстваОбъекта(Свойство);
						
						Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
							ИмяСвойства = Сред(Свойство.Путь, СтрДлина(ИмяПоля) + 2);
							ПоляВакансии.Вставить(ИмяСвойства, ЗначениеСвойства);
						КонецЕсли;
						
					КонецЦикла;
					
				ИначеЕсли СвойстваОбъекта.Количество() > 0 Тогда
					
					СтруктураСвойств = Новый Структура;
					Для Каждого Свойство Из СвойстваОбъекта Цикл
						
						ЗначениеСвойства = ЗначениеСвойстваОбъекта(Свойство);
						
						Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
							ИмяСвойства = Сред(Свойство.Путь, СтрДлина(ИмяПоля) + 2);
							СтруктураСвойств.Вставить(ИмяСвойства, ЗначениеСвойства);
						КонецЕсли;
						
					КонецЦикла;
					
					Если ЗначениеЗаполнено(СтруктураСвойств) Тогда
						ПоляВакансии.Вставить(ИмяПоля, СтруктураСвойств);
					КонецЕсли;
					
				Иначе
					
					Если ТипЗнч(СтрокаДереваПодчиненная.ПубликацияВакансии) = Тип("СписокЗначений") Тогда 
						ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансии[0].Значение;
					Иначе
						ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансии;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
						ПоляВакансии.Вставить(ИмяПоля, ЗначениеПоля);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоМассива() Тогда
				
				МассивЭлементов = Новый Массив;
				Для Каждого ЭлементСписка Из СтрокаДереваПодчиненная.ПубликацияВакансии Цикл
					
					Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
						
						Если ИмяПоля = "address" Тогда
							
							ВыбранноеЗначение = ЭлементСписка.Значение;
							ДанныеДляПередачи = Новый Структура("name,region,address,comment,metro");
							
							Для Каждого ДанныеПредставительства Из Представительства Цикл
								
								Если ВыбранноеЗначение = ДанныеПредставительства.id Тогда
									
									ЗаполнитьЗначенияСвойств(ДанныеДляПередачи, ДанныеПредставительства, "name, address, comment");
									ДанныеДляПередачи.region = ДанныеПредставительства.region.id;
									
									СтанцииМетро = Новый Массив;
									Для Каждого Метро Из ДанныеПредставительства.metro Цикл
										СтанцииМетро.Добавить(Метро.id);
										ДанныеДляПередачи.metro = СтанцииМетро;
									КонецЦикла;
									
									Прервать;
									
								КонецЕсли;
								
							КонецЦикла;
								
							ДанныеДляПередачи.Вставить("representation", ВыбранноеЗначение);
							
							МассивЭлементов.Добавить(ДанныеДляПередачи);
							
						ИначеЕсли ИмяПоля = "languages" Тогда
							
							ДанныеДляПередачи = Новый Структура;
							ДанныеДляПередачи.Вставить("offerLanguage", ЭлементСписка.Значение.offerLanguage.id);
							ДанныеДляПередачи.Вставить("offerLanguageLevel", ЭлементСписка.Значение.offerLanguageLevel.id);
							
							МассивЭлементов.Добавить(ДанныеДляПередачи);
							
						Иначе
							МассивЭлементов.Добавить(ЭлементСписка.Значение);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ПоляВакансии.Вставить(ИмяПоля, МассивЭлементов);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПоляВакансии;
	
КонецФункции

Функция ОписаниеПубликацииВакансии(ИдентификаторВакансии, СообщатьОбОшибке = Истина)
	
	ОписаниеПубликации = Неопределено;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("vacancies/%1", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Если СообщатьОбОшибке Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	Иначе
		ОписаниеПубликации = ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса);
	КонецЕсли;
	
	Возврат ОписаниеПубликации;
	
КонецФункции

Функция ПредставлениеДанныхПоИдентификатору(МассивДанных, Идентификатор, ПолеИдентификатор = "id", ПолеПредставление = "name")
	
	Представление = Неопределено;
	
	Для Каждого СтруктураДанных Из МассивДанных Цикл
		Если СтруктураДанных[ПолеИдентификатор] = Идентификатор Тогда
			Представление = СтруктураДанных[ПолеПредставление];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

Функция ЗначениеСвойстваОбъекта(Свойство)
	
	Если ТипЗнч(Свойство.ПубликацияВакансии) = Тип("СписокЗначений") Тогда
		МассивЭлементов = Новый Массив;
		Для Каждого ЭлементСписка Из Свойство.ПубликацияВакансии Цикл
			Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
				МассивЭлементов.Добавить(ЭлементСписка.Значение);
			КонецЕсли;
		КонецЦикла;
		
		ЗначениеСвойства = МассивЭлементов;
	Иначе
		ЗначениеСвойства = Свойство.ПубликацияВакансии;
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

Функция ОписаниеНеверногоНомераТелефона()
	
	Возврат НСтр("ru = 'номер телефона должен состоять из цифр (от 4 до 7). В нем не должно быть пробелов, скобок, дефисов и других лишних знаков.'");
	
КонецФункции

Функция ОписаниеНеверногоАдресаРаботы()
	
	Возврат НСтр("ru = 'проверьте обязательные для заполнения поля адреса на сайте.'");
	
КонецФункции

Процедура ЗаполнитьМассивОбразование(СтруктураРезюме, МассивОбразование)
	
	УровеньДопОбразования = Справочники.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование;
	
	Для Каждого Образование Из СтруктураРезюме.Получить("education").Получить("details") Цикл
		ДанныеУровняОбразования = ВидОбразованияПоИдентификатору(Образование.Получить("level").Получить("id"));
		
		СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		СтруктураОбразование.УчебноеЗаведение = Образование.Получить("name");
		СтруктураОбразование.Факультет = Образование.Получить("faculty");
		
		Если ДанныеУровняОбразования.ВидОбразования = УровеньДопОбразования Тогда
			СтруктураОбразование.НаименованиеКурса = Образование.Получить("speciality");
		Иначе
			СтруктураОбразование.Специальность = Образование.Получить("speciality");
		КонецЕсли;
		
		СтруктураОбразование.Окончание = Образование.Получить("yearTo");
		ЗаполнитьЗначенияСвойств(СтруктураОбразование, ДанныеУровняОбразования);
		
		МассивОбразование.Добавить(СтруктураОбразование);
	КонецЦикла;
	
КонецПроцедуры

Функция ВидОбразованияПоИдентификатору(Идентификатор)
	
	ДанныеОбразования = Новый Структура("ВидОбразования, ВидПослевузовскогоОбразования, ВидДополнительногоОбучения");
	ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
	
	Если (Идентификатор = 1
		Или Идентификатор = 5) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");
	ИначеЕсли (Идентификатор = 2
		Или Идентификатор = 6) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
	ИначеЕсли (Идентификатор = 3
		Или Идентификатор = 7) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование");
	ИначеЕсли (Идентификатор = 4
		Или Идентификатор = 12) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
	ИначеЕсли (Идентификатор = 8
		Или Идентификатор = 9) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура");
	ИначеЕсли Идентификатор = 10 Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование");
		ДанныеОбразования.ВидДополнительногоОбучения = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ВидыПрофессиональнойПодготовки.ПовышениеКвалификации");
	ИначеЕсли Идентификатор = 11 Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование");
		ДанныеОбразования.ВидДополнительногоОбучения = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ВидыПрофессиональнойПодготовки.Переподготовка");
	ИначеЕсли Идентификатор = 13 Тогда 
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации");
		ДанныеОбразования.ВидПослевузовскогоОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.Докторантура");
	ИначеЕсли Идентификатор = 14 Тогда 
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат");
	ИначеЕсли Идентификатор = 15 Тогда 
		ДанныеОбразования.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации");
		ДанныеОбразования.ВидПослевузовскогоОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура");
	КонецЕсли;
	
	Возврат ДанныеОбразования;
	
КонецФункции

#КонецОбласти

#КонецЕсли
