#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		
		// ЗУПК
		ВнешниеНаборыДанных = ВнешниеНаборыДанныхОтчета();
		// ЗУПК
		
		РезультатКомпоновки = ЗарплатаКадрыОтчеты.РезультатКомпоновкиМакетаПечатнойФормы(ЭтотОбъект, ДанныеРасшифровки
		// ЗУПК
		, , Отчеты.ПечатнаяФормаТ9.ВнешниеНаборыДанных(ВнешниеНаборыДанных));
		// ЗУПК
		Отчеты.ПечатнаяФормаТ9.Сформировать(ДокументРезультат, РезультатКомпоновки);
		
	Исключение
		
		ИнформацияОшибки = ИнформацияОбОшибке();
		ВызватьИсключение НСтр("ru = 'В настройку формирования Т-9 (10, 10а) внесены критичные изменения. Печатная форма не будет сформирована'") + ". " + КраткоеПредставлениеОшибки(ИнформацияОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет(КлючВарианта = Неопределено) Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект,
		ЗарплатаКадрыОтчеты.ПоляПредставленийКадровыхДанныхСотрудниковОтчетовПечатныхФорм());
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ЗарплатаКадрыОтчеты.ИнициализироватьОтчетПечатнойФормы(Контекст, ЭтотОбъект, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
	
КонецПроцедуры

// ЗУПК
Функция ВнешниеНаборыДанныхОтчета()
	
	ВнешниеНаборыДанныхОтчета = Новый Массив;
	
	Для Каждого ЭлементНастроек Из ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементНастроек, "Параметр")
			И ЭлементНастроек.Параметр = Новый ПараметрКомпоновкиДанных("СсылкиНаОбъекты") Тогда
			
			Если ТипЗнч(ЭлементНастроек.Значение) = Тип("СписокЗначений") Тогда
				Для Каждого ЭлементСписка Из ЭлементНастроек.Значение Цикл
					ВнешниеНаборыДанныхОтчета.Добавить(ЭлементСписка.Значение);
				КонецЦикла;
			ИначеЕсли ТипЗнч(ЭлементНастроек.Значение) = Тип("ДокументСсылка.Командировка")
				ИЛИ ТипЗнч(ЭлементНастроек.Значение) = Тип("ДокументСсылка.КомандировкиСотрудников") Тогда
				ВнешниеНаборыДанныхОтчета.Добавить(ЭлементНастроек.Значение);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВнешниеНаборыДанныхОтчета;
	
КонецФункции
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли