#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПоРешениюОПриемеНаРаботу(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоРешениюОКадровомПереводе(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Ссылка) И МедицинскиеОсмотры.ЕстьЗаключениеПоНаправлению(Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'По данному направлению уже проведено заключение медицинского осмотра'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	ДатаНаправления = ДатаОсмотра;
	Если Не ЗначениеЗаполнено(ДатаНаправления) Тогда
		ДатаНаправления = Дата;
	КонецЕсли;
	
	Если ДатаНаправления >= МедицинскиеОсмотры.ДатаПриказа29н() Или ВредныеФакторыИВидыРабот.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидыРабот");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВредныеФакторы");
	Иначе	
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВредныеФакторыИВидыРабот");
		Если ВредныеФакторы.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидыРабот");
		КонецЕсли;
		
		Если ВидыРабот.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВредныеФакторы");
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотрыФормы.УдалитьДублиФакторовВидовРабот(ВредныеФакторы, "ВредныйФактор");
	МедицинскиеОсмотрыФормы.УдалитьДублиФакторовВидовРабот(ВидыРабот, "ВидРабот");
	
	ДанныеРабочегоМеста = Справочники.РабочиеМестаОхраныТруда.ДанныеРабочегоМеста(РабочееМесто);
	Если ДанныеРабочегоМеста = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Подразделение = ДанныеРабочегоМеста.Подразделение;
	Должность = ДанныеРабочегоМеста.Должность;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьВыданноеНаправление();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВредныеФакторыВидыРабот() Экспорт
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Или Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ВредныеФакторыИВидыРабот.Очистить();
		ВредныеФакторы.Очистить();
		ВидыРабот.Очистить();
		Возврат;
	КонецЕсли;
	
	ДатаАктуальности = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	ВредныеФакторыИВидыРаботТаблица = МедицинскиеОсмотры.ВредныеФакторыИВидыРаботТребующиеОсмотра(ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности);
	ВредныеФакторыИВидыРабот.Загрузить(ВредныеФакторыИВидыРаботТаблица);
	
	ВредныеФакторыТаблица = МедицинскиеОсмотры.ВредныеФакторыТребующиеОсмотра(ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности);
	ВредныеФакторы.Загрузить(ВредныеФакторыТаблица);
	
	ВидыРаботТаблица = МедицинскиеОсмотры.ВидыРаботТребующиеОсмотра(ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности);
	ВидыРабот.Загрузить(ВидыРаботТаблица);
	
КонецПроцедуры

Процедура ЗаполнитьДатуРожденияФизическогоЛица() Экспорт
	
	ДатаРождения = Неопределено;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическиеЛица, "ДатаРождения");
	
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРождения = КадровыеДанные[0]["ДатаРождения"];
	
КонецПроцедуры

Процедура ЗаполнитьРабочееМесто() Экспорт
	
	РабочееМесто = Неопределено;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыЗапроса.КадровыеДанные = "РабочееМестоОхраныТруда";
	ПараметрыЗапроса.Организация = Организация;
	ПараметрыЗапроса.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ОформленПоТрудовомуДоговору", "=", Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ДатаУвольнения", "=", "ДАТАВРЕМЯ(1, 1, 1)");
	
	КадровыеДанные = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыЗапроса);
	Если КадровыеДанные.Количество() = 0 Тогда
		РабочееМесто = Неопределено;
		Возврат;
	КонецЕсли;
	
	РабочееМесто = КадровыеДанные[0].РабочееМестоОхраныТруда;
	
	ЗаполнитьВредныеФакторыВидыРабот();
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
	Ответственный = ЗначенияПоУмолчанию.Ответственный;
	
	Если Не ЗначениеЗаполнено(ВидОсмотра) Тогда
		ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьПоРешениюОПриемеНаРаботу(ДокументОснование, СтандартнаяОбработка)
	
	Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.РешениеОПриемеНаРаботу") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеРешения = Документы.РешениеОПриемеНаРаботу.ДанныеОПриемеНаРаботу(ДокументОснование);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеРешения);
	ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Предварительный;
	
	ЗаполнитьДатуРожденияФизическогоЛица();
	ЗаполнитьЗначенияПоУмолчанию();
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		ЗаполнитьРабочееМесто();
	Иначе
		ЗаполнитьВредныеФакторыВидыРабот();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоРешениюОКадровомПереводе(ДокументОснование, СтандартнаяОбработка)
	
	Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.РешениеОКадровомПереводе") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеРешения = Документы.РешениеОКадровомПереводе.ДанныеОПереводе(ДокументОснование);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеРешения);
	ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Внеплановый;
	
	ЗаполнитьДатуРожденияФизическогоЛица();
	ЗаполнитьЗначенияПоУмолчанию();
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		ЗаполнитьРабочееМесто();
	Иначе
		ЗаполнитьВредныеФакторыВидыРабот();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьВыданноеНаправление()
	
	// Определим предыдущее состояние регистра по этому направлению.
	ДанныеНаправления = РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.ДанныеВыданногоНаправления(Ссылка);
	
	// Удаляем прежние данные.
	Для Каждого Выборка Из ДанныеНаправления Цикл
		НаборЗаписей = РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Отбор.РабочееМесто.Установить(Выборка.РабочееМесто);
		НаборЗаписей.Отбор.ВидОсмотра.Установить(Выборка.ВидОсмотра);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Создаем новую запись о выданном направлении.
	ДатаЗаписи = ДатаОсмотра;
	Если Не ЗначениеЗаполнено(ДатаЗаписи) Тогда
		ДатаЗаписи = Дата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) 
		Или Не ЗначениеЗаполнено(РабочееМесто) 
		Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	НаборЗаписей.Отбор.РабочееМесто.Установить(РабочееМесто);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидОсмотра);
	НаборЗаписей.Отбор.Период.Установить(ДатаЗаписи);
	
	СтрокаНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора, ЭтотОбъект);
	СтрокаНабора.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	СтрокаНабора.Период = ДатаЗаписи;
	СтрокаНабора.Направление = Ссылка;
	СтрокаНабора.Заключение = МедицинскиеОсмотры.ЗаключениеПоНаправлению(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ЗаполнитьДатуРожденияФизическогоЛица();
	ЗаполнитьЗначенияПоУмолчанию();
	ЗаполнитьВредныеФакторыВидыРабот();
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(ДанныеЗаполнения);
	Если ДанныеКандидата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКандидата.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
		ВызватьИсключение НСтр("ru = 'Кандидат отклонен. 
                                |Направление на медосмотр вводится для кандидатов на рассмотрении или утвержденных (одобренных) кандидатов.'");
	КонецЕсли;
	
	ПараметрыДанных = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
	ПараметрыДанных.Согласование = Истина;
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(ДанныеКандидата.Вакансия, ПараметрыДанных);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеВакансий") Тогда
		Если Не ЗначениеЗаполнено(ДанныеКандидата.Вакансия) Тогда
			ВызватьИсключение НСтр("ru = 'Вакансия не заполнена. 
	                                |Направление на медосмотр вводится для кандидата на согласованную вакансию.'");
		КонецЕсли;
		Если ДанныеВакансии.Согласование = Неопределено 
			Или ДанныеВакансии.Согласование.СостояниеСогласования <> Перечисления.СостоянияСогласования.Согласовано Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Вакансия %1 не согласована. 
	                  |Направление на медосмотр вводится для кандидата на согласованную вакансию.'"),
				ДанныеКандидата.Вакансия);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Предварительный;
	
	ФизическоеЛицо = ДанныеКандидата.ФизическоеЛицо;
	ЗаполнитьДатуРожденияФизическогоЛица();
	ЗаполнитьЗначенияПоУмолчанию();
	
	ИсточникСтруктурыПредприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеВакансии.Подразделение, "Источник");
	Если ТипЗнч(ИсточникСтруктурыПредприятия) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Подразделение = ИсточникСтруктурыПредприятия;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Владелец");
		КонецЕсли;
	ИначеЕсли ТипЗнч(ИсточникСтруктурыПредприятия) = Тип("СправочникСсылка.Организации") Тогда
		Организация = ИсточникСтруктурыПредприятия;
	КонецЕсли;
	
	Должность = ДанныеВакансии.Должность;
	
	Если Не ДанныеВакансии.НоваяПозиция Тогда
		Организация = ДанныеВакансии.Организация;
	КонецЕсли;
	
	РабочееМесто = ДанныеВакансии.РабочееМесто;
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		ЗаполнитьРабочееМесто();
	Иначе
		ЗаполнитьВредныеФакторыВидыРабот();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеЗаполнения.Свойство("РешениеОПриемеНаРаботу") Тогда
		ЗаполнитьПоРешениюОПриемеНаРаботу(ДанныеЗаполнения["РешениеОПриемеНаРаботу"], СтандартнаяОбработка);
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Кандидат") Тогда
		ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения["Кандидат"], СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли