#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Вакансия",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьАдресПубликацииЗаписи(ЗаписьОПубликации) Экспорт
	
	ИдентификаторВакансии = ЗаписьОПубликации.ИдентификаторВакансии;
	
	ЗаписьОПубликации.АдресПубликации = 
		РекрутинговыеСайты.АдресВакансии(ЗаписьОПубликации.МестоПубликации, ИдентификаторВакансии);
	
КонецПроцедуры

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
// 
// Возвращаемое значение:
//  - Неопределено
//  - Строка
Функция ИдентификаторВакансии(Вакансия, Сайт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПубликацияВакансий.ИдентификаторВакансии,
	|	ПубликацияВакансий.Вакансия
	|ИЗ
	|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|ГДЕ
	|	ПубликацияВакансий.Вакансия = &Вакансия
	|	И ПубликацияВакансий.МестоПубликации = &МестоПубликации";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("МестоПубликации", Сайт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИдентификаторВакансии;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли

