#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОСтавкахНалоговСборовОтчислений();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСтавкахНалоговСборовОтчислений() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.СоздатьНаборЗаписей();

	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя,     10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОППВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя,    5.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      5.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20150101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      11.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20180101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      3.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20180101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя,      9.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20200101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя,     10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20200101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20200601', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 5.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВ, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 10.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 3.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	1.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 1.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20230101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 20.0);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 21.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 23.8);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	2.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 2.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 11);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 24.8);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 6);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	3.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 3.5);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, Период, Организация, ВидНалогаВзносаОтчисления, ВидДохода, Ставка)
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.Ставка = Ставка;
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой(Период, Организация, ВидНалога, ВидДохода, Коэффициент) 
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидНалогаВзносаОтчисления.Установить(ВидНалога, Истина);
	НаборЗаписей.Отбор.ВидДохода.Установить(ВидДохода, Истина);
	НаборЗаписей.Отбор.Организация.Установить(Организация, Истина);
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.Организация = Организация;
		Движение.ВидНалогаВзносаОтчисления = ВидНалога;
		Движение.ВидДохода = ВидДохода;
		// Ресурсы
		Движение.Ставка = Коэффициент;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахОПВР2024() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 1.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 1.5);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахЕдиногоПлатежа2024() Экспорт
	
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		Возврат
	КонецЕсли;
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 21.5);	
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахЕдиногоПлатежа2024ВКонфигурацииЗарплатногоУчета() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 21.5);	
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахЕдиногоПлатежа2025() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 23.8);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахЕдиногоПлатежа2026() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ЕП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 24.8);
	
КонецПроцедуры

Процедура ОбновитьСтавкуОПВРЗаИП2024() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидНалогаВзносаОтчисления.Установить(Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Истина);
	НаборЗаписей.Отбор.ВидДохода.Установить(Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, Истина);
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка(), Истина);
	НаборЗаписей.Отбор.Период.Установить('20240101', Истина);

	ДобавитьСведенияОСтавкахНалоговСборовОтчислений(НаборЗаписей, '20240101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 1.5);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавках2025() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 2.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 2.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СО, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 11);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавках2026() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 3.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 3.5);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.Организации.ПустаяСсылка(), Перечисления.ВидыНалоговВзносовОтчислений.СН, Справочники.ВидыДоходов.ДоходыОтРаботодателя, 6);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли