#Область СлужебныеПроцедурыИФункции

#Область ОбщееДляФорм

// Определяет, можно ли обращаться к данным текущей строки таблицы.
//
Функция ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные = Неопределено
		ИЛИ ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыделеннаяГруппаТаблицы(ТаблицаФормы) Экспорт
	
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные; 
	
	Если ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) И ТекущиеДанные.Свойство("ЭтоГруппа") Тогда
		
		Если ТекущиеДанные.ЭтоГруппа Тогда 
			Группа = ТекущиеДанные.Ссылка;
		Иначе 
			Группа = ТекущиеДанные.Родитель;
		КонецЕсли;
		
	Иначе
		
		Группа = Неопределено
		
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

#КонецОбласти

#Область ФормыСПолемHTML

// Исполняет скрипт в браузере.
//
Функция ВыполнитьСкрипт(Документ, ТекстСкрипта, Браузер) Экспорт
	
	
	Если Документ = NULL ИЛИ Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Браузер) Тогда
		Текст = НСтр("ru = 'Браузер не определен'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоВстроенныйWeKit(Браузер) Тогда
		
		Скрипт = Документ.createElement("script");
		Скрипт.setAttribute("type", "text/javascript");
		TextNode = Документ.createTextNode(ТекстСкрипта);
		Скрипт.appendChild(TextNode);
			
		head = Документ.getElementsByTagName("head");
		head["0"].appendChild(Скрипт);		
		
	Иначе
		
		Если Браузер = "msie" Тогда
			ИмяОкна = "parentWindow";
		Иначе
			ИмяОкна = "defaultView";
		КонецЕсли;
		
		Возврат Документ[ИмяОкна].eval(ТекстСкрипта);		
		
	КонецЕсли;

	
КонецФункции

Функция ЭтоВстроенныйWeKit(Браузер)
	
	#Если НЕ ВебКлиент Тогда
	Если Браузер = "other" Тогда
		Возврат Истина;
	КонецЕсли;
	#КонецЕсли
	
	Возврат Ложь;
	
КонецФункции

Функция ИмяДокумента(Документ, Браузер) Экспорт
	
	Если Документ = NULL ИЛИ Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Браузер) Тогда
		Текст = НСтр("ru = 'Браузер не определен'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат Неопределено;
	КонецЕсли;
	
	Если Браузер = "msie" Тогда
		ИмяОкна = "parentWindow";
	Иначе
		ИмяОкна = "defaultView";
	КонецЕсли;
	
	ИмяДокумента = Неопределено;
	
	Попытка
		ИмяДокумента = Документ[ИмяОкна].eval("name");
	Исключение
	КонецПопытки;
	
	Если ИмяДокумента = Неопределено Тогда
		ИмяДокумента = Документ[ИмяОкна].name;	
	КонецЕсли;
	
	Если ИмяДокумента = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно определить имя окна HTML страницы'");
	КонецЕсли;
	
	Возврат ИмяДокумента;
	
КонецФункции

#КонецОбласти

#Область Системное

// Записывает в журнал регистрации описание ошибки.
//
// Параметры:
//	СообщениеОбОшибке - Строка - строковое представление ошибки.
//	Данные - Произвольный - данные, к которым относится сообщение об ошибке.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, Данные = Неопределено) Экспорт
	
	ЭлектронноеОбучениеСлужебныйВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, Данные);
	
КонецПроцедуры

Функция КомандаLinuxДоступна(ИмяКоманды) Экспорт
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;			
	РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму("bash -c ""command -v "+ИмяКоманды+"""", ПараметрыЗапускаПрограммы);
	
	Если РезультатЗапуска.КодВозврата = 0
		И ЗначениеЗаполнено(РезультатЗапуска.ПотокВывода)
		И СтрНайти(РезультатЗапуска.ПотокВывода, ИмяКоманды) > 0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;		
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Вызывает диалог перед добавлением элемента подчиненного справочника,
// если основной элемент не записан.
//
Процедура ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ, ПроверитьМодифицированность = Ложь) Экспорт
	ВызватьИсключение НСтр("ru = 'Устаревший вызов'");		
КонецПроцедуры

#КонецОбласти

#КонецОбласти



