#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ТолькоСозданиеРеквизитов) Экспорт

	Если ТолькоСозданиеРеквизитов = Неопределено Тогда

		ОбработатьСозданиеМетаданныхФормы(Форма, Отказ, СтандартнаяОбработка);
		ОбработатьСобытияФормПриСозданииЧтении(Форма, Отказ, СтандартнаяОбработка);

		ДанныеЗУПКИнициализированы(Форма);
		
	ИначеЕсли ТолькоСозданиеРеквизитов = Истина Тогда
		
		ОбработатьСозданиеМетаданныхФормы(Форма, Отказ, СтандартнаяОбработка);
		
	Иначе
		
		ОбработатьСобытияФормПриСозданииЧтении(Форма);
 		ДанныеЗУПКИнициализированы(Форма);

	КонецЕсли;

КонецПроцедуры

Процедура ПриЧтенииНаСервере(Форма) Экспорт

	// данные формы перечитываются
	Если ДанныеЗУПКИнициализированы(Форма) Тогда
		Возврат;
	КонецЕсли;
		
	ОбработатьСозданиеМетаданныхФормы(Форма);
	ОбработатьСобытияФормПриСозданииЧтении(Форма);
	
КонецПроцедуры

Функция ПодменитьЗначениеНедоступногоЭлементаРФ(ИмяЭлемента, ИмяСвойства, Значение) Экспорт

	ЗначениеПодмены = Неопределено;
	
	Если (СтрНайти(ВРег(ИмяЭлемента), ВРег("СкидкаПоВзносам")) > 0
		ИЛИ СтрНайти(ВРег(ИмяЭлемента), ВРег("МестоПолученияДохода")) > 0
		ИЛИ СтрНайти(ВРег(ИмяЭлемента), ВРег("КорректировкиВыплаты")) > 0
		ИЛИ СтрНайти(ВРег(ИмяЭлемента), ВРег("КорректировкаВыплатыГруппа")) > 0
		ИЛИ СтрНайти(ВРег(ИмяЭлемента), ВРег("ГруппаКорректировкиВыплаты")) > 0
		ИЛИ СтрНайти(ВРег(ИмяЭлемента), ВРег("УчитыватьМРОТПриОплатеПоСреднемуЗаработку")) > 0)
		И ИмяСвойства = "Видимость" Тогда
		ЗначениеПодмены = Ложь;
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(ЗначениеПодмены), ЗначениеПодмены, Значение);
	
КонецФункции

Функция ПолучитьМассивМакетовИсключений() Экспорт
	
	МассивМакетовИсключений = Новый Массив;
	МассивМакетовИсключений.Добавить("ПФ_MXL_СправкаПоРасчетуСуммыДоплатыПособия");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Доверенность");
	МассивМакетовИсключений.Добавить("ПФ_MXL_415АПК");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ДоплатаЗаДниНетрудоспособности");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ЗаявлениеВФССОВыплатеПособия_2012");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ЗаявлениеВФССОВыплатеПособия_2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ОписьЗаявленийИДокументовВФСС_2012");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ОписьЗаявленийИДокументовВФСС_2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Запрос");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Заявление");
	МассивМакетовИсключений.Добавить("ПФ_MXL_РасчетПособия");
	МассивМакетовИсключений.Добавить("ПФ_MXL_РеестрПеречисленныхСуммНДФЛ");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Т51");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Т49");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СправкаОСреднемЗаработкеДляПособияПоБезработице");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ТрудовойДоговорМикропредприятий");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Т4");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Реестр");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Реестр2016");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаКНД1151087");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Т9а");
	МассивМакетовИсключений.Добавить("ПФ_MXL_Т10а");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СправкаДляОплатыОтпускаЧАЭС");
    //
	МассивМакетовИсключений.Добавить("ПФ_MXL_РеестрДепонированныхСумм0504047");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СправкаОДивидендах2021");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СправкаОРаспределенииЗаработка");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаАДВ_6_1");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаАДВ_6_1_2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаАДВ_6_1_2019");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаОДВ_1");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаОДВ_1_2019");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаОДВ_1_2022");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаСЗВ_СТАЖ");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаСЗВ_СТАЖ_2019");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаСЗВ_СТАЖ_2022");
	МассивМакетовИсключений.Добавить("ФормаСЗВ_М");
	МассивМакетовИсключений.Добавить("ФормаСЗВ_М_2021");
	МассивМакетовИсключений.Добавить("ФорматСЗВ_ДСО_2022XML");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ФормаЕФС_1");
	МассивМакетовИсключений.Добавить("ФорматЕФС1_2022XML");
	МассивМакетовИсключений.Добавить("ПФ_MXL_КарточкаУчета2015");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокГражданПодлежащихПостановкеНаВоинскийУчет");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокГражданПодлежащихПостановкеНаВоинскийУчет2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокПервоначальнойПостановкиНаВоинскийУчет");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокПервоначальнойПостановкиНаВоинскийУчет2021");
	МассивМакетовИсключений.Добавить("ПФ_MXL_КарточкаОповещения");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ИзвещениеОПриемеУвольнении");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ИзвещениеОПриемеУвольнении2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ИзвещениеОПриемеУвольнении2020");
	МассивМакетовИсключений.Добавить("ПФ_MXL_КарточкаУчета");
	МассивМакетовИсключений.Добавить("ПФ_MXL_КарточкаУчета2015");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ИзвещениеОПриемеУвольнении2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокЮношейДляОВК2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокДляСверкиСВоенкоматом2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_КарточкаУчета2017");
	МассивМакетовИсключений.Добавить("ПФ_MXL_ИзвещениеОПриемеУвольнении2020");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокПервоначальнойПостановкиНаВоинскийУчет2021");
	МассивМакетовИсключений.Добавить("ПФ_MXL_СписокДляСверкиСВоенкоматом2021");
	МассивМакетовИсключений.Добавить("ПФ_MXL_КарточкаГражданинаПодлежащегоВоинскомуУчету");
	
	Возврат МассивМакетовИсключений;
	
КонецФункции

#Область СКД

Функция СформироватьТекстУдаленнаяРаботаПрием(РежимДистанционнойРаботы, УсловияПриема) Экспорт

	ТекстРежимДистанционнойРаботы = "";
	
	Если ЗначениеЗаполнено(РежимДистанционнойРаботы) Тогда
		
		ТекстРежимДистанционнойРаботы = ?(ЗначениеЗаполнено(УсловияПриема), ", ", "") + ?(ЗначениеЗаполнено(УсловияПриема), НРег(РежимДистанционнойРаботы), РежимДистанционнойРаботы);
		
	КонецЕсли;

	Возврат ТекстРежимДистанционнойРаботы;
	
КонецФункции

Функция СформироватьТекстУдаленнаяРаботаПеревод(РежимДистанционнойРаботы, НовыйРежимДистанционнойРаботы, ПричинаПеревода) Экспорт
	
	ТекстРежимДистанционнойРаботы = "";
	
	Если НовыйРежимДистанционнойРаботы <> РежимДистанционнойРаботы Тогда
		
		Если НЕ ЗначениеЗаполнено(НовыйРежимДистанционнойРаботы) Тогда
			
			Если РежимДистанционнойРаботы = Перечисления.РежимыДистанционнойРаботы.КомбинированнаяДистанционнаяРабота Тогда
				ТекстРежимДистанционнойРаботы = НСтр("ru = 'комбинированной дистанционной работы'")	
			Иначе
				ТекстРежимДистанционнойРаботы = НСтр("ru = 'дистанционной работы'")	
			КонецЕсли;
			
			ТекстРежимДистанционнойРаботы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 %3'"), ?(ЗначениеЗаполнено(ПричинаПеревода), ",", ""),
							        ?(ЗначениеЗаполнено(ПричинаПеревода), НСтр("ru = 'возврат с'"), НСтр("ru = 'Возврат с'")), ТекстРежимДистанционнойРаботы);
		Иначе
			
			Если НовыйРежимДистанционнойРаботы = Перечисления.РежимыДистанционнойРаботы.КомбинированнаяДистанционнаяРабота Тогда
				ТекстРежимДистанционнойРаботы = НСтр("ru = 'комбинированную дистанционную работу'")	
			Иначе
				ТекстРежимДистанционнойРаботы = НСтр("ru = 'дистанционную работу'")	
			КонецЕсли;
			
			ТекстРежимДистанционнойРаботы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 %3'"), ?(ЗначениеЗаполнено(ПричинаПеревода), ",", ""),
							        ?(ЗначениеЗаполнено(ПричинаПеревода), НСтр("ru = 'перевод на'"), НСтр("ru = 'Перевод на'")), ТекстРежимДистанционнойРаботы);
		КонецЕсли;
		
	КонецЕсли;

	Возврат ТекстРежимДистанционнойРаботы;
	
КонецФункции

Функция СформироватьТекстУдаленнаяРаботаПереводСписком(РежимДистанционнойРаботы, НовыйРежимДистанционнойРаботы) Экспорт
	
	ТекстРежимДистанционнойРаботы = "";
	
    Если НовыйРежимДистанционнойРаботы <> РежимДистанционнойРаботы Тогда
        Если НЕ ЗначениеЗаполнено(НовыйРежимДистанционнойРаботы) Тогда
            
            Если РежимДистанционнойРаботы = Перечисления.РежимыДистанционнойРаботы.КомбинированнаяДистанционнаяРабота Тогда
                ТекстРежимДистанционнойРаботы = НСтр("ru = 'комбинированной дистанционной работы'")	
            Иначе
                ТекстРежимДистанционнойРаботы = НСтр("ru = 'дистанционной работы'")	
            КонецЕсли;
            
            ТекстРежимДистанционнойРаботы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = ', %1 %2'"), НСтр("ru = 'возврат с'"), ТекстРежимДистанционнойРаботы);
        Иначе
            
            Если НовыйРежимДистанционнойРаботы = Перечисления.РежимыДистанционнойРаботы.КомбинированнаяДистанционнаяРабота Тогда
                ТекстРежимДистанционнойРаботы = НСтр("ru = 'комбинированную дистанционную работу'")	
            Иначе
                ТекстРежимДистанционнойРаботы = НСтр("ru = 'дистанционную работу'")	
            КонецЕсли;
            
            ТекстРежимДистанционнойРаботы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = ', %1 %2'"), НСтр("ru = 'перевод на'"), ТекстРежимДистанционнойРаботы);
        КонецЕсли;
    КонецЕсли;
	
	Возврат ТекстРежимДистанционнойРаботы;
	
КонецФункции

Функция СформироватьТекстУдаленнаяРаботаПереводСпискомПрежнее(РежимДистанционнойРаботы) Экспорт
	
	ТекстРежимДистанционнойРаботы = "";
	
	Если ЗначениеЗаполнено(РежимДистанционнойРаботы) Тогда
		
		ТекстРежимДистанционнойРаботы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = ', %1 %2'"), НСтр("ru = 'перевод на'"), НРег(РежимДистанционнойРаботы));
		
	КонецЕсли;

	Возврат ТекстРежимДистанционнойРаботы;
	
КонецФункции

#КонецОбласти

Функция ИдентификаторИнтернетПоддержки() Экспорт 

	Возврат МодификацияКонфигурацииЗУПКПереопределяемый.ИдентификаторИнтернетПоддержки();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеЗУПКИнициализированы(Форма)

	ДанныеФормы = Новый Структура("ДанныеЗУПКИнициализированы");
	
	ЗаполнитьЗначенияСвойств(ДанныеФормы, Форма);
	
	Если ДанныеФормы.ДанныеЗУПКИнициализированы = Неопределено Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		НовыйРеквизит = Новый РеквизитФормы("ДанныеЗУПКИнициализированы", Новый ОписаниеТипов("Булево"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		Форма.ДанныеЗУПКИнициализированы = Истина;
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;

	КонецЕсли;
	
КонецФункции

Функция РазобратьИмяФормы(Форма)

	ИмяФормыМассив = СтрРазделить(Форма.ИмяФормы, ".", Ложь);
	
	Если ИмяФормыМассив.Количество() = 4 Тогда 
		ДополнительныеПараметры = Новый Структура("ТипОбъекта, ИмяОбъекта, ИмяФормы", ВРег(ИмяФормыМассив[0]), ВРег(ИмяФормыМассив[1]), ВРег(ИмяФормыМассив[3]));
	ИначеЕсли ИмяФормыМассив.Количество() = 2 Тогда 
		ДополнительныеПараметры = Новый Структура("ТипОбъекта, ИмяОбъекта, ИмяФормы", ВРег(ИмяФормыМассив[0]), "", ВРег(ИмяФормыМассив[1]));
	Иначе
		ДополнительныеПараметры = Новый Структура("ТипОбъекта, ИмяОбъекта, ИмяФормы", "", "", "");
	КонецЕсли;

	Возврат ДополнительныеПараметры;
	
КонецФункции

#Область СозданиеМетаданныхФормы

Процедура ОбработатьСозданиеМетаданныхФормы(Форма, Отказ = Ложь, СтандартнаяОбработка = Истина)

	Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		ДополнительныеПараметры = РазобратьИмяФормы(Форма);
		
        // внутри процедур выстаривать порядок если необходимо с учетом приоритетности документа (например, документ НачислениеЗарплаты используют чаще документа БольничныйЛист)
		Если СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("ЖурналДокументов")) > 0 Тогда
			ОбработатьСозданиеМетаданныхФормыЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("Документ")) > 0 Тогда
			ОбработатьСозданиеМетаданныхФормыДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("Справочник")) > 0 Тогда
			ОбработатьСозданиеМетаданныхФормыСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("ОбщаяФорма")) > 0 Тогда
			ОбработатьСозданиеМетаданныхФормыОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("РегистрСведений")) > 0 Тогда
			ОбработатьСозданиеМетаданныхФормыРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("ПланВидовРасчета")) > 0 Тогда
			ОбработатьСозданиеМетаданныхФормыПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("Обработка")) > 0 Тогда
			ОбработатьСозданиеМетаданныхФормыОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		КонецЕсли;
		
	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормы(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область Командировки

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("Командировки") Тогда
		
		НоваяКоманда = Форма.Команды.Добавить("СоздатьКомандировкуГруппы");
		НоваяКоманда.Действие = "СоздатьТ9а";
		НоваяКоманда.Заголовок = НСтр("ru = 'Создать командировку группы'");
		
	КонецЕсли;

#КонецОбласти

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормыЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область Начисления

	Если  ДополнительныеПараметры.ИмяОбъекта = ВРег("Начисления") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВидаРасчета") Тогда
			
			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ИПН");
			ВидыНВО.Добавить("ОПВ");
			ВидыНВО.Добавить("ОППВ");
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("ВОСМС");
			ВидыНВО.Добавить("ООСМС");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ЕП");
			
			// новые реквизиты формы
			
			НоваяКоманда = Форма.Команды.Добавить("РедактированиеИсторииНалогообложениеНачислений");
			НоваяКоманда.Действие = "Подключаемый_РедактированиеИсторииНалогообложениеНачислений";
			НоваяКоманда.Заголовок = НСтр("ru = 'История изменения налогообложения начисления'");
			
			МассивДобавляемыхРеквизитов = Новый Массив;

			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачислений", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.НалогообложениеНачислений"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.НалогообложениеНачислений"));
			НовыйРеквизит.СохраняемыеДанные = Истина;
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
            Для Каждого ВидНВО из ВидыНВО Цикл
				НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитывать" + ВидНВО, Новый ОписаниеТипов("Булево"));
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			КонецЦикла;	
			НовыйРеквизит = Новый РеквизитФормы("ОплатаБольничногоБезФормулы", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
	
	КонецЕсли;

#КонецОбласти

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормыПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область ПанельНастроекЗарплатаКадры

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("ПанельНастроекЗарплатаКадры") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("РасчетЗарплаты") Тогда
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;

			НовыйРеквизит = Новый РеквизитФормы("ИспользоватьРасчетыОтОбратного", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			НовыйРеквизит = Новый РеквизитФормы("ИспользоватьРегистрациюПрочихВыплат", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		КонецЕсли;
			
#КонецОбласти

#Область РедактированиеЗаконодательныхЗначений
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РедактированиеЗаконодательныхЗначений") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Форма") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("МесячныйРасчетныйПоказательИстория");
			НоваяКоманда.Действие = "Подключаемый_МесячныйРасчетныйПоказательИстория";
			НоваяКоманда.Заголовок = НСтр("ru = 'История изменений ...'");
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("МесячныйРасчетныйПоказатель",Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.МесячныйРасчетныйПоказатель"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("МесячныйРасчетныйПоказательНаборЗаписей",Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.МесячныйРасчетныйПоказатель"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("МесячныйРасчетныйПоказательНаборЗаписейПрочитан",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("МесячныйРасчетныйПоказательНоваяЗапись",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("МесячныйРасчетныйПоказательПрежняя",Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("МесячныйРасчетныйПоказательПериодСтрокой", Новый ОписаниеТипов("Строка")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
	
#КонецОбласти

#Область ОбменСБанкамиПоЗарплатнымПроектам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОбменСБанкамиПоЗарплатнымПроектам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ЛицевыеСчета") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерЛицевогоСчета", "Маска", "");

		КонецЕсли;
			
#КонецОбласти

#Область ПлатежиПоРезультатамРасчетаЗарплаты
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПлатежиПоРезультатамРасчетаЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Форма") Тогда
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ИтогНалогиРК",Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогиРК",Новый ОписаниеТипов("ТаблицаЗначений"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалоговыйОрган",Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"),"НалогиРК", "Налоговый орган");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("Сумма",Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)),"НалогиРК");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("МесяцНалоговогоПериода",Новый ОписаниеТипов("Дата", , , , , Новый КвалификаторыДаты(ЧастиДаты.Дата)),"НалогиРК", "Месяц налогового периода");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"),"НалогиРК", "Вид налога, взноса, отчисления");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"),"НалогиРК");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
	
#КонецОбласти

#Область НачальнаяНастройкаПрограммы
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачальнаяНастройкаПрограммы") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаНастройкиПрограммы") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ИспользоватьРасчетыОтОбратного",Новый ОписаниеТипов("Булево"),,, Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаПоНалоговомуУчету", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.УчетнаяПолитикаПоНалоговомуУчету"),,, Истина); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НастройкиВзаиморасчетовПоПрочимДоходам", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.НастройкиВзаиморасчетовПоПрочимДоходам"),,, Истина); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ИспользоватьРегистрациюПрочихВыплат", Новый ОписаниеТипов("Булево"),,, Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Новый ОписаниеТипов("Булево"),,, Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
	
#КонецОбласти

#Область ОбщиеОбъектыРеглОтчетности
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОбщиеОбъектыРеглОтчетности") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("НастройкиОтчета") Тогда
				
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("мСписокСтруктурныхЕдиниц",Новый ОписаниеТипов("СписокЗначений"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("мСписокРегистраций",Новый ОписаниеТипов("СписокЗначений"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтруктурныеЕдиницы",Новый ОписаниеТипов("Строка"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалоговыйКомитет", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		КонецЕсли;

#КонецОбласти

#Область ПомощникПереходаСПрежнихПрограммЗарплатаКадры
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПомощникПереходаСПрежнихПрограммЗарплатаКадры") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаПомощника") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ОграничиватьПереносКоэффициентовИндексации",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
	
#КонецОбласти

#Область ГрупповоеРедактированиеНачислений
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ГрупповоеРедактированиеНачислений") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Форма") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияПраво1");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияПраво1";
			НоваяКоманда.Заголовок = НСтр("ru = '>'");
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияПраво2");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияПраво2";
			НоваяКоманда.Заголовок = НСтр("ru = '>'");
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияЛево1");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияЛево1";
			НоваяКоманда.Заголовок = НСтр("ru = '<'");
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияЛево2");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияЛево2";
			НоваяКоманда.Заголовок = НСтр("ru = '<'");
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовНВОБазаНачислений(Форма, МассивДобавляемыхРеквизитов, Истина, "ИсходнаяБаза", Истина, "Начисления", Истина);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		КонецЕсли;
		
#КонецОбласти

#Область СозданиеВедомостейПрочихДоходов

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СозданиеВедомостейПрочихДоходов") Тогда
        
        Если ДополнительныеПараметры.ИмяФормы = ВРег("ВедомостиПоРасчетномуДокументу") Тогда
            
            МассивДобавляемыхРеквизитов = Новый Массив;
            
			НовыйРеквизит = Новый РеквизитФормы("ВРазрезеПодразделений", Новый ОписаниеТипов("Булево"),,, Истина);
            МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

 			НовыйРеквизит = Новый РеквизитФормы("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"), "Ведомости", "Подразделение");
            МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

            Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
            
        КонецЕсли;
        
#КонецОбласти

	КонецЕсли;
	
	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормыОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область Организациия

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("Организации") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("СоответствиеРеквизитовПечатиНаРусскомИГосударственномЯзыках");
			НоваяКоманда.Действие = "Подключаемый_СоответствиеРеквизитовПечатиНаРусскомИГосударственномЯзыках";
			НоваяКоманда.Заголовок = НСтр("ru = 'Данные печати на государственном и русском языках'");
			
		КонецЕсли;
		
#КонецОбласти
	
#Область ПодразделенияОрганизаций

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПодразделенияОрганизаций") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("РасчетСреднегоЗаработкаПодразделенийИстория");
			НоваяКоманда.Действие = "Подключаемый_РасчетСреднегоЗаработкаПодразделенийИстория";
			НоваяКоманда.Заголовок = НСтр("ru = 'История изменения'");

			МассивДобавляемыхРеквизитов = Новый Массив;

			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаПодразделений", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.РасчетСреднегоЗаработкаПодразделений"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаПодразделенийНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.РасчетСреднегоЗаработкаПодразделений"));
			НовыйРеквизит.СохраняемыеДанные = Истина;
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаПодразделенийНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаПодразделенийНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаПодразделенийПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаПодразделенийПериодСтрокой", Новый ОписаниеТипов("Строка"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ДоступноРедактированиеРасчетСреднегоЗаработкаПодразделений", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		КонецЕсли;
	
#КонецОбласти

#Область Контрагенты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Контрагенты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("КБЕ", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(2, ДопустимаяДлина.Переменная)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область ОбразованиеФизическихЛиц

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОбразованиеФизическихЛиц") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ФормаОбучения", Новый ОписаниеТипов("ПеречислениеСсылка.ФормыОбученияФизическихЛиц"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область СоставыВоеннослужащих

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СоставыВоеннослужащих") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") ИЛИ ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("КатегорияСоставаВоеннослужащих", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииСоставаВоеннослужащих"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область ВидыВыплатБывшимСотрудникам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВидыВыплатБывшимСотрудникам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("РедактированиеИсторииНалогообложениеНачислений");
			НоваяКоманда.Действие = "Подключаемый_РедактированиеИсторииНалогообложениеНачислений";
			НоваяКоманда.Заголовок = НСтр("ru = 'История изменения налогообложения'");
			
			НоваяКоманда = Форма.Команды.Добавить("ФормаЗаписатьИЗакрыть");
			НоваяКоманда.Действие = "Подключаемый_ЗаписатьИЗакрыть";
			НоваяКоманда.Заголовок = НСтр("ru = 'Записать и закрыть'");
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачислений",Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.НалогообложениеНачислений"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНаборЗаписей",Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.НалогообложениеНачислений"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНаборЗаписейПрочитан",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНоваяЗапись",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийПрежняя",Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьВОСМС",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьИПН",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьОПВ",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьСН",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьСО",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьООСМС",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьОПВР",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область ВидыПрочихДоходовФизическихЛиц

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВидыПрочихДоходовФизическихЛиц") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("РедактированиеИсторииНалогообложениеНачислений");
			НоваяКоманда.Действие = "Подключаемый_РедактированиеИсторииНалогообложениеНачислений";
			НоваяКоманда.Заголовок = НСтр("ru = 'История изменения налогообложения'");
			
			НоваяКоманда = Форма.Команды.Добавить("ФормаЗаписатьИЗакрыть");
			НоваяКоманда.Действие = "Подключаемый_ЗаписатьИЗакрыть";
			НоваяКоманда.Заголовок = НСтр("ru = 'Записать и закрыть'");
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачислений",Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.НалогообложениеНачислений"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНаборЗаписей",Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.НалогообложениеНачислений"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНаборЗаписейПрочитан",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийНоваяЗапись",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийПрежняя",Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьВОСМС",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьИПН",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьОПВ",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьСН",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьСО",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьООСМС",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НалогообложениеНачисленийУчитыватьОПВР",Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область Сотрудники
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Сотрудники") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("ПрочиеСведения");
			НоваяКоманда.Действие = "Подключаемый_ПрочиеСведения";
			НоваяКоманда.Заголовок = НСтр("ru = 'Прочие сведения'");
			
			НоваяКоманда = Форма.Команды.Добавить("УчетСреднегоЗаработка");
			НоваяКоманда.Действие = "Подключаемый_УчетСреднегоЗаработка";
			НоваяКоманда.Заголовок = НСтр("ru = 'Учет среднего заработка'");
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛиц", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СведенияОПенсионномОбеспеченииФизическихЛиц"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СведенияОПенсионномОбеспеченииФизическихЛиц"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВ", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СведенияОФизическихЛицахУчастникахВОВ"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СведенияОФизическихЛицахУчастникахВОВ"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиков", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СтатусФизическихЛицКакНалогоплательщиков"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СтатусФизическихЛицКакНалогоплательщиков"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаСотрудников", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.РасчетСреднегоЗаработкаСотрудников"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаСотрудниковНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.РасчетСреднегоЗаработкаСотрудников"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаСотрудниковНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаСотрудниковНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаСотрудниковПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ДоходыСПредыдущегоМестаРаботы") Тогда
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ПримененнаяЛьгота",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Доходы");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ВОСМС",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)), "Доходы");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
	
#КонецОбласти

#Область ФизическиеЛица
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ФизическиеЛица") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("ПрочиеСведения");
			НоваяКоманда.Действие = "Подключаемый_ПрочиеСведения";
			НоваяКоманда.Заголовок = НСтр("ru = 'Прочие сведения'");
			
			// новые реквизиты формы
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛиц", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СведенияОПенсионномОбеспеченииФизическихЛиц"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СведенияОПенсионномОбеспеченииФизическихЛиц"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОПенсионномОбеспеченииФизическихЛицПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВ", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СведенияОФизическихЛицахУчастникахВОВ"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СведенияОФизическихЛицахУчастникахВОВ"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СведенияОФизическихЛицахУчастникахВОВПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиков", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СтатусФизическихЛицКакНалогоплательщиков"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СтатусФизическихЛицКакНалогоплательщиков"), , , Истина);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковНоваяЗапись", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("СтатусФизическихЛицКакНалогоплательщиковПрежняя", Новый ОписаниеТипов());
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
	
#КонецОбласти

#Область ИмяСправочника
#КонецОбласти

	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормыСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область НачислениеЗарплаты

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияНайти");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияНайти";
			НоваяКоманда.Заголовок = НСтр("ru = 'Найти...'");
		
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияОтменитьПоиск");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияОтменитьПоиск";
			НоваяКоманда.Заголовок = НСтр("ru = 'Отменить поиск'");

			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ИспользоватьНалогиВзносыОтчисления", Новый ОписаниеТипов("Булево")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0))); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0))); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("КонтролируемыеПоляНалогиВзносыОтчисления", Новый ОписаниеТипов()); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ПредставлениеПримененныеВычеты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НалогиВзносыОтчисления", НСтр("ru = 'Примененные вычеты'")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ПредставлениеРазрешенныеВычеты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НалогиВзносыОтчисления", НСтр("ru = 'Разрешенные вычеты'")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти
			
#Область РазовоеНачисление

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РазовоеНачисление") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти
			
#Область Премия

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Премия") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти

#Область Отпуск

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Отпуск") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовСреднегоЗаработка(Форма, МассивДобавляемыхРеквизитов);
			СоздатьБлокРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти
			
#Область БольничныйЛист

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("БольничныйЛист") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовСреднегоЗаработка(Форма, МассивДобавляемыхРеквизитов);
			СоздатьБлокРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов);
			
			НовыйРеквизит = Новый РеквизитФормы("ДругиеСотрудникиФизическогоЛица", Новый ОписаниеТипов()); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			НовыйРеквизит = Новый РеквизитФормы("ОбновитьДанныеДляРасчетаСреднего", Новый ОписаниеТипов("Булево")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			НовыйРеквизит = Новый РеквизитФормы("СкорректированСреднийЗаработок", Новый ОписаниеТипов("Булево")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

            Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти

#Область ИсполнительныйЛист

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ИсполнительныйЛист") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти

#Область ИзменениеУсловийИсполнительногоЛиста

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ИзменениеУсловийИсполнительногоЛиста") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("Коэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти

#Область ПлатежноеПоручение

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПлатежноеПоручение") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("ВыгрузитьМТ102");
			НоваяКоманда.Заголовок = НСтр("ru = 'Выгрузить в МТ-102'");
			НоваяКоманда.Картинка = БиблиотекаКартинок.ВыгрузитьФайлСертификата;
			НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
			НоваяКоманда.Действие = "Подключаемый_ВыгрузитьМТ102";
			
			НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьНазначениеПлатежа");
			НоваяКоманда.Заголовок = НСтр("ru = 'Заполнить'");
			НоваяКоманда.Отображение = ОтображениеКнопки.Картинка;
			НоваяКоманда.Действие = "Подключаемый_ЗаполнитьНазначениеПлатежа";
			
		КонецЕсли;

#КонецОбласти

#Область ПростойСотрудников

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПростойСотрудников") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область МатериальнаяПомощь

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("МатериальнаяПомощь") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область НачислениеПоДоговорам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеПоДоговорам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияНайти");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияНайти";
			НоваяКоманда.Заголовок = НСтр("ru = 'Найти...'");
		
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияОтменитьПоиск");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияОтменитьПоиск";
			НоваяКоманда.Заголовок = НСтр("ru = 'Отменить поиск'");
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ПредставлениеПримененныеВычеты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НалогиВзносыОтчисления", "Примененные вычеты");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ВидимостьКомандыСоздатьВедомостиПрочихДоходов", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("КонтролируемыеПоляНалогиВзносыОтчисления", Новый ОписаниеТипов()); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область ОтпускПоУходуЗаРебенком

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОтпускПоУходуЗаРебенком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияНайти");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияНайти";
			НоваяКоманда.Заголовок = НСтр("ru = 'Найти...'");
		
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияОтменитьПоиск");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияОтменитьПоиск";
			НоваяКоманда.Заголовок = НСтр("ru = 'Отменить поиск'");
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ПредставлениеПримененныеВычеты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НалогиВзносыОтчисления", "Примененные вычеты");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти

#Область ОплатаПоСреднемуЗаработку

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОплатаПоСреднемуЗаработку") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов);
			
			НовыйРеквизит = Новый РеквизитФормы("ЗаголовокГруппыСреднийЗаработокИнфо", Новый ОписаниеТипов("Строка"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ПорядокУчетаРабочегоВремени", Новый ОписаниеТипов("ПеречислениеСсылка.УчетРабочегоВремениПриРасчетеСреднегоЗаработка"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти
   
#Область РегистрацияПрочихДоходов

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РегистрацияПрочихДоходов") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьЕжемесячнымДоходомИП");
			НоваяКоманда.Действие = "Подключаемый_ЗаполнитьПлановымДоходомИП";
			НоваяКоманда.Заголовок = НСтр("ru = 'Заполнить доходом ИП'");

            МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			НовыйРеквизит = Новый РеквизитФормы("ОрганизацияЯвляетсяИП", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ВОСМС");
			ВидыНВО.Добавить("ИПН");
			ВидыНВО.Добавить("ОПВ");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ООСМС");

			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				НовыйРеквизит = Новый РеквизитФормы("Итог" + ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("Учитывать" + ВидНВО, Новый ОписаниеТипов("Булево"));
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы(ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НачисленияУдержанияВзносы", , Истина);
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
			КонецЦикла;
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
			
#КонецОбласти
 
#Область ВыплатаБывшимСотрудникам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВыплатаБывшимСотрудникам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
            МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ВОСМС");
			ВидыНВО.Добавить("ИПН");
			ВидыНВО.Добавить("ОПВ");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ООСМС");

			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				НовыйРеквизит = Новый РеквизитФормы("Итог" + ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы("Учитывать" + ВидНВО, Новый ОписаниеТипов("Булево"));
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы(ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НачисленияУдержанияВзносы", , Истина);
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
			КонецЦикла;
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
			
#КонецОбласти
 
#Область ДивидендыФизическимЛицам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ДивидендыФизическимЛицам")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеДивидендов") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
            МассивДобавляемыхРеквизитов = Новый Массив;

			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ИПН");

			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				НовыйРеквизит = Новый РеквизитФормы("Итог" + ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
				НовыйРеквизит = Новый РеквизитФормы(ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.Начисления", , Истина);
				МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
				
			КонецЦикла;
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;
			
#КонецОбласти

#Область Увольнение

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Увольнение")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("УвольнениеСписком") И ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСтроки") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента")
			ИЛИ ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСтроки") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияНайти");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияНайти";
			НоваяКоманда.Заголовок = НСтр("ru = 'Найти...'");
		
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияОтменитьПоиск");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияОтменитьПоиск";
			НоваяКоманда.Заголовок = НСтр("ru = 'Отменить поиск'");

			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовСреднегоЗаработка(Форма, МассивДобавляемыхРеквизитов, Истина);
			СоздатьБлокРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов, Истина, "Удержано", Ложь);

			НовыйРеквизит = Новый РеквизитФормы("ИсчисленоИтог", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), , НСтр("ru = 'Всего'")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			НовыйРеквизит = Новый РеквизитФормы("УдаляемыйИдентификаторСтрокиНалогиВзносыОтчисления", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0))); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			НовыйРеквизит = Новый РеквизитФормы("КонтролируемыеПоляНалогиВзносыОтчисления", Новый ОписаниеТипов()); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			НовыйРеквизит = Новый РеквизитФормы("ПредставлениеПримененныеВычеты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НалогиВзносыОтчисления", НСтр("ru = 'Примененные вычеты'")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			НовыйРеквизит = Новый РеквизитФормы("ПредставлениеРазрешенныеВычеты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НалогиВзносыОтчисления", НСтр("ru = 'Разрешенные вычеты'")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		КонецЕсли;

#КонецОбласти

#Область УвольнениеСписком

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("УвольнениеСписком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			СоздатьБлокРеквизитовСреднегоЗаработка(Форма, МассивДобавляемыхРеквизитов, Истина);
			
			НовыйРеквизит = Новый РеквизитФормы("ИтогУдержаноРегл", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), , НСтр("ru = 'Удержано (регл.)'")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			НовыйРеквизит = Новый РеквизитФормы("ИтогИсчисленоРегл", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), , НСтр("ru = 'Исчислено (регл.)'")); 
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);

			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		КонецЕсли;

#КонецОбласти

#Область НачислениеЗаПервуюПоловинуМесяца

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеЗаПервуюПоловинуМесяца") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияНайти");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияНайти";
			НоваяКоманда.Заголовок = НСтр("ru = 'Найти...'");
		
			НоваяКоманда = Форма.Команды.Добавить("НалогиВзносыОтчисленияОтменитьПоиск");
			НоваяКоманда.Действие = "Подключаемый_НалогиВзносыОтчисленияОтменитьПоиск";
			НоваяКоманда.Заголовок = НСтр("ru = 'Отменить поиск'");
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ПредставлениеПримененныеВычеты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.НалогиВзносыОтчисления", "Примененные вычеты");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
		КонецЕсли;

#КонецОбласти
		
#Область НачислениеОценочныхОбязательствПоОтпускам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеОценочныхОбязательствПоОтпускам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ТаблицаСтавкиНалоговВзносовОтчислений",Новый ОписаниеТипов("ТаблицаЗначений"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("Налог", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"), "ТаблицаСтавкиНалоговВзносовОтчислений");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("Ставка", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)), "ТаблицаСтавкиНалоговВзносовОтчислений");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5,2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5,2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ФизическоеЛицоИП", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ОрганизацияЯвляетсяИП", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РазмерМРП", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10,0)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		КонецЕсли;
		
#КонецОбласти

#Область РезервыПоОплатеТруда

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РезервыПоОплатеТруда") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ТаблицаСтавкиНалоговВзносовОтчислений",Новый ОписаниеТипов("ТаблицаЗначений"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("Налог", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"), "ТаблицаСтавкиНалоговВзносовОтчислений");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("Ставка", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)), "ТаблицаСтавкиНалоговВзносовОтчислений");
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("НормативОтчисленийВРезервОтпусков", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(4,2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5,2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(5,2)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ФизическоеЛицоИП", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ОрганизацияЯвляетсяИП", Новый ОписаниеТипов("Булево"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("РазмерМРП", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10,0)));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

		КонецЕсли;
		
#КонецОбласти

	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормыДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область КоэффициентИндексацииЗаработка

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("КоэффициентИндексацииЗаработка") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокументовИндексацииСотрудника") Тогда
			
			Форма.Список.ТекстЗапроса =
			"ВЫБРАТЬ
			|	РегистрСведенийКоэффициентИндексацииЗаработка.Регистратор КАК Регистратор,
			|	РегистрСведенийКоэффициентИндексацииЗаработка.ДатаИндексации КАК ДатаИндексации,
			|	РегистрСведенийКоэффициентИндексацииЗаработка.Коэффициент КАК Коэффициент,
			|	РегистрСведенийКоэффициентИндексацииЗаработка.КоэффициентИндексации КАК КоэффициентИндексации
			|ИЗ
			|	РегистрСведений.КоэффициентИндексацииЗаработка КАК РегистрСведенийКоэффициентИндексацииЗаработка
			|ГДЕ
			|	РегистрСведенийКоэффициентИндексацииЗаработка.Сотрудник = &Сотрудник";
			
		КонецЕсли;

#КонецОбласти

	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормыРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область ВводДанныхДляРасчетаСреднегоЗаработкаОбщий

	Если ДополнительныеПараметры.ИмяФормы = ВРег("ВводДанныхДляРасчетаСреднегоЗаработкаОбщий") Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;

		НовыйРеквизит = Новый РеквизитФормы("КоличествоМесяцев", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)), "РасшифровкаГодовыхПремий", , Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		НовыйРеквизит = Новый РеквизитФормы("ПорядокУчетаРабочегоВремени", Новый ОписаниеТипов("ПеречислениеСсылка.УчетРабочегоВремениПриРасчетеСреднегоЗаработка")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			
#КонецОбласти
		
#Область ОрганизацияУчетнаяПолитика

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ОрганизацияУчетнаяПолитика") Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;

		НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаОрганизаций", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.РасчетСреднегоЗаработкаОрганизаций"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаОрганизацийНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.РасчетСреднегоЗаработкаОрганизаций")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаОрганизацийНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаОрганизацийНоваяЗапись", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаОрганизацийПериодСтрокой", Новый ОписаниеТипов("Строка"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РасчетСреднегоЗаработкаОрганизацийПрежняя", Новый ОписаниеТипов()); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("СрокиПеречисленияВзносовИОтчислений", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СрокиПеречисленияВзносовИОтчислений"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ПериодСтрокой", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)), "СрокиПеречисленияВзносовИОтчислений", , Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("СрокиПеречисленияВзносовИОтчисленийНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СрокиПеречисленияВзносовИОтчислений")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("СрокиПеречисленияВзносовИОтчисленийНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ПорядокОкругленияРезультатовРасчетаЗарплаты", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.ПорядокОкругленияРезультатовРасчетаЗарплаты"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ПериодСтрокой", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)), "ПорядокОкругленияРезультатовРасчетаЗарплаты", , Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.ПорядокОкругленияРезультатовРасчетаЗарплаты")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ПорядокОкругленияРезультатовРасчетаЗарплатыНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаПоНалоговомуУчету", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.УчетнаяПолитикаПоНалоговомуУчету"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаПоНалоговомуУчетуНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.УчетнаяПолитикаПоНалоговомуУчету")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаПоНалоговомуУчетуНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаПоНалоговомуУчетуНоваяЗапись", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой", Новый ОписаниеТипов("Строка"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаПоНалоговомуУчетуПрежняя", Новый ОписаниеТипов()); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаЗарплатаКадрыНаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.УчетнаяПолитикаЗарплатаКадры")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаЗарплатаКадры", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.УчетнаяПолитикаЗарплатаКадры"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаЗарплатаКадрыНаборЗаписейПрочитан", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаЗарплатаКадрыНоваяЗапись", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаЗарплатаКадрыПрежняя", Новый ОписаниеТипов()); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("УчетнаяПолитикаЗарплатаКадрыПериодСтрокой", Новый ОписаниеТипов("Строка"),,, Истина); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ЭтоКонфигурацияЗарплатногоУчета", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ОрганизацияЯвляетсяИП", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		НоваяКоманда = Форма.Команды.Добавить("РасчетСреднегоЗаработкаОрганизацийИстория");
		НоваяКоманда.Действие = "Подключаемый_РасчетСреднегоЗаработкаОрганизацийИстория";
		НоваяКоманда.Заголовок = НСтр("ru = 'История изменения'");

		НоваяКоманда = Форма.Команды.Добавить("СрокиПеречисленияВзносовИОтчисленийИстория");
		НоваяКоманда.Действие = "Подключаемый_ПеречисленияВзносовИОтчисленийИстория";
		НоваяКоманда.Заголовок = НСтр("ru = 'История изменений'");

		НоваяКоманда = Форма.Команды.Добавить("ПорядокОкругленияРезультатовРасчетаЗарплатыИстория");
		НоваяКоманда.Действие = "Подключаемый_ПорядокОкругленияРезультатовРасчетаЗарплатыИстория";
		НоваяКоманда.Заголовок = НСтр("ru = 'История изменений'");

		НоваяКоманда = Форма.Команды.Добавить("УчетнаяПолитикаПоНалоговомуУчетуИстория");
		НоваяКоманда.Действие = "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуИстория";
		НоваяКоманда.Заголовок = НСтр("ru = 'История изменений'");

		НоваяКоманда = Форма.Команды.Добавить("УчетнаяПолитикаЗарплатаКадрыИстория");
		НоваяКоманда.Действие = "Подключаемый_УчетнаяПолитикаЗарплатаКадрыИстория";
		НоваяКоманда.Заголовок = НСтр("ru = 'История изменений'");

#КонецОбласти

#Область РедактированиеВыплатыСтрокиВедомости

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеВыплатыСтрокиВедомости") Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;

		НовыйРеквизит = Новый РеквизитФормы("ПериодВзаиморасчетов", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)), "Выплаты"); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ПериодВзаиморасчетовСтрокой", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)), "Выплаты", НСтр("ru = 'Период взаиморасчетов'")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"),"Выплаты"); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
        
   		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
        
#КонецОбласти

	КонецЕсли;

#Область ИмяОбщейФормы

#КонецОбласти

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСозданиеМетаданныхФормыОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

#КонецОбласти

Процедура ОбработатьСобытияФормПриСозданииЧтении(Форма, Отказ = Ложь, СтандартнаяОбработка = Истина)

	Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		ДополнительныеПараметры = РазобратьИмяФормы(Форма);
		
        // внутри процедур выстаривать порядок если необходимо с учетом приоритетности документа (например, документ НачислениеЗарплаты используют чаще документа БольничныйЛист)
		Если СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("ЖурналДокументов")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииЧтенииЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("Документ")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииЧтенииДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("Справочник")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииЧтенииСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("ОбщаяФорма")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииЧтенииОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("РегистрСведений")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииЧтенииРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("ПланВидовРасчета")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииЧтенииПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("Обработка")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		ИначеЕсли СтрНайти(ДополнительныеПараметры.ТипОбъекта, ВРег("ПланОбмена")) > 0 Тогда
			ОбработатьСобытияФормПриСозданииЧтенииПланаОбмена(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;
	
#Область ВедомостиНаВыплатуЗарплаты

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостиНаВыплатуЗарплаты") Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеречислениеНДФЛРеквизиты", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Месяц", "Заголовок", НСтр("ru = 'Месяц выплаты'"));

#КонецОбласти

#Область ВедомостиПрочихДоходов

	ИначеЕсли ВРег(ДополнительныеПараметры.ИмяОбъекта) = ВРег("ВедомостиПрочихДоходов") Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеречислениеНДФЛРеквизиты", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Месяц", "Заголовок", НСтр("ru = 'Месяц выплаты'"));

#КонецОбласти

#Область Командировки

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Командировки") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаУтвердить", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Список", "ОтображениеПодсказки", ОтображениеПодсказки.Нет);
		
		НовыйЭлемент = Элементы.Добавить("СоздатьКомандировкуГруппы", Тип("КнопкаФормы"), Элементы.ФормаГруппаФормаСоздатьТ9аДополнительная);
		НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		НовыйЭлемент.ИмяКоманды = "СоздатьКомандировкуГруппы";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСоздатьТ9аДополнительная", "Видимость", Ложь);

#КонецОбласти

#Область Отсутствия

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Отсутствия") Тогда
		
		ТекстЗапроса = Форма.Список.ТекстЗапроса;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КОГДА НЕ ЖурналДокументовОтсутствия.ПометкаУдаления", 
								  "КОГДА НЕ ТИПЗНАЧЕНИЯ(ЖурналДокументовОтсутствия.Ссылка) = ТИП(Документ.Командировка)
									|И НЕ ТИПЗНАЧЕНИЯ(ЖурналДокументовОтсутствия.Ссылка) = ТИП(Документ.КомандировкиСотрудников)
									|И НЕ ЖурналДокументовОтсутствия.ПометкаУдаления");
		
		Форма.Список.ТекстЗапроса = ТекстЗапроса;

#КонецОбласти

	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииЧтенииЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область Удержания

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("Удержания") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВидаРасчета") Тогда
			
			ГруппаНастройкиНалоговВзносовОтРасчетнойБазы = Элементы.Вставить("НастройкиНалоговВзносовОтРасчетнойБазы", Тип("ГруппаФормы"), Элементы.СтраницаРезультатРассчитывается);
			ГруппаНастройкиНалоговВзносовОтРасчетнойБазы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНастройкиНалоговВзносовОтРасчетнойБазы.ОтображатьЗаголовок = Ложь;

			НовыйЭлемент = Элементы.Добавить("ВычитатьИзРасчетнойБазыНалогиВзносы", Тип("ПолеФормы"), ГруппаНастройкиНалоговВзносовОтРасчетнойБазы);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным 		= "Объект.ВычитатьИзРасчетнойБазыНалогиВзносы";
			НовыйЭлемент.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Если установлены флажки, то при расчете базовая сумма начислений, с которой производится удержание, будет уменьшена на величину выбранного налога/взноса за расчетный месяц.
																|В расчете базы для алиментов не участвуют налоги и взносы, исчисленные с сумм начислений, не входящих в базу для расчета исполнительного листа (профсоюзных взносов).'");
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЯвляетсяВзысканием", "Подсказка", НСтр("ru = 'Размер удержания ограничивается согласно ст. 115 ТК РК'"));
			
			Элементы.ИнфоНадписьИсполнительныйЛист.Заголовок = НСтр("ru = 'Удержание рассчитывается в соответствии с условиями, указанными в исполнительном документе. В расчете базы для алиментов не участвуют налоги и взносы, исчисленные с сумм начислений, не входящих в базу для расчета исполнительного листа (профсоюзных взносов)'");
			
		КонецЕсли;		

#КонецОбласти

#Область Начисления

	ИначеЕсли  ДополнительныеПараметры.ИмяОбъекта = ВРег("Начисления") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВидаРасчета") Тогда
			
			// РФ данные
			МассивСкрываемыхРеквизитов = Новый Массив;
			МассивСкрываемыхРеквизитов.Добавить("СреднийЗаработокФСС");
			МассивСкрываемыхРеквизитов.Добавить("СреднийЗаработокФССИспользовать");
			МассивСкрываемыхРеквизитов.Добавить("ПредставлениеВидаНачисленияПоНКРФ");
			МассивСкрываемыхРеквизитов.Добавить("ОблагаетсяНДФЛЧисло0");
			МассивСкрываемыхРеквизитов.Добавить("ОблагаетсяНДФЛЧисло1");
			МассивСкрываемыхРеквизитов.Добавить("ВключаетсяВРасходыПоСт255НКРФЧисло0");
			МассивСкрываемыхРеквизитов.Добавить("ВключаетсяВРасходыПоСт255НКРФЧисло1");
			МассивСкрываемыхРеквизитов.Добавить("ВидНачисленияДляНУ");
			МассивСкрываемыхРеквизитов.Добавить("СтатистическаяОтчетность");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаКатегорияСтатистическогоНаблюдения57Т");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаКатегорияСтатистическогоНаблюденияЗП");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаКатегорияСтатистическогоНаблюдения");
			МассивСкрываемыхРеквизитов.Добавить("СтраницаБухучетПособияФСС");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаНДФЛ");
			МассивСкрываемыхРеквизитов.Добавить("КатегорияДохода");
			МассивСкрываемыхРеквизитов.Добавить("СтрокаРаздела2Расчета6НДФЛ");
			МассивСкрываемыхРеквизитов.Добавить("СтраницыПорядкаОпределенияМесяцаДоходаВВидеОплатыТруда");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаВзносы");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаСтатья255НКРФ");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаСтатья255НКРФ");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаИсполнительноеПроизводство");
            МассивСкрываемыхРеквизитов.Добавить("УчитыватьВесьЗаработок");
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;	

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПостоянныеПоказателиСтраницы", "ОтображениеПодсказки", ОтображениеПодсказки.Нет);

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСреднийЗаработокОбщий", "Заголовок", НСтр("ru = 'Расчет оплаты отпусков, больничных и др.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СреднийЗаработокОбщийИспользовать", "Заголовок", НСтр("ru = 'Учитывать при расчете среднего заработка для целей оплаты отпусков, больничных и пр.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоказательПремированияРасширеннаяПодсказка", "Заголовок", НСтр("ru = 'Используется для определения дублирующих премий с целью их исключения при расчете среднего заработка.'"));
			
			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ИПН");
			ВидыНВО.Добавить("ОПВ");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ОППВ");
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("ВОСМС");
			ВидыНВО.Добавить("ООСМС");
			ВидыНВО.Добавить("ЕП");
			
			// "от обратного"
			ГруппаИспользованиеОтОбратного = Элементы.Вставить("ИспользованиеОтОбратного", Тип("ГруппаФормы"), Элементы.СтраницаРезультатРассчитывается, Элементы.ПостоянныеПоказателиСтраницы);
			ГруппаИспользованиеОтОбратного.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаИспользованиеОтОбратного.ОтображатьЗаголовок = Ложь; 
			
			НовыйЭлемент = Элементы.Добавить("ОтОбратного", Тип("ПолеФормы"), ГруппаИспользованиеОтОбратного);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным 		= "Объект.ОтОбратного";
			НовыйЭлемент.Подсказка 		    = НСтр("ru = 'Если флажок установлен, то при расчете результат начисления будет увеличен на сумму компенсации удержаний.'");
            НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОтОбратногоПриИзменении");

			ГруппаНастройкиОтОбратного = Элементы.Вставить("НастройкиОтОбратного", Тип("ГруппаФормы"), Элементы.Страницы, Элементы.СреднийЗаработок);
			ГруппаНастройкиОтОбратного.Вид = ВидГруппыФормы.Страница;
			ГруппаНастройкиОтОбратного.Заголовок = НСтр("ru = 'От обратного'"); 
			
			НовыйЭлемент = Элементы.Добавить("ОтОбратногоУчетПрямыхНачислений", Тип("ПолеФормы"), ГруппаНастройкиОтОбратного);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным 		= "Объект.ОтОбратногоУчетПрямыхНачислений";
			НовыйЭлемент.Подсказка 		    = НСтр("ru = 'Если флажок установлен, то при расчете данного начисления и определении для него размеров вычетов, льгот и ограничений, будут учтены суммы ""прямых"" ранее исчисленных начислений, в формулах которых не использован метод ""от обратного"".'");
            НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;

			НоваяТаблица = Элементы.Добавить("ОтОбратногоКомпенсируемыеУдержания", Тип("ТаблицаФормы"), ГруппаНастройкиОтОбратного);
			НоваяТаблица.ПутьКДанным 		= "Объект.ОтОбратногоКомпенсируемыеУдержания";

			НовыйЭлемент = Элементы.Добавить("ОтОбратногоКомпенсируемыеУдержанияНомерСтроки", Тип("ПолеФормы"), НоваяТаблица);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
			НовыйЭлемент.ПутьКДанным 		= "Объект.ОтОбратногоКомпенсируемыеУдержания.НомерСтроки";

			НовыйЭлемент = Элементы.Добавить("ОтОбратногоКомпенсируемыеУдержанияВидРасчета", Тип("ПолеФормы"), НоваяТаблица);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.ОтОбратногоКомпенсируемыеУдержания.ВидРасчета";
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОтОбратногоКомпенсируемыеУдержанияВидРасчетаПриИзменении");
            НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ОтОбратногоКомпенсируемыеУдержанияВидРасчетаНачалоВыбора");

			// налогообложение начислений
			ГруппаНалогообложениеНачислений = Элементы.Добавить("ГруппаНалогообложениеНачислений", Тип("ГруппаФормы"), Элементы.ГруппаНалогиИВзносы);
			ГруппаНалогообложениеНачислений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
            ГруппаНалогообложениеНачислений.Заголовок = НСтр("ru = 'Налогообложение начислений'"); 
            ГруппаНалогообложениеНачислений.Отображение = ОтображениеОбычнойГруппы.Нет;

			ГруппаРедактированиеИсторииНалогообложенияНачислений = Элементы.Добавить("ГруппаРедактированиеИсторииНалогообложенияНачислений", Тип("ГруппаФормы"), ГруппаНалогообложениеНачислений);
			ГруппаРедактированиеИсторииНалогообложенияНачислений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
  			ГруппаРедактированиеИсторииНалогообложенияНачислений.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
  			ГруппаРедактированиеИсторииНалогообложенияНачислений.ОтображатьЗаголовок = Ложь;
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийПериод", Тип("ПолеФормы"), ГруппаРедактированиеИсторииНалогообложенияНачислений);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "НалогообложениеНачислений.Период";
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийПериодПриИзменении");

			НовыйЭлемент = Элементы.Добавить("РедактированиеИсторииНалогообложениеНачислений", Тип("КнопкаФормы"), ГруппаРедактированиеИсторииНалогообложенияНачислений);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "РедактированиеИсторииНалогообложениеНачислений";
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийВидДохода", Тип("ПолеФормы"), ГруппаНалогообложениеНачислений);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "НалогообложениеНачислений.ВидДохода";
			
			НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(Справочники.ВидыДоходов.ВидыНачисленияПВР());
			НовыйЭлемент.РежимВыбораИзСписка = Истина;
			НовыйЭлемент.КнопкаСоздания = Ложь;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийВидДоходаПриИзменении");
			
			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложения" + ВидНВО, Тип("ПолеФормы"), ГруппаНалогообложениеНачислений);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.ПутьКДанным 		= "НалогообложениеНачислений.СпособОбложения" + ВидНВО;
            	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияПриИзменении");
				
				НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложению" + ВидНВО, Тип("ПолеФормы"), ГруппаНалогообложениеНачислений);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
				НовыйЭлемент.ПутьКДанным 		= "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложению" + ВидНВО;
            	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюПриИзменении");
				
			КонецЦикла;

			// статистика
			НовыйЭлемент = Элементы.Добавить("КатегорияФондаЗаработнойПлаты1ТГод", Тип("ПолеФормы"), Элементы.ГруппаОтражениеВБухучетеИСтатистика);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.КатегорияФондаЗаработнойПлаты1ТГод";

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодДоходаСтраховыеВзносы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаНастройкаСреднегоЗаработка", "Заголовок", НСтр("ru = 'Настройка среднего заработка и др.'"));
		КонецЕсли;

#КонецОбласти
	
	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииЧтенииПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область ПанельНастроекЗарплатаКадры

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("ПанельНастроекЗарплатаКадры") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("РасчетЗарплаты") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("ГруппаИспользоватьУчетПоСтатьямФинансирования");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаНастройкиСтатистикиПерсонала");
            МассивСкрываемыхРеквизитов.Добавить("Декорация8");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаПереноситьДанныеВДругойУчетСреднегоЗаработка");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаКомпенсацияЗаЗадержкуЗарплаты");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаПризыПодарки");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаВыделятьНерабочиеДниОтдельнымВидомВремени");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаНастройкиИспользованияСтатейРасходов");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаНастройкаСреднемесячныхПоказателей");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаСтатьиФинансированияСтатистикаПерсонала");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаИспользованиеИФО");
            МассивСкрываемыхРеквизитов.Добавить("ДекорацияОтступ");
            МассивСкрываемыхРеквизитов.Добавить("ПорядокУчетаДоговоровГПХ");
			
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;	

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация4", "Заголовок", НСтр("ru = 'Выплаты бывшим сотрудникам, такие как выплата материальной помощи пенсионерам, также необходимо фиксировать в программе (для формирования налоговой отчетности и т.п.)'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОграничиватьСуммуУдержанийПроцентомОтЗаработнойПлаты", "Заголовок", НСтр("ru = 'Ограничивать общий размер удержаний процентом от заработной платы.'"));

			ГруппаИспользованиеОтОбратного = Элементы.Вставить("ГруппаОтОбратного", Тип("ГруппаФормы"), Элементы.ГруппаНастройки, Элементы.ГруппаИндексация);
			ГруппаИспользованиеОтОбратного.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаИспользованиеОтОбратного.ОтображатьЗаголовок = Ложь; 
  			ГруппаИспользованиеОтОбратного.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Элементы.Добавить("ИспользоватьРасчетыОтОбратного", Тип("ПолеФормы"), ГруппаИспользованиеОтОбратного);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным 		= "ИспользоватьРасчетыОтОбратного";
			НовыйЭлемент.Заголовок 		    = НСтр("ru = 'Использовать расчеты ""от обратного""'");
            НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьРасчетыОтОбратногоПриИзменении");

			НовыйЭлемент = Элементы.Добавить("ИнфоНадписьРасчетыОтОбратного", Тип("ДекорацияФормы"), ГруппаИспользованиеОтОбратного);
			НовыйЭлемент.Вид 				= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок 		    = НСтр("ru = 'Позволяет использовать начисления, результатом расчета которых является сумма, увеличенная на сумму компенсации удержаний.'");
			НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ПоясняющийТекст;
			НовыйЭлемент.Ширина 			= 75;

			ГруппаКомментарийИспользоватьРасчетОтОбратного = Элементы.Добавить("ГруппаКомментарийИспользоватьРасчетОтОбратного", Тип("ГруппаФормы"), ГруппаИспользованиеОтОбратного);
			ГруппаКомментарийИспользоватьРасчетОтОбратного.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКомментарийИспользоватьРасчетОтОбратного.ОтображатьЗаголовок = Ложь; 
			
			НовыйЭлемент = Элементы.Добавить("ДекорацияРасчетыОтОбратного", Тип("ДекорацияФормы"), ГруппаКомментарийИспользоватьРасчетОтОбратного);
			НовыйЭлемент.Вид 				= ВидДекорацииФормы.Картинка;
			НовыйЭлемент.Картинка		 	= БиблиотекаКартинок.ИнформацияПоНедоступнымПолям;
			
			НовыйЭлемент = Элементы.Добавить("КомментарийИспользоватьРасчетыОтОбратного", Тип("ДекорацияФормы"), ГруппаКомментарийИспользоватьРасчетОтОбратного);
			НовыйЭлемент.Вид 				= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок 		    = НСтр("ru = 'Начисления ""от обратного"" используются в программе, для отключения настройки необходимо отменить плановые начисления сотрудников с видом ""от обратного"".'");
			НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ПоясняющийТекст;
			НовыйЭлемент.Ширина 			= 75;
			
			ГруппаИспользоватьРегистрациюПрочихВыплат = Элементы.Вставить("ГруппаИспользоватьРегистрациюПрочихВыплат", Тип("ГруппаФормы"), Элементы.ГруппаНастройки, Элементы.ГруппаБывшиеСотрудники);
			ГруппаИспользоватьРегистрациюПрочихВыплат.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаИспользоватьРегистрациюПрочихВыплат.ОтображатьЗаголовок = Ложь; 
  			ГруппаИспользоватьРегистрациюПрочихВыплат.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

			НовыйЭлемент = Элементы.Добавить("ИспользоватьРегистрациюПрочихВыплат", Тип("ПолеФормы"), ГруппаИспользоватьРегистрациюПрочихВыплат);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным 		= "ИспользоватьРегистрациюПрочихВыплат";
			НовыйЭлемент.Заголовок 		    = НСтр("ru = 'Регистрируются прочие выплаты физическим лицам'");
            НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьРегистрациюПрочихВыплатПриИзменении");

			НовыйЭлемент = Элементы.Добавить("ИнфоНадписьИспользоватьРегистрациюПрочихВыплат", Тип("ДекорацияФормы"), ГруппаИспользоватьРегистрациюПрочихВыплат);
			НовыйЭлемент.Вид 				= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок 		    = НСтр("ru = 'Необходимо включить, если на предприятии регистрируются прочие выплаты, не являющиеся доходом физического лица (например, профессиональные выплаты).'");
			НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ПоясняющийТекст;
			НовыйЭлемент.Ширина 			= 75;
				
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроверятьЗаполнениеСпособаРасчетовВВедомостях", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроверятьЗаполнениеСпособаРасчетовВВедомостяхРасширеннаяПодсказка", "Заголовок", НСтр("ru = 'Включите, если ведомости на выплату зарплаты ведутся по способам расчетов с персоналом. Заполнение способа расчета будет обязательным.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация5", "Заголовок", НСтр("ru = 'Если на предприятии выдаются займы сотрудникам, их необходимо регистрировать для целей погашения займа из зарплаты.'"));
			
			// ЗУП КОРП
			ТекстРасширеннаяПодсказка = Элементы.НастройкиУчетаВремениОтражатьЧасыВДеньНачалаСменыРасширеннаяПодсказка.Заголовок;
			ТекстРасширеннаяПодсказка = СтрЗаменить(ТекстРасширеннаяПодсказка, "Т-13", НСтр("ru = 'Табеле учета рабочего времени'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкиУчетаВремениОтражатьЧасыВДеньНачалаСменыРасширеннаяПодсказка", "Заголовок", ТекстРасширеннаяПодсказка);
			// ЗУП КОРП
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("КадровыйУчет") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("ИспользоватьИнтеграциюСРаботаВРоссииГруппа");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаМедицинскоеСтрахованиеСотрудников");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаИспользоватьПодработки");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаПечататьТ6ДляОтпусковПоБеременностиИРодам");
            МассивСкрываемыхРеквизитов.Добавить("ПояснениеИспользоватьБронированиеГраждан");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаВоинскийУчетСоставы");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаЗаполнятьСТДРВсемиМероприятиямиДо2020Года");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаСоциальныеВыплатыРаботаСКоронавирусом");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаСервис1СКабинетСотрудника");
            МассивСкрываемыхРеквизитов.Добавить("БронированиеКомандировокГруппа");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаРаботаВМедицинскомУчреждении");
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;	

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("НастройкаНачисленийУдержаний") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("УчитыватьВечерниеЧасы");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаОтпускЧернобыльский");
			МассивСкрываемыхРеквизитов.Добавить("ОплачиватьДлительныеКомандировкиПомесячно");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаДоплатаБЛ");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаДоплатаДенежноеСодержание");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаЕдиновременнаяВыплатаКОтпуску");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаНПФ");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаДСВ");
            МассивСкрываемыхРеквизитов.Добавить("ОплачиватьДлительныеКомандировкиПомесячно");
            МассивСкрываемыхРеквизитов.Добавить("НастройкиРасчетаЗарплатыИспользоватьДоплатуЗаКомандировкиПоПостановлению1099");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаЕдиновременнаяВыплатаКОтпуску");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаИспользуютсяУдержанияВМедицинскомСтрахованииСотрудников");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаДоплатаБЛ");
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;	
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИспользоватьОплатуПереработокСуммированногоУчета", "Подсказка", НСтр("ru = 'Если на вашем предприятии выполняются работы в ночные часы, сверхурочные работы или оплачиваются переработки при суммированном учете времени, укажите это в настройках.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация10", "Заголовок", НСтр("ru = 'Установите для регистрации простоев на производстве. Порядок оформления простоя и условия оплаты времени простоя по причинам, не зависящим от работодателя и работника, определяются трудовым, коллективным договорами и устанавливаются в размере не ниже минимального размера заработной платы, по вине работодателя – в размере не менее пятидесяти процентов от средней заработной платы работника. Время простоя, допущенного по вине работника, оплате не подлежит.'"));

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("НастройкаШтатногоРасписания") Тогда
	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеТарифовИНадбавок", "Заголовок", НСтр("ru = 'Способ отображения надбавок в печатной форме штатного расписания'"));
			
		КонецЕсли;
			
#КонецОбласти

#Область ПанельАдминистрированияБСП

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПанельАдминистрированияБСП") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("НастройкиПользователейИПрав") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьНастройкиРегистрацииСобытийДоступаКПерсональнымДаннымРасширеннаяПодсказка", "Заголовок", НСтр("ru = 'Регистрация событий доступа в соответствии с требованиями закона от 21.05.2013 № 94-V ""О персональных данных и их защите""'"));

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ИнтернетПоддержкаИСервисы") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РегистрСведенийАдресныеОбъектыЗагрузитьАдресныйКлассификаторРасширеннаяПодсказка", "Заголовок", НСтр("ru = 'Загрузка адресного классификатора.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбработкаЗагрузкаКурсовВалютОткрытьРасширеннаяПодсказка", "Заголовок", НСтр("ru = 'Загрузка курсов выбранных валют за указанный период с сайта нац. банка.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьНастройкиРегистрацииСобытийДоступаКПерсональнымДаннымРасширеннаяПодсказка", "Заголовок", НСтр("ru = ''"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьНастройкиРегистрацииСобытийДоступаКПерсональнымДаннымРасширеннаяПодсказка", "Заголовок", НСтр("ru = ''"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьНастройкиРегистрацииСобытийДоступаКПерсональнымДаннымРасширеннаяПодсказка", "Заголовок", НСтр("ru = ''"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьНастройкиРегистрацииСобытийДоступаКПерсональнымДаннымРасширеннаяПодсказка", "Заголовок", НСтр("ru = ''"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьНастройкиРегистрацииСобытийДоступаКПерсональнымДаннымРасширеннаяПодсказка", "Заголовок", НСтр("ru = ''"));

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);

		КонецЕсли;
			
#КонецОбласти

#Область РаботаСКадрами

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РаботаСКадрами") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("РаботаСКадрами") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникСНИЛС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникСправка2НДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникИНН", "Заголовок", НСтр("ru = 'ИИН'"));
			
			Для Каждого ОтборКомпоновщикаНастроек Из Форма.СотрудникиСОшибками.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				Если ТипЗнч(ОтборКомпоновщикаНастроек) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
					Для Каждого ОтборГруппы Из ОтборКомпоновщикаНастроек.Элементы Цикл
						Если ОтборГруппы.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтраховойНомерПФР")
							ИЛИ ОтборГруппы.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕстьЗаявление") Тогда
							ОтборГруппы.Использование = Ложь;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
			
#КонецОбласти

#Область РедактированиеЗаконодательныхЗначений
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РедактированиеЗаконодательныхЗначений") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Форма") Тогда
			
			// РФ данные
			МассивСкрываемыхРеквизитов = Новый Массив;
			МассивСкрываемыхРеквизитов.Добавить("МаксимальныйРазмерЕжемесячнойСтраховойВыплатыГруппа");
			МассивСкрываемыхРеквизитов.Добавить("ГосударственныеПособияГруппа");
			МассивСкрываемыхРеквизитов.Добавить("ПредельнаяВеличинаБазыСтраховыхВзносовГруппа");
			МассивСкрываемыхРеквизитов.Добавить("РазмерВычетовНДФЛГруппа");
			МассивСкрываемыхРеквизитов.Добавить("ТарифыСтраховыхВзносовГруппа");
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;
			
			Форма.Заголовок = НСтр("ru = 'Редактирование законодательных значений'");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтавкаРефинансированияЦБГруппа", "Заголовок", НСтр("ru = 'Ставка рефинансирования НБ'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МинимальнаяОплатаТрудаРФГруппа", "Заголовок", НСтр("ru = 'Минимальная заработная плата'"));
			
			ГруппаМесячныйРасчетныйПоказатель = Элементы.Добавить("МесячныйРасчетныйПоказатель", Тип("ГруппаФормы"), Элементы.ОдиночныеЗначения);
			ГруппаМесячныйРасчетныйПоказатель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаМесячныйРасчетныйПоказатель.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			ГруппаМесячныйРасчетныйПоказатель.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
			ГруппаМесячныйРасчетныйПоказатель.Заголовок = НСтр("ru = 'Месячный расчетный показатель'");
			ГруппаМесячныйРасчетныйПоказатель.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
			ГруппаМесячныйРасчетныйПоказатель.Скрыть();
			
			НовыйЭлемент = Элементы.Добавить("МесячныйРасчетныйПоказательРазмер", Тип("ПолеФормы"), ГруппаМесячныйРасчетныйПоказатель);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "МесячныйРасчетныйПоказатель.Размер";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_МесячныйРасчетныйПоказательРазмерПриИзменении");
			НовыйЭлемент.КнопкаВыбора = Истина;
			
			НовыйЭлемент = Элементы.Добавить("МесячныйРасчетныйПоказательРазмерДляПособийИныхСоциальныхВыплат", Тип("ПолеФормы"), ГруппаМесячныйРасчетныйПоказатель);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "МесячныйРасчетныйПоказатель.РазмерДляПособийИныхСоциальныхВыплат";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_МесячныйРасчетныйПоказательРазмерДляПособийИныхСоциальныхВыплатПриИзменении");
			НовыйЭлемент.КнопкаВыбора = Истина;
			
			НовыйЭлемент = Элементы.Добавить("МесячныйРасчетныйПоказательПериодСтрокой", Тип("ПолеФормы"), ГруппаМесячныйРасчетныйПоказатель);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "МесячныйРасчетныйПоказательПериодСтрокой";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Применяется с'");
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_МесячныйРасчетныйПоказательПериодСтрокойПриИзменении");
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_МесячныйРасчетныйПоказательПериодСтрокойНачалоВыбора");
			НовыйЭлемент.УстановитьДействие("Регулирование", "Подключаемый_МесячныйРасчетныйПоказательПериодСтрокойРегулирование");
			НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_МесячныйРасчетныйПоказательПериодСтрокойАвтоПодбор");
			НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_МесячныйРасчетныйПоказательПериодСтрокойОкончаниеВводаТекста");
			НовыйЭлемент.КнопкаВыбора = Истина;
			НовыйЭлемент.КнопкаРегулирования = Истина;
			
			НовыйЭлемент = Элементы.Добавить("МесячныйРасчетныйПоказательИстория", Тип("КнопкаФормы"), ГруппаМесячныйРасчетныйПоказатель);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "МесячныйРасчетныйПоказательИстория";
			
		КонецЕсли;
	
#КонецОбласти

#Область ПлатежиПоРезультатамРасчетаЗарплаты
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПлатежиПоРезультатамРасчетаЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Форма") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаШапкаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НалогОстаткиОборотыГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НалогКУплате", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраховыеВзносыСтраница", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НДФЛСтраница", "Заголовок", НСтр("ru = 'Налоги и взносы'"));
			
			НоваяТаблица = Элементы.Добавить("НалогиРК", Тип("ТаблицаФормы"), Элементы.НалогКУплатеГруппа);
			НоваяТаблица.ПутьКДанным = "НалогиРК";
			НоваяТаблица.ИзменятьПорядокСтрок = Ложь;
			НоваяТаблица.ИзменятьСоставСтрок = Ложь;

			НовыйЭлемент = Элементы.Добавить("НалогиРКНалоговыйОрган", Тип("ПолеФормы"), НоваяТаблица);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогиРК.НалоговыйОрган";

			НовыйЭлемент = Элементы.Добавить("НалогиРКВидНалогаВзносаОтчисления", Тип("ПолеФормы"), НоваяТаблица);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогиРК.ВидНалогаВзносаОтчисления";

			НовыйЭлемент = Элементы.Добавить("НалогиРКСумма", Тип("ПолеФормы"), НоваяТаблица);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогиРК.Сумма";

			НовыйЭлемент = Элементы.Добавить("НалогиРКМесяцНалоговогоПериода", Тип("ПолеФормы"), НоваяТаблица);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогиРК.МесяцНалоговогоПериода";
			
		КонецЕсли;
	
#КонецОбласти

#Область СозданиеВедомостейНаВыплатуЗарплаты
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СозданиеВедомостейНаВыплатуЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Ведомость") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставНомерСтроки", "Ширина", 3);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставНДФЛГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставВзысканнаяСумма", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставФинансирование", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставКВыплатеРасшифровка", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставОтступ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РедактироватьЗарплату", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РедактироватьНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособРасчетов", "Видимость", Ложь);
			
		КонецЕсли;
	
#КонецОбласти              

#Область СозданиеВедомостейПрочихДоходов
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СозданиеВедомостейПрочихДоходов") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ВедомостиПоРасчетномуДокументу") Тогда
			
           Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") Тогда
               
               НовыйЭлемент = Элементы.Добавить("ВРазрезеПодразделений", Тип("ПолеФормы"), Элементы.РазрезыГруппа);
               НовыйЭлемент.Вид		            = ВидПоляФормы.ПолеФлажка;
               НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
               НовыйЭлемент.ПутьКДанным         = "ВРазрезеПодразделений";
               НовыйЭлемент.Заголовок           = НСтр("ru = 'В разрезе подразделений'");
               НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВРазрезеПодразделенийПриИзменении");
               
               НовыйЭлемент = Элементы.Добавить("ТаблицаВедомостейПодразделение", Тип("ПолеФормы"), Элементы.ТаблицаВедомостей);
               НовыйЭлемент.Вид		           = ВидПоляФормы.ПолеВвода;
               НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
               НовыйЭлемент.ПутьКДанным        = "Ведомости.Подразделение";
               
           КонецЕсли;
           
		КонецЕсли;
	
#КонецОбласти

#Область ПомощникПереходаСПрежнихПрограммЗарплатаКадры
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПомощникПереходаСПрежнихПрограммЗарплатаКадры") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВыбораВариантаПереносаДанных") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РекомендованныйПеренос", "Подсказка", НСтр("ru = 'Вы перенесете все данные, необходимые для расчета среднего заработка, сдачи отчетности по налогам и взносам в этом году, но расчет зарплаты начнете «с чистого листа» без накопившихся в прошлой системе ошибок.'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаПомощника") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИнформационнаяСсылка", "Видимость", Ложь);
			
			ГруппаОграничиватьПереносКоэффициентовИндексации = Элементы.Вставить("ГруппаОграничиватьПереносКоэффициентовИндексации", Тип("ГруппаФормы"), Элементы.ПереносДанныхИзИБНастройки, Элементы.УточнениеВариантаРасчетаДенежногоДовольствия);
			ГруппаОграничиватьПереносКоэффициентовИндексации.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаОграничиватьПереносКоэффициентовИндексации.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаОграничиватьПереносКоэффициентовИндексации.ОтображатьЗаголовок = Ложь;
			ГруппаОграничиватьПереносКоэффициентовИндексации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Элементы.Добавить("ОграничиватьПереносКоэффициентовИндексации", Тип("ПолеФормы"), ГруппаОграничиватьПереносКоэффициентовИндексации);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным = "ОграничиватьПереносКоэффициентовИндексации";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Ограничивать перенос коэффициентов индексации'");
			
			НовыйЭлемент = Элементы.Добавить("НастройкиПереносаТекст10", Тип("ДекорацияФормы"), ГруппаОграничиватьПереносКоэффициентовИндексации);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок	= НСтр("ru = 'Если флажок установлен, при переносе данных будут учитываться настройки учетной политики прежней программы по расчету среднего заработка.'");
			НовыйЭлемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
			НовыйЭлемент.Ширина		= 75;
			
		КонецЕсли;
	
#КонецОбласти

#Область НачальнаяНастройкаПрограммы
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачальнаяНастройкаПрограммы") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаНастройкиПрограммы") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсобенностиБюджетнойОрганизации", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МуниципальныеСлужащие", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГосударственныеСлужащие", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Военнослужащие", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЦелевоеФинансированиеХозрасчет", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СведенияОбОрганизации", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияСтраховыеВзносы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияУчетСтраховыхВзносов", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияУчетСтраховыхВзносовПродолжение", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкиБюджетногоУчреждения", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИспользоватьПодработкиГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентСевернойНадбавкиДляФОТСтраницы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВоинскийУчетБронированиеГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВоинскийУчетИспользованиеКатегорий", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчитыватьВечерниеЧасы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст69", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчетнаяПолитикаПлательщикЕНВД", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПособияФСС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОГРН", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОГРНИП", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЕжемесячнаяПремияКодДохода", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКвартальнаяПремияКодДоходаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГодоваяПремияКодДоходаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПремияРазоваяКодДоходаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомпенсационныеВыплатыНалогообложение", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИспользоватьОтпускаДляПострадавшихВАварииЧернобыльскойАЭС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКомандировкиПодчиненныеНастройки", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОплатаДнейСдачиКровиВнутрисменная", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДоплатаЗаДниБолезни", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыКОтпуску", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыКОтпускуГосслужба", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПризыПодарки", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДСВ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВзносыНПФ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДолжностиВнимание", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоздатьРегиональныйПроизводственныйКалендарь", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьПроизводственныйКалендарь", "Заголовок", НСтр("ru = 'Открыть производственный календарь'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИННОрганизации", "Заголовок", НСтр("ru = 'ИИН организации'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаИНН", "Заголовок", НСтр("ru = 'ИИН'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыБывшимСотрудникамИнфо", "Заголовок", НСтр("ru = 'Выплаты бывшим сотрудникам, такие как сохраняемый заработок на период трудоустройства, выплата материальной помощи пенсионерам, так же необходимо фиксировать в программе (для формирования отчетности по ИПН и т.п.).'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация4", "Заголовок", НСтр("ru = 'Укажите, с какой точностью на вашем предприятии задаются размеры окладов. Выбранная точность не влияет на расчет начисления (начисления всегда считаются с точностью до тиын) или на округление сумм к выплате (точность округления суммы к выплате задается в ведомости на выплату зарплаты).'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация6", "Заголовок", НСтр("ru = 'Выберите точность, с которой задаются часовые тарифные ставки на вашем предприятии. Выбранная точность не влияет на расчет начисления (начисления всегда считаются с точностью до тиын) или на округление сумм к выплате (точность округления суммы к выплате задается в ведомости на выплату зарплаты).'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация9", "Заголовок", НСтр("ru = 'Если на вашем предприятии выполняются работы в ночные часы, в вечерние часы, используется сверхурочная работа или оплата переработок при суммированном учете рабочего времени, укажите это в настройках. Оплачивается ли и как именно оплачивается на предприятии работа в ночные часы зависит от коллективного договора.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст75", "Заголовок", НСтр("ru = 'Начисление премии выполняется при расчете зарплаты того месяца, когда введен процент премии или размер премии в тенге. Выплата премии производится одновременно с выплатой зарплаты.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст65", "Заголовок", НСтр("ru = 'Начисление премии выполняется при расчете зарплаты того месяца, когда введен процент премии или размер премии в тенге. Выплата премии производится одновременно с выплатой зарплаты.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст16", "Заголовок", НСтр("ru = 'Начисление премии может выполняться  при расчете зарплаты того месяца, когда введен процент премии или размер премии в тенге. Но, возможно, на вашем предприятии премия начисляется и выплачивается в межрасчетный период отдельным документом.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст22", "Заголовок", НСтр("ru = 'Если на предприятии начисляются надбавки, которые устанавливаются в тенге за месяц, а не процентом от основного заработка, напишите ниже их список.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст25", "Заголовок", НСтр("ru = 'Если вам необходимо регистрировать время пребывания в командировке, установите этот флажок.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИспользоватьОплатуКомандировок", "Заголовок", НСтр("ru = 'Регистрируются командировки'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст27", "Заголовок", НСтр("ru = 'Если на предприятии принято регистрировать внутрисменные командировки, т.е. командировки длительностью в несколько часов не занимающие весь рабочий день, установите этот флажок.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаголовокТекст77", "Заголовок", НСтр("ru = 'В программе вы сможете в межрасчетный период оплачивать отпуска, премии, больничные, простои, выдавать материальную помощь. Если кроме этого потребуется выполнять другие единовременные начисления в межрасчетный период до окончательного расчета зарплаты, используйте разовые начисления.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КалендариГрафикиТекст", "Заголовок", НСтр("ru = 'Проверьте заполнение производственного календаря. Это производственный календарь Республики Казахстан. Если его данные вас не устраивают – отредактируйте его. Если ваше предприятие работает по региональному производственному календарю – создайте производственный календарь своего региона.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация88", "Заголовок", НСтр("ru = 'Заполните список должностей.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация122", "Заголовок", НСтр("ru = 'Для исчисления налогов и взносов никаких дополнительных действий не требуется, но для удержания, например, по исполнительным листам, необходимо ввести соответствующие первичные документы.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Декорация126", "Заголовок", НСтр("ru = 'Все необходимые для работы команды вы найдете на рабочем столе и в разделе Главное или в разделах программы Кадры, Зарплата, Налоги и взносы. Разделы программы  Настройка, Администрирование позволят вам управлять настройками программы, создавать пользователей и управлять доступом к данным, выполнять синхронизацию данных с другими программами.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИспользоватьРегистрациюПрочихДоходов", "Заголовок", НСтр("ru = 'Регистрируются прочие доходы физических лиц, не связанные с оплатой труда'"));
			
			Для Каждого ЭлементСписка Из Элементы.ОкладТарифТочность.СписокВыбора Цикл
				Если Найти(ЭлементСписка.Представление, "рублей") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'С точностью до тенге'");
				ИначеЕсли Найти(ЭлементСписка.Представление, "копеек") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'С точностью до тиын'");
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Элементы.ОкладТарифЧасовойТочность.СписокВыбора Цикл
				Если Найти(ЭлементСписка.Представление, "рублей") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'С точностью до тенге'");
				ИначеЕсли Найти(ЭлементСписка.Представление, "до копеек") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'С точностью до тиын'");
				ИначеЕсли Найти(ЭлементСписка.Представление, "долей копеек") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'С точностью до десятых долей тиын'");
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Элементы.ЕжемесячнаяПремияСпособРасчета.СписокВыбора Цикл
				Если Найти(ЭлементСписка.Представление, "процентом от заработка") > 0 Тогда
					Продолжить;
				ИначеЕсли Найти(ЭлементСписка.Представление, "рублях") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'У нас применяется второй способ – начисление суммой в тенге'");;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Элементы.КвартальнаяПремияСпособРасчета.СписокВыбора Цикл
				Если Найти(ЭлементСписка.Представление, "процентом от заработка") > 0 Тогда
					Продолжить;
				ИначеЕсли Найти(ЭлементСписка.Представление, "рублях") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'У нас применяется второй способ – начисление конкретных сумм в тенге'");;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Элементы.ГодоваяПремияСпособРасчета.СписокВыбора Цикл
				Если Найти(ЭлементСписка.Представление, "процентом от заработка") > 0 Тогда
					Продолжить;
				ИначеЕсли Найти(ЭлементСписка.Представление, "рублях") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'У нас применяется второй способ – начисление конкретных сумм в тенге'");;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Элементы.РазоваяПремияСпособРасчета.СписокВыбора Цикл
				Если Найти(ЭлементСписка.Представление, "процентом от заработка") > 0 Тогда
					Продолжить;
				ИначеЕсли Найти(ЭлементСписка.Представление, "рублях") > 0 Тогда
					ЭлементСписка.Представление = НСтр("ru = 'У нас применяется второй способ – начисление конкретных сумм в тенге'");;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			НовыйЭлемент = Элементы.Вставить("УчетнаяПолитикаПоНалоговомуУчетуПлательщикОППВ", Тип("ПолеФормы"), Элементы.ГруппаЕНВД, Элементы.УчетнаяПолитикаПериодСтрокой);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "УчетнаяПолитикаПоНалоговомуУчету.ПлательщикОППВ";
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			
			ГруппаОтОбратного = Элементы.Вставить("ГруппаОтОбратного", Тип("ГруппаФормы"), Элементы.НастройкиРасчетаЗарплаты, Элементы.ГруппаНесколькоТарифныхСтавок);
			ГруппаОтОбратного.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаОтОбратного.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			ГруппаОтОбратного.ОтображатьЗаголовок = Ложь;
			ГруппаОтОбратного.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			
			НовыйЭлемент = Элементы.Добавить("Декорация140", Тип("ДекорацияФормы"), ГруппаОтОбратного);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок	= НСтр("ru = 'Позволяет использовать начисления, результатом расчета которых является сумма, увеличинная на сумму компенсации удержаний.'");
			НовыйЭлемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
			
			НовыйЭлемент = Элементы.Добавить("ИспользоватьРасчетыОтОбратного", Тип("ПолеФормы"), ГруппаОтОбратного);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным = "ИспользоватьРасчетыОтОбратного";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Использовать расчеты ""от обратного""'");
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьРасчетыОтОбратногоПриИзменении");
			
			ГруппаИспользоватьРегистрациюПрочихВыплат = Элементы.Вставить("ГруппаИспользоватьРегистрациюПрочихВыплат", Тип("ГруппаФормы"), Элементы.НастройкиРасчетаЗарплатыПродолжение, Элементы.ЗаймыВОрганизацииНастройка);
			ГруппаИспользоватьРегистрациюПрочихВыплат.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаИспользоватьРегистрациюПрочихВыплат.ОтображатьЗаголовок = Ложь; 
  			ГруппаИспользоватьРегистрациюПрочихВыплат.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

			НовыйЭлемент = Элементы.Добавить("ИнфоНадписьИспользоватьРегистрациюПрочихВыплат", Тип("ДекорацияФормы"), ГруппаИспользоватьРегистрациюПрочихВыплат);
			НовыйЭлемент.Вид 				= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок 		    = НСтр("ru = 'Необходимо включить, если на предприятии регистрируются прочие выплаты, не являющиеся доходом физического лица (например, профессиональные выплаты).'");
			НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ПоясняющийТекст;
			НовыйЭлемент.Ширина 			= 75;

			НовыйЭлемент = Элементы.Добавить("ИспользоватьРегистрациюПрочихВыплат", Тип("ПолеФормы"), ГруппаИспользоватьРегистрациюПрочихВыплат);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
			НовыйЭлемент.ПутьКДанным 		= "ИспользоватьРегистрациюПрочихВыплат";
			НовыйЭлемент.Заголовок 		    = НСтр("ru = 'Регистрируются прочие выплаты физическим лицам'");
            НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьРегистрациюПрочихВыплатПриИзменении");
			
		КонецЕсли;
	
#КонецОбласти

#Область ОбщиеОбъектыРеглОтчетности
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОбщиеОбъектыРеглОтчетности") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("НастройкиОтчета") Тогда

			СтраницаСтруктурныеЕдиницы = Элементы.Вставить("НастройкиОтчета", Тип("ГруппаФормы"), Элементы.Страницы, Элементы.СвойстваРазделов);
			СтраницаСтруктурныеЕдиницы.Вид = ВидГруппыФормы.Страница;
 			СтраницаСтруктурныеЕдиницы.Заголовок  = НСтр("ru = 'Настройки отчета'");

			ГруппаСтруктурныеЕдиницы = Элементы.Добавить("ГруппаСтруктурныеЕдиницы", Тип("ГруппаФормы"), СтраницаСтруктурныеЕдиницы);
			ГруппаСтруктурныеЕдиницы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСтруктурныеЕдиницы.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			ГруппаСтруктурныеЕдиницы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

			НовыйЭлемент = Элементы.Добавить("СтруктурныеЕдиницы", Тип("ПолеФормы"), ГруппаСтруктурныеЕдиницы);
			НовыйЭлемент.Вид		  = ВидПоляФормы.ПолеВвода;
 			НовыйЭлемент.ПутьКДанным  = "СтруктурныеЕдиницы";
 			НовыйЭлемент.Заголовок  = НСтр("ru = 'Структурные единицы'");
			НовыйЭлемент.КнопкаВыбора = Истина;
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_СтруктурныеЕдиницыНачалоВыбора");

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("УправлениеОтчетностью") Тогда
			
			МассивСкрываемыхКоманд = Новый Массив;
			МассивСкрываемыхКоманд.Добавить("ПроверитьВыгрузку");
			СкрытьОбъектыКоманд(Форма, МассивСкрываемыхКоманд);
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияКодИФНС", "Заголовок", НСтр("ru = 'Организация, код налогового органа'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияКодИФНС", "Подсказка", НСтр("ru = 'Отбор по коду налогового органа'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборПоКодуИФНС", "Заголовок", НСтр("ru = 'Отбор по коду налогового органа'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборПоКодуИФНС", "Подсказка", НСтр("ru = 'Отбор по коду налогового органа'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборКодИФНС", "Заголовок", НСтр("ru = 'Отбор по коду налогового органа:'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодИФНС", "Заголовок", НСтр("ru = 'Код налогового органа'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЖурналВыгрузкиКодНалоговогоОргана", "Заголовок", НСтр("ru = 'Налоговый орган'"));
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтатусКартинка", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЖурналОтчетовКодНалоговогоОргана", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЖурналОтчетовПредставлениеВида", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЦиклыОбмена", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("УправлениеОтчетностьюФормаНастройки") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкиПечатиМашиночитаемыхФорм", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументооборотСКонтролирующимиОрганами", "Видимость", Ложь);

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВыбораОтчета") Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЖурналОтчетовКодНалоговогоОргана", "Заголовок", НСтр("ru = 'Налоговый орган'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЖурналОтчетовПредставлениеВида", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область РасширенныйВводКонтактнойИнформации
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РасширенныйВводКонтактнойИнформации") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ВводАдреса") Тогда
			
			МассивСкрываемыхКоманд = Новый Массив;
			МассивСкрываемыхКоманд.Добавить("ПроверитьЗаполнениеАдреса");
			МассивСкрываемыхКоманд.Добавить("ЗаполнитьПоПочтовомуИндексу");
			МассивСкрываемыхКоманд.Добавить("АдресныйКлассификаторУстарел");
			СкрытьОбъектыКоманд(Форма, МассивСкрываемыхКоманд);

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТипДома", "ПропускатьПриВводе", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТипСтроения", "ПропускатьПриВводе", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТипПомещения", "ПропускатьПриВводе", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Улица", "ПодсказкаВвода", НСтр("ru = ''"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МуниципальноеДеление", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаМуниципальныйАдрес", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаАдминистративноТерриториальныйАдрес", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СообщениеОбОбращенииВФНС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОКТМО", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("НаселенныйПунктАдреса") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТипАдреса", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Территория", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("НастройкиАдреса") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТолькоРоссийскийАдрес", "Заголовок", НСтр("ru = 'Только казахстанский адрес'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УказыватьОКТМОВручную", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ОбъединениеКарточекСЛичнымиДанными
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОбъединениеКарточекСЛичнымиДанными") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Форма") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НайденныеДублиИНН", "Заголовок", НСтр("ru = 'ИИН'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НайденныеДублиСтраховойНомерПФР", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаПоискаЗадублированныхФизическихЛиц") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИНН", "Заголовок", НСтр("ru = 'ИИН'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраховойНомерПФР", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаПредварительногоПросмотра") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраховойНомерПФР", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ГрупповоеРедактированиеНачислений
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ГрупповоеРедактированиеНачислений") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("Форма") Тогда
			
			Форма.Заголовок = НСтр("ru = 'Настройка налогообложения, среднего заработка и пр.'");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаСреднийЗаработокОбщий", "Заголовок", НСтр("ru = 'Средний заработок (больничные, отпуска и др.)'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаСреднийЗаработокФСС2010", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПФРФССФОМС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаСтатистическаяОтчетность", "Видимость", Ложь);
			
			ГруппаНалогиВзносыОтчисления = Элементы.Добавить("ГруппаНалогиВзносыОтчисления", Тип("ГруппаФормы"), Элементы.СтраницыРасчетныеБазы);
			ГруппаНалогиВзносыОтчисления.Вид = ВидГруппыФормы.Страница;
			ГруппаНалогиВзносыОтчисления.Заголовок  = НСтр("ru = 'Налоги, взносы, отчисления'");
			
			ГруппаРеквизитыНалогиВзносыОтчисления = Элементы.Добавить("ГруппаРеквизитыНалогиВзносыОтчисления", Тип("ГруппаФормы"), ГруппаНалогиВзносыОтчисления);
			ГруппаРеквизитыНалогиВзносыОтчисления.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРеквизитыНалогиВзносыОтчисления.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
			ГруппаРеквизитыНалогиВзносыОтчисления.ОтображатьЗаголовок = Ложь;
			ГруппаРеквизитыНалогиВзносыОтчисления.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияПериод", Тип("ПолеФормы"), ГруппаРеквизитыНалогиВзносыОтчисления);
			НовыйЭлемент.Вид				 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным		 = "НалогиВзносыОтчисленияПериодСтрокой";
			НовыйЭлемент.КнопкаВыбора		 = Истина;
			НовыйЭлемент.КнопкаРегулирования = Истина;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогиВзносыОтчисленияПериодПриИзменении");
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_НалогиВзносыОтчисленияПериодНачалоВыбора");
			НовыйЭлемент.УстановитьДействие("Регулирование", "Подключаемый_НалогиВзносыОтчисленияПериодРегулирование");
			НовыйЭлемент.УстановитьДействие("ОбработкаВыбора", "Подключаемый_НалогиВзносыОтчисленияПериодОбработкаВыбора");
			НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_НалогиВзносыОтчисленияПериодАвтоПодбор");
			НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_НалогиВзносыОтчисленияПериодОкончаниеВводаТекста");
			
			НовыйЭлемент = Элементы.Добавить("ВидДохода", Тип("ПолеФормы"), ГруппаРеквизитыНалогиВзносыОтчисления);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ВидДохода";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВидДоходаПриИзменении");
			
			ГруппаСтраницыНалогиВзносыОтчисления = Элементы.Добавить("ГруппаСтраницыНалогиВзносыОтчисления", Тип("ГруппаФормы"), ГруппаНалогиВзносыОтчисления);
			ГруппаСтраницыНалогиВзносыОтчисления.Вид = ВидГруппыФормы.Страницы;
			
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "ОПВ", "обязательных пенсионных взносов");
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "ВОСМС", "взносов на обязательное медицинское страхование");
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "ИПН", "индивидуального подоходного налога");
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "СО", "обязательных социальных отчислений");
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "СН", "социального налога");
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "ООСМС", "отчислений на обязательное медицинское страхование");
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "ОПВР", "обязательных пенсионных взносов работодателя");
			СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраницыНалогиВзносыОтчисления, "ОППВ", "обязательных профессиональных пенсионных взносов");

		КонецЕсли;
		
#КонецОбласти

	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область Организации

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("Организации") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("ГруппаТерриториальныеУсловияПФР");
			МассивСкрываемыхРеквизитов.Добавить("УчетнаяПолитикаОрганизацийГруппа");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаКодОГРН");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаОсновныеСведенияПравая");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаОКВЭД2");
            МассивСкрываемыхРеквизитов.Добавить("ОрганизацияОКПОКартинка");
            МассивСкрываемыхРеквизитов.Добавить("ОрганизацияОКПОНадпись");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаФонды");
            МассивСкрываемыхРеквизитов.Добавить("ГруппаЭДО");
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;	
			
			НовыйЭлемент = Элементы.Добавить("КБЕ", Тип("ПолеФормы"), Элементы.ГруппаИНН);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.КБЕ";
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_КБЕПриИзменении");
			
			НовыйЭлемент = Элементы.Вставить("СтранаРегистрации", Тип("ПолеФормы"), Элементы.Главное, Элементы.ГруппаРегистрацияВНалоговомОргане);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.СтранаРегистрации";
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
			
			НовыйЭлемент = Элементы.Добавить("СоответствиеРеквизитовПечатиНаРусскомИГосударственномЯзыках", Тип("КнопкаФормы"), Элементы.ГруппаНастройкиОрганизации);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "СоответствиеРеквизитовПечатиНаРусскомИГосударственномЯзыках";
			НовыйЭлемент.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Используются для печатных форм, утвержденных ПП РК ""Об утверждении Правил документирования, управления документацией и использования систем электронного документооборота в государственных и негосударственных организациях"".'");
			НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодОКВЭДExtendedTooltip", "Заголовок", НСтр("ru = 'Код по Общему классификатору видов экономической деятельности (ОКЭД).'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодОКВЭД", "Заголовок", НСтр("ru = 'ОКЭД'"));

		КонецЕсли;
			
#КонецОбласти

#Область ПодразделенияОрганизаций

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПодразделенияОрганизаций") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("ТерриториальныеУсловияПФРТерриториальныеУсловияПФР");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаТерриториальныеУсловияПФРПериодИстория");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаПроцентЗаОсобыеКлиматическиеУсловия");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаДетализацияМестВыплат");
			МассивСкрываемыхРеквизитов.Добавить("РКГруппа");
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;	
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодОКВЭДExtendedTooltip", "Заголовок", НСтр("ru = 'Код по Общему классификатору видов экономической деятельности (ОКЭД).'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодОКВЭД", "Заголовок", НСтр("ru = 'ОКЭД'"));
			
			// налогообложение начислений
			ГруппаУчетВремениПриРасчетеСреднегоЗаработка = Элементы.Добавить("УчетВремениПриРасчетеСреднегоЗаработка", Тип("ГруппаФормы"), Элементы.ЛеваяКолонкаШапка);
			ГруппаУчетВремениПриРасчетеСреднегоЗаработка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
            ГруппаУчетВремениПриРасчетеСреднегоЗаработка.Заголовок = НСтр("ru = 'Учет рабочего времени при расчете среднего заработка'"); 
            ГруппаУчетВремениПриРасчетеСреднегоЗаработка.Отображение = ОтображениеОбычнойГруппы.Нет;

			НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаПодразделенийУчетРабочегоВремени", Тип("ПолеФормы"), ГруппаУчетВремениПриРасчетеСреднегоЗаработка);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаПодразделений.УчетРабочегоВремени";
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетСреднегоЗаработкаПодразделенийУчетРабочегоВремениПриИзменении");

			НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаПодразделенийУчетРабочегоВремениДляСуммированногоУчета", Тип("ПолеФормы"), ГруппаУчетВремениПриРасчетеСреднегоЗаработка);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаПодразделений.УчетРабочегоВремениДляСуммированногоУчета";
	        НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПустаяСсылка(), НСтр("ru = 'По фактическим графикам сотрудников'"));
            НовыйЭлемент.ПодсказкаВвода     = НСтр("ru = 'По фактическим графикам сотрудников'");
			НовыйЭлемент.КнопкаОчистки 		= Истина;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетСреднегоЗаработкаПодразделенийУчетРабочегоВремениДляСуммированногоУчетаПриИзменении");

            ГруппаДатаУчетаРабочегоВремени = Элементы.Добавить("ДатаУчетаРабочегоВремени", Тип("ГруппаФормы"), ГруппаУчетВремениПриРасчетеСреднегоЗаработка);
			ГруппаДатаУчетаРабочегоВремени.Вид = ВидГруппыФормы.ОбычнаяГруппа;
  			ГруппаДатаУчетаРабочегоВремени.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
  			ГруппаДатаУчетаРабочегоВремени.ОтображатьЗаголовок = Ложь;
			
			НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаПодразделенийПериодСтрокой", Тип("ПолеФормы"), ГруппаДатаУчетаРабочегоВремени);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок 			= НСтр("ru = 'действует с'");
			НовыйЭлемент.КнопкаВыбора 		= Истина;
			НовыйЭлемент.КнопкаРегулирования = Истина;
			НовыйЭлемент.Ширина 			= 14;
			НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаПодразделенийПериодСтрокой";
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетСреднегоЗаработкаПодразделенийПериодСтрокойПриИзменении");
            НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_РасчетСреднегоЗаработкаПодразделенийПериодСтрокойНачалоВыбора");
            НовыйЭлемент.УстановитьДействие("Регулирование", "Подключаемый_РасчетСреднегоЗаработкаПодразделенийПериодСтрокойРегулирование");
            НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_РасчетСреднегоЗаработкаПодразделенийПериодСтрокойАвтоПодбор");
            НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_РасчетСреднегоЗаработкаПодразделенийПериодСтрокойОкончаниеВводаТекста");

			НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаПодразделенийИстория", Тип("КнопкаФормы"), ГруппаДатаУчетаРабочегоВремени);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "РасчетСреднегоЗаработкаПодразделенийИстория";

		КонецЕсли;

#КонецОбласти

#Область РегистрацииВНалоговомОргане
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РегистрацииВНалоговомОргане") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НовыйЭлемент = Элементы.Вставить("ИНН", Тип("ПолеФормы"), Форма, Элементы.КПП);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.ИНН";
            НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_ИННОкончаниеВводаТекста");
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаПредставителя") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Доверенность", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПодсказкаДоверенность", "Видимость", Ложь);
			
		КонецЕсли;
			
#КонецОбласти

#Область БанковскиеСчетаКонтрагентов
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("БанковскиеСчетаКонтрагентов") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БИКБанка", "Маска", "UUUUUUUU");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПроверка", "Видимость", Ложь);
			
		КонецЕсли;
		
#КонецОбласти

#Область Контрагенты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Контрагенты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ГруппаКодПоОКПОКБЕ = Элементы.Вставить("КодПоОКПОКБЕ", Тип("ГруппаФормы"), , Элементы.КодПоОКПО);
			ГруппаКодПоОКПОКБЕ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКодПоОКПОКБЕ.ОтображатьЗаголовок = Ложь;
			ГруппаКодПоОКПОКБЕ.Отображение = ОтображениеОбычнойГруппы.Нет;
			
			Элементы.Переместить(Элементы.КодПоОКПО, ГруппаКодПоОКПОКБЕ);
			
			Элементы.ИНН.АвтоОтметкаНезаполненного = Истина;
			
			НовыйЭлемент = Элементы.Добавить("КБЕ", Тип("ПолеФормы"), ГруппаКодПоОКПОКБЕ);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.КБЕ";
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_КБЕПриИзменении");
			
			НовыйЭлемент = Элементы.Вставить("СтранаРегистрации", Тип("ПолеФормы"), Форма, Элементы.БанковскийСчет);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.СтранаРегистрации";
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КПП", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ОбразованиеФизическихЛиц

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОбразованиеФизическихЛиц") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("ЗаПределамиРФ");
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;
			
			НовыйЭлемент = Элементы.Вставить("ФормаОбучения", Тип("ПолеФормы"), Элементы.ГруппаВидОбразования, Элементы.ВидПрофессиональногоОбучения);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ФормаОбучения";
			
		КонецЕсли;

#КонецОбласти

#Область СоставыВоеннослужащих

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СоставыВоеннослужащих") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ГруппаКатегорияСоставаВоеннослужащихОфицерскийСостав = Элементы.Вставить("КатегорияСоставаВоеннослужащихОфицерскийСостав", Тип("ГруппаФормы"), , Элементы.ОфицерскийСостав);
			ГруппаКатегорияСоставаВоеннослужащихОфицерскийСостав.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКатегорияСоставаВоеннослужащихОфицерскийСостав.ОтображатьЗаголовок = Ложь;
			ГруппаКатегорияСоставаВоеннослужащихОфицерскийСостав.Отображение = ОтображениеОбычнойГруппы.Нет;
			
			НовыйЭлемент = Элементы.Добавить("КатегорияСоставаВоеннослужащих", Тип("ПолеФормы"), ГруппаКатегорияСоставаВоеннослужащихОфицерскийСостав);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.КатегорияСоставаВоеннослужащих";
			
			Элементы.Переместить(Элементы.ОфицерскийСостав, ГруппаКатегорияСоставаВоеннослужащихОфицерскийСостав);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			НовыйЭлемент = Элементы.Добавить("КатегорияСоставаВоеннослужащих", Тип("ПолеФормы"), Элементы.Список);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.КатегорияСоставаВоеннослужащих";
			
		КонецЕсли;

#КонецОбласти

#Область Валюты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Валюты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Команды, "ЗагрузитьКурсыВалют", "Подсказка", НСтр("ru = 'Загрузить курсы валют с веб-сайта Национального банка РК'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Команды, "ПодборИзКлассификатора", "Подсказка", НСтр("ru = 'Подобрать валюты из классификатора валют'"));
			
		КонецЕсли;

#КонецОбласти

#Область ВидыВыплатБывшимСотрудникам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВидыВыплатБывшимСотрудникам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("ФормаЗаписатьИЗакрыть");
			МассивСкрываемыхРеквизитов.Добавить("СтрокаРаздела2Расчета6НДФЛ");
			
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;
			
			Форма.УстановитьДействие("ПриЗаписиНаСервере", "Подключаемый_ПриЗаписиНаСервере");
			Форма.УстановитьДействие("ПередЗаписью", "Подключаемый_ПередЗаписью");
			
			НовыйЭлемент = Элементы.Вставить("ФормаЗаписатьИЗакрытьКомандаФормы", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель, Элементы.ФормаЗаписать);
			НовыйЭлемент.ИмяКоманды = "ФормаЗаписатьИЗакрыть";
			НовыйЭлемент.КнопкаПоУмолчанию = Истина;
			НовыйЭлемент.ЦветФона = Новый Цвет(255,225,0);
			НовыйЭлемент.ЦветРамки = Новый Цвет(170,150,40);
			
			ГруппаНалогообложениеНачислений = Элементы.Вставить("ГруппаНалогообложениеНачислений", Тип("ГруппаФормы"));
			ГруппаНалогообложениеНачислений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНалогообложениеНачислений.Заголовок = НСтр("ru = 'Налогообложение начислений'");
			ГруппаНалогообложениеНачислений.Отображение = ОтображениеОбычнойГруппы.Нет;
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийПериод", Тип("ПолеФормы"), ГруппаНалогообложениеНачислений);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.Период";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Сведения действуют с ...'");
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийПериодПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("РедактированиеИсторииНалогообложениеНачислений", Тип("КнопкаФормы"), ГруппаНалогообложениеНачислений);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "РедактированиеИсторииНалогообложениеНачислений";
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийВидДохода", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ВидДохода";
			НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(Справочники.ВидыДоходов.ВыплатыБывшимСотрудникам());
            НовыйЭлемент.РежимВыбораИзСписка = Истина;
            НовыйЭлемент.КнопкаСоздания = Ложь; 
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийВидДоходаПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияИПН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияИПН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияИПНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияОПВ", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияОПВ";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияОПВПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВ", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияВОСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияВОСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияВОСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияСН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияСН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияСНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияСО", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияСО";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияСОПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСО", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСОПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияООСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияООСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияООСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюООСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюООСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияОПВР", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияОПВР";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияОПВРПриИзменении");

			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВР", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВР";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВРПриИзменении");

		КонецЕсли;

#КонецОбласти

#Область ВидыПрочихДоходовФизическихЛиц

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВидыПрочихДоходовФизическихЛиц") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			// РФ данные
			
			МассивСкрываемыхРеквизитов = Новый Массив;
			
			МассивСкрываемыхРеквизитов.Добавить("ФормаЗаписатьИЗакрыть");
			МассивСкрываемыхРеквизитов.Добавить("ГруппаНДФЛ");
			
			Для Каждого СкрываемыйРеквизит из МассивСкрываемыхРеквизитов Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, СкрываемыйРеквизит, "Видимость", Ложь);
			КонецЦикла;
			
			Форма.УстановитьДействие("ПриЗаписиНаСервере", "Подключаемый_ПриЗаписиНаСервере");
			Форма.УстановитьДействие("ПередЗаписью", "Подключаемый_ПередЗаписью");
			
			НовыйЭлемент = Элементы.Вставить("ФормаЗаписатьИЗакрытьКомандаФормы", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель, Элементы.ФормаЗаписать);
			НовыйЭлемент.ИмяКоманды = "ФормаЗаписатьИЗакрыть";
			НовыйЭлемент.КнопкаПоУмолчанию = Истина;
			НовыйЭлемент.ЦветФона = Новый Цвет(255,225,0);
			НовыйЭлемент.ЦветРамки = Новый Цвет(170,150,40);
			
			ГруппаНалогообложениеНачислений = Элементы.Вставить("ГруппаНалогообложениеНачислений", Тип("ГруппаФормы"));
			ГруппаНалогообложениеНачислений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаНалогообложениеНачислений.Заголовок = НСтр("ru = 'Налогообложение начислений'");
			ГруппаНалогообложениеНачислений.Отображение = ОтображениеОбычнойГруппы.Нет;
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийПериод", Тип("ПолеФормы"), ГруппаНалогообложениеНачислений);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.Период";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Сведения действуют с ...'");
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийПериодПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("РедактированиеИсторииНалогообложениеНачислений", Тип("КнопкаФормы"), ГруппаНалогообложениеНачислений);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "РедактированиеИсторииНалогообложениеНачислений";
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийВидДохода", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ВидДохода";
			НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(Справочники.ВидыДоходов.ВидыПрочихДоходовФизическихЛиц());
			НовыйЭлемент.РежимВыбораИзСписка = Истина;
			НовыйЭлемент.КнопкаСоздания = Ложь;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийВидДоходаПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияИПН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияИПН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияИПНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюИПН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияОПВ", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияОПВ";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияОПВПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВ", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВ";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияВОСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияВОСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияВОСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюВОСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюВОСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияСН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияСН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияСНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСН", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСН";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСНПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияСО", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияСО";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияСОПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСО", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюСО";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюСОПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияООСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияООСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияООСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюООСМС", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюООСМС";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюООСМСПриИзменении");
			
			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийСпособОбложенияОПВР", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.СпособОбложенияОПВР";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийСпособОбложенияОПВРПриИзменении");

			НовыйЭлемент = Элементы.Добавить("НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВР", Тип("ПолеФормы"));
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НалогообложениеНачислений.ДоходНеПодлежащийНалогообложениюОПВР";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюОПВРПриИзменении");
			
		КонецЕсли;

#КонецОбласти

#Область ВидыДокументовФизическихЛиц
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВидыДокументовФизическихЛиц") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодыГруппа", "Заголовок", "");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодМВД", "Заголовок", "");
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодМВД", "Заголовок", "");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокНастройкиОтбора", "Видимость", Ложь);
			
			ИсключаемыеЭлементы = Новый Массив;
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортСССР);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортМинморфлота);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ВременноеУдостоверениеВзаменВоенногоБилетаОфицераЗапаса);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.СправкаВзаменВоенногоБилета);
			ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеГражданинаПодлежащегоПризыву);
			
			ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
			ЭлементОтбора.ПравоеЗначение = ИсключаемыеЭлементы;
			ЭлементОтбора.Использование = Истина;
			
		КонецЕсли;
#КонецОбласти

#Область Должности
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Должности") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассУсловийТрудаИстория", "Заголовок", НСтр("ru = 'История изменения особенностей исчисления ПВ'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОсобенностиИсчисленияСтраховыхВзносов", "Заголовок", НСтр("ru = 'Особенности исчисления пенсионных взносов'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассыУсловийТрудаПоДолжностямПериод", "Заголовок", НСтр("ru = 'Условия труда установлены с'"));
			
			НовыйЭлемент = Элементы.Вставить("КлассыУсловийТрудаПоДолжностямОсуществляютсяОППВ", Тип("ПолеФормы"), Элементы.ГруппаКлассыУсловийТруда, Элементы.КлассыУсловийТрудаПоДолжностямПериод);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "КлассыУсловийТрудаПоДолжностям.ОсуществляютсяОППВ";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Осуществляются ОППВ за занятых на работах с вредными условиями труда'");
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодборИзОКПДТР", "Видимость", Ложь);
			
		КонецЕсли;
	
#КонецОбласти

#Область УсловияТруда
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("УсловияТруда") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассУсловийТрудаИстория", "Заголовок", НСтр("ru = 'История изменения особенностей исчисления ПВ'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОсобенностиИсчисленияСтраховыхВзносов", "Заголовок", НСтр("ru = 'Особенности исчисления пенсионных взносов'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассыУсловийТрудаПоДолжностямПериод", "Заголовок", НСтр("ru = 'Условия труда установлены с'"));
			
			НовыйЭлемент = Элементы.Вставить("КлассыУсловийТрудаПоДолжностямОсуществляютсяОППВ", Тип("ПолеФормы"), Элементы.ГруппаОсобенностиИсчисленияСтраховыхВзносов, Элементы.КлассыУсловийТрудаПоДолжностямПериод);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "КлассыУсловийТрудаПоДолжностям.ОсуществляютсяОППВ";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Осуществляются ОППВ за занятых на работах с вредными условиями труда'");
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			
		КонецЕсли;
	
#КонецОбласти

#Область КлассификаторБанков
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("КлассификаторБанков") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Код", "Маска", "UUUUUUUU");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Родитель", "Заголовок", НСтр("ru = 'Группа банков'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Команды, "ЗагрузитьКлассификатор", "Заголовок", НСтр("ru = 'Подобрать из классификатора'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаГруппы") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Родитель", "Заголовок", НСтр("ru = 'Группа банков'"));
			
			НовыйЭлемент = Элементы.Вставить("Код", Тип("ПолеФормы"), , Элементы.Наименование);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Код";
			
		КонецЕсли;
	
#КонецОбласти

#Область Работодатели
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Работодатели") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КПП", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодыДляЗапросовВФСС", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КПП", "Видимость", Ложь);
			
		КонецЕсли;
	
#КонецОбласти

#Область ЯзыкиНародовМира
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ЯзыкиНародовМира") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Команды, "КомандаПодборИзКлассификатора", "Заголовок", НСтр("ru = 'Подбор из классификатора'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Команды, "КомандаПодборИзКлассификатора", "Подсказка", НСтр("ru = 'Подбор информации о сотруднике из классификатора ""Языки народов мира""'"));
			
		КонецЕсли;
	
#КонецОбласти

#Область ОснованияУвольнения
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОснованияУвольнения") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			НовыйЭлемент = Элементы.Вставить("ПричинаУвольненияИзОрганизации", Тип("ПолеФормы"), , Элементы.ТекстОснования);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПричинаУвольненияИзОрганизации";
			НовыйЭлемент.ТолькоПросмотр = Истина;
			
		КонецЕсли;
	
#КонецОбласти

#Область ФизическиеЛица
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ФизическиеЛица") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Команды, "НалогНаДоходы", "Заголовок", НСтр("ru = 'Налоги'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФизлицоИНН", "Подсказка", НСтр("ru = 'ИИН'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГражданствоФизическихЛицИНН", "Заголовок", НСтр("ru = 'ИИН в стране гражданства'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страхование", "Видимость", Ложь);
			
			НовыйЭлемент = Элементы.Добавить("ПрочиеСведения", Тип("КнопкаФормы"), Элементы.ГруппаДополнительныеДанные);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "ПрочиеСведения";
			
			НовыйЭлемент = Элементы.Вставить("Национальность", Тип("ПолеФормы"), Элементы.РегистрационныеНомера, Элементы.ФизлицоСтраховойНомерПФР);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ФизическоеЛицо.Национальность";
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ПроверкаУникальностиПоИННиСНИЛС") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьИНН", "Заголовок", НСтр("ru = 'ИИН:'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФизическиеЛицаСПохожимиДанными") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИНН", "Заголовок", НСтр("ru = 'ИИН'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраховойНомерПФР", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Поиск", "ПодсказкаВвода", НСтр("ru = 'Имя, телефон, ИИН или др.'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ВоинскийУчет") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВоинскийУчетДатаСнятияСВоинскогоУчета", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДополнительныеСведенияГруппа", "Видимость", Ложь);
			
			НовыйЭлемент = Элементы.Вставить("ВоинскийУчетГруппаУчета", Тип("ПолеФормы"), Элементы.ДанныеВоенногоБилета, Элементы.ВоинскийУчетКатегорияЗапаса);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ВоинскийУчет.ГруппаУчета";
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ТрудоваяДеятельность") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТрудоваяДеятельностьФизическихЛицИмпортСТДР", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТрудоваяДеятельностьФизическихЛицРассчитатьСтажиПоТрудовойДеятельности", "Видимость", Ложь);
			
		КонецЕсли;
	
#КонецОбласти

#Область Сотрудники
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Сотрудники") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Команды, "НалогНаДоходы", "Заголовок", НСтр("ru = 'Налоги'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПлановыйАванс", "Заголовок", НСтр("ru = 'Аванс'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Страхование", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрямыеВыплатыФСС", "Видимость", Ложь);
			Для Каждого Элемент Из Элементы Цикл
				Если ТипЗнч(Элемент) = Тип("КнопкаФормы") И (Элемент.ИмяКоманды = "КомандаВводаНаОсновании_Документы_ЗапросСреднегоЗаработкаСЭДО" ИЛИ 
					Элемент.ИмяКоманды = "КомандаВводаНаОсновании_Документы_СведенияОЗастрахованномЛицеФСС") Тогда // у данных команд имя формируется динамически
					Элемент.Видимость = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Форма.Параметры.ДоступныТолькоДанныеСотрудника Тогда
				НовыйЭлемент = Элементы.Вставить("УчетСреднегоЗаработка", Тип("КнопкаФормы"), Элементы.ГруппаДополнительныеДанные1, Элементы.НалогНаДоходы);
				НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
				НовыйЭлемент.ИмяКоманды = "УчетСреднегоЗаработка";
			КонецЕсли;
			
			НовыйЭлемент = Элементы.Вставить("ПрочиеСведения", Тип("КнопкаФормы"), Элементы.ГруппаДополнительныеДанные2, Элементы.ГруппаОхранаТруда);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "ПрочиеСведения";
			
			НовыйЭлемент = Элементы.Вставить("ФизЛицоНациональность", Тип("ПолеФормы"), Элементы.РегистрационныеНомераВертикальная, Элементы.ФизлицоСтраховойНомерПФР);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ФизическоеЛицо.Национальность";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Национальность'");
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ФизлицоНациональностьПриИзменении");
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОформитьДокументРазделитель4Разделитель5Группа11Разделитель1КомандаВводаНаОсновании_Документы_СведенияОЗастрахованномЛицеФСС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОформитьДокументРазделитель4Разделитель5Группа11Разделитель1КомандаВводаНаОсновании_Документы_ЗапросСреднегоЗаработкаСЭДО", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВыбора") Тогда
			
			ЭлементНайден = Ложь;
			Для Каждого ЭлементУсловногоОформления Из Форма.Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
				Для Каждого ОтборУсловногоОформления Из ЭлементУсловногоОформления.Отбор.Элементы Цикл
					Если ОтборУсловногоОформления.ПравоеЗначение = Перечисления.СпособыРасчетаАванса.ФиксированнойСуммой Тогда
						ТекстУсловногоОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Текст");
						ТекстУсловногоОформления.Значение = "тг.";
						
						ЭлементНайден = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ЭлементНайден Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ЛичныеДанные") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГражданствоФизическихЛицИНН", "Заголовок", НСтр("ru = 'ИИН в стране гражданства'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ВыплатаЗарплаты") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РаспределениеПоСотруднику", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетализацияМестВыплат", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ДоходыСПредыдущегоМестаРаботы") Тогда
			
			Форма.Заголовок = НСтр("ru = 'Сведения с предыдущего места работы'");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Доходы", "Подсказка", "");
			
			НовыйЭлемент = Элементы.Вставить("Организация", Тип("ПолеФормы"), , Элементы.Год);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Организация";
			НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ОрганизацияПриИзменении");
			НовыйЭлемент.УстановитьДействие("Очистка", "Подключаемый_ОрганизацияОчистка");
			
			НовыйЭлемент = Элементы.Добавить("ДоходыПримененнаяЛьгота", Тип("ПолеФормы"), Элементы.Доходы);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Доходы.ПримененнаяЛьгота";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Примененная льгота'");
			
			НовыйЭлемент = Элементы.Добавить("ДоходыВОСМС", Тип("ПолеФормы"), Элементы.Доходы);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Доходы.ВОСМС";
			НовыйЭлемент.Заголовок = НСтр("ru = 'ВОСМС'");
			
		КонецЕсли;
	
#КонецОбласти

#Область ВидыКонтактнойИнформации
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВидыКонтактнойИнформации") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДополнительныеНастройкиАдреса", "Видимость", Ложь);
			
		КонецЕсли;
	
#КонецОбласти

#Область ПрофессииРабочих
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПрофессииРабочих") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКомандаПодборИзКлассификатора", "Видимость", Ложь);
			
		КонецЕсли;
	
#КонецОбласти

#Область ЗарплатныеПроекты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ЗарплатныеПроекты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийНастройкиПрямыхВыплатФССОрганизацийИспользоватьПроектДляПрямыхВыплатФСС", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ГрафикиРаботыСотрудников
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ГрафикиРаботыСотрудников") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("НастройкаНовогоГрафикаРаботы") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчитыватьНерабочиеДни", "Видимость", Ложь);
			
		КонецЕсли;
	
#КонецОбласти

#Область РодственникиФизическихЛиц

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РодственникиФизическихЛиц") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа1", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СНИЛС", "Видимость", Ложь);
			
			Элементы.Переместить(Элементы.Владелец, Форма, Элементы.ФамилияИмяОтчествоГруппа);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СНИЛС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодСвязи", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ШтатноеРасписание
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ШтатноеРасписание") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассУсловийТрудаИстория", "Заголовок", НСтр("ru = 'История изменения особенностей исчисления ПВ'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСпецоценкаУсловийТруда", "Заголовок", НСтр("ru = 'Особенности исчисления пенсионных взносов'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассыУсловийТрудаПоДолжностямПериод", "Заголовок", НСтр("ru = 'Условия труда установлены с'"));
			
			НовыйЭлемент = Элементы.Вставить("КлассыУсловийТрудаПоДолжностямОсуществляютсяОППВ", Тип("ПолеФормы"), Элементы.ГруппаСпецоценкаУсловийТрудаКлассыУсловийТруда, Элементы.КлассыУсловийТрудаПоДолжностямПериод);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = "КлассыУсловийТрудаПоДолжностям.ОсуществляютсяОППВ";
			НовыйЭлемент.Заголовок = НСтр("ru = 'Осуществляются ОППВ за занятых на работах с вредными условиями труда'");
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			
		КонецЕсли;
	
#КонецОбласти

#Область НастройкиРасчетаРезервовПоОплатеТруда
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НастройкиРасчетаРезервовПоОплатеТруда") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассУсловийТрудаИстория", "Заголовок", НСтр("ru = 'История изменения особенностей исчисления ПВ'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСпецоценкаУсловийТруда", "Заголовок", НСтр("ru = 'Особенности исчисления пенсионных взносов'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассыУсловийТрудаПоДолжностямПериод", "Заголовок", НСтр("ru = 'Условия труда установлены с'"));
			
		КонецЕсли;

#КонецОбласти

#Область ПроизводственныеКалендари
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПроизводственныеКалендари") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Создать", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСкопировать", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаУстановитьПометкуУдаления", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область НастройкиОбменСБанками
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НастройкиОбменСБанками") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Организация", "ТолькоПросмотр", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Банк", "ТолькоПросмотр", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВерсияФормата", "РежимВыбораИзСписка", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВерсияФормата", "ВыбиратьТип", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВерсияФормата", "БыстрыйВыбор", Истина);
			
			Элементы.Банк.УстановитьДействие("ПриИзменении", "Подключаемый_БанкПриИзменении");
			
		КонецЕсли;

#КонецОбласти

	КонецЕсли;
  
	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииЧтенииСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область НачислениеЗарплаты

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			СоздатьБлокРеквизитовНВОМногосотрудниковыхДокументов(Форма, "Страницы", "ГруппаНачисленияПерерасчеты");

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Начисления", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияПоДоговорам", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УправленческиеНачисления", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Удержания", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПогашениеЗаймов", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияПерерасчет", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПособия", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВзносы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПособияПерерасчетСтраницы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияСкидкаПоВзносам", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияПоДоговорамСкидкаПоВзносам", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияПерерасчетСкидкаПоВзносам", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область РазовоеНачисление

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РазовоеНачисление") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			СоздатьЭлементыРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма);
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияКорректировкаВыплаты", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область Премия

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Премия") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			СоздатьЭлементыРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, "ГруппаКолонокНачисленияМежрасчетныйПериод");
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияКорректировкаВыплаты", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияНДФЛ", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область Отпуск

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Отпуск") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			СоздатьЭлементыРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма);
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияКорректировкаВыплаты", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияНДФЛ", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ОтпускаСотрудников

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОтпускаСотрудников") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиПечатьТ6", "Заголовок", НСтр("ru = 'Приказ о предоставлении отпуска работникам'"));
			
		КонецЕсли;

#КонецОбласти

#Область ОтпускБезСохраненияОплаты
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОтпускБезСохраненияОплатыСписком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиПечатьТ6", "Заголовок", НСтр("ru = 'Приказ о предоставлении отпуска работникам'"));
			
		КонецЕсли;

#КонецОбласти

#Область БольничныйЛист

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("БольничныйЛист") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЭтоЭЛН", "Видимость", Ложь);

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			СоздатьЭлементыРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма);
			
			НовыйЭлемент = Элементы.Добавить("НомерЛисткаНетрудоспособностиРК", Тип("ПолеФормы"), Элементы.ОбязательныеРеквизиты);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.НомерЛисткаНетрудоспособности";
			
			НовыйЭлемент = Элементы.Добавить("ОтсутствиеПоДругимМестамРаботы", Тип("ДекорацияФормы"), Элементы.ПричинаНетрудоспособностиГруппа);
			НовыйЭлемент.Вид 				= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Гиперссылка 		= Истина;
			НовыйЭлемент.Заголовок	 		= НСтр("ru = 'Физическое лицо оформлено по совместительству, необходимо проверить наличие больничного листа по совместительству'");
        	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ОтсутствиеПоДругимМестамРаботыНажатие");
			
			НовыйЭлемент = Элементы.Добавить("ПричинаНетрудоспособности", Тип("ПолеФормы"), Элементы.Группа1);
			НовыйЭлемент.ПутьКДанным 		= "Объект.ПричинаНетрудоспособности";
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
        	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПричинаНетрудоспособностиПриИзменении");

			НовыйЭлемент = Элементы.Добавить("СлучайУходаЗаБольнымРебенком", Тип("ПолеФормы"), Элементы.Группа1);
			НовыйЭлемент.ПутьКДанным 		= "Объект.СлучайУходаЗаБольнымРебенком";
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьСтаж", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтажиНеЗаданыГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНомерЛисткаНетрудоспособности", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УходЗаРодственникамиСтраница", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчитыватьЗаработокПредыдущихСтрахователей", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДнейПриостановленияТДГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеПричиныНетрудоспособности", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПереключательПричиныНетрудоспособности01", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПереключательПричиныНетрудоспособности02", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодменюЭЛН", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ИзменениеАванса

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ИзменениеАванса") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("УстановитьРазмер") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РазмерВРублях", "Заголовок", НСтр("ru = 'Размер аванса в тенге'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРубли", "Заголовок", НСтр("ru = 'тг.'"));
			
		КонецЕсли;

#КонецОбласти

#Область ИсполнительныйЛист

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ИсполнительныйЛист") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Сумма", "Подсказка", НСтр("ru = 'тенге'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияПредел", "Заголовок", НСтр("ru = 'тенге'"));
			Для Каждого ЭлементСписка Из Элементы.СпособРасчетаПроцентом.СписокВыбора Цикл
				ЭлементСписка.Представление = НСтр("ru = 'Процентом от заработка'");
				Прервать;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Элементы.СпособРасчетаДолей.СписокВыбора Цикл
				ЭлементСписка.Представление = НСтр("ru = 'Долей от заработка'");
				Прервать;
			КонецЦикла;
			
			РолиФизическихЛиц = Новый Массив;
			РолиФизическихЛиц.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.Сотрудник"));
			РолиФизическихЛиц.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.БывшийСотрудник"));
			РолиФизическихЛиц.Добавить(ПредопределенноеЗначение("Перечисление.РолиФизическихЛиц.ПрочийПолучательДоходов"));
			МассивПараметровВыбора = Новый Массив();
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.Роль", РолиФизическихЛиц);
			МассивПараметровВыбора.Добавить(ПараметрВыбора);
			Элементы.Сотрудник.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
			
			ГруппаСпособРасчетаПоМРП = Элементы.Вставить("СпособРасчетаПоМРПГруппа", Тип("ГруппаФормы"), Элементы.СпособРасчетаГруппа, Элементы.СпособРасчетаПроцентомГруппа);
			ГруппаСпособРасчетаПоМРП.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСпособРасчетаПоМРП.ОтображатьЗаголовок = Ложь;
			ГруппаСпособРасчетаПоМРП.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСпособРасчетаПоМРП.Объединенная = Ложь;
			
			НовыйЭлемент = Элементы.Добавить("СпособРасчетаПоМРП", Тип("ПолеФормы"), ГруппаСпособРасчетаПоМРП);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеПереключателя;
			НовыйЭлемент.ПутьКДанным = "Объект.СпособРасчета";
			НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.ПоМесячномуРасчетномуПоказателю, НСтр("ru = 'По МРП'"));
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "СпособРасчетаПриИзменении");
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
			НовыйЭлемент = Элементы.Добавить("Коэффициент", Тип("ПолеФормы"), ГруппаСпособРасчетаПоМРП);
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_КоэффициентПриИзменении");
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Коэффициент";
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
		КонецЕсли;

#КонецОбласти

#Область ИзменениеУсловийИсполнительногоЛиста

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ИзменениеУсловийИсполнительногоЛиста") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Сумма", "Подсказка", НСтр("ru = 'тенге'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Предел", "Подсказка", НСтр("ru = 'тенге'"));
			Для Каждого ЭлементСписка Из Элементы.СпособРасчетаПроцентом.СписокВыбора Цикл
				ЭлементСписка.Представление = НСтр("ru = 'Процентом от заработка'");
				Прервать;
			КонецЦикла;
			Для Каждого ЭлементСписка Из Элементы.СпособРасчетаДолей.СписокВыбора Цикл
				ЭлементСписка.Представление = НСтр("ru = 'Долей от заработка'");
				Прервать;
			КонецЦикла;
			
			ГруппаСпособРасчетаПоМРП = Элементы.Вставить("СпособРасчетаПоМРПГруппа", Тип("ГруппаФормы"), Элементы.СпособРасчетаГруппа, Элементы.СпособРасчетаПроцентомГруппа);
			ГруппаСпособРасчетаПоМРП.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСпособРасчетаПоМРП.ОтображатьЗаголовок = Ложь;
			ГруппаСпособРасчетаПоМРП.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСпособРасчетаПоМРП.Объединенная = Ложь;
			
			НовыйЭлемент = Элементы.Добавить("СпособРасчетаПоМРП", Тип("ПолеФормы"), ГруппаСпособРасчетаПоМРП);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеПереключателя;
			НовыйЭлемент.ПутьКДанным = "Объект.СпособРасчета";
			НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.ПоМесячномуРасчетномуПоказателю, НСтр("ru = 'По МРП'"));
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "СпособРасчетаПриИзменении");
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
			ГруппаРазмерУдержанияПоМРП = Элементы.Добавить("РазмерУдержанияПоМРП", Тип("ГруппаФормы"), ГруппаСпособРасчетаПоМРП);
			ГруппаРазмерУдержанияПоМРП.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаРазмерУдержанияПоМРП.ОтображатьЗаголовок = Ложь;
			ГруппаРазмерУдержанияПоМРП.Отображение = ОтображениеОбычнойГруппы.Нет;
			
			НовыйЭлемент = Элементы.Добавить("Коэффициент", Тип("ПолеФормы"), ГруппаРазмерУдержанияПоМРП);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Коэффициент";
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			
		КонецЕсли;

#КонецОбласти

#Область Командировка

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Командировка") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоначислитьЗарплатуПриНеобходимости", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияСтраница", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтажПФРСтраница", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособОтраженияЗарплатыВБухучете", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБухучет", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПризнакДлительнойКомандировки", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДополнительныеСведения", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидВремениЗамещаемыйПредставление", "Видимость", Ложь);
            
			
		КонецЕсли;

#КонецОбласти
		
#Область КомандировкиСотрудников

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("КомандировкиСотрудников") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияНДФЛ", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти
		
#Область ПриемНаРаботу

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПриемНаРаботу") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособРасчетаАванса", "Заголовок", НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти
		
#Область ПриемНаРаботуСписком

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПриемНаРаботуСписком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСтроки") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособРасчетаАванса", "Заголовок",  НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти

#Область КадровыйПеревод

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("КадровыйПеревод") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИзменитьАванс", "Заголовок",  НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти

#Область КадровыйПереводСписком

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("КадровыйПереводСписком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСтроки") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИзменитьАванс", "Заголовок",  НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти

#Область ИзменениеОплатыТруда

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ИзменениеОплатыТруда") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИзменитьАванс", "Заголовок",  НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти

#Область УдержаниеВСчетРасчетовПоПрочимОперациям

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("УдержаниеВСчетРасчетовПоПрочимОперациям") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияПредел", "Заголовок", НСтр("ru = 'тенге'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРазмерВалюта", "Заголовок", НСтр("ru = 'тенге'"));
			
		КонецЕсли;

#КонецОбласти

#Область УдержаниеДобровольныхВзносовВНПФ

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("УдержаниеДобровольныхВзносовВНПФ") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НПФ", "Заголовок", НСтр("ru = 'Пенсионный фонд'"));
			
		КонецЕсли;

#КонецОбласти

#Область ВедомостьНаВыплатуЗарплаты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьНаВыплатуЗарплатыВБанк")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьНаВыплатуЗарплатыВКассу")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьНаВыплатуЗарплатыПеречислением")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьНаВыплатуЗарплатыРаздатчиком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеречислениеНДФЛРеквизиты", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПериодРегистрации", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РедактироватьНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбновитьНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВнешниеОперацииГруппа", "Заголовок", НСтр("ru = 'Выплата зарплаты'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставНомерСтроки", "Ширина", 3);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеречислениеНДФЛГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставНДФЛГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыплатыГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатаЗарплатыПолностьюГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставВзысканнаяСумма", "Видимость", Ложь);
			// прочие доходы
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПериодРегистрации", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатаЗарплатыВыполненаГруппа", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ВедомостьПрочихДоходов

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьПрочихДоходовВБанк")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьПрочихДоходовВКассу")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьПрочихДоходовПеречислением") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеречислениеНДФЛРеквизиты", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПериодРегистрации", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РедактироватьНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбновитьНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВнешниеОперацииГруппа", "Заголовок", НСтр("ru = 'Выплата зарплаты'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставНомерСтроки", "Ширина", 3);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПеречислениеНДФЛГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставНДФЛГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаВыплатыГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатаЗарплатыПолностьюГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставВзысканнаяСумма", "Видимость", Ложь);
			// прочие доходы
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПериодРегистрации", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатаЗарплатыВыполненаГруппа", "Видимость", Ложь);
			
			Если ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьПрочихДоходовВБанк") Тогда
				Элементы.СоставНомерЛицевогоСчета.УстановитьДействие("ПриИзменении", "Подключаемый_СоставНомерЛицевогоСчетаПриИзменении");
			ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВедомостьПрочихДоходовПеречислением") Тогда
				Элементы.СоставБанковскийСчет.УстановитьДействие("ПриИзменении", "Подключаемый_СоставБанковскийСчетПриИзменении");
			КонецЕсли;
			
   			НовыйЭлемент = Элементы.Вставить("Подразделение", Тип("ПолеФормы"), Элементы.ШапкаОсновное, Элементы.ВыплачиватьГруппа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Подразделение";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПодразделениеПриИзменении");

		КонецЕсли;

#КонецОбласти

#Область ПлатежноеПоручение

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПлатежноеПоручение") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда

			НовыйЭлемент = Элементы.Вставить("ВидОперации", Тип("ПолеФормы"), Элементы.Список, Элементы.СуммаПоДокументу);
			НовыйЭлемент.ПутьКДанным = "Список.ВидОперации";

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерРеестра", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НовыйЭлемент = Элементы.Добавить("ФормаВыгрузитьМТ102", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
			НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			НовыйЭлемент.ИмяКоманды = "ВыгрузитьМТ102";
			
			ГруппаСуммаПлатежаНомерРеестра = Элементы.Добавить("ГруппаСуммаПлатежаНомерРеестра", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛевая);
			ГруппаСуммаПлатежаНомерРеестра.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСуммаПлатежаНомерРеестра.ОтображатьЗаголовок = Ложь;

			Элементы.Переместить(Элементы.СуммаПлатежа, Элементы.ГруппаСуммаПлатежаНомерРеестра);
			Элементы.Переместить(Элементы.НомерРеестра, Элементы.ГруппаСуммаПлатежаНомерРеестра);

			НовыйЭлемент = Элементы.Добавить("БанковскийСчет", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.БанковскийСчет";

			ГруппаКНПНазначениеПлатежа = Элементы.Вставить("ГруппаКНПНазначениеПлатежа", Тип("ГруппаФормы"), , Элементы.ГруппаКомментарий);
			ГруппаКНПНазначениеПлатежа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаКНПНазначениеПлатежа.ОтображатьЗаголовок = Ложь;

			НовыйЭлемент = Элементы.Добавить("ЗаполнитьНазначениеПлатежа", Тип("КнопкаФормы"), Элементы.ГруппаКНПНазначениеПлатежа);
			НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
			НовыйЭлемент.ИмяКоманды = "ЗаполнитьНазначениеПлатежа";

			НовыйЭлемент = Элементы.Добавить("КодНазначенияПлатежа", Тип("ПолеФормы"), Элементы.ГруппаКНПНазначениеПлатежа);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.КодНазначенияПлатежа";

			НовыйЭлемент = Элементы.Добавить("НазначениеПлатежа", Тип("ПолеФормы"), Элементы.ГруппаКНПНазначениеПлатежа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.МногострочныйРежим = Истина;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
			НовыйЭлемент.РастягиватьПоВертикали = Ложь;
			НовыйЭлемент.ПутьКДанным = "Объект.НазначениеПлатежа";
			НовыйЭлемент.ВысотаЗаголовка = 2;

			НовыйЭлемент = Элементы.Вставить("Подразделение", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая, Элементы.РеестрГруппа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Подразделение";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПодразделениеПриИзменении");

			НовыйЭлемент = Элементы.Вставить("ФактическийПлательщик", Тип("ПолеФормы"), Элементы.ГруппаШапкаЛевая, Элементы.РеестрГруппа);
			НовыйЭлемент.Вид					 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным			 = "Объект.ФактическийПлательщик";
			НовыйЭлемент.РежимВыбораИзСписка	 = Истина;
			НовыйЭлемент.КнопкаОткрытия			 = Истина;
			НовыйЭлемент.КнопкаВыбора			 = Ложь;

			НовыйЭлемент = Элементы.Добавить("Контрагент", Тип("ПолеФормы"), Элементы.Авторизация);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Контрагент";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_КонтрагентПриИзменении");

			НовыйЭлемент = Элементы.Добавить("БанковскийСчетКонтрагента", Тип("ПолеФормы"), Элементы.Авторизация);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.БанковскийСчетКонтрагента";

			НовыйЭлемент = Элементы.Вставить("ВидОперации", Тип("ПолеФормы"), Элементы.Авторизация, Элементы.Ответственный);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВидОперации";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВидОперацииПриИзменении");
			
            Элементы.Переместить(Элементы.Ответственный, Элементы.ГруппаКомментарий);

			ВедомостиПрочие = Элементы.Вставить("ВедомостиПрочие", Тип("ТаблицаФормы"), , Элементы.ГруппаКНПНазначениеПлатежа);
			ВедомостиПрочие.ПутьКДанным = "Объект.ВедомостиПрочие";
			ВедомостиПрочие.УстановитьДействие("ПриИзменении", "Подключаемый_ВедомостиПрочиеПриИзменении");

			НовыйЭлемент = Элементы.Добавить("ВедомостиПрочиеНомерСтроки", Тип("ПолеФормы"), ВедомостиПрочие);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВедомостиПрочие.НомерСтроки";
			НовыйЭлемент.ФиксацияВТаблице = ФиксацияВТаблице.Лево;

			НовыйЭлемент = Элементы.Добавить("ВедомостиПрочиеПодразделение", Тип("ПолеФормы"), ВедомостиПрочие);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВедомостиПрочие.Ведомость";

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Получатель", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетныйСчет", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьРеквизитыПлательщика", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ВосстановлениеВДолжности

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВосстановлениеВДолжности") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтажиНеЗаданыГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособРасчетаАванса", "Заголовок", НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти

#Область ПогашениеЗаймаСотруднику

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПогашениеЗаймаСотруднику") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Сумма", "Подсказка", НСтр("ru = 'На 12 марта 2014 г. сумма задолженности составляет %3 тенге. В том числе: основной долг %4 тенге, проценты %5 тенге.'"));
			
		КонецЕсли;

#КонецОбласти

#Область ПростойСотрудников

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПростойСотрудников") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияКорректировкаВыплаты", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияГруппаЗначенияПоказателя1", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияГруппаЗначенияПоказателя2", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Информация", "Видимость", Ложь);
			
			Если Элементы.ПереключательВариантов.СписокВыбора.Количество() > 2 Тогда
				Элементы.ПереключательВариантов.СписокВыбора.Удалить(2); // Другая причина
			КонецЕсли;
			
			Если Элементы.ВариантыОтстранение.СписокВыбора.Количество() > 1 Тогда
				Элементы.ВариантыОтстранение.СписокВыбора[1].Представление = НСтр("ru = 'Оплачиваемое'"); // Отстранение
			КонецЕсли;
			
			СоздатьЭлементыРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, "ГруппаКолонокНачисленияМежрасчетныйПериод");
			
		КонецЕсли;

#КонецОбласти

#Область МатериальнаяПомощь

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("МатериальнаяПомощь") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			Элементы.Переместить(Элементы.НачисленияНДФЛ, Элементы.ГруппаКолонокНачисленияМежрасчетныйПериод, Элементы.НачисленияУдержания);
			Элементы.Переместить(Элементы.НачисленияКВыплате, Элементы.ГруппаКолонокНачисленияМежрасчетныйПериод);
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияСкидкаПоВзносам", "Видимость", Ложь);
			
			СоздатьЭлементыРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, "ГруппаКолонокНачисленияМежрасчетныйПериод");
			
		КонецЕсли;

#КонецОбласти

#Область РегистрацияПереработок

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РегистрацияПереработок") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиВсего", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиСверхурочно2", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область КомпенсацияЗаЗадержкуЗарплаты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("КомпенсацияЗаЗадержкуЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РегистрироватьДоходыСтраховыхВзносов", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РегистрироватьКакОблагаемыйНДФЛДоход", "Видимость", Ложь);
			КомментарийМежрасчетнойВыплатыВидимость = (Форма.Объект.ПорядокВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Межрасчет
														ИЛИ Форма.Объект.ПорядокВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Аванс);
			
			НовыйЭлемент = Элементы.Добавить("КомментарийМежрасчетнойВыплаты", Тип("ДекорацияФормы"), Элементы.ВыплатаГруппа);
			НовыйЭлемент.Вид		= ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок	= НСтр("ru = 'Компенсация выплачивается в пределах начисленных сумм, удержание налогов и взносов будет произведено позже в документе окончательного расчета.'");
			НовыйЭлемент.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
			НовыйЭлемент.Видимость	= КомментарийМежрасчетнойВыплатыВидимость;
			
			НовыйЭлемент = Элементы.Вставить("ВидДохода", Тип("ПолеФормы"), Элементы.ШапкаОсновное, Элементы.ПериодВзаиморасчетов);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВидДохода";
			МассивПараметровВыбора = Новый Массив();
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.ЯвляетсяЛьготой", Ложь);
			МассивПараметровВыбора.Добавить(ПараметрВыбора);
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.СпособВыполненияНачисления", Перечисления.СпособыВыполненияНачислений.ПоОтдельномуДокументуДоОкончательногоРасчета);
			МассивПараметровВыбора.Добавить(ПараметрВыбора);
			ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидДокументаНачисления", Перечисления.ВидыДокументовНачисления.КомпенсацияЗаЗадержкуЗарплаты);
			МассивПараметровВыбора.Добавить(ПараметрВыбора);
			НовыйЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
			
		КонецЕсли;

#КонецОбласти

#Область АктПриемкиВыполненныхРаботОказанныхУслуг

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("АктПриемкиВыполненныхРаботОказанныхУслуг") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВычетПоНормативуИнфоНадпись", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодВычета", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодДохода", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодДоходаСтраховыеВзносы", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ДоговорРаботыУслуги

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ДоговорРаботыУслуги") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачалоДвиженийПФРГруппа", "Видимость", Ложь);
			
			НовыйЭлемент = Элементы.Вставить("ВидДохода", Тип("ПолеФормы"), Элементы.Основное, Элементы.НачалоДвиженийПФРГруппа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВидДохода";
			
		КонецЕсли;

#КонецОбласти

#Область НачислениеПоДоговорам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеПоДоговорам") Тогда
		
		ВидимостьКомандывСоздатьВедомостиПрочихДоходов =
				ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов");
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы.ГруппаКнопкиКоманднойПанели.ПодчиненныеЭлементы,
					"ФормаОбработкаСозданиеВедомостейПрочихДоходовСоздатьВедомостиПрочихДоходовПоДокументу",
					"Видимость",
					ВидимостьКомандывСоздатьВедомостиПрочихДоходов);
			Форма.ВидимостьКомандыСоздатьВедомостиПрочихДоходов = ВидимостьКомандывСоздатьВедомостиПрочихДоходов;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияПоДоговорам", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Удержания", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияПоДоговорамСкидкаПоВзносам", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетныйЛистокДоговорникиГПХ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасчетныйЛистокУдержания", "Видимость", Ложь);
			
			НовыйЭлемент = Элементы.Добавить("НачисленияПоДоговорамВидДохода", Тип("ПолеФормы"), Элементы.НачисленияПоДоговорам);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.НачисленияПоДоговорам.ВидДохода";
			
			СоздатьБлокРеквизитовНВОМногосотрудниковыхДокументов(Форма, "Страницы", "", Ложь);
			
			Элементы.НалогиВзносыОтчисления.УстановитьДействие("Выбор", "Подключаемый_НалогиВзносыОтчисленияВыбор");
			Элементы.НалогиВзносыОтчисления.УстановитьДействие("ПередУдалением", "Подключаемый_НалогиВзносыОтчисленияПередУдалением");
			Элементы.НалогиВзносыОтчисления.УстановитьДействие("ПослеУдаления", "Подключаемый_НалогиВзносыОтчисленияПослеУдаления");
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы.КоманднаяПанельФормы.ПодчиненныеЭлементы,
					"ФормаОбработкаСозданиеВедомостейПрочихДоходовСоздатьВедомостиПрочихДоходовПоДокументу",
					"Видимость",
					ВидимостьКомандывСоздатьВедомостиПрочихДоходов);
			
			Форма.УстановитьДействие("ПриОткрытии", "Подключаемый_ПриОткрытии");
		КонецЕсли;

#КонецОбласти

#Область ОплатаПоСреднемуЗаработку

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОплатаПоСреднемуЗаработку") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленоИтог", "ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Лево);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СреднийЗаработокГруппа", "Заголовок", НСтр("ru = 'Средний заработок инфо'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СреднийЗаработокГруппа", "ОтображатьЗаголовок", Истина);
			
			СоздатьЭлементыРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма);
			
		КонецЕсли;

#КонецОбласти

#Область ОтпускПоУходуЗаРебенком

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОтпускПоУходуЗаРебенком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыполнятьРасчетПоПравилам2010Года", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Пособия", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВзносы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДанныеДляФСС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКорректировкиВыплаты", "Видимость", Ложь);
			
			Элементы.Переместить(Элементы.РассчитатьЗарплатуГруппа, Элементы.ГруппаНачисления);
			Элементы.Переместить(Элементы.Номер, Элементы.Группа2);
			
			СоздатьБлокРеквизитовНВОМногосотрудниковыхДокументов(Форма, "Страницы", "", Ложь);
			
			Элементы.НалогиВзносыОтчисления.УстановитьДействие("Выбор", "Подключаемый_НалогиВзносыОтчисленияВыбор");
			Элементы.НалогиВзносыОтчисления.УстановитьДействие("ПередУдалением", "Подключаемый_НалогиВзносыОтчисленияПередУдалением");
			Элементы.НалогиВзносыОтчисления.УстановитьДействие("ПослеУдаления", "Подключаемый_НалогиВзносыОтчисленияПослеУдаления");
			
		КонецЕсли;

#КонецОбласти

#Область ПереводКДругомуРаботодателю

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПереводКДругомуРаботодателю") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНадписьИсходящаяСправкаОЗаработкеДляРасчетаПособий", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНадписьВходящаяСправкаОЗаработкеДляРасчетаПособий", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособРасчетаАванса", "Заголовок", НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти

#Область ПогашениеЗадолженностиПоВзысканиям

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПогашениеЗадолженностиПоВзысканиям") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияСумма", "Заголовок", НСтр("ru = 'тенге'"));
			
		КонецЕсли;

#КонецОбласти

#Область ДоговорАвторскогоЗаказа

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ДоговорАвторскогоЗаказа") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВычетПоНормативуИнфоНадпись", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачалоДвиженийПФРГруппа", "Видимость", Ложь);
			
			НовыйЭлемент = Элементы.Вставить("ВидДохода1", Тип("ПолеФормы"), Элементы.Основное, Элементы.НачалоДвиженийПФРГруппа);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ВидДохода";
			
		КонецЕсли;

#КонецОбласти

#Область ОтражениеЗарплатыВБухучете

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ОтражениеЗарплатыВБухучете")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("ОтражениеЗарплатыВФинансовомУчете") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНачисленныйНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленнаяЗарплатаИВзносыСтатьяРасходов", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдержаннаяЗарплатаСтатьяРасходов", "Видимость", Ложь);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленнаяЗарплатаИВзносыРезервБУ", "Видимость", Ложь);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленнаяЗарплатаИВзносыРезервНУ", "Видимость", Ложь);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатаЗаСчетРезерваРезервБУ", "Видимость", Ложь);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатаЗаСчетРезерваРезервНУ", "Видимость", Ложь);
			
			Элементы = Форма.Элементы;
			
			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ЕП");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("ООСМС");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ОППВ");
			
			Элементы = Форма.Элементы;
			ГруппаНачисленнаяЗарплатаИВзносы = Элементы.НачисленнаяЗарплатаИВзносы;
			ГруппаВыплатаЗаСчетРезерва = Элементы.ВыплатаЗаСчетРезерва;
			
			Для Каждого ВидНВО Из ВидыНВО Цикл

				НовыйЭлемент = Элементы.Добавить("НачисленнаяЗарплатаИВзносы" + ВидНВО, Тип("ПолеФормы"), ГруппаНачисленнаяЗарплатаИВзносы);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным 		= "Объект.НачисленнаяЗарплатаИВзносы." + ВидНВО;
				НовыйЭлемент.ПутьКДаннымПодвала	= "Объект.НачисленнаяЗарплатаИВзносы.Итог" + ВидНВО;
				НовыйЭлемент.Ширина 			= 10;
				
				Если НЕ ВидНВО = "ЕП" Тогда
					НовыйЭлемент = Элементы.Добавить("ВыплатаОтпусковЗаСчетРезерва" + ВидНВО, Тип("ПолеФормы"), ГруппаВыплатаЗаСчетРезерва);
					НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
					НовыйЭлемент.ПутьКДанным 		= "Объект.ВыплатаЗаСчетРезерва." + ВидНВО;
					НовыйЭлемент.ПутьКДаннымПодвала	= "Объект.ВыплатаЗаСчетРезерва.Итог" + ВидНВО;
					НовыйЭлемент.Ширина 			= 10;
				КонецЕсли;
				
			КонецЦикла;
			
			НовыйЭлемент = Элементы.Добавить("НачисленнаяЗарплатаИВзносыРегистрацияВНалоговомОргане", Тип("ПолеФормы"), ГруппаНачисленнаяЗарплатаИВзносы);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.НачисленнаяЗарплатаИВзносы.РегистрацияВНалоговомОргане";
			НовыйЭлемент.Ширина 			= 10;
			
			ГруппаРегламентированныеУдержания = Элементы.Вставить("ГруппаРегламентированныеУдержания", Тип("ГруппаФормы"), Элементы.Страницы, Элементы.ГруппаУдержаннаяЗарплата);
			ГруппаРегламентированныеУдержания.Вид = ВидГруппыФормы.Страница;
			ГруппаРегламентированныеУдержания.Заголовок = НСтр("ru = 'Удержания (регл)'"); 
					
			ГруппаПеняПоВзносамИОтчислениям = Элементы.Добавить("ГруппаПеняПоВзносамИОтчислениям", Тип("ГруппаФормы"), Элементы.Страницы);
			ГруппаПеняПоВзносамИОтчислениям.Вид = ВидГруппыФормы.Страница;
			ГруппаПеняПоВзносамИОтчислениям.Заголовок = НСтр("ru = 'Пеня по взносам, отчислениям и платежам'"); 
			
			РегламентированныеУдержания = Элементы.Добавить("РегламентированныеУдержания", Тип("ТаблицаФормы"), ГруппаРегламентированныеУдержания);
			РегламентированныеУдержания.ПутьКДанным = "Объект.РегламентированныеУдержания";

			НовыйЭлемент = Элементы.Добавить("РегламентированныеУдержанияНомерСтроки", Тип("ПолеФормы"), РегламентированныеУдержания);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.РегламентированныеУдержания.НомерСтроки";
			НовыйЭлемент.ФиксацияВТаблице = ФиксацияВТаблице.Лево;

			НовыйЭлемент = Элементы.Добавить("РегламентированныеУдержанияФизическоеЛицо", Тип("ПолеФормы"), РегламентированныеУдержания);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.РегламентированныеУдержания.ФизическоеЛицо";
			НовыйЭлемент.ФиксацияВТаблице = ФиксацияВТаблице.Лево;

			НовыйЭлемент = Элементы.Добавить("РегламентированныеУдержанияПодразделение", Тип("ПолеФормы"), РегламентированныеУдержания);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.РегламентированныеУдержания.Подразделение";

			НовыйЭлемент = Элементы.Добавить("РегламентированныеУдержанияВидОперацииНалогиВзносы", Тип("ПолеФормы"), РегламентированныеУдержания);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.РегламентированныеУдержания.ВидОперацииНалогиВзносы";

			НовыйЭлемент = Элементы.Добавить("РегламентированныеУдержанияСуммаНалогаВзноса", Тип("ПолеФормы"), РегламентированныеУдержания);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.РегламентированныеУдержания.СуммаНалогаВзноса";

			НовыйЭлемент = Элементы.Добавить("РегламентированныеУдержанияРегистрацияВНалоговомОргане", Тип("ПолеФормы"), РегламентированныеУдержания);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.РегламентированныеУдержания.РегистрацияВНалоговомОргане";
			
			ПеняПоВзносамИОтчислениям = Элементы.Добавить("ПеняПоВзносамИОтчислениям", Тип("ТаблицаФормы"), ГруппаПеняПоВзносамИОтчислениям);
			ПеняПоВзносамИОтчислениям.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям";
			
			НовыйЭлемент = Элементы.Добавить("ПеняПоВзносамИОтчислениямНомерСтроки", Тип("ПолеФормы"), ПеняПоВзносамИОтчислениям);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям.НомерСтроки";
			НовыйЭлемент.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
			
			НовыйЭлемент = Элементы.Добавить("ПеняПоВзносамИОтчислениямФизическоеЛицо", Тип("ПолеФормы"), ПеняПоВзносамИОтчислениям);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям.ФизическоеЛицо";
			НовыйЭлемент.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
			
			НовыйЭлемент = Элементы.Добавить("ПеняПоВзносамИОтчислениямПодразделение", Тип("ПолеФормы"), ПеняПоВзносамИОтчислениям);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям.Подразделение";
			
			НовыйЭлемент = Элементы.Добавить("ПеняПоВзносамИОтчислениямВидПлатежа", Тип("ПолеФормы"), ПеняПоВзносамИОтчислениям);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям.ВидПлатежа";
			
			НовыйЭлемент = Элементы.Добавить("ПеняПоВзносамИОтчислениямВидОперации", Тип("ПолеФормы"), ПеняПоВзносамИОтчислениям);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям.ВидОперации";

			НовыйЭлемент = Элементы.Добавить("ПеняПоВзносамИОтчислениямСумма", Тип("ПолеФормы"), ПеняПоВзносамИОтчислениям);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям.Сумма";
			
			НовыйЭлемент = Элементы.Добавить("ПеняПоВзносамИОтчислениямСпособОтраженияЗарплатыВБухучете", Тип("ПолеФормы"), ПеняПоВзносамИОтчислениям);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.ПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете";
					
		КонецЕсли;

#КонецОбласти

#Область РегистрацияПрочихДоходов

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РегистрацияПрочихДоходов") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НовыйЭлемент = Элементы.Добавить("НачисленияУдержанияВзносыЗаполнитьПлановымДоходом", Тип("КнопкаФормы"), Элементы.КомандыНачисления);
			НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			НовыйЭлемент.ИмяКоманды = "ЗаполнитьЕжемесячнымДоходомИП";
			
			Элементы.Переместить(Элементы.НачисленияУдержанияВзносыУдержано, Элементы.НачисленияУдержанияВзносы, Элементы.НачисленияКВыплате);

			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ВОСМС");
			ВидыНВО.Добавить("ИПН");
			ВидыНВО.Добавить("ОПВ");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ООСМС");

			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				НовыйЭлемент = Элементы.Вставить("Начисления" + ВидНВО, Тип("ПолеФормы"), Элементы.НачисленияУдержанияВзносы, Элементы.НачисленияУдержанияВзносыУдержано);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
				НовыйЭлемент.ПутьКДанным 		= "Объект.НачисленияУдержанияВзносы." + ВидНВО;
				НовыйЭлемент.ПутьКДаннымПодвала	= "Итог" + ВидНВО;
				НовыйЭлемент.Формат 			= "ЧДЦ=2; ЧН=0,00";
				НовыйЭлемент.Ширина 			= 10;
				НовыйЭлемент.Гиперссылка 		= Истина;
				НовыйЭлемент.ГиперссылкаЯчейки  = Истина;
				НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ТекстИнформационнойНадписи;
				
				Элемент = Форма.УсловноеОформление.Элементы.Добавить();
				
				ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Начисления" + ВидНВО);
				
				ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учитывать" + ВидНВО);
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = Ложь;

				Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
				
			КонецЦикла;

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияУдержанияВзносыСкидкаПоВзносам", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаПросмотрВзносов", "Видимость", Ложь);
			
		КонецЕсли;
			
#КонецОбласти

#Область ВыплатаБывшимСотрудникам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВыплатаБывшимСотрудникам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ВОСМС");
			ВидыНВО.Добавить("ИПН");
			ВидыНВО.Добавить("ОПВ");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ООСМС");

			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				НовыйЭлемент = Элементы.Вставить("Начисления" + ВидНВО, Тип("ПолеФормы"), Элементы.НачисленияУдержанияВзносы, Элементы.НачисленияУдержано);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
				НовыйЭлемент.ПутьКДанным 		= "Объект.НачисленияУдержанияВзносы." + ВидНВО;
				НовыйЭлемент.ПутьКДаннымПодвала	= "Итог" + ВидНВО;
				НовыйЭлемент.Формат 			= "ЧДЦ=2; ЧН=0,00";
				НовыйЭлемент.Ширина 			= 10;
				НовыйЭлемент.Гиперссылка 		= Истина;
				НовыйЭлемент.ГиперссылкаЯчейки  = Истина;
				НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ТекстИнформационнойНадписи;
				
				Элемент = Форма.УсловноеОформление.Элементы.Добавить();
				
				ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Начисления" + ВидНВО);
				
				ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Учитывать" + ВидНВО);
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = Ложь;

				Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

			КонецЦикла;

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияУдержанияВзносыСкидкаПоВзносам", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаПросмотрВзносов", "Видимость", Ложь);
			
		КонецЕсли;
			
#КонецОбласти

#Область ДивидендыФизическимЛицам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ДивидендыФизическимЛицам")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеДивидендов") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда

			Элементы.Начисления.УстановитьДействие("Выбор", "Подключаемый_НачисленияВыбор");
			
			НовыйЭлемент = Элементы.Вставить("НачисленияВидДивидендов", Тип("ПолеФормы"), Элементы.Начисления, Элементы.НачисленияНачислено);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Начисления.ВидДивидендов";
			Элементы.НачисленияВидДивидендов.УстановитьДействие("ПриИзменении", "Подключаемый_НачисленияВидДивидендовПриИзменении");
			
			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("ИПН");

			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				НовыйЭлемент = Элементы.Вставить("Начисления" + ВидНВО, Тип("ПолеФормы"), Элементы.Начисления, Элементы.НачисленияВычетПоНДФЛ);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
				НовыйЭлемент.ПутьКДанным 		= "Объект.Начисления." + ВидНВО;
				НовыйЭлемент.ПутьКДаннымПодвала	= "Итог" + ВидНВО;
				НовыйЭлемент.Формат 			= "ЧДЦ=2; ЧН=0,00";
				НовыйЭлемент.Ширина 			= 10;
				НовыйЭлемент.Гиперссылка 		= Истина;
				НовыйЭлемент.ГиперссылкаЯчейки  = Истина;
				НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ТекстИнформационнойНадписи;
				
			КонецЦикла;

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияНалогНаПрибыльКЗачету", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаПросмотрВзносов", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СправкиПриУвольненииСтраница", "Видимость", Ложь);
			
		КонецЕсли;
			
#КонецОбласти

#Область Увольнение

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("Увольнение")
		ИЛИ ДополнительныеПараметры.ИмяОбъекта = ВРег("УвольнениеСписком") И ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСтроки") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента")
			ИЛИ ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСтроки") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Сверхурочно2", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдержанНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДенежноеСодержаниеИнфо", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПерерасчетПособийИтог", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЕНВД", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПособия", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВзносы", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНачисленияПерерасчет", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПособияПерерасчетВидЗанятости", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКорректировкиВыплаты", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СведенияТрудовойКнижкиСФлажкомГруппа", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СправкиПриУвольнении", "Видимость", Ложь);
			
			ГруппаИсчисленоГруппа = Элементы.Вставить("ИсчисленоГруппа", Тип("ГруппаФормы"), Элементы.Результаты, Элементы.ДенежноеСодержаниеИнфо);
			ГруппаИсчисленоГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаИсчисленоГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаИсчисленоГруппа.Объединенная = Ложь;
			ГруппаИсчисленоГруппа.Заголовок = НСтр("ru = 'Исчислено'");
			ГруппаИсчисленоГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			
			НовыйЭлемент = Элементы.Добавить("ИсчисленоИтог", Тип("ПолеФормы"), ГруппаИсчисленоГруппа);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "ИсчисленоИтог";
			НовыйЭлемент.ТолькоПросмотр		= Истина;
			НовыйЭлемент.Ширина 			= 10;

			СоздатьЭлементыРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма, "УдержанНДФЛ", Истина, "Удержано", Ложь);
			СоздатьБлокРеквизитовНВОМногосотрудниковыхДокументов(Форма, "НачисленияУдержания", "ГруппаВзносы", Ложь);
			
			ГруппаПерерасчетыСреднийЗаработок = Элементы.Вставить("ПерерасчетыСреднийЗаработок", Тип("ГруппаФормы"), Элементы.Результаты, Элементы.ДенежноеСодержаниеИнфо);
			ГруппаПерерасчетыСреднийЗаработок.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаПерерасчетыСреднийЗаработок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
			ГруппаПерерасчетыСреднийЗаработок.Объединенная = Ложь;
			ГруппаПерерасчетыСреднийЗаработок.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаПерерасчетыСреднийЗаработок.ОтображатьЗаголовок = Ложь;
			
			Элементы.Переместить(Элементы.ПерерасчетГруппа, ГруппаПерерасчетыСреднийЗаработок);
			Элементы.Переместить(Элементы.СреднийЗаработокИнфо, ГруппаПерерасчетыСреднийЗаработок);

		КонецЕсли;

#КонецОбласти

#Область УвольнениеСписком

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("УвольнениеСписком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			НовыйЭлемент = Элементы.Вставить("ИтогУдержаноРегл", Тип("ПолеФормы"), Элементы.ИтогиДокументаГруппа, Элементы.ИтогоНДФЛ);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "ИтогУдержаноРегл";
			НовыйЭлемент.Заголовок			= НСтр("ru = 'Удержано (регл.)'");
			НовыйЭлемент.ТолькоПросмотр		= Истина;
			НовыйЭлемент.Ширина 			= 10;
			
			НовыйЭлемент = Элементы.Вставить("ИтогИсчисленоРегл", Тип("ПолеФормы"), Элементы.ИтогиДокументаГруппа, Элементы.ИтогоНДФЛ);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "ИтогИсчисленоРегл";
			НовыйЭлемент.Заголовок			= НСтр("ru = 'Исчислено (регл.)'");
			НовыйЭлемент.ТолькоПросмотр		= Истина;
			НовыйЭлемент.Ширина 			= 10;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИтогоНДФЛ", "Видимость", Ложь);

		КонецЕсли;
		
#КонецОбласти

#Область НачислениеЗаПервуюПоловинуМесяца

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеЗаПервуюПоловинуМесяца") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНДФЛ", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКорректировкиВыплаты", "Видимость", Ложь);
			
			СоздатьБлокРеквизитовНВОМногосотрудниковыхДокументов(Форма, "Страницы", "", Ложь);
			
			Элементы.НалогиВзносыОтчисления.УстановитьДействие("Выбор", "Подключаемый_НалогиВзносыОтчисленияВыбор");
			
		КонецЕсли;

#КонецОбласти

#Область РегламентированныйОтчет

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РегламентированныйОтчет") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборПоФормеИИФНС", "Заголовок", НСтр("ru = 'Группа отбор по форме и налоговому органу'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборПоФормеИИФНС", "Подсказка", НСтр("ru = 'Группа отбор по форме и налоговому органу'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборПоИФНС", "Заголовок", НСтр("ru = 'Группа отбор по налоговому органу'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборПоИФНС", "Подсказка", НСтр("ru = 'Группа отбор по налоговому органу'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокВидовНО", "Заголовок", НСтр("ru = 'Налоговый орган'"));
			
		КонецЕсли;

#КонецОбласти

#Область ВыгрузкаРегламентированныхОтчетов
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВыгрузкаРегламентированныхОтчетов") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			МассивСкрываемыхКоманд = Новый Массив;
			МассивСкрываемыхКоманд.Добавить("ПроверитьОтчет");
			МассивСкрываемыхКоманд.Добавить("ЗашифроватьИОтправить");
			СкрытьОбъектыКоманд(Форма, МассивСкрываемыхКоманд);
			
		КонецЕсли;

#КонецОбласти

#Область НачислениеОценочныхОбязательствПоОтпускам

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачислениеОценочныхОбязательствПоОтпускам") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			СоздатьЭлементыРеквизитовНВОРезервы(Форма, "РасчетРезерваОтпусков");
			
		КонецЕсли;

#КонецОбласти

#Область РезервыПоОплатеТруда

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РезервыПоОплатеТруда") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			СоздатьЭлементыРеквизитовНВОРезервы(Форма);
			
			ВидыНВО = Новый Массив;
			ВидыНВО.Добавить("СО");
			ВидыНВО.Добавить("СН");
			ВидыНВО.Добавить("ОтчисленияОСМС");
			ВидыНВО.Добавить("ОПВР");
			ВидыНВО.Добавить("ОППВ");
			
			Для Каждого ВидНВО Из ВидыНВО Цикл
				
				// Результат
				НовыйЭлемент = Элементы.Вставить("ВзносыСумма" + ВидНВО, Тип("ПолеФормы"), Элементы.ВзносыГруппаРезультаты, Элементы.ВзносыГруппаРезультатСтраховыеВзносы);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным 		= "Объект.Взносы.Сумма" + ВидНВО;
				НовыйЭлемент.ПутьКДаннымПодвала = "Объект.Взносы.ИтогСумма" + ВидНВО;
                НовыйЭлемент.Ширина 			= 12;
                НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
				НовыйЭлемент.Заголовок 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1", СтрЗаменить(ВидНВО, "ОтчисленияОСМС", "ООСМС"));
				
                // Показатели
				ГруппаНВО = Элементы.Вставить("ВзносыГруппа" + ВидНВО, Тип("ГруппаФормы"), Элементы.ВзносыГруппаПоказателиРасчета, Элементы.ВзносыГруппаСтраховыеВзносы);
				ГруппаНВО.Группировка 			= ГруппировкаКолонок.Горизонтальная; 
				ГруппаНВО.Заголовок 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1", СтрЗаменить(ВидНВО, "ОтчисленияОСМС", "ООСМС")); 
		
				НовыйЭлемент = Элементы.Добавить("Взносы" + ВидНВО, Тип("ПолеФормы"), ГруппаНВО);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным 		= "Объект.Взносы." + ВидНВО;
				НовыйЭлемент.ПутьКДаннымПодвала = "Объект.Взносы.Итог" + ВидНВО;
				НовыйЭлемент.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 (расч. месяц)", СтрЗаменить(ВидНВО, "ОтчисленияОСМС", "ООСМС")); 
                НовыйЭлемент.Ширина 			= 12;
                НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;

				ГруппаВзносыГруппа = Элементы.Добавить("ВзносыГруппаСтавка" + ВидНВО, Тип("ГруппаФормы"), ГруппаНВО);
				ГруппаВзносыГруппа.Группировка 	= ГруппировкаКолонок.Горизонтальная; 
				
				НовыйЭлемент = Элементы.Добавить("ВзносыТекущаяСтавка" + ВидНВО, Тип("ПолеФормы"), ГруппаВзносыГруппа);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным 		= "Объект.Взносы.ТекущаяСтавка" + ВидНВО;
				НовыйЭлемент.Заголовок 			= "%"; 
                НовыйЭлемент.Ширина 			= 5;
                НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
                НовыйЭлемент.ОтображатьВШапке = Ложь;
				
				НовыйЭлемент = Элементы.Добавить("ВзносыНормативОтчисленийВРезерв" + ВидНВО, Тип("ПолеФормы"), ГруппаВзносыГруппа);
				НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.ПутьКДанным 		= "Объект.Взносы.НормативОтчисленийВРезерв" + ВидНВО;
				НовыйЭлемент.Заголовок 			= "%"; 
                НовыйЭлемент.Ширина 			= 5;
                НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
                НовыйЭлемент.ОтображатьВШапке = Ложь;
				
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВзносы", "Заголовок", НСтр("ru = 'Налоги, взносы, отчисления'"));

		КонецЕсли;

#КонецОбласти

#Область ПодтверждениеЗачисленияЗарплаты
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ПодтверждениеЗачисленияЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда

  			Элементы.Сотрудники.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_СотрудникиПередНачаломДобавления");
			Элементы.СотрудникиФизическоеЛицо.УстановитьДействие("ПриИзменении", "Подключаемый_СотрудникиФизическоеЛицоПриИзменении");

		КонецЕсли;
		
#КонецОбласти

#Область ДоходВНатуральнойФорме
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ДоходВНатуральнойФорме") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Удержано", "Видимость", Ложь);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленияСкидкаПоВзносам", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область НачальнаяШтатнаяРасстановка
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НачальнаяШтатнаяРасстановка") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиПредставлениеАванса", "Заголовок", НСтр("ru = 'Аванс'"));
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВыбораЕжегодныхОтпусков") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЕжегодныеОтпускаДнейОтсутствия", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ВводНачальныхОстатковОтпусков
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВводНачальныхОстатковОтпусков") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЕжегодныеОтпускаДнейОтсутствия", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ВозвратИзОтпускаПоУходуЗаРебенком
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВозвратИзОтпускаПоУходуЗаРебенком") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособРасчетаАванса", "Заголовок", НСтр("ru = 'Аванс'"));
			
		КонецЕсли;

#КонецОбласти

#Область СведенияОНезачисленныхВзносахОтчислениях
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СведенияОНезачисленнойЗарплате") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда

			НовыйЭлемент = Элементы.Вставить("Подразделение", Тип("ПолеФормы"), Элементы.Основное, Элементы.Ведомость);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Объект.Подразделение";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПодразделениеПриИзменении");
			
			Элементы.Организация.УстановитьДействие("ПриИзменении", "Подключаемый_ОрганизацияПриИзменении");
			
		КонецЕсли;

#КонецОбласти

#Область СторнированиеНачислений
		
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СторнированиеНачислений") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоначисленияИПерерасчетыСкидкаПоВзносам", "Видимость", Ложь);
			
		КонецЕсли;

#КонецОбласти

#Область ДанныеДляРасчетаЗарплаты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ДанныеДляРасчетаЗарплаты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыполненныеРаботыПоСотрудникам", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеСводно", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеДетально", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыполненныеРаботы", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсполнителиРабот", "ПоложениеСтрокиПоиска", ПоложениеСтрокиПоиска.Авто);

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРуб", "Заголовок",  НСтр("ru = 'тг.'"));
			
		КонецЕсли;

#КонецОбласти

	КонецЕсли;
  
	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииЧтенииДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область ИсторияРегистрацийВНалоговомОргане

	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("ИсторияРегистрацийВНалоговомОргане") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеИстории") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НаборЗаписейРегистрацияВНалоговомОрганеКод", "Заголовок", НСтр("ru = 'Код налогового органа'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НаборЗаписейРегистрацияВНалоговомОрганеНаименование", "Заголовок", НСтр("ru = 'Наименование налогового органа'"));
			
		КонецЕсли;

#КонецОбласти
		
#Область МинимальнаяОплатаТрудаРФ

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("МинимальнаяОплатаТрудаРФ") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Период", "Заголовок", НСтр("ru = 'Дата, на которую установлен МЗП'"));
			
		КонецЕсли;

#КонецОбласти

#Область КлассыУсловийТрудаПоДолжностям

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("КлассыУсловийТрудаПоДолжностям") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			НовыйЭлемент = Элементы.Вставить("ОсуществляютсяОППВ", Тип("ПолеФормы"), Элементы.Список, Элементы.КлассУсловийТруда);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.ОсуществляютсяОППВ";
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеИстории") Тогда
			
			НовыйЭлемент = Элементы.Вставить("ОсуществляютсяОППВ", Тип("ПолеФормы"), Элементы.НаборЗаписей, Элементы.НаборЗаписейКлассУсловийТруда);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НаборЗаписей.ОсуществляютсяОППВ";
			
		КонецЕсли;

#КонецОбласти

#Область НастройкиРасчетаРезервовОтпусков

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НастройкиРасчетаРезервовОтпусков") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеИстории") Тогда
			
			НовыйЭлемент = Элементы.Добавить("КоэффициентРасчетаОплачиваемыхДнейОтпуска", Тип("ПолеФормы"), Элементы.НаборЗаписей);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НаборЗаписей.КоэффициентРасчетаОплачиваемыхДнейОтпуска";
			
		КонецЕсли;

#КонецОбласти

#Область СведенияОбИнвалидностиФизическихЛиц

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("СведенияОбИнвалидностиФизическихЛиц") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Период", "Подсказка", НСтр("ru = 'Период'"));
			
			НовыйЭлемент = Элементы.Вставить("ФизическоеЛицо", Тип("ПолеФормы"), Элементы.Список, Элементы.КолонкиИнвалидности);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.ФизическоеЛицо";
			
			НовыйЭлемент = Элементы.Вставить("ОтношениеКИнвалидности", Тип("ПолеФормы"), Элементы.КолонкиСправки, Элементы.ГруппаИнвалидности);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.ОтношениеКИнвалидности";
			
			НовыйЭлемент = Элементы.Вставить("ИсчислятьОПВ", Тип("ПолеФормы"), Элементы.КолонкиСправки, Элементы.ГруппаИнвалидности);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.ИсчислятьОПВ";
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеИстории") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КолонкиИнвалидности", "Заголовок", НСтр("ru = 'Инвалидность с ... по'"));
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НаборЗаписейПериод", "Подсказка", НСтр("ru = 'Период'"));
			
		КонецЕсли;

#КонецОбласти

#Область ВоинскийУчет

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВоинскийУчет") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеИстории") Тогда
			
			НовыйЭлемент = Элементы.Вставить("НаборЗаписейГруппаУчета", Тип("ПолеФормы"), Элементы.НаборЗаписей, Элементы.НаборЗаписейКатегорияЗапаса);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "НаборЗаписей.ГруппаУчета";
			
		КонецЕсли;

#КонецОбласти

#Область ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ДанныеОВремениДляРасчетаСреднегоОбщийКорректировка") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			НовыйЭлемент = Элементы.Вставить("ОтработаноЧасовШестидневка", Тип("ПолеФормы"), Элементы.Список, Элементы.ОтработаноЧасовПятидневка);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.ОтработаноЧасовШестидневка";
			
			Элементы.Переместить(Элементы.ОтработаноДнейПятидневка, Элементы.Список, Элементы.ОтработаноДнейШестидневка);
			
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЗаписи") Тогда
			
			НовыйЭлемент = Элементы.Вставить("ОтработаноЧасовШестидневка", Тип("ПолеФормы"), , Элементы.ОтработаноДнейКалендарных);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Запись.ОтработаноЧасовШестидневка";
			
			Элементы.Переместить(Элементы.ОтработаноДнейШестидневка, Форма, НовыйЭлемент);
			
		КонецЕсли;

#КонецОбласти

#Область АдресныеОбъекты

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("АдресныеОбъекты") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ЗагрузкаАдресногоКлассификатора") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗагружатьИсториюИзмененийАдресныхОбъектов", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗагружатьИсториюИзмененийАдресныхОбъектов", "Доступность", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗагрузкиССайта", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗагрузкиССайта", "Доступность", Ложь);

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекстОписанияЗагрузкиРасширеннаяПодсказка", "Заголовок", НСтр("ru = 'Загрузка адресного классификатора может занять длительное время, которое зависит от количества выбранных регионов.'"));

		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ОчисткаАдресногоКлассификатора") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекстОписанияОчисткиРасширеннаяПодсказка", "Заголовок", НСтр("ru = 'Очистка адресного классификатора может занять длительное время, которое зависит от количества выбранных регионов.'"));

		КонецЕсли;
		
#КонецОбласти

#Область КоэффициентИндексацииЗаработка

	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("КоэффициентИндексацииЗаработка") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокументовИндексацииСотрудника") Тогда
			
			НовыйЭлемент = Элементы.Добавить("ДатаИндексации", Тип("ПолеФормы"), Элементы.Список);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.ДатаИндексации";
			
			НовыйЭлемент = Элементы.Добавить("Коэффициент", Тип("ПолеФормы"), Элементы.Список);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.Коэффициент";
			
			НовыйЭлемент = Элементы.Добавить("КоэффициентИндексации", Тип("ПолеФормы"), Элементы.Список);
			НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "Список.КоэффициентИндексации";
			
		КонецЕсли;

#КонецОбласти

	КонецЕсли;
  
	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииЧтенииРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область РедактированиеРегистрацииВНалоговомОргане

	Если ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеРегистрацииВНалоговомОргане") Тогда
		НовыйЭлемент = Элементы.Вставить("ИНН", Тип("ПолеФормы"), Элементы.ГруппаКППКодВертикальная, Элементы.КПП);
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 		= "РегистрацияВНалоговомОргане.ИНН";
        НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_ИННОкончаниеВводаТекста");
			
#КонецОбласти

#Область ВводДанныхДляРасчетаСреднегоЗаработкаОбщий

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ВводДанныхДляРасчетаСреднегоЗаработкаОбщий") Тогда
		
		НовыйЭлемент = Элементы.Добавить("СреднийЗаработокИнформационныйТекст", Тип("ДекорацияФормы"), Элементы.СреднийЗаработокЕдинственныйСпособ);
		НовыйЭлемент.Вид 				= ВидДекорацииФормы.Надпись;
		НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ПоясняющийТекст;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДатаУчетаРабочегоВремени", "Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);

#КонецОбласти
		
#Область ОрганизацияУчетнаяПолитика

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ОрганизацияУчетнаяПолитика") Тогда

		ОбработатьСобытияФормПриСозданииЧтенииОбщаяФормаОрганизацияУчетнаяПолитика(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

#КонецОбласти

#Область ВводМестаРождения

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ВводМестаРождения") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОсобоеМестоРождения", "Видимость", Ложь);

#КонецОбласти

#Область НастройкиРегистрацииСобытийДоступаКПерсональнымДанным

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("НастройкиРегистрацииСобытийДоступаКПерсональнымДанным") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРегистрацияСобытияДоступНадпись", "Заголовок", НСтр("ru = 'Для выбранных областей данных выполняется регистрация событий доступа в соответствии с требованиями закона Республики Казахстан от 21 мая 2013 года N 94-V ""О персональных данных и их защите"".'"));

#КонецОбласти

#Область ОрганизацияВоинскийУчет

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ОрганизацияВоинскийУчет") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРаботыПоОсуществлениюВоинскогоУчета", "Видимость", Ложь);

#КонецОбласти

#Область ОрганизацияНастройкиРасчетаРезервовОтпусков

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ОрганизацияНастройкиРасчетаРезервовОтпусков") Тогда
		
		Группа7 = Элементы.Добавить("Группа7", Тип("ГруппаФормы"), Элементы.Группа2);
		Группа7.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа7.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа7.ОтображатьЗаголовок = Ложь;
		
		НовыйЭлемент = Элементы.Добавить("Декорация4", Тип("ДекорацияФормы"), Группа7);
		
		НовыйЭлемент = Элементы.Добавить("КоэффициентРасчетаОплачиваемыхДнейОтпуска", Тип("ПолеФормы"), Группа7);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "НастройкиРасчетаРезервовОтпусков.КоэффициентРасчетаОплачиваемыхДнейОтпуска";

#КонецОбласти

#Область РедактированиеЗарплатыСтрокиВедомости

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеЗарплатыСтрокиВедомости") Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗарплатаВидДохода", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗарплатаСтатьяРасходов", "Видимость", Ложь);

#КонецОбласти
		
#Область РедактированиеВыплатыСтрокиВедомости

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеВыплатыСтрокиВедомости") Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыСтатьяРасходов", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыВидДохода", "Видимость", Ложь);

        НовыйЭлемент = Элементы.Добавить("ВыплатыПодразделение", Тип("ПолеФормы"), Элементы.Выплаты);
        НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным 		= "Выплаты.Подразделение";
        НовыйЭлемент.Заголовок 			= НСтр("ru = 'Подразделение'");
        НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыплатыПодразделениеПриИзменении");
        НовыйЭлемент.КнопкаВыбора = Истина;

        НовыйЭлемент = Элементы.Добавить("ВыплатыПериодВзаиморасчетовСтрокой", Тип("ПолеФормы"), Элементы.Выплаты);
        НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным 		= "Выплаты.ПериодВзаиморасчетовСтрокой";
        НовыйЭлемент.Заголовок 			= НСтр("ru = 'Период взаиморасчетов'");
        НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыплатыПериодВзаиморасчетовСтрокойПриИзменении");
        НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ВыплатыПериодВзаиморасчетовСтрокойНачалоВыбора");
        НовыйЭлемент.УстановитьДействие("Регулирование", "Подключаемый_ВыплатыПериодВзаиморасчетовСтрокойРегулирование");
        НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_ВыплатыПериодВзаиморасчетовСтрокойАвтоПодбор");
        НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_ВыплатыПериодВзаиморасчетовСтрокойОкончаниеВводаТекста");
        НовыйЭлемент.КнопкаВыбора = Истина;
        НовыйЭлемент.КнопкаРегулирования = Истина;
        
#КонецОбласти

#Область ФормаСтрокиДокументаИзмененияШтатногоРасписания

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСтрокиДокументаИзмененияШтатногоРасписания") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассУсловийТрудаИстория", "Заголовок", НСтр("ru = 'История изменения особенностей исчисления ПВ'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСпецоценкаУсловийТруда", "Заголовок", НСтр("ru = 'Особенности исчисления пенсионных взносов'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КлассыУсловийТрудаПоДолжностямПериод", "Заголовок", НСтр("ru = 'Условия труда установлены с'"));
		
		НовыйЭлемент = Элементы.Вставить("КлассыУсловийТрудаПоДолжностямОсуществляютсяОППВ", Тип("ПолеФормы"), Элементы.ГруппаСпецоценкаУсловийТрудаКлассыУсловийТруда, Элементы.КлассыУсловийТрудаПоДолжностямПериод);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "КлассыУсловийТрудаПоДолжностям.ОсуществляютсяОППВ";
		НовыйЭлемент.Заголовок = НСтр("ru = 'Осуществляются ОППВ за занятых на работах с вредными условиями труда'");
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;

#КонецОбласти
 
#Область РегламентированнаяОтчетность

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("РегламентированнаяОтчетность") Тогда
		
		Форма.Заголовок = НСтр("ru = 'Регламентированная отчетность'"); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПанельИнформацииСКнопкой", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаНовое", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаУведомления", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаПисьма", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаСверки", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаВходящие", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаЕГРЮЛ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаВходящие", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГиперссылкаСервисы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаНовое", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтчетыГруппаПроверка", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтатусГосорган", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаУведомления", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаПисьма", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаСверки", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаЕГРЮЛ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаВходящие", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаСервисы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьИнформацияОбОбновлениях", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьНастройкиМеханизмаОнлайнСервисовРО", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСкрытыхОбъектов", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДвухмерногоШтрихкода", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтчетовВРосстат", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкиЭлектронногоДокументооборота", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтчетыГруппаЗагрузитьИзФайла", "Видимость", Ложь);
		
		МассивСкрываемыхКоманд = Новый Массив;
		МассивСкрываемыхКоманд.Добавить("ПечатьОтчетШтрих");
		МассивСкрываемыхКоманд.Добавить("ПечатьПротоколовОтчетов");
		МассивСкрываемыхКоманд.Добавить("ПроверитьВыгрузку");
		МассивСкрываемыхКоманд.Добавить("ПереустановитьКомпонентыПечатиМашиночитаемыхФорм");
		МассивСкрываемыхКоманд.Добавить("ПроверитьВИнтернете");
		МассивСкрываемыхКоманд.Добавить("ПроверитьВИнтернетеУведомления");
		МассивСкрываемыхКоманд.Добавить("ОтправитьОтчет");
		МассивСкрываемыхКоманд.Добавить("ПроиндексироватьОбъекты");
		МассивСкрываемыхКоманд.Добавить("ПечатьПротоколовУведомлений");
		МассивСкрываемыхКоманд.Добавить("ЖурналОбменаСКонтролирующимиОрганами");
		МассивСкрываемыхКоманд.Добавить("ГрупповойРежим");
        МассивСкрываемыхКоманд.Добавить("ОтправитьПакетСДопДокументамиДляФНС");
        МассивСкрываемыхКоманд.Добавить("ПометитьПрочитанным");
		
		СкрытьОбъектыКоманд(Форма, МассивСкрываемыхКоманд);

		НовыйЭлемент = Элементы.Вставить("ОтчетыСтатусПриемаОтчетность1С", Тип("ПолеФормы"), Элементы.Отчеты, Элементы.ОтчетыКомментарий);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Отчеты.СтатусПриемаОтчетность1С";

		НовыйЭлемент = Элементы.Вставить("ОтчетыСтатусРазноскиОтчетность1С", Тип("ПолеФормы"), Элементы.Отчеты, Элементы.ОтчетыКомментарий);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Отчеты.СтатусРазноскиОтчетность1С";

		НовыйЭлемент = Элементы.Вставить("ОтчетыНомерУведомленияОтчетность1С", Тип("ПолеФормы"), Элементы.Отчеты, Элементы.ОтчетыКомментарий);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Отчеты.НомерУведомленияОтчетность1С";

		НовыйЭлемент = Элементы.Вставить("ОтчетыДатаУведомленияОтчетность1С", Тип("ПолеФормы"), Элементы.Отчеты, Элементы.ОтчетыКомментарий);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Отчеты.ДатаУведомленияОтчетность1С";

		// условное оформление
        УсловноеОформлениеОтчеты = Форма.Отчеты.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы;
		
		// ( СтатусПриемаОтчетность1С Не равно "Перечисление.СтатусыПриемаОтчетность1С.НеПринят" И СтатусПриемаОтчетность1С Не равно "Перечисление.СтатусыПриемаОтчетность1С.Принят" )
		ЭлементОформления = УсловноеОформлениеОтчеты.Добавить();
		
		ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СтатусПриемаОтчетность1С");
		
		ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусПриемаОтчетность1С");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыПриемаОтчетность1С.НеПринят;

		ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусПриемаОтчетность1С");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыПриемаОтчетность1С.Принят;

		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Отчетность1СКлиентСервер.ЦветСиний());

		// СтатусПриемаОтчетность1С Равно "Перечисление.СтатусыПриемаОтчетность1С.Принят"
		ЭлементОформления = УсловноеОформлениеОтчеты.Добавить();
		
		ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СтатусПриемаОтчетность1С");
		
		ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусПриемаОтчетность1С");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыПриемаОтчетность1С.Принят;

		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Отчетность1СКлиентСервер.ЦветЗеленый());

		// СтатусПриемаОтчетность1С Равно "Перечисление.СтатусыПриемаОтчетность1С.Принят"
		ЭлементОформления = УсловноеОформлениеОтчеты.Добавить();
		
		ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СтатусПриемаОтчетность1С");
		
		ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусПриемаОтчетность1С");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыПриемаОтчетность1С.НеПринят;

		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Отчетность1СКлиентСервер.ЦветКрасный());

		// СтатусРазноскиОтчетность1С Заполнено
		ЭлементОформления = УсловноеОформлениеОтчеты.Добавить();
		
		ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СтатусРазноскиОтчетность1С");
		
		ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусРазноскиОтчетность1С");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Отчетность1СКлиентСервер.ЦветСиний());

#КонецОбласти

#Область ПодробнееОРасчетеУдержаний

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ПодробнееОРасчетеУдержаний") Тогда

 		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПогашениеЗаймовГруппаМатериальнаяВыгода", "Видимость", Ложь);

#КонецОбласти

#Область РедактированиеСоставаНачисленийИУдержаний

	ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("РедактированиеСоставаНачисленийИУдержаний") Тогда

 		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособРасчетаАванса", "Заголовок", НСтр("ru = 'Аванс'"));

#КонецОбласти

	КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииЧтенииОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииПланаОбмена(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)

	Элементы = Форма.Элементы;

#Область СинхронизацияДанныхЧерезУниверсальныйФормат

    Если ДополнительныеПараметры.ИмяОбъекта = ВРег("СинхронизацияДанныхЧерезУниверсальныйФормат") Тогда
    
        Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаУзла") Тогда 
            Группа = Элементы.Добавить("ГруппаВыгружатьСДетализациейПоФизическимЛицам", Тип("ГруппаФормы"), Элементы.ГруппаПрочее);
            Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
            Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
            Группа.ОтображатьЗаголовок = Ложь;
            
            
            НовыйЭлемент = Элементы.Вставить("ВыгружатьСДетализациейПоФизическимЛицам", Тип("ПолеФормы"), Элементы.ГруппаВыгружатьСДетализациейПоФизическимЛицам);
            НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка; 
            НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
            НовыйЭлемент.ПутьКДанным 		= "Объект.ВыгружатьСДетализациейПоФизическимЛицам"; 
            НовыйЭлемент.Заголовок 			= НСтр("ru = 'Выгружать с детализацией по физическим лицам'");
            НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ВыгружатьСДетализациейПоФизическимЛицамПриИзменении");

            НовыйЭлемент = Элементы.Вставить("ВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы", Тип("ПолеФормы"), Элементы.ГруппаВыгружатьСДетализациейПоФизическимЛицам);
            НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка; 
            НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
            НовыйЭлемент.ПутьКДанным 		= "Объект.ВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы"; 
            НовыйЭлемент.Заголовок 			= НСтр("ru = 'Выгружать с детализацией по физическим лицам (незарплатные доходы)'");

            НовыйЭлемент = Элементы.Вставить("ПутьКМенеджеруОбмена", Тип("ПолеФормы"), Элементы.ГруппаСлужебнаяИнформацияПрочее);
            НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода; 
            НовыйЭлемент.ПутьКДанным 		= "Объект.ПутьКМенеджеруОбмена"; 
            НовыйЭлемент.Заголовок 			= НСтр("ru = 'Путь к менеджеру обмена'");
            НовыйЭлемент.КнопкаВыбора 		= Истина;
            НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_ПутьКМенеджеруОбменаНачалоВыбора");

            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРежимВыгрузкиПроводок", "Видимость", Ложь);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтправкаВедомостейОтчетов", "Видимость", Ложь);
       КонецЕсли;		
        
 #КонецОбласти
    
    КонецЕсли;

	МодификацияКонфигурацииЗУПКПереопределяемый.ОбработатьСобытияФормПриСозданииЧтенииПланаОбмена(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);

КонецПроцедуры

#Область УниверсальныеПроцедуры

Процедура СоздатьБлокРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов, ДобавитьРеквизитыНВОРаботодателя = Ложь, ПрефиксНВО = "", ДобавлятьКоманды = Истина)
	
	ВидыНВО = Новый Массив;
	ВидыНВО.Добавить(ПрефиксНВО + "ВОСМС");
	ВидыНВО.Добавить(ПрефиксНВО + "ИПН");
	ВидыНВО.Добавить(ПрефиксНВО + "ОПВ");
	ВидыНВО.Добавить(ПрефиксНВО + "ЕП");
	
	Если ДобавитьРеквизитыНВОРаботодателя Тогда
		ВидыНВО.Добавить("ИсчисленоСО");
		ВидыНВО.Добавить("ИсчисленоСН");
		ВидыНВО.Добавить("ИсчисленоООСМС");
		ВидыНВО.Добавить("ИсчисленоОППВ");
		ВидыНВО.Добавить("ИсчисленоЕП");
		ВидыНВО.Добавить("ИсчисленоОПВР");
	КонецЕсли;
	
	Для Каждого ВидНВО Из ВидыНВО Цикл
		
		НовыйРеквизит = Новый РеквизитФормы(ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)),,, Истина);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		Если ДобавлятьКоманды Тогда
			НоваяКоманда = Форма.Команды.Добавить("ПодробнееОРасчете" + ВидНВО);
			НоваяКоманда.Действие = "Подключаемый_ПодробнееОРасчете" + ВидНВО;
			НоваяКоманда.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подробнее о расчете %1'"), ВидНВО);
			НоваяКоманда.Картинка = БиблиотекаКартинок.Изменить;
			НоваяКоманда.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьБлокРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, МассивДобавляемыхРеквизитов)
	
	ВидыНВО = Новый Массив;
	ВидыНВО.Добавить("ВОСМС");
	ВидыНВО.Добавить("ИПН");
	ВидыНВО.Добавить("ОПВ");
	ВидыНВО.Добавить("ЕП");

	Для Каждого ВидНВО Из ВидыНВО Цикл
		
		НовыйРеквизит = Новый РеквизитФормы("Итог" + ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		НовыйРеквизит = Новый РеквизитФормы(ВидНВО, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), "Объект.Начисления", , Истина);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьБлокРеквизитовНВОМногосотрудниковыхДокументов(Форма, ИмяСтраницыФорма, ИмяЭлементаДляВставки, ДобавитьПредставлениеРазрешенныеВычеты = Истина)

	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(ИмяЭлементаДляВставки) Тогда
		ГруппаНалогиВзносыОтчисления = Элементы.Вставить("ГруппаНалогиВзносыОтчисления", Тип("ГруппаФормы"), Элементы[ИмяСтраницыФорма], Элементы[ИмяЭлементаДляВставки]);
	Иначе
		ГруппаНалогиВзносыОтчисления = Элементы.Добавить("ГруппаНалогиВзносыОтчисления", Тип("ГруппаФормы"), Элементы[ИмяСтраницыФорма]);
	КонецЕсли;
	ГруппаНалогиВзносыОтчисления.Вид = ВидГруппыФормы.Страница;
	ГруппаНалогиВзносыОтчисления.Заголовок = НСтр("ru = 'Налоги, взносы, отчисления'"); 

	НоваяТаблица = Элементы.Добавить("НалогиВзносыОтчисления", Тип("ТаблицаФормы"), ГруппаНалогиВзносыОтчисления);
	НоваяТаблица.ПутьКДанным		= "Объект.НалогиВзносыОтчисления";
	НоваяТаблица.УстановитьДействие("Выбор", "Подключаемый_НалогиВзносыОтчисленияВыбор");
	НоваяТаблица.УстановитьДействие("ПриАктивизацииСтроки", "Подключаемый_НалогиВзносыОтчисленияПриАктивизацииСтроки");
	НоваяТаблица.УстановитьДействие("ПередУдалением", "Подключаемый_НалогиВзносыОтчисленияПередУдалением");
	НоваяТаблица.УстановитьДействие("ПриОкончанииРедактирования", "Подключаемый_НалогиВзносыОтчисленияПриОкончанииРедактирования");
	НоваяТаблица.УстановитьДействие("ПослеУдаления", "Подключаемый_НалогиВзносыОтчисленияПослеУдаления");

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияНайти", Тип("КнопкаФормы"), Элементы.НалогиВзносыОтчисленияКоманднаяПанель);
	НовыйЭлемент.Вид 				= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды  		= "НалогиВзносыОтчисленияНайти";
	НовыйЭлемент.Видимость  		= Ложь;
	
	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияОтменитьПоиск", Тип("КнопкаФормы"), Элементы.НалогиВзносыОтчисленияКоманднаяПанель);
	НовыйЭлемент.Вид 				= ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды 		= "НалогиВзносыОтчисленияОтменитьПоиск";
	НовыйЭлемент.Видимость  		= Ложь;

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияАвтоКоманды", Тип("ГруппаФормы"), Элементы.НалогиВзносыОтчисленияКоманднаяПанель);
	НовыйЭлемент.Вид 				= ВидГруппыФормы.ГруппаКнопок;

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияНомерСтроки", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.НомерСтроки";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияФизическоеЛицо", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ФизическоеЛицо";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияПодразделение", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным		= "Объект.НалогиВзносыОтчисления.Подразделение";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияМесяцНалоговогоПериода", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.МесяцНалоговогоПериода";
    НовыйЭлемент.Формат 			= "ДФ='ММММ гггг'";
	
	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияВидДохода", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ВидДохода";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияВидНалогаВзносаОтчисления", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияОблагаемыйДоход", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ОблагаемыйДоход";

    // в многосотрудниковых документах расчет необлагаемого дохода довольно редкий, данную информацию можно получить в подробной форме 
	//НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияНеоблагаемыйДоход", Тип("ПолеФормы"), НоваяТаблица);
	//НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.НеоблагаемыйДоход";

	НалогВзносГруппа = Элементы.Добавить("НалогиВзносыОтчисленияНалогВзносГруппа", Тип("ГруппаФормы"), НоваяТаблица);
	НалогВзносГруппа.Вид 				= ВидГруппыФормы.ГруппаКолонок;
	НалогВзносГруппа.Группировка		= ГруппировкаКолонок.Горизонтальная;
	НалогВзносГруппа.Заголовок			= НСтр("ru = 'Налог / взнос'");
	НалогВзносГруппа.ОтображатьВШапке   = Истина;

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияНалогВзнос", Тип("ПолеФормы"), НалогВзносГруппа);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.НалогВзнос";
 	НовыйЭлемент.ОтображатьВШапке	= Ложь;

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияНалогВзносСПревышения", Тип("ПолеФормы"), НалогВзносГруппа);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.НалогВзносСПревышения";
	НовыйЭлемент.ОтображатьВШапке	= Ложь;

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияОбъектИсчисления", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ОбъектИсчисления";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияРазрешенныйВычет", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.РазрешенныйВычет";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияПримененныйВычет", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ПримененныйВычет";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияПримененнаяЛьгота", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ПримененнаяЛьгота";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияПрочиеВычеты", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ПрочиеВычеты";

	НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияПредставлениеПримененныеВычеты", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "Объект.НалогиВзносыОтчисления.ПредставлениеПримененныеВычеты";
	НовыйЭлемент.ГиперссылкаЯчейки 	= Истина;
	НовыйЭлемент.ЦветТекста		 	= ЦветаСтиля.ЦветГиперссылкиБРО;

	Если ДобавитьПредставлениеРазрешенныеВычеты Тогда
		НовыйЭлемент = Элементы.Добавить("НалогиВзносыОтчисленияПредставлениеРазрешенныеВычеты", Тип("ПолеФормы"), НоваяТаблица);
		НовыйЭлемент.Вид				= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным		= "Объект.НалогиВзносыОтчисления.ПредставлениеРазрешенныеВычеты";
		НовыйЭлемент.ГиперссылкаЯчейки	= Истина;
		НовыйЭлемент.ЦветТекста			= ЦветаСтиля.ЦветГиперссылкиБРО;
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьБлокРеквизитовСреднегоЗаработка(Форма, МассивДобавляемыхРеквизитов, ЕстьИспользуетсяСреднечасовойЗаработок = Ложь)
	
    Если НЕ ЕстьИспользуетсяСреднечасовойЗаработок Тогда
		НовыйРеквизит = Новый РеквизитФормы("ИспользуетсяСреднечасовойЗаработок", Новый ОписаниеТипов("Булево")); 
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	КонецЕсли;
	НовыйРеквизит = Новый РеквизитФормы("ПорядокУчетаРабочегоВремени", Новый ОписаниеТипов("ПеречислениеСсылка.УчетРабочегоВремениПриРасчетеСреднегоЗаработка")); 
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
КонецПроцедуры

Процедура СоздатьБлокРеквизитовНВОБазаНачислений(Форма, МассивДобавляемыхРеквизитов, ДобавитьРеквизитыНВОБазы = Ложь, ПрефиксНВОБазы = "", ДобавитьРеквизитыНВОНачислений = Ложь, ПрефиксНВОНачислений = "", ДобавитьДополнительныеРеквизитыНВО = Ложь)
	
	ВидыНВОБазы = Новый Массив;
	Если ДобавитьРеквизитыНВОБазы Тогда
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "ОПВ");
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "ВОСМС");
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "ИПН");
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "СО");
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "СН");
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "ООСМС");
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "ОПВР");
		ВидыНВОБазы.Добавить(ПрефиксНВОБазы + "ОППВ");
	КонецЕсли;
	
	Для Каждого ВидНВО Из ВидыНВОБазы Цикл
		
		НовыйРеквизит = Новый РеквизитФормы(ВидНВО, Новый ОписаниеТипов("ТаблицаЗначений"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"), ВидНВО);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("СпособОбложения", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыНалогообложенияДоходов"), ВидНВО);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ДоходНеПодлежащийНалогообложению", Новый ОписаниеТипов("СправочникСсылка.ДоходыНеПодлежащиеНалогообложениюЧастично"), ВидНВО);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
	КонецЦикла;
	
	ВидыНВОНачислений = Новый Массив;
	Если ДобавитьРеквизитыНВОНачислений Тогда
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "ОПВ");
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "ВОСМС");
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "ИПН");
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "СО");
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "СН");
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "ООСМС");
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "ОПВР");
		ВидыНВОНачислений.Добавить(ПрефиксНВОНачислений + "ОППВ");
	КонецЕсли;
	
	Для Каждого ВидНВО Из ВидыНВОНачислений Цикл
		
		НовыйРеквизит = Новый РеквизитФормы(ВидНВО, Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"), ВидНВО);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РеквизитДопУпорядочивания", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)), ВидНВО);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ТолькоПросмотр", Новый ОписаниеТипов("Булево"), ВидНВО);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		НовыйРеквизит = Новый РеквизитФормы(ВидНВО + "НеОблагаются", Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"), ВидНВО + "НеОблагаются");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РеквизитДопУпорядочивания", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)), ВидНВО + "НеОблагаются");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ТолькоПросмотр", Новый ОписаниеТипов("Булево"), ВидНВО + "НеОблагаются");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
		НовыйРеквизит = Новый РеквизитФормы(ВидНВО + "НеОблагаютсяЧастично", Новый ОписаниеТипов("ТаблицаЗначений"),,, Истина);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"), ВидНВО + "НеОблагаютсяЧастично");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ДоходНеПодлежащийНалогообложению", Новый ОписаниеТипов("СправочникСсылка.ДоходыНеПодлежащиеНалогообложениюЧастично"), ВидНВО + "НеОблагаютсяЧастично");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РеквизитДопУпорядочивания", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)), ВидНВО + "НеОблагаютсяЧастично");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ТолькоПросмотр", Новый ОписаниеТипов("Булево"), ВидНВО + "НеОблагаютсяЧастично");
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		
	КонецЦикла;
	
	Если ДобавитьДополнительныеРеквизитыНВО Тогда
		НовыйРеквизит = Новый РеквизитФормы("НалогиВзносыОтчисленияПериод", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("НалогиВзносыОтчисленияПериодСтрокой", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)),, НСтр("ru = 'Период изменений'"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("НалогиВзносыОтчисленияТаблицаИсточник", Новый ОписаниеТипов("Строка"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("НалогиВзносыОтчисленияТаблицаПриемник", Новый ОписаниеТипов("Строка"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов"),, НСтр("ru = 'Вид дохода'"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЭлементыРеквизитовНВОМежрасчетОдносотрудниковыйДокумент(Форма, ЭлементВставки = "УдержанияИзменить", ДобавитьРеквизитыНВОРаботодателя = Ложь, ПрефиксНВО = "", ДобавлятьКоманды = Истина)

	Элементы = Форма.Элементы;
	
	ВидыНВО = Новый Массив;
	ВидыНВО.Добавить(ПрефиксНВО + "ЕП");
	ВидыНВО.Добавить(ПрефиксНВО + "ОПВ");
	ВидыНВО.Добавить(ПрефиксНВО + "ВОСМС");
	ВидыНВО.Добавить(ПрефиксНВО + "ИПН");
	
	Если ДобавитьРеквизитыНВОРаботодателя Тогда
		ВидыНВО.Добавить("ИсчисленоЕП");
		ВидыНВО.Добавить("ИсчисленоСО");
		ВидыНВО.Добавить("ИсчисленоСН");
		ВидыНВО.Добавить("ИсчисленоОППВ");
		ВидыНВО.Добавить("ИсчисленоООСМС");
		ВидыНВО.Добавить("ИсчисленоОПВР");
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Для Каждого ВидНВО Из ВидыНВО Цикл

        Если ВидНВО = "ИсчисленоСО" ИЛИ ВидНВО = "ИсчисленоСН" ИЛИ ВидНВО = "ИсчисленоООСМС" ИЛИ ВидНВО = "ИсчисленоОППВ" ИЛИ ВидНВО = "ИсчисленоОПВР" ИЛИ ВидНВО = "ИсчисленоЕП" Тогда
			ГруппаВидНВО = Элементы.Добавить(ВидНВО + "Изменить", Тип("ГруппаФормы"), Элементы.ИсчисленоГруппа);
		Иначе
			ГруппаВидНВО = Элементы.Вставить(ВидНВО + "Изменить", Тип("ГруппаФормы"), Элементы.УдержаноГруппа, Элементы[ЭлементВставки]);
		КонецЕсли;
		ГруппаВидНВО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаВидНВО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаВидНВО.ОтображатьЗаголовок = Ложь;
        ГруппаВидНВО.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		НовыйЭлемент = Элементы.Добавить(ВидНВО, Тип("ПолеФормы"), ГруппаВидНВО);
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 		= ВидНВО;
		
		Если ВидНВО = ПрефиксНВО + "ЕП" ИЛИ ВидНВО = "ИсчисленоЕП" Тогда
			Если ВидНВО = ПрефиксНВО + "ЕП" Тогда
				Заголовок = НСтр("ru = 'ЕП (за счет работника)'");
			Иначе
				Заголовок = НСтр("ru = 'ЕП (за счет работодателя)'");
			КонецЕсли;
		Иначе
			Заголовок = ВидНВО;
			Заголовок = СтрЗаменить(Заголовок, "Исчислено", "");
			Заголовок = СтрЗаменить(Заголовок, ПрефиксНВО, "");
		КонецЕсли;
		
		НовыйЭлемент.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1'"), Заголовок);	
		НовыйЭлемент.ТолькоПросмотр		= Истина;
		
		Если ДобавлятьКоманды Тогда
			НовыйЭлемент.Ширина 			= 10;
			
			НовыйЭлемент = Элементы.Добавить("ПодробнееОРасчете" + ВидНВО, Тип("КнопкаФормы"), ГруппаВидНВО);
			НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
			НовыйЭлемент.ИмяКоманды = "ПодробнееОРасчете" + ВидНВО;
			НовыйЭлемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементыРеквизитовНВОМежрасчетМногосотрудниковыйДокумент(Форма, ИмяЭлементаВставки = "Начисления")

	Элементы = Форма.Элементы;
	
	ВидыНВО = Новый Массив;
	ВидыНВО.Добавить("ВОСМС");
	ВидыНВО.Добавить("ИПН");
	ВидыНВО.Добавить("ОПВ");
	ВидыНВО.Добавить("ЕП");

	Для Каждого ВидНВО Из ВидыНВО Цикл
		
		НовыйЭлемент = Элементы.Вставить("Начисления" + ВидНВО, Тип("ПолеФормы"), Элементы[ИмяЭлементаВставки], Элементы.НачисленияУдержания);
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.Формат 			= "ЧДЦ=2; ЧН=0,00";
		НовыйЭлемент.ПутьКДанным 		= "Объект.Начисления." + ВидНВО;
		НовыйЭлемент.ПутьКДаннымПодвала = "Итог" + ВидНВО;
		НовыйЭлемент.ЦветТекста 		= ЦветаСтиля.ТекстИнформационнойНадписи;
		НовыйЭлемент.Гиперссылка 		= Истина;
		НовыйЭлемент.ГиперссылкаЯчейки  = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементыРеквизитовНВОРезервы(Форма, ИмяТЧРасчетРезерва = "РасчетРезервов")

	Элементы = Форма.Элементы;
	
	ВидыНВО = Новый Массив;
	ВидыНВО.Добавить("СО");
	ВидыНВО.Добавить("СН");
	ВидыНВО.Добавить("ОтчисленияОСМС");
	ВидыНВО.Добавить("ОПВР");
	ВидыНВО.Добавить("ОППВ");
	
    // документ НачислениеОценочныхОбязательствПоОтпускам - РасчетРезерваОтпусков
    // документ РезервыПоОплатеТруда - РасчетРезервов
	Если ИмяТЧРасчетРезерва = "РасчетРезервов" Тогда
		ИмяЭлементаВставки1 = "РасчетРезерваОтпусковГруппаРезервСтраховыеВзносы";	
		ИмяЭлементаВставки2 = "РасчетРезервовФиксРасчет";	
		ИмяЭлементаВставки3 = "ОценочныеОбязательстваФиксРасчет";	
	Иначе
		ИмяЭлементаВставки1 = "РасчетРезерваОтпусковГруппаПоказатели";	
		ИмяЭлементаВставки2 = "РасчетРезерваОтпусковОтступ";	
		ИмяЭлементаВставки3 = "ОценочныеОбязательстваОтступ";	
	КонецЕсли;
	
	МассивДанных = Новый Массив;
	МассивДанных.Добавить("Исчислено");
	МассивДанных.Добавить("Накоплено");
	МассивДанных.Добавить("");
	
	Для Каждого ВидНВО Из ВидыНВО Цикл
		
        // резервы
        Если НЕ ИмяТЧРасчетРезерва = "РасчетРезервов" Тогда
			
			НовыйЭлемент = Элементы.Вставить("РасчетРезерваОтпусков" + ВидНВО, Тип("ПолеФормы"), Элементы[ИмяТЧРасчетРезерва], Элементы[ИмяЭлементаВставки1]);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект." + ИмяТЧРасчетРезерва + "." + ВидНВО;
			НовыйЭлемент.ПутьКДаннымПодвала = "Объект." + ИмяТЧРасчетРезерва + ".Итог" + ВидНВО;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетРезерваОтпусков" + СтрЗаменить(ВидНВО, "ОтчисленияОСМС", "ООСМС") + "ПриИзменении");
            НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
            НовыйЭлемент.Ширина = 10;
			
		КонецЕсли;
		
		ГруппаНВО = Элементы.Вставить("РасчетРезерваГруппа" + ВидНВО, Тип("ГруппаФормы"), Элементы[ИмяТЧРасчетРезерва], Элементы[ИмяЭлементаВставки2]);
		ГруппаНВО.Группировка = ГруппировкаКолонок.Горизонтальная; 
		ГруппаНВО.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2", СтрЗаменить(ВидНВО, "ОтчисленияОСМС", "ООСМС"), НСтр("ru = 'обязательства (резерва)'")); 
        ГруппаНВО.ОтображатьВШапке = Истина;
		
		Для Каждого СтрокаДанных Из МассивДанных Цикл
			
			ГруппаИсчислено = Элементы.Добавить("РасчетРезервовГруппаСуммаРезерва" + ВидНВО + СтрокаДанных, Тип("ГруппаФормы"), ГруппаНВО);
			ГруппаИсчислено.Группировка = ГруппировкаКолонок.Вертикальная; 
			ГруппаИсчислено.Заголовок = ?(ЗначениеЗаполнено(СтрокаДанных), НРег(СтрокаДанных), НСтр("ru = 'зачтено'")); 
            ГруппаИсчислено.ОтображатьВШапке = Истина;
			
			НовыйЭлемент = Элементы.Добавить("РасчетРезервовСуммаРезерва" + ВидНВО + СтрокаДанных, Тип("ПолеФормы"), ГруппаИсчислено);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект." + ИмяТЧРасчетРезерва + ".СуммаРезерва" + ВидНВО + СтрокаДанных;
			НовыйЭлемент.ПутьКДаннымПодвала = "Объект." + ИмяТЧРасчетРезерва + ".ИтогСуммаРезерва" + ВидНВО + СтрокаДанных;
            НовыйЭлемент.ОтображатьВШапке 	= Ложь;
            НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
            НовыйЭлемент.Ширина = 10;
            Если ИмяТЧРасчетРезерва = "РасчетРезерваОтпусков" Тогда
				НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетРезерваОтпусковСуммаРезерва" + ВидНВО + СтрокаДанных + "ПриИзменении");
			КонецЕсли;
			
		КонецЦикла;		

		// ОценочныеОбязательстваПоСотрудникам
		НовыйЭлемент = Элементы.Вставить("ОценочныеОбязательстваПоСотрудникамСуммаРезерва" + ВидНВО, Тип("ПолеФормы"), Элементы.ОценочныеОбязательстваПоСотрудникам, Элементы.ОценочныеОбязательстваПоСотрудникамКорректировкаОбязательств);
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 		= "Объект.ОценочныеОбязательстваПоСотрудникам.СуммаРезерва" + ВидНВО;
		НовыйЭлемент.ПутьКДаннымПодвала = "Объект.ОценочныеОбязательстваПоСотрудникам.ИтогСуммаРезерва" + ВидНВО;
        НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
        НовыйЭлемент.Ширина = 17;
		
		// ОценочныеОбязательства 
		ГруппаНВООценочныеОбязательства = Элементы.Вставить("ОценочныеОбязательстваГруппаРезерв" + ВидНВО, Тип("ГруппаФормы"), Элементы.ОценочныеОбязательства, Элементы[ИмяЭлементаВставки3]);
		ГруппаНВООценочныеОбязательства.Группировка = ГруппировкаКолонок.Вертикальная; 
		ГруппаНВООценочныеОбязательства.Заголовок = СтрЗаменить(ВидНВО, "ОтчисленияОСМС", "ООСМС"); 
        ГруппаНВООценочныеОбязательства.ОтображатьВШапке = Истина;
        ГруппаНВООценочныеОбязательства.РастягиватьПоГоризонтали = Ложь;
        ГруппаНВООценочныеОбязательства.Ширина = 17;

		НовыйЭлемент = Элементы.Добавить("ОценочныеОбязательстваСуммаРезерва" + ВидНВО, Тип("ПолеФормы"), ГруппаНВООценочныеОбязательства);
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 		= "Объект.ОценочныеОбязательства.СуммаРезерва" + ВидНВО;
		НовыйЭлемент.ПутьКДаннымПодвала = "Объект.ОценочныеОбязательства.ИтогСуммаРезерва" + ВидНВО;
        НовыйЭлемент.ОтображатьВШапке 	= Ложь;
        НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
        НовыйЭлемент.Ширина = 17;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементыРеквизитовНВОБазаНачислений(Форма, ГруппаСтраниц, ИмяЭлементаВставки, ПодсказкаЭлементаВставки)
	
	Элементы = Форма.Элементы;
	
	СтраницаНВО = Элементы.Добавить("Страница" + ИмяЭлементаВставки, Тип("ГруппаФормы"), ГруппаСтраниц);
	СтраницаНВО.Вид = ВидГруппыФормы.Страница;
	СтраницаНВО.Заголовок = НСтр("ru = '"+ИмяЭлементаВставки+"'");
	СтраницаНВО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ГруппаОблагаетсяНВО = Элементы.Добавить("ГруппаОблагается" + ИмяЭлементаВставки, Тип("ГруппаФормы"), СтраницаНВО);
	ГруппаОблагаетсяНВО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОблагаетсяНВО.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаОблагаетсяНВО.Заголовок  = НСтр("ru = 'Облагается "+ИмяЭлементаВставки+"'");
	ГруппаОблагаетсяНВО.ОтображатьЗаголовок = Истина;
	ГруппаОблагаетсяНВО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НоваяТаблица = Элементы.Добавить("Начисления" + ИмяЭлементаВставки, Тип("ТаблицаФормы"), ГруппаОблагаетсяНВО);
	НоваяТаблица.ПутьКДанным = "Начисления" + ИмяЭлементаВставки;
	НоваяТаблица.Подсказка = НСтр("ru = 'Список начислений, определяющих базу " + ПодсказкаЭлементаВставки + "'");
	НоваяТаблица.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
	НоваяТаблица.Шапка = Ложь;
	НоваяТаблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	НоваяТаблица.УстановитьДействие("Выбор", "Подключаемый_НалогиВзносыОтчисленияВыбор");
	НоваяТаблица.УстановитьДействие("НачалоПеретаскивания", "Подключаемый_НалогиВзносыОтчисленияНачалоПеретаскивания");
	НоваяТаблица.УстановитьДействие("Перетаскивание", "Подключаемый_НалогиВзносыОтчисленияПеретаскивание");
	
	НовыйЭлемент = Элементы.Добавить("Начисления" + ИмяЭлементаВставки + "ВидРасчета", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Начисления" + ИмяЭлементаВставки + ".ВидРасчета";
	
	ГруппаНВОПравая = Элементы.Добавить("Группа" + ИмяЭлементаВставки + "Правая", Тип("ГруппаФормы"), СтраницаНВО);
	ГруппаНВОПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНВОПравая.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаНВОПравая.ОтображатьЗаголовок = Ложь;
	ГруппаНВОПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаНеОблагаетсяНВО = Элементы.Добавить("ГруппаНеОблагается" + ИмяЭлементаВставки, Тип("ГруппаФормы"), ГруппаНВОПравая);
	ГруппаНеОблагаетсяНВО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНеОблагаетсяНВО.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаНеОблагаетсяНВО.Заголовок  = НСтр("ru = '            Не облагается "+ИмяЭлементаВставки+"'");
	ГруппаНеОблагаетсяНВО.ОтображатьЗаголовок = Истина;
	ГруппаНеОблагаетсяНВО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	КомандыНВО1 = Элементы.Добавить("Команды" + ИмяЭлементаВставки + "1", Тип("ГруппаФормы"), ГруппаНеОблагаетсяНВО);
	КомандыНВО1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КомандыНВО1.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	КомандыНВО1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияПустаяСтрока" + ИмяЭлементаВставки + "1", Тип("ДекорацияФормы"), КомандыНВО1);
	НовыйЭлемент.Вид	= ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Высота = 3;
	
	НовыйЭлемент = Элементы.Добавить("Право" + ИмяЭлементаВставки + "1", Тип("КнопкаФормы"), КомандыНВО1);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "НалогиВзносыОтчисленияПраво1";
	
	НовыйЭлемент = Элементы.Добавить("Лево" + ИмяЭлементаВставки + "1", Тип("КнопкаФормы"), КомандыНВО1);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "НалогиВзносыОтчисленияЛево1";
	
	НоваяТаблица = Элементы.Добавить("Начисления" + ИмяЭлементаВставки + "НеОблагаются", Тип("ТаблицаФормы"), ГруппаНеОблагаетсяНВО);
	НоваяТаблица.ПутьКДанным = "Начисления" + ИмяЭлементаВставки + "НеОблагаются";
	НоваяТаблица.Подсказка = НСтр("ru = 'Список начислений, не включаемых в базу для расчета " + ПодсказкаЭлементаВставки + "'");
	НоваяТаблица.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
	НоваяТаблица.Шапка = Ложь;
	НоваяТаблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	НоваяТаблица.УстановитьДействие("Выбор", "Подключаемый_НалогиВзносыОтчисленияВыбор");
	НоваяТаблица.УстановитьДействие("НачалоПеретаскивания", "Подключаемый_НалогиВзносыОтчисленияНачалоПеретаскивания");
	НоваяТаблица.УстановитьДействие("Перетаскивание", "Подключаемый_НалогиВзносыОтчисленияПеретаскивание");
	
	НовыйЭлемент = Элементы.Добавить("Начисления" + ИмяЭлементаВставки + "НеОблагаютсяВидРасчета", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Начисления" + ИмяЭлементаВставки + "НеОблагаются.ВидРасчета";
	
	ГруппаНеОблагаетсяНВОЧастично = Элементы.Добавить("ГруппаНеОблагается" + ИмяЭлементаВставки + "Частично", Тип("ГруппаФормы"), ГруппаНВОПравая);
	ГруппаНеОблагаетсяНВОЧастично.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНеОблагаетсяНВОЧастично.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаНеОблагаетсяНВОЧастично.Заголовок  = НСтр("ru = '            Не облагается "+ИмяЭлементаВставки+" частично'");
	ГруппаНеОблагаетсяНВОЧастично.ОтображатьЗаголовок = Истина;
	ГруппаНеОблагаетсяНВОЧастично.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	КомандыНВО2 = Элементы.Добавить("Команды" + ИмяЭлементаВставки + "2", Тип("ГруппаФормы"), ГруппаНеОблагаетсяНВОЧастично);
	КомандыНВО2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	КомандыНВО2.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	КомандыНВО2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияПустаяСтрока" + ИмяЭлементаВставки + "2", Тип("ДекорацияФормы"), КомандыНВО2);
	НовыйЭлемент.Вид	= ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Высота = 3;
	
	НовыйЭлемент = Элементы.Добавить("Право" + ИмяЭлементаВставки + "2", Тип("КнопкаФормы"), КомандыНВО2);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "НалогиВзносыОтчисленияПраво2";
	
	НовыйЭлемент = Элементы.Добавить("Лево" + ИмяЭлементаВставки + "2", Тип("КнопкаФормы"), КомандыНВО2);
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.ИмяКоманды = "НалогиВзносыОтчисленияЛево2";
	
	НоваяТаблица = Элементы.Добавить("Начисления" + ИмяЭлементаВставки + "НеОблагаютсяЧастично", Тип("ТаблицаФормы"), ГруппаНеОблагаетсяНВОЧастично);
	НоваяТаблица.ПутьКДанным = "Начисления" + ИмяЭлементаВставки + "НеОблагаютсяЧастично";
	НоваяТаблица.Подсказка = НСтр("ru = 'Список начислений, не включаемых в базу для расчета " + ПодсказкаЭлементаВставки + " до определенного настройками предела'");
	НоваяТаблица.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
	НоваяТаблица.Шапка = Ложь;
	НоваяТаблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	НоваяТаблица.УстановитьДействие("Выбор", "Подключаемый_НалогиВзносыОтчисленияВыбор");
	НоваяТаблица.УстановитьДействие("НачалоПеретаскивания", "Подключаемый_НалогиВзносыОтчисленияНачалоПеретаскивания");
	НоваяТаблица.УстановитьДействие("Перетаскивание", "Подключаемый_НалогиВзносыОтчисленияПеретаскивание");
	
	НовыйЭлемент = Элементы.Добавить("Начисления" + ИмяЭлементаВставки + "НеОблагаютсяЧастичноВидРасчета", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Начисления" + ИмяЭлементаВставки + "НеОблагаютсяЧастично.ВидРасчета";
	
	НовыйЭлемент = Элементы.Добавить("Начисления" + ИмяЭлементаВставки + "НеОблагаютсяЧастичноДоходНеПодлежащийНалогообложению", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид		 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Начисления" + ИмяЭлементаВставки + "НеОблагаютсяЧастично.ДоходНеПодлежащийНалогообложению";
	
КонецПроцедуры

Процедура СкрытьОбъектыКоманд(Форма, МассивСкрываемыхКоманд)
	
	Для Каждого Элемент Из Форма.Элементы Цикл  
		
		Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
			Если МассивСкрываемыхКоманд.Найти(Элемент.ИмяКоманды) = Неопределено Тогда     
				Продолжить;
			Иначе
	        	Элемент.Видимость = Ложь;
			КонецЕсли;
		Иначе
			Продолжить;
	    КонецЕсли;
		
	КонецЦикла

КонецПроцедуры

#КонецОбласти

#Область ВнешниеПроцедурыПостроенияЭлементовОбъектов

Процедура ОбработатьСобытияФормПриСозданииЧтенииОбщаяФормаОрганизацияУчетнаяПолитика(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Элементы = Форма.Элементы;

	НастройкиОрганизацийРасширеннаяИспользоватьОсобыеУсловияТруда = Элементы.НастройкиОрганизацийРасширеннаяИспользоватьОсобыеУсловияТруда;
	НастройкиОрганизацийРасширеннаяИспользоватьОсобыеУсловияТруда.УстановитьДействие("ПриИзменении", "Подключаемый_НастройкиОрганизацийРасширеннаяИспользоватьОсобыеУсловияТрудаПриИзменении");

	ГруппаНастроек = Элементы.Добавить("ГруппаНастроек", Тип("ГруппаФормы"), Элементы.РасчетЗарплаты);
	ГруппаНастроек.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроек.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаНастроек.ОтображатьЗаголовок = Ложь;
	
	ГруппаНастроекЛевая = Элементы.Добавить("ГруппаНастроекЛевая", Тип("ГруппаФормы"), ГруппаНастроек);
	ГруппаНастроекЛевая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроекЛевая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНастроекЛевая.ОтображатьЗаголовок = Ложь;

	ГруппаНастроекПравая = Элементы.Добавить("ГруппаНастроекПравая", Тип("ГруппаФормы"), ГруппаНастроек);
	ГруппаНастроекПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастроекПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНастроекПравая.ОтображатьЗаголовок = Ложь;
	
	ГруппаНалогообложение = Элементы.Добавить("ГруппаНалогообложение", Тип("ГруппаФормы"), ГруппаНастроекЛевая);
 	ГруппаНалогообложение.Вид = ВидГруппыФормы.ОбычнаяГруппа;
 	ГруппаНалогообложение.Заголовок = НСтр("ru = 'Налогообложение'");
	ГруппаНалогообложение.Отображение = ОтображениеОбычнойГруппы.Нет; 
	ГруппаНалогообложение.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПлательщикОППВ", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ПлательщикОППВ";
	НовыйЭлемент.Заголовок 			= НСтр("ru = 'Является плательщиком ОППВ'");
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПрименятьОграничениеНаМинимальныйОбъектОСМС", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ПрименятьОграничениеНаМинимальныйОбъектОСМС";
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПредоставлятьВычетВМесяцеОтсутствияДохода", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ПредоставлятьВычетВМесяцеОтсутствияДохода";
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу";
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВДляГПХ", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчислений", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуНеПрименятьКорректировкуПрочихНалоговВзносовОтчисленийПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХ", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетВОСМСДляФизическихЛицИГПХ";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетВОСМСДляФизическихЛицИГПХПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПрименятьВычетОПВиВОСМСДляГПХ", Тип("ПолеФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ПрименятьВычетОПВиВОСМСДляГПХ";
	
	ГруппаУчетнаяПолитикаПериодИстория = Элементы.Добавить("УчетнаяПолитикаПериодИстория", Тип("ГруппаФормы"), ГруппаНалогообложение);
 	ГруппаУчетнаяПолитикаПериодИстория.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУчетнаяПолитикаПериодИстория.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаУчетнаяПолитикаПериодИстория.ОтображатьЗаголовок = Ложь;

	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой", Тип("ПолеФормы"), ГруппаУчетнаяПолитикаПериодИстория);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Авто;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокой";
	НовыйЭлемент.Заголовок 			= НСтр("ru = 'действует с'");
	НовыйЭлемент.КнопкаВыбора 		= Истина;
	НовыйЭлемент.КнопкаРегулирования = Истина;
	НовыйЭлемент.Ширина 			= 14;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойПриИзменении");
    НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойНачалоВыбора");
    НовыйЭлемент.УстановитьДействие("Регулирование", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойРегулирование");
    НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойАвтоПодбор");
    НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуПериодСтрокойОкончаниеВводаТекста");
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуИстория", Тип("КнопкаФормы"), ГруппаНалогообложение);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = "УчетнаяПолитикаПоНалоговомуУчетуИстория";

	Элементы.Переместить(Элементы.КраткосрочныеИзмененияУсловийТрудаГруппа, ГруппаНастроекЛевая);
	Элементы.Переместить(Элементы.ПроцентДоплатыЗаНочныеВечерниеГруппа, ГруппаНастроекЛевая);

	НовыйЭлемент = Элементы.Добавить("НастройкиОрганизацийРасширеннаяВестиУчетРабочегоВремениПоУсловиямТруда", Тип("ПолеФормы"), Элементы.КраткосрочныеИзмененияУсловийТрудаГруппа);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "НастройкиОрганизацийРасширенная.ВестиУчетРабочегоВремениПоУсловиямТруда";

	ГруппаРасчетСреднегоЗаработка = Элементы.Добавить("РасчетСреднегоЗаработка", Тип("ГруппаФормы"), ГруппаНастроекЛевая);
 	ГруппаРасчетСреднегоЗаработка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаРасчетСреднегоЗаработка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаРасчетСреднегоЗаработка.ОтображатьЗаголовок = Ложь;

	ГруппаУчетаКадровыхПерестановок = Элементы.Добавить("ГруппаУчетаКадровыхПерестановок", Тип("ГруппаФормы"), ГруппаРасчетСреднегоЗаработка);
 	ГруппаУчетаКадровыхПерестановок.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУчетаКадровыхПерестановок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
 	ГруппаУчетаКадровыхПерестановок.Заголовок = НСтр("ru = 'Расчет среднего заработка'");
	ГруппаУчетаКадровыхПерестановок.Отображение = ОтображениеОбычнойГруппы.Нет; 

 	НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаОрганизацийРассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок", Тип("ПолеФормы"), ГруппаУчетаКадровыхПерестановок);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок 			= НСтр("ru = 'Рассчитывать кадровые изменения в пределах мест работы'");
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаОрганизаций.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийРассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановокПриИзменении");
	НовыйЭлемент.ВысотаЗаголовка   = 2;

 	НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаОрганизацийВариантУчетаКадровыхПерестановок", Тип("ПолеФормы"), ГруппаУчетаКадровыхПерестановок);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаОрганизаций.ВариантУчетаКадровыхПерестановок";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийВариантУчетаКадровыхПерестановокПриИзменении");
	НовыйЭлемент.ВысотаЗаголовка   = 2;

 	НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаОрганизацийУчетРабочегоВремени", Тип("ПолеФормы"), ГруппаРасчетСреднегоЗаработка);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремени";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийУчетРабочегоВремениПриИзменении");
	НовыйЭлемент.ВысотаЗаголовка   = 2;

 	НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаОрганизацийУчетРабочегоВремениДляСуммированногоУчета", Тип("ПолеФормы"), ГруппаРасчетСреднегоЗаработка);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПустаяСсылка(), НСтр("ru = 'По фактическим графикам сотрудников'"));
    НовыйЭлемент.ПодсказкаВвода     = НСтр("ru = 'По фактическим графикам сотрудников'");
	НовыйЭлемент.КнопкаОчистки 		= Истина;
    НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета";

	ГруппаДатаУчетаРабочегоВремени = Элементы.Добавить("ДатаУчетаРабочегоВремени", Тип("ГруппаФормы"), ГруппаРасчетСреднегоЗаработка);
 	ГруппаДатаУчетаРабочегоВремени.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДатаУчетаРабочегоВремени.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаДатаУчетаРабочегоВремени.ОтображатьЗаголовок = Ложь;

	НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаОрганизацийПериодСтрокой", Тип("ПолеФормы"), ГруппаДатаУчетаРабочегоВремени);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Авто;
	НовыйЭлемент.ПутьКДанным 		= "РасчетСреднегоЗаработкаОрганизацийПериодСтрокой";
	НовыйЭлемент.Заголовок 			= НСтр("ru = 'действует с'");
	НовыйЭлемент.КнопкаВыбора 		= Истина;
	НовыйЭлемент.КнопкаРегулирования = Истина;
	НовыйЭлемент.Ширина 			= 14;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийПериодСтрокойПриИзменении");
    НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийПериодСтрокойНачалоВыбора");
    НовыйЭлемент.УстановитьДействие("Регулирование", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийПериодСтрокойРегулирование");
    НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийПериодСтрокойАвтоПодбор");
    НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_РасчетСреднегоЗаработкаОрганизацийПериодСтрокойОкончаниеВводаТекста");

	НовыйЭлемент = Элементы.Добавить("РасчетСреднегоЗаработкаОрганизацийИстория", Тип("КнопкаФормы"), ГруппаДатаУчетаРабочегоВремени);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = "РасчетСреднегоЗаработкаОрганизацийИстория";


	
	ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения = Элементы.Добавить("ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения", Тип("ГруппаФормы"), ГруппаНастроекПравая);
 	ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения", Тип("ПолеФормы"), ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.ВидПереключателя 	= ВидПереключателя.Тумблер;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.СистемаНалогообложения";
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СистемыНалогообложения.Общая, НСтр("ru = 'Общеустановленная'"));
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СистемыНалогообложения.Упрощенная, НСтр("ru = 'Упрощенная'"));
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СистемыНалогообложения.РозничныйНалог, НСтр("ru = 'Розничный налог'"));
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.СистемыНалогообложения.ПустаяСсылка(), НСтр("ru = '<не установлен>'"));
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_УчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложенияПриИзменении");

 	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуПорядокОбложенияДоходовРаботников", Тип("ПолеФормы"), ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеПереключателя;
	НовыйЭлемент.ВидПереключателя 	= ВидПереключателя.Тумблер;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.ПорядокОбложенияДоходовРаботников";
 	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.ПорядокОбложенияДоходовРаботников.Общеустановленный, НСтр("ru = 'Общеустановленный'"));
	НовыйЭлемент.СписокВыбора.Добавить(Перечисления.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж, НСтр("ru = 'Единый платеж'"));

 	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуСуммаЗаявленногоДоходаИП", Тип("ПолеФормы"), ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.СуммаЗаявленногоДоходаИП";
 	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;

	ГруппаСНИндивидуальногоПредпринимателя = Элементы.Добавить("ГруппаСНИндивидуальногоПредпринимателя", Тип("ГруппаФормы"), ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения);
 	ГруппаСНИндивидуальногоПредпринимателя.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСНИндивидуальногоПредпринимателя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаСНИндивидуальногоПредпринимателя.ОтображатьЗаголовок = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя", Тип("ПолеФормы"), ГруппаСНИндивидуальногоПредпринимателя);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя";
 	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;

	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуКоэффициентМРПДляРасчетаСНЗаНаемногоРаботника", Тип("ПолеФормы"), ГруппаСНИндивидуальногоПредпринимателя);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника";
 	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;

	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаПоНалоговомуУчетуСпособОтраженияПоДоходуСубъектаПредпринимательства", Тип("ПолеФормы"), ГруппаУчетнаяПолитикаПоНалоговомуУчетуСистемаНалогообложения);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаПоНалоговомуУчету.СпособОтраженияПоДоходуСубъектаПредпринимательства";
 	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;

	
	ГруппаКадровыйУчет = Элементы.Добавить("ГруппаКадровыйУчет", Тип("ГруппаФормы"), ГруппаНастроекПравая);
 	ГруппаКадровыйУчет.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКадровыйУчет.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКадровыйУчет.Заголовок = НСтр("ru = 'Кадровый учет'");
	ГруппаКадровыйУчет.Отображение = ОтображениеОбычнойГруппы.Нет; 
	
 	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаЗарплатаКадрыДеньУвольненияЯвляетсяРабочимДнем", Тип("ПолеФормы"), ГруппаКадровыйУчет);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Право;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаЗарплатаКадры.ДеньУвольненияЯвляетсяРабочимДнем";

	ГруппаУчетнаяПолитикаЗарплатаКадры = Элементы.Добавить("ГруппаУчетнаяПолитикаЗарплатаКадры", Тип("ГруппаФормы"), ГруппаКадровыйУчет);
 	ГруппаУчетнаяПолитикаЗарплатаКадры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаУчетнаяПолитикаЗарплатаКадры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаУчетнаяПолитикаЗарплатаКадры.ОтображатьЗаголовок = Ложь;

	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаЗарплатаКадрыПериодСтрокой", Тип("ПолеФормы"), ГруппаУчетнаяПолитикаЗарплатаКадры);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Авто;
	НовыйЭлемент.ПутьКДанным 		= "УчетнаяПолитикаЗарплатаКадрыПериодСтрокой";
	НовыйЭлемент.Заголовок 			= НСтр("ru = 'действует с'");
	НовыйЭлемент.КнопкаВыбора 		= Истина;
	НовыйЭлемент.КнопкаРегулирования = Истина;
	НовыйЭлемент.Ширина 			= 14;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_УчетнаяПолитикаЗарплатаКадрыПериодСтрокойПриИзменении");
    НовыйЭлемент.УстановитьДействие("НачалоВыбора", "Подключаемый_УчетнаяПолитикаЗарплатаКадрыПериодСтрокойНачалоВыбора");
    НовыйЭлемент.УстановитьДействие("Регулирование", "Подключаемый_УчетнаяПолитикаЗарплатаКадрыПериодСтрокойРегулирование");
    НовыйЭлемент.УстановитьДействие("АвтоПодбор", "Подключаемый_УчетнаяПолитикаЗарплатаКадрыПериодСтрокойАвтоПодбор");
    НовыйЭлемент.УстановитьДействие("ОкончаниеВводаТекста", "Подключаемый_УчетнаяПолитикаЗарплатаКадрыПериодСтрокойОкончаниеВводаТекста");

	НовыйЭлемент = Элементы.Добавить("УчетнаяПолитикаЗарплатаКадрыИстория", Тип("КнопкаФормы"), ГруппаУчетнаяПолитикаЗарплатаКадры);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = "УчетнаяПолитикаЗарплатаКадрыИстория";

	
	ГруппаПеречислениеВзносовИОтчислений = Элементы.Добавить("ГруппаПеречислениеВзносовИОтчислений", Тип("ГруппаФормы"), ГруппаНастроекПравая);
 	ГруппаПеречислениеВзносовИОтчислений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПеречислениеВзносовИОтчислений.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаПеречислениеВзносовИОтчислений.Заголовок = НСтр("ru = 'Перечисление взносов, отчислений и платежей'");
	ГруппаПеречислениеВзносовИОтчислений.Отображение = ОтображениеОбычнойГруппы.Нет; 

	НовыйЭлемент = Элементы.Добавить("СрокиПеречисленияВзносовИОтчисленийИстория", Тип("КнопкаФормы"), ГруппаПеречислениеВзносовИОтчислений);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = "СрокиПеречисленияВзносовИОтчисленийИстория";
	
	НоваяТаблица = Элементы.Добавить("СрокиПеречисленияВзносовИОтчисленийВидНалогаВзносаОтчисления", Тип("ТаблицаФормы"), ГруппаПеречислениеВзносовИОтчислений);
	НоваяТаблица.ПутьКДанным 		= "СрокиПеречисленияВзносовИОтчислений";
	НоваяТаблица.ВысотаВСтрокахТаблицы = 3;
	НоваяТаблица.МножественныйВыбор = Истина;
    НоваяТаблица.ТолькоПросмотр = Истина;
	
	НовыйЭлемент = Элементы.Добавить("СрокиПеречисленияВзносовИОтчисленийДатаПеречисленияНеПозжеЧем", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "СрокиПеречисленияВзносовИОтчислений.ДатаПеречисленияНеПозжеЧем";

	НовыйЭлемент = Элементы.Добавить("СрокиПеречисленияВзносовИОтчисленийПорядокОпределенияСрокаПеречисления", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "СрокиПеречисленияВзносовИОтчислений.ПорядокОпределенияСрокаПеречисления";
	
	НовыйЭлемент = Элементы.Добавить("СрокиПеречисленияВзносовИОтчисленийПериодСтрокой", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "СрокиПеречисленияВзносовИОтчислений.ПериодСтрокой";
	НовыйЭлемент.Заголовок 			= НСтр("ru = 'Действует с'");
	
	ГруппаОкруглениеНалоговВзносовОтчислений = Элементы.Добавить("ГруппаОкруглениеНалоговВзносовОтчислений", Тип("ГруппаФормы"), ГруппаНастроекПравая);
 	ГруппаОкруглениеНалоговВзносовОтчислений.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОкруглениеНалоговВзносовОтчислений.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаОкруглениеНалоговВзносовОтчислений.Заголовок = НСтр("ru = 'Округление налогов, взносов и отчислений'");
	ГруппаОкруглениеНалоговВзносовОтчислений.Отображение = ОтображениеОбычнойГруппы.Нет; 
	
	НовыйЭлемент = Элементы.Добавить("ПорядокОкругленияРезультатовРасчетаЗарплатыИстория", Тип("КнопкаФормы"), ГруппаОкруглениеНалоговВзносовОтчислений);
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	НовыйЭлемент.ИмяКоманды = "ПорядокОкругленияРезультатовРасчетаЗарплатыИстория";
	
	НоваяТаблица = Элементы.Добавить("ПорядокОкругленияРезультатовРасчетаЗарплаты", Тип("ТаблицаФормы"), ГруппаОкруглениеНалоговВзносовОтчислений);
	НоваяТаблица.ПутьКДанным 		= "ПорядокОкругленияРезультатовРасчетаЗарплаты";
	НоваяТаблица.ВысотаВСтрокахТаблицы = 3;
    НоваяТаблица.МножественныйВыбор = Истина;
    НоваяТаблица.ТолькоПросмотр = Истина;
	
	НовыйЭлемент = Элементы.Добавить("ПорядокОкругленияРезультатовРасчетаЗарплатыВидРасчета", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "ПорядокОкругленияРезультатовРасчетаЗарплаты.ВидРасчета";

	НовыйЭлемент = Элементы.Добавить("ПорядокОкругленияРезультатовРасчетаЗарплатыСпособОкругления", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "ПорядокОкругленияРезультатовРасчетаЗарплаты.СпособОкругления";

	НовыйЭлемент = Элементы.Добавить("ПорядокОкругленияРезультатовРасчетаЗарплатыПериод", Тип("ПолеФормы"), НоваяТаблица);
	НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным 		= "ПорядокОкругленияРезультатовРасчетаЗарплаты.ПериодСтрокой";
	НовыйЭлемент.Заголовок 			= НСтр("ru = 'Действует с'");
	

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРазделовУчетнойПолитики", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияОписаниеДекорация", "Заголовок", НСтр("ru = 'Организация является обособленным подразделением, настройки налогообложения недоступны для редактирования.'"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраховыеВзносыГруппа", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НДФЛГруппа", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчетПособийФСС", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентДоплатыЗаРаботуВВечернееВремя", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентДоплатыЗаВечернееВремяПодпись", "Видимость", Ложь);
	
	// новые элементы
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПорядокОкругленияРезультатовРасчетаЗарплаты", "ПоложениеКоманднойПанели", ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПорядокОкругленияРезультатовРасчетаЗарплаты", "ИзменятьСоставСтрок", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПорядокОкругленияРезультатовРасчетаЗарплаты", "ИзменятьПорядокСтрок", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокиПеречисленияВзносовИОтчисленийВидНалогаВзносаОтчисления", "ПоложениеКоманднойПанели", ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокиПеречисленияВзносовИОтчисленийВидНалогаВзносаОтчисления", "ИзменятьСоставСтрок", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СрокиПеречисленияВзносовИОтчисленийВидНалогаВзносаОтчисления", "ИзменятьПорядокСтрок", Ложь);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
