
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализацияСтатусовСервиса();
	
	Элементы.СтраницаКриптографическаяБиблиотека.Доступность = ИспользоватьОбменЭТД;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьОбменЭТД = Константы.ИспользоватьОбменЭТД.Получить();
	
	АдресСервисаЭТД = ЭТДКлиентСервер.АдресПродуктивногоСтенда();
	
	ПараметрыЭТД = ЭТДСерверПовтИсп.ПолучитьПараметрыЭТД();
	
	Элементы.ГруппаДоступ.ОтображениеСтраниц       = ОтображениеСтраницФормы.Нет;
	Элементы.ГруппаДоступСервис.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура ИспользоватьОбменЭТДПриИзмененииНаСервере(ИспользоватьОбменЭТД, АдресСервисаЭТД)
	
	Константы.ИспользоватьОбменЭТД.Установить(ИспользоватьОбменЭТД);
	
	Если ИспользоватьОбменЭТД Тогда
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("АдресСервисаЭТД", АдресСервисаЭТД);
		ЭТДСервер.ЗаполнитьПараметрыЭТД(Истина, ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбменЭТДПриИзменении(Элемент)
	
	ИспользоватьОбменЭТДПриИзмененииНаСервере(ИспользоватьОбменЭТД, АдресСервисаЭТД);
	
	ИнициализацияСтатусовСервиса();
	
	Элементы.СтраницаКриптографическаяБиблиотека.Доступность = ИспользоватьОбменЭТД;
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСопоставлениеДолжностей(Команда)  
	
	ОткрытьФормуПоВыбору("СопоставлениеДолжностей"); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьСопоставлениеПричинРасторжения(Команда)
	
	ОткрытьФормуПоВыбору("СопоставлениеПричинРасторжения"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСопоставлениеПрофилейНавыков(Команда)
	
	ОткрытьФормуПоВыбору("СопоставлениеПрофилейНавыков");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоВыбору(ИмяФормы)
	
	Если ИмяФормы = "СопоставлениеДолжностей" Тогда
		ОткрытьФорму("Обработка.ОбменЭТД.Форма.СопоставлениеДолжностей");
	ИначеЕсли ИмяФормы = "СопоставлениеПричинРасторжения" Тогда
		ОткрытьФорму("РегистрСведений.СопоставлениеПричинРасторженияЭТД.ФормаСписка");
	ИначеЕсли ИмяФормы = "СопоставлениеПрофилейНавыков" Тогда
		ОткрытьФорму("РегистрСведений.СопоставлениеПрофилейНавыковЭТД.ФормаСписка");
	ИначеЕсли ИмяФормы = "ЗагрузкаДанныхИзЕСУТД" Тогда
		ОткрытьФорму("Обработка.ОбменЭТД.Форма.ЗагрузкаДанныхИзЕСУТД");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗагрузкуДанныхИзЕСУТД(Команда)
	
	ОткрытьФормуПоВыбору("ЗагрузкаДанныхИзЕСУТД");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиКриптографии(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкаКриптографии");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьСтатусы() Экспорт
	
	ПараметрыЭТД = ЭТДКлиентПовтИсп.ПолучитьПараметрыЭТД();
	
	СтатусВебСервиса = ЭТДКлиентСервер.ПроверкаСтатусаСервиса(ПараметрыЭТД.АдресСервисаЭТД, ПараметрыЭТД.АдресПроверкиДоступностиСервиса);
	СтатусЕСУТД		 = ЭТДКлиентСервер.ПроверкаСтатусаСервиса(ПараметрыЭТД.АдресСервисаЭТД, ПараметрыЭТД.АдресПроверкиДоступностиЕСУТД);
	
	Если СтатусВебСервиса Тогда
		Элементы.ГруппаДоступСервис.ТекущаяСтраница = Элементы.СтраницаДоступСервисУспешно;
	Иначе
		Элементы.ГруппаДоступСервис.ТекущаяСтраница = Элементы.СтраницаДоступСервисОшибка;
	КонецЕсли;
	
	Если СтатусЕСУТД Тогда
		Элементы.ГруппаДоступ.ТекущаяСтраница = Элементы.СтраницаДоступУспешно;
	Иначе
		Элементы.ГруппаДоступ.ТекущаяСтраница = Элементы.СтраницаДоступОшибка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияСтатусовСервиса()
	
	Элементы.ГруппаДоступ.Видимость = ИспользоватьОбменЭТД;
	Элементы.ГруппаДоступСервис.Видимость = ИспользоватьОбменЭТД;
	
	Если ИспользоватьОбменЭТД Тогда
		ПроверитьСтатусы();
		
		ПодключитьОбработчикОжидания("ПроверитьСтатусы", 60);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
