#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РегистрНалоговогоУчетаПоИПНиСН");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Регистр налогового учета по индивидуальному подоходному налогу и социальному налогу'");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РегистрНалоговогоУчетаПоИПНиСНОбщий");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Регистр налогового учета по индивидуальному подоходному налогу и социальному налогу в целом по организации'");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаОЗаработнойПлате");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Справка о заработной плате'");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
	НастройкиВарианта.Описание =
		НСтр("ru = 'До 2022 года - Справка с места работы о доходах за последние двенадцать календарных месяцев, предшествующих месяцу,
		|в котором наступило право на социальную выплату на случай потери дохода в связи с беременностью и родами,
		|усыновлением (удочерением) новорожденного ребенка (детей)'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаОСуммеДоходовОПВ");
	НастройкиВарианта.Описание =
		НСтр("ru = 'До 2022 года - Справка о суммах дохода, выплаченных физическому лицу и осуществленных с дохода обязательных пенсионных взносов (для назначения пенсионных выплат физическому лицу)'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаОСуммеДоходовВОСМС");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Справка о сумме доходов, выплаченных физическому лицу, и перечисленных взносах на обязательное социальное медицинское страхование'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаПодтверждениеОПеречисленииОПВ");
	НастройкиВарианта.Описание =
		НСтр("ru = 'До 2022 года - Справка-подтверждение о перечислении обязательных пенсионных взносов (предоставляется по запросу при несовпадении сумм)'");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура СформироватьОтчет(Объект, ДокументРезультат, ДанныеРасшифровки) Экспорт
//	
//	СхемаКомпоновкиДанных = Объект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
//      
//    Настройки = Объект.КомпоновщикНастроек.ПолучитьНастройки();

//    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//      
//    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
//	
//	ВнешниеНаборыДанных = Новый Структура;
//	
//	//ВнешниеНаборыДанных.Вставить("НастройкиПоРазделам", НастройкиПоРазделам);
//	
//    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
//      
//    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
//   
//    ДокументРезультат.Очистить();
//      
//    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//    
//    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
//     
//    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
//	
//КонецПроцедуры

#КонецОбласти

#КонецЕсли
