#Если Не ТолстыйКлиентУправляемоеПриложение Или Сервер Тогда

#Область ОписаниеПеременных

Перем ОтчетИнициализирован;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИнициализироватьОтчет();
	
	Если Не СтандартнаяОбработка Тогда
		Возврат
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.НачислениеДивидендов КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)", "И ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ССЫЛКА Документ.ДивидендыФизическимЛицам", "ССЫЛКА Документ.НачислениеДивидендов");
		
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	Иначе
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.ДивидендыФизическимЛицам КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		// депонирование
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход", "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаПриход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход", "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаРасход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОстаткиИОбороты.Период, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОстаткиИОбороты.Ведомость.ПериодРегистрации, МЕСЯЦ)");
		
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.НалогиВзносыОтчисленияВХО") Тогда
		
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка) КАК БанковскийСчет", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).БанковскийСчет 
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчет");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).Контрагент
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
												|	КОНЕЦ КАК Контрагент");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка) КАК БанковскийСчетКонтрагента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).БанковскийСчетКонтрагента
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчетКонтрагента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДокумента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.ПеречислениеВзносовИОтчислений)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.ПеречислениеВзносовИОтчислений).Сумма
												|			ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
												|	КОНЕЦ КАК СуммаДокумента");
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;

	Иначе
		
		ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка) КАК БанковскийСчет", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).БанковскийСчет 
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчет");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
												|	КОНЕЦ КАК Контрагент");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка) КАК БанковскийСчетКонтрагента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).БанковскийСчетКонтрагента
												|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
												|	КОНЕЦ КАК БанковскийСчетКонтрагента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДокумента", 
												"ВЫБОР
												|	КОГДА ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор) = ТИП(Документ.СписаниеБезналичныхДенежныхСредств)
												|		ТОГДА ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).СуммаДокумента
												|			ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
												|	КОНЕЦ КАК СуммаДокумента");
		ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;
		
	КонецЕсли;

	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов") 
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
        ПараметрПериод = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ПериодОтчета");
		Если ПараметрПериод = Неопределено Тогда
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
		Иначе
			Если ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартныйПериод") Тогда
				ДатаНачала = ПараметрПериод.Значение.ДатаНачала;
				Если ДатаНачала < Дата('20250101') Тогда
					КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Ложь);
				Иначе
					КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
				КонецЕсли;
			Иначе
				КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если КлючВарианта = "СправкаОЗаработнойПлате"
		ИЛИ КлючВарианта = "СправкаСМестаРаботыПередНаступлениемСоциальногоРиска" 
		ИЛИ КлючВарианта = "СправкаОСуммахДоходаОПВ"
		ИЛИ КлючВарианта = "СправкаОСуммеДоходовВОСМС"
		ИЛИ КлючВарианта = "СправкаПодтверждениеОПеречисленииОПВ" Тогда
		
		ПриКомпоновкеРезультатаСправки(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, КлючВарианта);
	
	Иначе
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
        
        Если КлючВарианта = "РегистрНалоговогоУчетаПоИПНиСН"
            ИЛИ КлючВарианта = "РегистрНалоговогоУчетаПоИПНиСНОбщий" Тогда			
            НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
            // Нужно выводить Подписи.
            ВыводитьПодписи = Ложь;
            ПараметрГруппировки = Новый ПараметрКомпоновкиДанных("ВыводитьПодписи");
            ВыводитьПодписи = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрГруппировки).Значение;
            
            ПараметрОтветственный = Новый ПараметрКомпоновкиДанных("Ответственный");
            Ответственный = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрОтветственный).Значение;
            Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
                Ответственный = Пользователи.ТекущийПользователь().ФизическоеЛицо;
            КонецЕсли;
            
            ПараметрДолжностьОтветственного = Новый ПараметрКомпоновкиДанных("ДолжностьОтветственного");
            ДолжностьОтветственного = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДолжностьОтветственного).Значение;
            
            ГруппировкаОрганизация = НайтиПоИмени(КомпоновщикНастроек.Настройки.Структура,"Организация");
			Если НЕ ГруппировкаОрганизация = Неопределено Тогда
				Если НЕ ВыводитьПодписи Тогда
	                ГруппировкаОрганизация.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеИтогов"), РасположениеИтоговКомпоновкиДанных.Нет);                
	                ГруппировкаОрганизация.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"), ТипВыводаТекстаКомпоновкиДанных.НеВыводить);                
	            Иначе
	                ГруппировкаОрганизация.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеИтогов"), РасположениеИтоговКомпоновкиДанных.Конец);                
	                ГруппировкаОрганизация.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеГруппировки"), РасположениеГруппировкиКомпоновкиДанных.Начало);                
	                КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьПараметрыДанных"), ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	                КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьОтбор"), ТипВыводаТекстаКомпоновкиДанных.НеВыводить);                
	            КонецЕсли; 
	        КонецЕсли; 
            
            ЗарплатаКадрыОтчеты.ЗаполнитьПользовательскиеПоляВариантаОтчета(КлючВарианта, НастройкиОтчета);
            
            НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
            ИзменениеПараметраМакетаСогласноНастройкеКомпоновщика("МесяцНалоговогоПериода", "НалоговыйПериод", НастройкиКомпоновщика);
            ПроверкаСтруктурыДанныхКомпоновщикаДляШапкиИПодписей(НастройкиКомпоновщика, СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
        КонецЕсли;

		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
			КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанных"));
            
        НаборыВнешнихДанных = Новый Структура;
        
        ОтветственныеЛицаОрганизации = Новый ТаблицаЗначений;
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Организация",									Новый ОписаниеТипов("СправочникСсылка.Организации"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Руководитель",									Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ГлавныйБухгалтер",							    Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Ответственный",							        Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьРуководителя",					        Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьГлавногоБухгалтера",					Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьОтветственного",					    Новый ОписаниеТипов("Строка"));
        Если КлючВарианта = "РегистрНалоговогоУчетаПоИПНиСН"
            ИЛИ КлючВарианта = "РегистрНалоговогоУчетаПоИПНиСНОбщий" Тогда			
            ПериодОтчета = МакетКомпоновкиДанных.ЗначенияПараметров.ПериодОтчета.Значение;
            ОтветственныеЛицаОрганизации = ЗаполнитьОтветсвенныеЛицаОрганизации(ОтветственныеЛицаОрганизации, ПериодОтчета, Ответственный, ДолжностьОтветственного);
        КонецЕсли;    
        
        НаборыВнешнихДанных.Вставить("ОтветственныеЛицаОрганизации", ОтветственныеЛицаОрганизации);
        
        ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
        ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,НаборыВнешнихДанных, ДанныеРасшифровки, Истина);
        
        ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ЗначениеВДанныеФормы(ЭтотОбъект, Форма.Отчет);
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> "СхемаИнициализирована" Тогда
		
		ИнициализироватьОтчет();
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
		КлючСхемы = "СхемаИнициализирована";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьОтчетРасшифровку(Параметры, ДокументРезультат) Экспорт
	
	СхемаКомпоновки = Отчеты.РегистрНалоговогоУчетаПоИПНиСН.ПолучитьМакет(Параметры.ИмяСКД);
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ТекстЗапроса = СхемаКомпоновки.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.НачислениеДивидендов КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)", "И ИСТИНА");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		СхемаКомпоновки.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	Иначе
		ТекстЗапроса = СхемаКомпоновки.НаборыДанных.Данные.Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РегистрацияПрочихДоходов КАК ДивидендыФизическимЛицам", "Документ.ДивидендыФизическимЛицам КАК ДивидендыФизическимЛицам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ПланируемаяДатаВыплаты, МЕСЯЦ)", "НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.ДатаВыплаты, МЕСЯЦ)");
		// депонирование
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), МЕСЯЦ, , ЛОЖЬ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты", "РегистрНакопления.ВзаиморасчетыСДепонентами.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, МЕСЯЦ) КАК ВзаиморасчетыСДепонентамиОстаткиИОбороты");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход", "-ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаПриход");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход", "ВзаиморасчетыСДепонентамиОстаткиИОбороты.СуммаРасход");
		СхемаКомпоновки.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	КонецЕсли;

	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек("РегистрНалоговогоУчетаПоИПНиСНОбщий", Параметры, СхемаКомпоновки);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов") 
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
        ПараметрПериод = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ПериодОтчета");
		Если ПараметрПериод = Неопределено Тогда
			НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
		Иначе
			Если ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартныйПериод") Тогда
				ДатаНачала = ПараметрПериод.Значение.ДатаНачала;
				Если ДатаНачала < Дата('20250101') Тогда
					НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Ложь);
				Иначе
					НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
				КонецЕсли;
			Иначе
				НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ИспользоватьВедомостиДляВыплатыПрочихДоходов", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
    НаборыВнешнихДанных = Новый Структура;
    ОтветственныеЛицаОрганизации = Новый ТаблицаЗначений;
    ОтветственныеЛицаОрганизации.Колонки.Добавить("Организация",									Новый ОписаниеТипов("СправочникСсылка.Организации"));
    ОтветственныеЛицаОрганизации.Колонки.Добавить("Руководитель",									Новый ОписаниеТипов("Строка"));
    ОтветственныеЛицаОрганизации.Колонки.Добавить("ГлавныйБухгалтер",							    Новый ОписаниеТипов("Строка"));
    ОтветственныеЛицаОрганизации.Колонки.Добавить("Ответственный",							        Новый ОписаниеТипов("Строка"));
    ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьРуководителя",					        Новый ОписаниеТипов("Строка"));
    ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьГлавногоБухгалтера",					Новый ОписаниеТипов("Строка"));
    ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьОтветственного",					    Новый ОписаниеТипов("Строка"));  
    
    НаборыВнешнихДанных.Вставить("ОтветственныеЛицаОрганизации", ОтветственныеЛицаОрганизации);
    
    ГруппировкаОрганизация = НайтиПоИмени(КомпоновщикНастроек.Настройки.Структура,"Организация");
    ГруппировкаОрганизация.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеИтогов"), РасположениеИтоговКомпоновкиДанных.Нет);                
    ГруппировкаОрганизация.ПараметрыВывода.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеГруппировки"), РасположениеГруппировкиКомпоновкиДанных.Нет);                

	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиОтчета);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, НаборыВнешнихДанных, , Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроек(КлючВарианта, ПараметрыОтчета, СхемаКД)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаОтчета;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	
	КомпНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));
	КомпНастроек.ЗагрузитьНастройки(СхемаКД.ВариантыНастроек[КлючВарианта].Настройки);
	КомпНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	
	ПараметрПериод = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпНастроек, "ПериодОтчета");
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
		ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;
	КонецЕсли;
	
	
	Настройки = КомпНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОтборСтруктурныхЕдиниц = ПолучитьСписокСтруктурныхЕдиниц(ПараметрыОтчета);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно, Организация);	
	
	Если ПараметрыОтчета.ИндивидуальныйПредприниматель Тогда
		УстановитьОтборИП(ПараметрыОтчета, Отбор);
	КонецЕсли;
	
	Если ПараметрыОтчета.Форма = "0" ИЛИ (ПараметрыОтчета.Форма = "910.00" И ПараметрыОтчета.ДатаНачалаПериодаОтчета < Дата('2023.01.01')) Тогда
		
		Если ПараметрыОтчета.Свойство("РегистрацияВНО") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "РегистрацияВНалоговомОргане", ВидСравненияКомпоновкиДанных.Равно, ПараметрыОтчета.РегистрацияВНО);	
        КонецЕсли;
        
        Если ПараметрыОтчета.Свойство("СписокФизическихЛиц")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.СписокФизическихЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			
		ИначеЕсли ПараметрыОтчета.Свойство("Строка") Тогда
            Если Найти(ПараметрыОтчета.Строка, "18") > 0 Тогда
                ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета, Ложь);
                Если ОтборФизЛиц <> Неопределено
                    И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
                ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
                КонецЕсли;
                
            ИначеЕсли Найти(ПараметрыОтчета.Строка, "19") > 0 Тогда
                ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета);
                Если ОтборФизЛиц <> Неопределено
                    И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
                ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
                КонецЕсли;
            КонецЕсли; 
        КонецЕсли; 
		
	ИначеЕсли ПараметрыОтчета.Форма = "910.00" И ПараметрыОтчета.ДатаНачалаПериодаОтчета >= Дата('2023.01.01') Тогда
		
		Если ПараметрыОтчета.Свойство("РегистрацияВНО") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "РегистрацияВНалоговомОргане", ВидСравненияКомпоновкиДанных.Равно, ПараметрыОтчета.РегистрацияВНО);
        КонецЕсли;
        
        Если ПараметрыОтчета.Свойство("СписокФизическихЛиц")
            И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
            
            ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.СписокФизическихЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
            
        ИначеЕсли ПараметрыОтчета.Свойство("Строка") Тогда
            Если Прав(ПараметрыОтчета.Строка, 2) = "19" Тогда
                ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета, Ложь);
                Если ОтборФизЛиц <> Неопределено
                    И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
                ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);
                КонецЕсли;
            ИначеЕсли Прав(ПараметрыОтчета.Строка, 2) = "20" Тогда
                ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета);
                Если ОтборФизЛиц <> Неопределено
                    И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
                ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
                    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "910.03" Тогда
		
		Если ПараметрыОтчета.Свойство("СписокФизическихЛиц")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.СписокФизическихЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			
		ИначеЕсли ПараметрыОтчета.Свойство("ФизическоеЛицо")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.ФизическоеЛицо, ВидСравненияКомпоновкиДанных.Равно);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "1" Тогда
		
		Если ПараметрыОтчета.Свойство("СписокСтруктурныхЕдиниц") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "РегистрацияВНалоговомОргане", ВидСравненияКомпоновкиДанных.ВСписке, ПараметрыОтчета.СписокСтруктурныхЕдиниц);	
		КонецЕсли;
		
		Если ПараметрыОтчета.Свойство("СписокФизическихЛиц")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.СписокФизическихЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "2" ИЛИ ПараметрыОтчета.Форма = "910.02" Тогда
		
		Если ПараметрыОтчета.Свойство("СписокФизическихЛиц")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.СписокФизическихЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			
		ИначеЕсли ПараметрыОтчета.Свойство("ФизическоеЛицо")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.ФизическоеЛицо, ВидСравненияКомпоновкиДанных.Равно)
			
		Иначе
			
			ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета);
			Если ОтборФизЛиц <> Неопределено
				И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "3" Тогда
		
		// отбираем по РегистрацияВНО, тк 200.03 может быть собрана по справочнику Подразделения 
		Если ПараметрыОтчета.Свойство("РегистрацияВНО") Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "РегистрацияВНалоговомОргане", ВидСравненияКомпоновкиДанных.Равно, ПараметрыОтчета.РегистрацияВНО);	
		Иначе
			// поддержим работу ранее сохраненых отчетов без РегистрацияВНО
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Отбор, "Организация", , ОтборСтруктурныхЕдиниц, ВидСравненияКомпоновкиДанных.ВСписке);
		КонецЕсли;
		
		Если ПараметрыОтчета.Свойство("СписокФизическихЛиц")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.СписокФизическихЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыОтчета.Форма = "5" ИЛИ ПараметрыОтчета.Форма = "910.01" ИЛИ ПараметрыОтчета.Форма = "6" Тогда
		
		Если ПараметрыОтчета.Свойство("СписокФизическихЛиц")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.СписокФизическихЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			
		ИначеЕсли ПараметрыОтчета.Свойство("ФизическоеЛицо")
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.ФизическоеЛицо, ВидСравненияКомпоновкиДанных.Равно)
			
		Иначе
			
			ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета, Ложь);
			Если ОтборФизЛиц <> Неопределено
				И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
			ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОтчета.Форма <> "3" И ПараметрыОтчета.Форма <> "0" Тогда
		
		Если ОтборСтруктурныхЕдиниц <> Неопределено Тогда
			ОтборСтруктурныхЕдиниц.Добавить(Организация);
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(Отбор, "Организация", , ОтборСтруктурныхЕдиниц, ВидСравненияКомпоновкиДанных.ВСписке);
		КонецЕсли;
		
	КонецЕсли;

	Если ПараметрыОтчета.Свойство("ТолькоГражданеРК") И ПараметрыОтчета.ТолькоГражданеРК Тогда 
		
		ОтборФизЛиц = ПолучитьСписокПоГражданству(ПараметрыОтчета, Ложь);
		Если ОтборФизЛиц <> Неопределено
			И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ОтборФизЛиц, ВидСравненияКомпоновкиДанных.ВСписке);
		ИначеЕсли Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", "", ВидСравненияКомпоновкиДанных.Равно);						
		КонецЕсли;
			
	КонецЕсли;
	
	ДобавитьПолеЗадолженностьПоДоходам(Настройки, ПараметрыОтчета);
	
	Возврат КомпНастроек.ПолучитьНастройки();
	
КонецФункции

Функция ПолучитьСписокПоГражданству(ПараметрыОтчета, БезГражданства = Истина)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамПериодС",ПараметрыОтчета.ДатаНачалаПериодаОтчета);
	Запрос.УстановитьПараметр("парамПериодПо",ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	ИсключаемыеФизическиеЛица = Новый Массив;
	
	Если ПараметрыОтчета.Свойство("ИндивидуальныйПредприниматель")
		И ПараметрыОтчета.ИндивидуальныйПредприниматель Тогда
		
		ИндивидуальныйПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "ИндивидуальныйПредприниматель");
		
		ИсключаемыеФизическиеЛица.Добавить(ИндивидуальныйПредприниматель);
			
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ИсключаемыеФизическиеЛица", ИсключаемыеФизическиеЛица);

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ДанныеПроизводственногоКалендаря.Дата, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТ_ДатыПериодовГода
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &парамПериодС И &парамПериодПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	ФизическиеЛица.Ссылка КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	ВТ_ДатыПериодовГода КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	Периоды.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ГражданствоФизЛиц.Период) ЕСТЬ NULL
	|			ТОГДА ГражданствоФизЛицСрезПоследних.Период
	|		ИНАЧЕ МАКСИМУМ(ГражданствоФизЛиц.Период)
	|	КОНЕЦ КАК ПериодСреза
	|ПОМЕСТИТЬ ВТ_ГражданствоФизЛицСрезПоследних
	|ИЗ
	|	ВТ_Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизЛиц
	|		ПО (Периоды.Период >= НАЧАЛОПЕРИОДА(ГражданствоФизЛиц.Период, МЕСЯЦ))
	|			И Периоды.ФизЛицо = ГражданствоФизЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&парамПериодПо) КАК ГражданствоФизЛицСрезПоследних
	|		ПО Периоды.ФизЛицо = ГражданствоФизЛицСрезПоследних.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Период,
	|	Периоды.ФизЛицо,
	|	ГражданствоФизЛицСрезПоследних.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодСреза,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо
	|ИЗ
	|	ВТ_ГражданствоФизЛицСрезПоследних КАК ГражданствоФизЛицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц КАК ГражданствоФизЛиц
	|		ПО ГражданствоФизЛицСрезПоследних.ПериодСреза = ГражданствоФизЛиц.Период
	|			И ГражданствоФизЛицСрезПоследних.ФизЛицо = ГражданствоФизЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(&парамПериодПо, ) КАК СтатусФизическихЛицКакНалогоплательщиковСрезПоследних
	|		ПО ГражданствоФизЛицСрезПоследних.ФизЛицо = СтатусФизическихЛицКакНалогоплательщиковСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	" + ?(БезГражданства, "НЕ", "") + " ВЫБОР
	|		КОГДА ГражданствоФизЛиц.Страна ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
	|		ИНАЧЕ ГражданствоФизЛиц.Страна
	|	КОНЕЦ = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
	|	И НЕ ГражданствоФизЛицСрезПоследних.ФизЛицо В (&ИсключаемыеФизическиеЛица)";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСписокСтруктурныхЕдиниц(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСтруктурныхЕдиниц",ПараметрыОтчета.СписокСтруктурныхЕдиниц);
	Запрос.УстановитьПараметр("Организация",ПараметрыОтчета.Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.РегистрацияВНалоговомОргане В(&СписокСтруктурныхЕдиниц)
	|	И Организации.Ссылка <> &Организация";
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Процедура УстановитьОтборИП(ПараметрыОтчета, Отбор)
	
	ИндивидуальныйПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "ИндивидуальныйПредприниматель");
	
	Если НЕ ПараметрыОтчета.Свойство("ИДИменПоказателей")
		ИЛИ ПараметрыОтчета.ИДИменПоказателей.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.НеРавно);
		Возврат;
		
	КонецЕсли;
	
	ИмяЯчейки = ПараметрыОтчета.ИДИменПоказателей[0];
	
	// ячейки расшиврофки определяются в отчете формы
	Если ПараметрыОтчета.ДатаНачалаПериодаОтчета >= Дата('20210101')
		И ПараметрыОтчета.Свойство("ЭтоРасшиврофкаИП") Тогда
		
		// данные по ИП + сотрудники - параметр ЭтоРасшиврофкаИП пустой
		Если ЗначениеЗаполнено(ПараметрыОтчета.ЭтоРасшиврофкаИП) Тогда
			
			Если ПараметрыОтчета.ЭтоРасшиврофкаИП = Истина Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.Равно);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.НеРавно);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Лев(ИмяЯчейки,10) = "П000020005"
				ИЛИ Лев(ИмяЯчейки,10) = "П000030010"
				ИЛИ Лев(ИмяЯчейки,10) = "П000120012"
				ИЛИ Лев(ИмяЯчейки,10) = "П000120018" Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.Равно);
			
		ИначеЕсли Лев(ИмяЯчейки,10) <> "П000020008" 
					И Лев(ИмяЯчейки,10) <> "П000030012" 
					И Лев(ИмяЯчейки,10) <> "П000120020" Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.НеРавно);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеЗадолженностьПоДоходам(Настройки, ПараметрыОтчета)
	
	Если НЕ ПараметрыОтчета.Свойство("ИДИменПоказателей")
		ИЛИ ПараметрыОтчета.ИДИменПоказателей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЯчейки = ПараметрыОтчета.ИДИменПоказателей[0];
	
	Если ИмяЯчейки = "П000110003001" Тогда
		Если Настройки.Структура.Количество() <> 0
			 И Настройки.Структура[0].Структура.Количество() <> 0
			 И Настройки.Структура[0].Структура[0].Структура.Количество() <> 0
			 И Настройки.Структура[0].Структура[0].Структура[0].Колонки.Количество() <> 0 Тогда
			ОтчетыСервер.ДобавитьВыбранноеПоле(Настройки.Структура[0].Структура[0].Структура[0].Колонки[0].Выбор, "ЗадолженностьПоДоходамНаКонец","Задолженность по невыплаченным доходам");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьОтчет() Экспорт
	
	Если Не ОтчетИнициализирован Тогда
		
		//СоответсвиеДополнительныхПолейПредставлениям = КадровыйУчетРасширенный.ДополнительныеПоляОтчетаКадроваяИсторияСотрудников();
		ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект);
		
		ОтчетИнициализирован = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультатаСправки(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, КлючВарианта)
	
	СтандартнаяОбработка = Ложь;
	СправкаОЗаработнойПлате = (КлючВарианта = "СправкаОЗаработнойПлате");
	СправкаПодтверждениеОПеречисленииОПВ = (КлючВарианта = "СправкаПодтверждениеОПеречисленииОПВ");
	СправкаОСуммахДоходаОПВ = (КлючВарианта = "СправкаОСуммахДоходаОПВ");
	СправкаОСуммахДоходаВОСМС = (КлючВарианта = "СправкаОСуммеДоходовВОСМС");
	
	Попытка
		
		// Параметры документа
		ДокументРезультат.ТолькоПросмотр = Истина;
		ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Справка";
		ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ДокументРезультат.АвтоМасштаб = Истина;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		
		Если СправкаОЗаработнойПлате Тогда
			НатуральныйДоход = ПолучитьСписокНачисленийДоходВНатуральнойФорме();
			Если ЗначениеЗаполнено(НатуральныйДоход) Тогда
				НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("НатуральныйДоход", НатуральныйДоход);
			КонецЕсли;
		КонецЕсли;
		
		Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("МакетКомпоновкиДанных")
			И КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.МакетКомпоновкиДанных <> Неопределено Тогда
			
			МакетКомпоновкиДанных = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.МакетКомпоновкиДанных;
			КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Удалить("МакетКомпоновкиДанных");
			
		Иначе
			
			МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
				НастройкиОтчета, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			
			Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ФормированиеМакетаКомпоновкиДанных") Тогда
				
				КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СкомпонованныйМакетКомпоновкиДанных", МакетКомпоновкиДанных);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
        
        НаборыВнешнихДанных = Новый Структура;
        ОтветственныеЛицаОрганизации = Новый ТаблицаЗначений;
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Организация",									Новый ОписаниеТипов("СправочникСсылка.Организации"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Руководитель",									Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ГлавныйБухгалтер",							    Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("Ответственный",							        Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьРуководителя",					        Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьГлавногоБухгалтера",					Новый ОписаниеТипов("Строка"));
        ОтветственныеЛицаОрганизации.Колонки.Добавить("ДолжностьОтветственного",					    Новый ОписаниеТипов("Строка"));  
        
        НаборыВнешнихДанных.Вставить("ОтветственныеЛицаОрганизации", ОтветственныеЛицаОрганизации);

		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, НаборыВнешнихДанных, , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ДанныеОтчета = Новый ДеревоЗначений;
		ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
        Если СправкаОСуммахДоходаОПВ
            ИЛИ СправкаОСуммахДоходаВОСМС Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.РегистрНалоговогоУчетаПоИПНиСН.ПФ_MXL_СправкаОСуммахДохода");
		Иначе	
			Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.РегистрНалоговогоУчетаПоИПНиСН.ПФ_MXL_Справка");
		КонецЕсли;	
			
		Если СправкаОЗаработнойПлате Тогда
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧОбщее,ШапкаТЧОбщееПродолжение,ШапкаТЧЕП,ШапкаТЧЕППродолжение,СтрокаТЧОбщее,СтрокаТЧОбщееПродолжение,СтрокаТЧЕП,СтрокаТЧЕППродолжение,ПодвалТЧОбщее,ПодвалТЧОбщееПродолжение,ПодвалТЧЕП,ПодвалТЧЕППродолжение,Группировка,
                                        |ШапкаТЧСОДоходыНалоговогоАгента, СтрокаТЧСОДоходыНалоговогоАгента, ПодвалТЧСОДоходыНалоговогоАгента");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаОЗаработнойПлате");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаОЗаработнойПлате");
			Макеты.ШапкаТЧОбщее = Макет.ПолучитьОбласть("ШапкаТЧСправкаОЗаработнойПлате|ОПВиИПНиВОСМС");
			Макеты.ШапкаТЧОбщееПродолжение = Макет.ПолучитьОбласть("ШапкаТЧСправкаОЗаработнойПлате|ОПВиИПНиВОСМСПродолжение");
			Макеты.ШапкаТЧЕП = Макет.ПолучитьОбласть("ШапкаТЧСправкаОЗаработнойПлате|ЕП");
			Макеты.ШапкаТЧЕППродолжение = Макет.ПолучитьОбласть("ШапкаТЧСправкаОЗаработнойПлате|ЕППродолжение");
			Макеты.ШапкаТЧСОДоходыНалоговогоАгента = Макет.ПолучитьОбласть("ШапкаТЧСправкаОЗаработнойПлате|СОДоходыНалоговогоАгента");
			Макеты.СтрокаТЧОбщее = Макет.ПолучитьОбласть("СтрокаТЧСправкаОЗаработнойПлате|ОПВиИПНиВОСМС");
			Макеты.СтрокаТЧОбщееПродолжение = Макет.ПолучитьОбласть("СтрокаТЧСправкаОЗаработнойПлате|ОПВиИПНиВОСМСПродолжение");
			Макеты.СтрокаТЧЕП = Макет.ПолучитьОбласть("СтрокаТЧСправкаОЗаработнойПлате|ЕП");
			Макеты.СтрокаТЧЕППродолжение = Макет.ПолучитьОбласть("СтрокаТЧСправкаОЗаработнойПлате|ЕППродолжение");
			Макеты.СтрокаТЧСОДоходыНалоговогоАгента = Макет.ПолучитьОбласть("СтрокаТЧСправкаОЗаработнойПлате|СОДоходыНалоговогоАгента");
			Макеты.ПодвалТЧОбщее = Макет.ПолучитьОбласть("ПодвалТЧСправкаОЗаработнойПлате|ОПВиИПНиВОСМС");
			Макеты.ПодвалТЧОбщееПродолжение = Макет.ПолучитьОбласть("ПодвалТЧСправкаОЗаработнойПлате|ОПВиИПНиВОСМСПродолжение");
			Макеты.ПодвалТЧЕП = Макет.ПолучитьОбласть("ПодвалТЧСправкаОЗаработнойПлате|ЕП");
			Макеты.ПодвалТЧЕППродолжение = Макет.ПолучитьОбласть("ПодвалТЧСправкаОЗаработнойПлате|ЕППродолжение");
			Макеты.ПодвалТЧСОДоходыНалоговогоАгента = Макет.ПолучитьОбласть("ПодвалТЧСправкаОЗаработнойПлате|СОДоходыНалоговогоАгента");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		ИначеЕсли СправкаПодтверждениеОПеречисленииОПВ Тогда
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаПодтверждениеОПеречисленииОПВ");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		ИначеЕсли СправкаОСуммахДоходаОПВ Тогда
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,ПодвалТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаОСуммахДоходаОПВ");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаОСуммахДоходаОПВ");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаОСуммахДоходаОПВ");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаОСуммахДоходаОПВ");
			Макеты.ПодвалТЧ = Макет.ПолучитьОбласть("ПодвалТЧСправкаОСуммахДоходаОПВ");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		ИначеЕсли СправкаОСуммахДоходаВОСМС Тогда
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,ПодвалТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаОСуммахДоходаВОСМС");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаОСуммахДоходаВОСМС");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаОСуммахДоходаВОСМС");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаОСуммахДоходаВОСМС");
			Макеты.ПодвалТЧ = Макет.ПолучитьОбласть("ПодвалТЧСправкаОСуммахДоходаВОСМС");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		Иначе
			
			Макеты = Новый Структура("Шапка,Подвал,ШапкаТЧ,СтрокаТЧ,ПодвалТЧ,Группировка");
			
			Макеты.Шапка = Макет.ПолучитьОбласть("ШапкаСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.Подвал = Макет.ПолучитьОбласть("ПодвалСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.ПодвалТЧ = Макет.ПолучитьОбласть("ПодвалТЧСправкаСМестаРаботыПередНаступлениемСоциальногоРиска");
			Макеты.Группировка = Макет.ПолучитьОбласть("Группировка");
			
		КонецЕсли;
		
		
		ЕстьГруппировкаПоОрганизации = ДанныеОтчета.Строки.Количество() > 1;
		
		Организация = Неопределено;
		Подразделение = Неопределено;
		
		ДокументРезультатСтраница = Новый ТабличныйДокумент;
		
		Если СправкаОЗаработнойПлате Тогда
		
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				ОрганизацияНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "НаименованиеПолное");
				ОрганизацияБИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "ИНН");
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер,ДолжностьРуководителя, Ответственный", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
					ЗаполняемыеЗначения.Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаполняемыеЗначения.Ответственный, "ФизическоеЛицо");
					Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
						СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Ответственный);
					КонецЕсли;
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФамилияИО");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.Руководитель = ЗаполняемыеЗначения.ДолжностьРуководителя;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.ГлавныйБухгалтер = ЗаполняемыеЗначения.ГлавныйБухгалтер;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Ответственный, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОИсполнитель = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
				КонецЕсли;
				
				ДолжностьОтветственного = "";
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Ответственный) Тогда
					СписокФизЛиц = Новый Массив;
					СписокФизЛиц.Добавить(ЗаполняемыеЗначения.Ответственный);
					ОсновныеСотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизЛиц, Истина, Организация, ТекущаяДатаСеанса());
					
					Если ОсновныеСотрудникиФизическихЛиц.Количество() > 0  Тогда
						СписокСотрудников = Новый Массив;
						СписокСотрудников.Добавить(ОсновныеСотрудникиФизическихЛиц[0].Сотрудник);
						
						КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, "Должность");
						
						Если КадровыеДанные.Количество() > 0 Тогда
							ДолжностьОтветственного = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанные[0].Должность, "Наименование");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ПараметрыОтветственныхЛиц.Исполнитель = ДолжностьОтветственного;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры,СтрокаФизЛица);
					Макеты.Шапка.Параметры.ТабельныйНомер = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(СтрокаФизЛица.ТабельныйНомер, Истина, Истина);
					Макеты.Шапка.Параметры.ИИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.НачалоПериода = МакетКомпоновкиДанных.ЗначенияПараметров.НачалоПериода.Значение;
					Макеты.Шапка.Параметры.КонецПериода =  МакетКомпоновкиДанных.ЗначенияПараметров.КонецПериода.Значение;
					Макеты.Шапка.Параметры.Организация = ОрганизацияНаименование;
					Макеты.Шапка.Параметры.БИННалогоплательщика = ОрганизацияБИН;
					Макеты.Шапка.Параметры.ТекущаяДата = ТекущаяДатаСеанса();
					СведенияОСотруднике = "";
					Если ЗначениеЗаполнено(СтрокаФизЛица.ПодразделениеНаКонецПериода) Тогда
						СведенияОСотруднике = Строка(СтрокаФизЛица.ПодразделениеНаКонецПериода);
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаФизЛица.ДолжностьНаКонецПериода) Тогда
						СведенияОСотруднике = СведенияОСотруднике + ", " + Строка(СтрокаФизЛица.ДолжностьНаКонецПериода);
					КонецЕсли;
					Макеты.Шапка.Параметры.СведенияОСотруднике = СведенияОСотруднике;
					
					ДокументРезультат.Вывести(Макеты.Шапка);
					
					Если СтрокаФизЛица.СуммаЕП > 0 Тогда
						ШапкаТЧ = Макеты.ШапкаТЧЕП;
						ШапкаТЧПродолжение = Макеты.ШапкаТЧЕППродолжение;
						СтрокаТЧ = Макеты.СтрокаТЧЕП;
						СтрокаТЧПродолжение = Макеты.СтрокаТЧЕППродолжение;
						ПодвалТЧ = Макеты.ПодвалТЧЕП;
						ПодвалТЧПродолжение = Макеты.ПодвалТЧЕППродолжение; 
                    ИначеЕсли СтрокаФизЛица.СуммаСОПрочиеДоходы > 0 Тогда 
						ШапкаТЧ = Макеты.ШапкаТЧСОДоходыНалоговогоАгента;
						ШапкаТЧПродолжение = Макеты.ШапкаТЧОбщееПродолжение;
						СтрокаТЧ = Макеты.СтрокаТЧСОДоходыНалоговогоАгента;
						СтрокаТЧПродолжение = Макеты.СтрокаТЧОбщееПродолжение;
						ПодвалТЧ = Макеты.ПодвалТЧСОДоходыНалоговогоАгента;
						ПодвалТЧПродолжение = Макеты.ПодвалТЧОбщееПродолжение;
					Иначе
						ШапкаТЧ = Макеты.ШапкаТЧОбщее;
						ШапкаТЧПродолжение = Макеты.ШапкаТЧОбщееПродолжение;
						СтрокаТЧ = Макеты.СтрокаТЧОбщее;
						СтрокаТЧПродолжение = Макеты.СтрокаТЧОбщееПродолжение;
						ПодвалТЧ = Макеты.ПодвалТЧОбщее;
						ПодвалТЧПродолжение = Макеты.ПодвалТЧОбщееПродолжение;
					КонецЕсли;
					
					ДокументРезультат.Вывести(ШапкаТЧ);
					ДокументРезультат.Присоединить(ШапкаТЧПродолжение);
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если СтрокаМесяцев.СуммаДохода = 0
							И СтрокаМесяцев.СуммаОПВ = 0
							И СтрокаМесяцев.СуммаИПН = 0
							И СтрокаМесяцев.СуммаВОСМС = 0
							И СтрокаМесяцев.СуммаЕП = 0
							И СтрокаМесяцев.СуммаСОПрочиеДоходы = 0
							И СтрокаМесяцев.ИтогоКВыплатеРаботнику = 0 Тогда
								Продолжить;
						КонецЕсли;
						                                                                                               
						ЗаполнитьЗначенияСвойств(СтрокаТЧ.Параметры,СтрокаМесяцев);
						ЗаполнитьЗначенияСвойств(СтрокаТЧПродолжение.Параметры,СтрокаМесяцев);
						СтрокаТЧ.Параметры.Месяц = СтрокаМесяцев.МесяцНалоговогоПериода;
						
						Если НЕ ДокументРезультат.ПроверитьВывод(СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(ШапкаТЧ);
							ДокументРезультат.Присоединить(ШапкаТЧПродолжение);
						КонецЕсли;
						
						ДокументРезультат.Вывести(СтрокаТЧ);
						ДокументРезультат.Присоединить(СтрокаТЧПродолжение);
						
					КонецЦикла;
					
					Если НЕ ДокументРезультат.ПроверитьВывод(ПодвалТЧ) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(ШапкаТЧ);
						ДокументРезультат.Присоединить(ШапкаТЧПродолжение);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ПодвалТЧ.Параметры,СтрокаФизЛица);
					ЗаполнитьЗначенияСвойств(ПодвалТЧПродолжение.Параметры,СтрокаФизЛица);
					ДокументРезультат.Вывести(ПодвалТЧ);
					ДокументРезультат.Присоединить(ПодвалТЧПродолжение);
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.Подвал) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
				
			КонецЦикла;
			
		ИначеЕсли  СправкаПодтверждениеОПеречисленииОПВ Тогда
			
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ПолныйАдрЮР";
				СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтрокаОрганизации.Организация,ТекущаяДатаСеанса(),СтрокаСведений);
				ПолныйАдрЮР = "";
				ИННЮЛ = "";
				НаимЮЛПол = "";
				
				Если СведенияОбОрганизации.Количество() > 0 Тогда
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолныйАдрЮР) Тогда
						ПолныйАдрЮР = СокрЛП(СведенияОбОрганизации.ПолныйАдрЮР);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ИННЮЛ) Тогда
						ИННЮЛ = СокрЛП(СведенияОбОрганизации.ИННЮЛ);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.НаимЮЛПол) Тогда
						НаимЮЛПол = СокрЛП(СведенияОбОрганизации.НаимЮЛПол);
					КонецЕсли;
				КонецЕсли;
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер ", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФИОПолные");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры,СтрокаФизЛица);
					Макеты.Шапка.Параметры.ФизическоеЛицо 	= СтрокаФизЛица.ФизическоеЛицо;
					Макеты.Шапка.Параметры.Фамилия			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Фамилия");
					Макеты.Шапка.Параметры.Имя 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Имя");
					Макеты.Шапка.Параметры.Отчество 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Отчество");
					Макеты.Шапка.Параметры.ИИН 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.ДатаРождения 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ДатаРождения");
					Макеты.Шапка.Параметры.НачалоПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.НачалоПериода.Значение;
					Макеты.Шапка.Параметры.КонецПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.КонецПериода.Значение;
					Макеты.Шапка.Параметры.ДокументВид		= СтрокаФизЛица.ДокументВид;
					Макеты.Шапка.Параметры.ДокументНомер	= СтрокаФизЛица.ДокументНомер;
					Макеты.Шапка.Параметры.ДокументаВыдан	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru ='%1 %2'"), СтрокаФизЛица.ДокументКемВыдан, Формат(СтрокаФизЛица.ДокументДатаВыдачи, "ДЛФ=Д"));

					Макеты.Шапка.Параметры.Организация = НаимЮЛПол;
					Макеты.Шапка.Параметры.БИННалогоплательщика = ИННЮЛ;
					Макеты.Шапка.Параметры.АдресОрганизации = ПолныйАдрЮР;
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					КоличествоМесяцев = 0;
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если СтрокаМесяцев.СуммаОПВПеречисленный = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры,СтрокаМесяцев);
						Макеты.СтрокаТЧ.Параметры.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаМесяцев.Контрагент, "НаименованиеПолное");
						Макеты.СтрокаТЧ.Параметры.БанковскийСчетКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаМесяцев.БанковскийСчетКонтрагента, "НомерСчета");
						Макеты.СтрокаТЧ.Параметры.БИКБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаМесяцев.Банк, "Код");
					
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						КоличествоМесяцев = КоличествоМесяцев + 1;
						
					КонецЦикла;
												
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.Подвал) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
							
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
			КонецЦикла;
			
		ИначеЕсли СправкаОСуммахДоходаОПВ Тогда
			
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ПолныйАдрЮР";
				СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтрокаОрганизации.Организация,ТекущаяДатаСеанса(),СтрокаСведений);
				ПолныйАдрЮР = "";
				ИННЮЛ = "";
				НаимЮЛПол = "";
				
				Если СведенияОбОрганизации.Количество() > 0 Тогда
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолныйАдрЮР) Тогда
						ПолныйАдрЮР = СокрЛП(СведенияОбОрганизации.ПолныйАдрЮР);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ИННЮЛ) Тогда
						ИННЮЛ = СокрЛП(СведенияОбОрганизации.ИННЮЛ);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.НаимЮЛПол) Тогда
						НаимЮЛПол = СокрЛП(СведенияОбОрганизации.НаимЮЛПол);
					КонецЕсли;
				КонецЕсли;
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер ", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФИОПолные");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					Если СтрокаФизЛица.СуммаДохода = 0
						И СтрокаФизЛица.СуммаОПВ = 0
						И СтрокаФизЛица.СуммаПениОПВ = 0
						И СтрокаФизЛица.СуммаОПВПеречисленный = 0 Тогда
						
						Продолжить;
						
					КонецЕсли;
						                                                                                               
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры, СтрокаФизЛица);
					Макеты.Шапка.Параметры.ДатаПодписи		= ТекущаяДатаСеанса();
					Макеты.Шапка.Параметры.Фамилия			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Фамилия");
					Макеты.Шапка.Параметры.Имя 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Имя");
					Макеты.Шапка.Параметры.Отчество 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Отчество");
					Макеты.Шапка.Параметры.ИИН 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.ТабельныйНомер	= ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(СтрокаФизЛица.ТабельныйНомер, Истина, Истина);
					Макеты.Шапка.Параметры.НачалоПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.НачалоПериода.Значение;
					Макеты.Шапка.Параметры.КонецПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.КонецПериода.Значение;

					Макеты.Шапка.Параметры.Организация = НаимЮЛПол;
					Макеты.Шапка.Параметры.БИННалогоплательщика = ИННЮЛ;
					Макеты.Шапка.Параметры.АдресОрганизации = ПолныйАдрЮР;
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					КоличествоМесяцев = 0;
					
					ВыводимыйГод = Дата(1, 1, 1);
					
					ИтогоСуммаДохода = 0;
					ИтогоСуммаОПВ = 0;
					ИтогоСуммаОПВПеречисленный = 0;
					ИтогоСуммаПениОПВ = 0;
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если НЕ Год(СтрокаМесяцев.МесяцНалоговогоПериода) = Год(ВыводимыйГод) Тогда
							
							// выведем итог по году
							Если НЕ ВыводимыйГод = Дата(1, 1, 1) Тогда
								
								Макеты.ПодвалТЧ.Параметры.Год = Год(ВыводимыйГод);
								Макеты.ПодвалТЧ.Параметры.СуммаДохода = ИтогоСуммаДохода;
								Макеты.ПодвалТЧ.Параметры.СуммаОПВ	  = ИтогоСуммаОПВ + ИтогоСуммаПениОПВ;
								Макеты.ПодвалТЧ.Параметры.СуммаОПВПеречисленный = ИтогоСуммаОПВПеречисленный;
								Макеты.ПодвалТЧ.Параметры.СуммаПениОПВ = ИтогоСуммаПениОПВ;
								
								Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
									ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								КонецЕсли;
								
								ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
								
								ВыводимыйГод = СтрокаМесяцев.МесяцНалоговогоПериода;
								
							Иначе
								
								ВыводимыйГод = СтрокаМесяцев.МесяцНалоговогоПериода;
								
							КонецЕсли;
							
							ИтогоСуммаДохода = СтрокаМесяцев.СуммаДохода;
							ИтогоСуммаОПВПеречисленный = СтрокаМесяцев.СуммаОПВПеречисленный;
							ИтогоСуммаПениОПВ = СтрокаМесяцев.СуммаПениОПВ;
							ИтогоСуммаОПВ = СтрокаМесяцев.СуммаОПВ + СтрокаМесяцев.СуммаПениОПВ;
							
						Иначе
						
							ИтогоСуммаДохода = ИтогоСуммаДохода + СтрокаМесяцев.СуммаДохода;
							ИтогоСуммаОПВ = ИтогоСуммаОПВ + СтрокаМесяцев.СуммаОПВ;
							ИтогоСуммаОПВПеречисленный = ИтогоСуммаОПВПеречисленный + СтрокаМесяцев.СуммаОПВПеречисленный;
							ИтогоСуммаПениОПВ = ИтогоСуммаПениОПВ + СтрокаМесяцев.СуммаПениОПВ;
						
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры, СтрокаМесяцев);
						
						// учтем ситуации, когда вся сумма была сторнирована (возврат)
						Если НЕ СтрокаМесяцев.СуммаОПВПеречисленный = 0
							И (ЗначениеЗаполнено(СтрокаМесяцев.ДатаПлатежногоДокумента)
							ИЛИ ЗначениеЗаполнено(СтрокаМесяцев.НомерПлатежногоДокумента)
							ИЛИ ЗначениеЗаполнено(СтрокаМесяцев.ПеречисленоЗаПериод)) Тогда
							
							Макеты.СтрокаТЧ.Параметры.РеквизитыПлатежногоДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2, %3'"),
														Формат(СтрокаМесяцев.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy"), СтрокаМесяцев.НомерПлатежногоДокумента, Формат(СтрокаМесяцев.ПеречисленоЗаПериод, "ДФ='ММММ гггг'"));
														
						Иначе
							Макеты.СтрокаТЧ.Параметры.РеквизитыПлатежногоДокумента = "";
						КонецЕсли;								
						
						Макеты.СтрокаТЧ.Параметры.СуммаОПВ = СтрокаМесяцев.СуммаОПВ + СтрокаМесяцев.СуммаПениОПВ;
						
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						КоличествоМесяцев = КоличествоМесяцев + 1;
						
					КонецЦикла;
												
					Макеты.ПодвалТЧ.Параметры.Год = Год(ВыводимыйГод);
					Макеты.ПодвалТЧ.Параметры.СуммаДохода = ИтогоСуммаДохода;
					Макеты.ПодвалТЧ.Параметры.СуммаОПВ	  = ИтогоСуммаОПВ + ИтогоСуммаПениОПВ;
					Макеты.ПодвалТЧ.Параметры.СуммаОПВПеречисленный = ИтогоСуммаОПВПеречисленный;
					Макеты.ПодвалТЧ.Параметры.СуммаПениОПВ = ИтогоСуммаПениОПВ;
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
					Макеты.Подвал.Параметры.КоличествоМесяцев = КоличествоМесяцев;
					Макеты.Подвал.Параметры.ИтогоСумма = Строка(СтрокаФизЛица.СуммаДохода) + " (" + СокрЛП(РаботаСКурсамиВалют.СформироватьСуммуПрописью(
						СтрокаФизЛица.СуммаДохода, ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты())) + ")";
					
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
			КонецЦикла;
			
		ИначеЕсли СправкаОСуммахДоходаВОСМС Тогда
			
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ПолныйАдрЮР";
				СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтрокаОрганизации.Организация,ТекущаяДатаСеанса(),СтрокаСведений);
				ПолныйАдрЮР = "";
				ИННЮЛ = "";
				НаимЮЛПол = "";
				
				Если СведенияОбОрганизации.Количество() > 0 Тогда
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолныйАдрЮР) Тогда
						ПолныйАдрЮР = СокрЛП(СведенияОбОрганизации.ПолныйАдрЮР);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.ИННЮЛ) Тогда
						ИННЮЛ = СокрЛП(СведенияОбОрганизации.ИННЮЛ);
					КонецЕсли;
					Если ЗначениеЗаполнено(СведенияОбОрганизации.НаимЮЛПол) Тогда
						НаимЮЛПол = СокрЛП(СведенияОбОрганизации.НаимЮЛПол);
					КонецЕсли;
				КонецЕсли;
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер ", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФИОПолные");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФИОПолные,"");
				КонецЕсли;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					Если СтрокаФизЛица.СуммаДохода = 0
						И СтрокаФизЛица.СуммаВОСМС = 0
						И СтрокаФизЛица.СуммаПениВОСМС = 0
						И СтрокаФизЛица.СуммаВОСМСПеречисленный = 0
                        И СтрокаФизЛица.СуммаОблагаемогоДоходаВОСМС = 0 Тогда
						
						Продолжить;
						
					КонецЕсли;
						                                                                                               
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры, СтрокаФизЛица);
					Макеты.Шапка.Параметры.ДатаПодписи		= ТекущаяДатаСеанса();
					Макеты.Шапка.Параметры.Фамилия			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Фамилия");
					Макеты.Шапка.Параметры.Имя 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Имя");
					Макеты.Шапка.Параметры.Отчество 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "Отчество");
					Макеты.Шапка.Параметры.ИИН 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.ТабельныйНомер	= ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(СтрокаФизЛица.ТабельныйНомер, Истина, Истина);
					Макеты.Шапка.Параметры.НачалоПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.НачалоПериода.Значение;
					Макеты.Шапка.Параметры.КонецПериода 	= МакетКомпоновкиДанных.ЗначенияПараметров.КонецПериода.Значение;

					Макеты.Шапка.Параметры.Организация = НаимЮЛПол;
					Макеты.Шапка.Параметры.БИННалогоплательщика = ИННЮЛ;
					Макеты.Шапка.Параметры.АдресОрганизации = ПолныйАдрЮР;
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					КоличествоМесяцев = 0;
					
					ВыводимыйГод = Дата(1, 1, 1);
					
					ИтогоСуммаДохода = 0;
					ИтогоСуммаВОСМС = 0;
					ИтогоСуммаВОСМСПеречисленный = 0;
					ИтогоСуммаПениВОСМС = 0;
                    ИтогоСуммаОблагаемогоДоходаВОСМС = 0;
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если НЕ Год(СтрокаМесяцев.МесяцНалоговогоПериода) = Год(ВыводимыйГод) Тогда
							
							// выведем итог по году
							Если НЕ ВыводимыйГод = Дата(1, 1, 1) Тогда
								
								Макеты.ПодвалТЧ.Параметры.Год = Год(ВыводимыйГод);
								Макеты.ПодвалТЧ.Параметры.СуммаДохода = ИтогоСуммаДохода;
								Макеты.ПодвалТЧ.Параметры.СуммаВОСМС	  = ИтогоСуммаВОСМС + ИтогоСуммаПениВОСМС;
								Макеты.ПодвалТЧ.Параметры.СуммаВОСМСПеречисленный = ИтогоСуммаВОСМСПеречисленный;
								Макеты.ПодвалТЧ.Параметры.СуммаПениВОСМС = ИтогоСуммаПениВОСМС;
								Макеты.ПодвалТЧ.Параметры.СуммаОблагаемогоДоходаВОСМС = ИтогоСуммаОблагаемогоДоходаВОСМС;
								
								Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
									ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								КонецЕсли;
								
								ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
								
								ВыводимыйГод = СтрокаМесяцев.МесяцНалоговогоПериода;
								
							Иначе
								
								ВыводимыйГод = СтрокаМесяцев.МесяцНалоговогоПериода;
								
							КонецЕсли;
							
							ИтогоСуммаДохода = СтрокаМесяцев.СуммаДохода;
							ИтогоСуммаВОСМСПеречисленный = СтрокаМесяцев.СуммаВОСМСПеречисленный;
							ИтогоСуммаПениВОСМС = СтрокаМесяцев.СуммаПениВОСМС;
							ИтогоСуммаВОСМС = СтрокаМесяцев.СуммаВОСМС + СтрокаМесяцев.СуммаПениВОСМС;
                            ИтогоСуммаОблагаемогоДоходаВОСМС = СтрокаМесяцев.СуммаОблагаемогоДоходаВОСМС;
							
						Иначе
						
							ИтогоСуммаДохода = ИтогоСуммаДохода + СтрокаМесяцев.СуммаДохода;
							ИтогоСуммаВОСМС = ИтогоСуммаВОСМС + СтрокаМесяцев.СуммаВОСМС;
							ИтогоСуммаВОСМСПеречисленный = ИтогоСуммаВОСМСПеречисленный + СтрокаМесяцев.СуммаВОСМСПеречисленный;
							ИтогоСуммаПениВОСМС = ИтогоСуммаПениВОСМС + СтрокаМесяцев.СуммаПениВОСМС;
                            ИтогоСуммаОблагаемогоДоходаВОСМС = ИтогоСуммаОблагаемогоДоходаВОСМС + СтрокаМесяцев.СуммаОблагаемогоДоходаВОСМС;
						
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры, СтрокаМесяцев);
						
						// учтем ситуации, когда вся сумма была сторнирована (возврат)
						Если НЕ СтрокаМесяцев.СуммаВОСМСПеречисленный = 0
							И (ЗначениеЗаполнено(СтрокаМесяцев.ДатаПлатежногоДокумента)
							ИЛИ ЗначениеЗаполнено(СтрокаМесяцев.НомерПлатежногоДокумента)
							ИЛИ ЗначениеЗаполнено(СтрокаМесяцев.ПеречисленоЗаПериод)) Тогда
							
							Макеты.СтрокаТЧ.Параметры.РеквизитыПлатежногоДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2, %3'"),
														Формат(СтрокаМесяцев.ДатаПлатежногоДокумента, "ДФ=dd.MM.yyyy"), СтрокаМесяцев.НомерПлатежногоДокумента, Формат(СтрокаМесяцев.ПеречисленоЗаПериод, "ДФ='ММММ гггг'"));
														
						Иначе
							Макеты.СтрокаТЧ.Параметры.РеквизитыПлатежногоДокумента = "";
						КонецЕсли;								
						
						Макеты.СтрокаТЧ.Параметры.СуммаВОСМС = СтрокаМесяцев.СуммаВОСМС + СтрокаМесяцев.СуммаПениВОСМС;
						
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						КоличествоМесяцев = КоличествоМесяцев + 1;
						
					КонецЦикла;
												
					Макеты.ПодвалТЧ.Параметры.Год = Год(ВыводимыйГод);
					Макеты.ПодвалТЧ.Параметры.СуммаДохода = ИтогоСуммаДохода;
					Макеты.ПодвалТЧ.Параметры.СуммаВОСМС	  = ИтогоСуммаВОСМС + ИтогоСуммаПениВОСМС;
					Макеты.ПодвалТЧ.Параметры.СуммаВОСМСПеречисленный = ИтогоСуммаВОСМСПеречисленный;
					Макеты.ПодвалТЧ.Параметры.СуммаПениВОСМС = ИтогоСуммаПениВОСМС;
					Макеты.ПодвалТЧ.Параметры.СуммаОблагаемогоДоходаВОСМС = ИтогоСуммаОблагаемогоДоходаВОСМС;
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
					Макеты.Подвал.Параметры.КоличествоМесяцев = КоличествоМесяцев;
					Макеты.Подвал.Параметры.ИтогоСумма = Строка(СтрокаФизЛица.СуммаДохода) + " (" + СокрЛП(РаботаСКурсамиВалют.СформироватьСуммуПрописью(
						СтрокаФизЛица.СуммаДохода, ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты())) + ")";
					
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрокаОрганизации Из ДанныеОтчета.Строки Цикл
				
				Если ЕстьГруппировкаПоОрганизации Тогда
					
					Макеты.Группировка.Параметры.НазваниеПараметра = НСтр("ru='Организация'");
					Макеты.Группировка.Параметры.Значение = СтрокаОрганизации.Организация;
					
					ДокументРезультат.Вывести(Макеты.Группировка);
					Организация = СтрокаОрганизации.Организация;
					
				КонецЕсли;
				
				//ОрганизацияНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "НаименованиеПолное");
				//ОрганизацияБИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОрганизации.Организация, "ИНН");
				СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ПолныйАдрЮР";
				СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтрокаОрганизации.Организация,ТекущаяДатаСеанса(),СтрокаСведений);
				РеквизитыОрганизации = "";
				
				Если ЗначениеЗаполнено(СведенияОбОрганизации.ПолныйАдрЮР) Тогда
					РеквизитыОрганизации = РеквизитыОрганизации 
						+ ?(ЗначениеЗаполнено(РеквизитыОрганизации), "; ", "") + СокрЛП(СведенияОбОрганизации.ПолныйАдрЮР);
				КонецЕсли;
				Если ЗначениеЗаполнено(СведенияОбОрганизации.ИННЮЛ) Тогда
					РеквизитыОрганизации = РеквизитыОрганизации 
						+ ?(ЗначениеЗаполнено(РеквизитыОрганизации), "; ", "") + НСтр("ru = 'БИН: '") + СокрЛП(СведенияОбОрганизации.ИННЮЛ);
				КонецЕсли;
				
				ЗаполняемыеЗначения = Новый Структура("Организация,Руководитель,ГлавныйБухгалтер,ДолжностьРуководителя ", СтрокаОрганизации.Организация);
				ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
				
				СписокФизлицРуководства = Новый Массив;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.Руководитель);
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					СписокФизлицРуководства.Добавить(ЗаполняемыеЗначения.ГлавныйБухгалтер);
				КонецЕсли;
				
				КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизлицРуководства, "ФамилияИО");
				
				ПараметрыОтветственныхЛиц = Новый Структура ("Руководитель, ФИОРуководитель, ГлавныйБухгалтер, ФИОГлавныйБухгалтер, Исполнитель, ФИОИсполнитель");
				
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.Руководитель) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.Руководитель, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОРуководитель = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.Руководитель = ЗаполняемыеЗначения.ДолжностьРуководителя;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЗаполняемыеЗначения.ГлавныйБухгалтер) Тогда
					ФИО = КадровыеДанныеФизическихЛиц.Найти(ЗаполняемыеЗначения.ГлавныйБухгалтер, "ФизическоеЛицо");
					ПараметрыОтветственныхЛиц.ФИОГлавныйБухгалтер = ?(ФИО <> Неопределено, ФИО.ФамилияИО,"");
					ПараметрыОтветственныхЛиц.ГлавныйБухгалтер = ЗаполняемыеЗначения.ГлавныйБухгалтер;
				КонецЕсли;
				
				Для Каждого СтрокаФизЛица Из СтрокаОрганизации.Строки Цикл
					
					ЗаполнитьЗначенияСвойств(Макеты.Шапка.Параметры,СтрокаФизЛица);
					Макеты.Шапка.Параметры.ИИН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаФизЛица.ФизическоеЛицо, "ИНН");
					Макеты.Шапка.Параметры.Организация = СведенияОбОрганизации.НаимЮЛПол;
					Макеты.Шапка.Параметры.РеквизитыОрганизации = РеквизитыОрганизации;
					ДокументРезультат.Вывести(Макеты.Шапка);
					ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					
					КоличествоМесяцев = 0;
					
					Для Каждого СтрокаМесяцев Из СтрокаФизЛица.Строки Цикл
						
						Если СтрокаМесяцев.ОбъектИсчисленияСО = 0
							И СтрокаМесяцев.СуммаСО = 0
							И СтрокаМесяцев.СуммаСОУплаченная = 0 Тогда
								Продолжить;
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры,СтрокаМесяцев);
						Макеты.СтрокаТЧ.Параметры.Период = СтрокаМесяцев.МесяцНалоговогоПериода;
						
						Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.СтрокаТЧ) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
						КонецЕсли;
						
						ДокументРезультат.Вывести(Макеты.СтрокаТЧ);
						КоличествоМесяцев = КоличествоМесяцев + 1;
						
					КонецЦикла;
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.ПодвалТЧ) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.ПодвалТЧ.Параметры,СтрокаФизЛица);
					ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
					
					Если НЕ ДокументРезультат.ПроверитьВывод(Макеты.Подвал) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Макеты.Подвал.Параметры, ПараметрыОтветственныхЛиц);
					Макеты.Подвал.Параметры.ТекущаяДата = ТекущаяДатаСеанса();
					Макеты.Подвал.Параметры.СуммаДохода = СтрокаФизЛица.ОбъектИсчисленияСО;
					Макеты.Подвал.Параметры.СуммаДоходаПрописью = СокрЛП(РаботаСКурсамиВалют.СформироватьСуммуПрописью(
						СтрокаФизЛица.ОбъектИсчисленияСО,ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты(),Истина));
					Макеты.Подвал.Параметры.КоличествоМесяцев = КоличествоМесяцев;
					
					ДокументРезультат.Вывести(Макеты.Подвал);
					
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
			
		
		ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
		ДопСвойства.Вставить("ОтчетПустой", ДанныеОтчета.Строки.Количество() = 0);
		
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ВызватьИсключение НСтр("ru = 'В настройку отчета "+
			?(СправкаОЗаработнойПлате,"""Справка о заработной плате""","""Справка с места работы перед наступлением социального риска""")
			+" внесены критичные изменения. Отчет не будет сформирован.'")
			+ ""
			+ КраткоеПредставлениеОшибки(Инфо);
		
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиПоИмени(Структура, Имя)
    
    Группировка = Неопределено;
	Для каждого Элемент Из Структура Цикл
		Если ТипЗнч(Элемент) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Если Элемент.Имя = Имя Тогда
				Возврат Элемент;
			КонецЕсли;	
		Иначе
			Если Элемент.Имя = Имя Тогда
				Возврат Элемент;
			КонецЕсли;	
			Для каждого Поле Из Элемент.ПоляГруппировки.Элементы Цикл
				Если Не ТипЗнч(Поле) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
					Если Поле.Поле = Новый ПолеКомпоновкиДанных(Имя) Тогда
						Возврат Элемент;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если Элемент.Структура.Количество() = 0 Тогда
				Продолжить;
			Иначе
				Группировка = НайтиПоИмени(Элемент.Структура, Имя);
				Если Не Группировка = Неопределено Тогда
					Возврат	Группировка;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Группировка;
	
КонецФункции

Функция ЗаполнитьОтветсвенныеЛицаОрганизации (ОтветственныеЛицаОрганизации, ПериодОтчета, Ответственный, ДолжностьОтветственного)
    
    ДатаОтчета = ?(ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания), ПериодОтчета.ДатаОкончания, ТекущаяДата()) ;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |   Организации.Ссылка КАК Организация
    |ИЗ
    |   Справочник.Организации КАК Организации";
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = ОтветственныеЛицаОрганизации.Добавить();
        ОтветственныеЛица = Новый Структура("Организация,Руководитель,ДолжностьРуководителя,ГлавныйБухгалтер,ДолжностьГлавногоБухгалтера", Выборка.Организация);
        ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ОтветственныеЛица, ДатаОтчета);
        
        НоваяСтрока.Организация = Выборка.Организация;
        МассивФизЛиц = Новый Массив;
        МассивФизЛиц.Добавить(ОтветственныеЛица.Руководитель);
        МассивФизЛиц.Добавить(ОтветственныеЛица.ГлавныйБухгалтер);
        Если ЗначениеЗаполнено(Ответственный) Тогда
            МассивФизЛиц.Добавить(Ответственный);
        КонецЕсли;
        
        ФИОФизЛиц = ЗарплатаКадры.СоответствиеФИОФизЛицСсылкам(ДатаОтчета, МассивФизЛиц);
        ФИОРуководителя = ФИОФизЛиц[ОтветственныеЛица.Руководитель];
        НоваяСтрока.ДолжностьРуководителя = ?(ОтветственныеЛица.ДолжностьРуководителя = Неопределено, "", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтветственныеЛица.ДолжностьРуководителя, "Наименование"));
        
        Если ФИОРуководителя <> Неопределено Тогда
            НоваяСтрока.Руководитель	= ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ФИОРуководителя);
        Иначе	
            НоваяСтрока.Руководитель	= "";
        КонецЕсли;	
        
        ФИООтветственногоСтрокой = "";
        Если ЗначениеЗаполнено(Ответственный) Тогда
            СписокФизЛиц = Новый Массив;
            СписокФизЛиц.Добавить(Ответственный);
            ОсновныеСотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизЛиц, Истина, Выборка.Организация, ДатаОтчета);
            
            ФИООтветственного = ФИОФизЛиц[Ответственный];
            НоваяСтрока.Ответственный = ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ФИООтветственного);
            Если ЗначениеЗаполнено(ДолжностьОтветственного) Тогда
                НоваяСтрока.ДолжностьОтветственного = ДолжностьОтветственного;
            Иначе
                Если ОсновныеСотрудникиФизическихЛиц.Количество() > 0  Тогда
                    СписокСотрудников = Новый Массив;
                    СписокСотрудников.Добавить(ОсновныеСотрудникиФизическихЛиц[0].Сотрудник);	
                    
                    КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, "Должность", ДатаОтчета);
                    
                    Если КадровыеДанные.Количество() > 0 Тогда
                        Если ЗначениеЗаполнено(КадровыеДанные[0].Должность) Тогда
                            НоваяСтрока.ДолжностьОтветственного = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанные[0].Должность, "Наименование");
                        Иначе
                            НоваяСтрока.ДолжностьОтветственного = "";
                        КонецЕсли; 
                    Иначе
                        НоваяСтрока.ДолжностьОтветственного = "";
                    КонецЕсли;
                Иначе
                    НоваяСтрока.ДолжностьОтветственного = "";
                КонецЕсли;	
            КонецЕсли;
        КонецЕсли;		
        
        ФИОГлавногоБухгалтера = ФИОФизЛиц[ОтветственныеЛица.ГлавныйБухгалтер];
        ДолжностьГлавногоБухгалтера = НСтр("ru = 'Главный бухгалтер'");
        Если ФИОГлавногоБухгалтера <> Неопределено Тогда 
            НоваяСтрока.ГлавныйБухгалтер = ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ФИОГлавногоБухгалтера);
        Иначе	
            НоваяСтрока.ГлавныйБухгалтер = "";
        КонецЕсли;	
        
        Если ОтветственныеЛица.ГлавныйБухгалтер = Ответственный Тогда
            НоваяСтрока.ДолжностьГлавногоБухгалтера = ?(ЗначениеЗаполнено(ДолжностьОтветственного), ДолжностьОтветственного, ДолжностьГлавногоБухгалтера);
        Иначе	
            Если ЗначениеЗаполнено(ОтветственныеЛица.ГлавныйБухгалтер) Тогда
                СписокФизЛиц = Новый Массив;
                СписокФизЛиц.Добавить(ОтветственныеЛица.ГлавныйБухгалтер);
                ОсновныеСотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизЛиц, Истина, Выборка.Организация, ДатаОтчета);
                
                Если ОсновныеСотрудникиФизическихЛиц.Количество() > 0  Тогда
                    
                    СписокСотрудников = Новый Массив;
                    СписокСотрудников.Добавить(ОсновныеСотрудникиФизическихЛиц[0].Сотрудник);	
                    
                    КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, "Должность", ДатаОтчета);
                    
                    Если КадровыеДанные.Количество() > 0 Тогда
                        Если ЗначениеЗаполнено(КадровыеДанные[0].Должность) Тогда
                            НоваяСтрока.ДолжностьГлавногоБухгалтера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанные[0].Должность, "Наименование");	
                        Иначе
                            НоваяСтрока.ДолжностьГлавногоБухгалтера = "";
                        КонецЕсли; 
                    Иначе
                        НоваяСтрока.ДолжностьГлавногоБухгалтера = "";
                    КонецЕсли;
                Иначе
                    НоваяСтрока.ДолжностьГлавногоБухгалтера = "";
                КонецЕсли;
            Иначе
                НоваяСтрока.ДолжностьГлавногоБухгалтера = "";
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    
    Возврат ОтветственныеЛицаОрганизации;
    
КонецФункции

Функция ПолучитьСписокНачисленийДоходВНатуральнойФорме()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК Начисление
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Начисление");
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Процедура ИзменениеПараметраМакетаСогласноНастройкеКомпоновщика(Выражение, ПараметрМакета, НастройкиКомпоновщика)
	
	ВыражениеГруппировки = НайтиВыражениеВСтруктуреКомпоновщика(Выражение, НастройкиКомпоновщика);
	
	Если ВыражениеГруппировки <> "" Тогда
		Для Каждого Макет Из СхемаКомпоновкиДанных.Макеты Цикл
			Если Макет.Параметры.Найти(ПараметрМакета) <> Неопределено Тогда
				Макет.Параметры[ПараметрМакета].Выражение = ВыражениеГруппировки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиВыражениеВСтруктуреКомпоновщика(Выражение, НастройкиКомпоновщика)
	
	ПолеСтрокой = ПолучитьПолеСтруктурыКомпоновщика(НастройкиКомпоновщика.Структура);
	Если Найти(ПолеСтрокой, Выражение) > 0 Тогда
		Возврат ПолеСтрокой;
	Иначе
		Для Каждого СтруктураКомпоновщика Из НастройкиКомпоновщика.Структура Цикл
			Если СтруктураКомпоновщика.Использование Тогда
				ПолеСтрокой = ПолучитьПолеСтруктурыКомпоновщика(СтруктураКомпоновщика.Структура);
				Если Найти(ПолеСтрокой, Выражение) > 0 Тогда
					Возврат ПолеСтрокой;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПроверкаСтруктурыДанныхКомпоновщикаДляШапкиИПодписей(НастройкиКомпоновщика, НастройкиПоУмолчанию)
	
	Поле = ПолучитьПолеСтруктурыКомпоновщика(НастройкиКомпоновщика.Структура);
	ПолеПоУмолчанию = ПолучитьПолеСтруктурыКомпоновщика(НастройкиПоУмолчанию.Структура);
	
	Если Найти(Поле, ПолеПоУмолчанию) > 0 Тогда
		Поле = ПолучитьПолеСтруктурыКомпоновщика(НастройкиКомпоновщика.Структура[0].Структура);
		ПолеПоУмолчанию = ПолучитьПолеСтруктурыКомпоновщика(НастройкиПоУмолчанию.Структура[0].Структура);
		
		Если Найти(Поле, ПолеПоУмолчанию) = 0 Тогда
			ОтключениеШапкиИПодписей("Организация");
		КонецЕсли;
	Иначе
		ОтключениеШапкиИПодписей("Организация");
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПолеСтруктурыКомпоновщика(СтруктураКомпоновщика)
	
	Для Каждого СтруктураГруппировки Из СтруктураКомпоновщика Цикл
		Если СтруктураГруппировки.Использование И ТипЗнч(СтруктураГруппировки) = Тип("ГруппировкаКомпоновкиДанных") Тогда
			Для Каждого ПолеГруппировки Из СтруктураГруппировки.ПоляГруппировки.Элементы Цикл
				Если ПолеГруппировки.Использование Тогда
					Возврат Строка(ПолеГруппировки.Поле);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Процедура ОтключениеШапкиИПодписей(ИмяГруппировки)
	
	УдаляемыеМакеты = Новый Массив;
	Для Каждого МакетГруппировки Из СхемаКомпоновкиДанных.МакетыГруппировок Цикл
		Если МакетГруппировки.ИмяГруппировки = ИмяГруппировки Тогда
			УдаляемыеМакеты.Добавить(МакетГруппировки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйМакет Из УдаляемыеМакеты Цикл
		СхемаКомпоновкиДанных.МакетыГруппировок.Удалить(УдаляемыйМакет);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ОтчетИнициализирован = Ложь;

#КонецОбласти

#КонецЕсли