#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапрашиваемыеЗначения = Новый Структура("Организация", "Организация");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗапрашиваемыеЗначения);
	ИспользоватьВыгрузкуВФедеральныеМедрегистры = ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИдентификаторИнформационнойСистемы", "ПодсказкаВвода", НСтр("ru='Например: '") + "4a0afd89-8ff4-04a7-245c-c0aed52e284c");
	ЗаполнитьНастройкиОрганизацииНаСервере();
	ЗаполнитьНастройкиМедрегистровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="НастройкаРаботаВМедицинскомУчрежденииСброшена" Тогда 
		Закрыть();
	КонецЕсли;
	Если ИмяСобытия="НастройкаИспользоватьВыгрузкуВФедеральныеМедрегистрыИзменена" Тогда 
		ИспользоватьВыгрузкуВФедеральныеМедрегистры = Параметр;
		ЗаполнитьНастройкиОрганизацииНаСервере();
		ЗаполнитьНастройкиМедрегистровНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьНастройкиОрганизацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АдресСервисаПриИзменении(Элемент)
	Настройки = СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Настройки.АдресСервиса = АдресСервиса;
	СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(Настройки);
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТестовыйСервисПриИзменении(Элемент)
	Оповещение = Новый ОписаниеОповещения("ИспользоватьТестовыйСервисПриИзмененииНаКлиенте", ЭтотОбъект);
	Текст = НСтр("ru = 'Внимание! Будут удалены сопоставления подразделений с ФРМО и сведения о предыдущих выгрузках. Уверены, что хотите изменить сервис выгрузки?'");
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТестовыйСервисПриИзмененииНаКлиенте(Знач РезультатВопроса, Знач ДополнительныеПараметры) Экспорт 
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Настройки = СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
		Настройки.ИспользоватьТестовыйСервис = ИспользоватьТестовыйСервис;
		СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(Настройки);
		ОчиститьРегистрыИдентификации();
	Иначе 
		ИспользоватьТестовыйСервис = Не ИспользоватьТестовыйСервис;
	КонецЕсли;
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресТестовогоСервисаПриИзменении(Элемент)
	Настройки = СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Настройки.АдресТестовогоСервиса = АдресТестовогоСервиса;
	СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(Настройки);
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторИнформационнойСистемыПриИзменении(Элемент)
	СохранитьНастройкиОрганизации(Организация, ИдентификаторИнформационнойСистемы);
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УИНОрганизацииПриИзменении(Элемент)
	СохранитьНастройкиОрганизации(Организация, , УИНОрганизации);
	Модифицированность = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КлассифицироватьОбъекты(Команда)
	ОткрытьФорму("РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.Форма.КлассификацияОбъектовДляФедеральныхМедрегистров", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАдресаСервисовПоУмолчанию(Команда)
	Оповещение = Новый ОписаниеОповещения("УстановитьАдресаСервисовПоУмолчаниюНаКлиенте", ЭтотОбъект);
	Текст = НСтр("ru = 'Заменить текущие адреса сервисов адресами по умолчанию?'");
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ИдентифицироватьПодразделенияОрганизацииПоФРМО(Команда)
	ОткрытьФорму("РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.Форма.ИдентификацияПодразделенийОрганизации", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиОрганизации(Организация, ИдентификаторИнформационнойСистемы = Неопределено, УИНОрганизации = Неопределено)
	Если ЗначениеЗаполнено(Организация) Тогда
		НастройкиОрганизации = МедицинскиеРегистры.СоздатьПустыеНастройкиОрганизации();
		НастройкиОрганизации.ИдентификаторИнформационнойСистемы = ИдентификаторИнформационнойСистемы;
		НастройкиОрганизации.ИдентификаторДляМедрегистров = УИНОрганизации;
		МедицинскиеРегистры.СохранитьНастройкиОрганизации(Организация, НастройкиОрганизации);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОрганизацииНаСервере()
	Если ЗначениеЗаполнено(Организация) Тогда
		НастройкиОрганизации = ПрочитатьНастройкиОрганизации(Организация);
		ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
		УИНОрганизации = НастройкиОрганизации.ИдентификаторДляМедрегистров;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьНастройкиМедрегистровНаСервере()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиВзаимодействияСФедеральнымиМедрегистрами", "Видимость", ИспользоватьВыгрузкуВФедеральныеМедрегистры);
	Если ИспользоватьВыгрузкуВФедеральныеМедрегистры Тогда 
		Настройки = МедицинскиеРегистры.ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами();
		АдресСервиса = Настройки.АдресСервиса;
		АдресТестовогоСервиса = Настройки.АдресТестовогоСервиса;
		ИспользоватьТестовыйСервис = Настройки.ИспользоватьТестовыйСервис;
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПрочитатьНастройкиОрганизации(Организация)
	Возврат МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Организация)
КонецФункции 

&НаКлиенте
Процедура УстановитьАдресаСервисовПоУмолчаниюНаКлиенте(Знач РезультатВопроса, Знач ДополнительныеПараметры) Экспорт 
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Настройки = НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами();
		АдресСервиса = Настройки.АдресСервиса;
		АдресТестовогоСервиса = Настройки.АдресТестовогоСервиса;
		СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(Настройки);
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами()
	Возврат МедицинскиеРегистры.НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами();
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами()
	Возврат МедицинскиеРегистры.СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(НастройкиВзаимодействияСФедеральнымиМедрегистрами)
	МедицинскиеРегистры.СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(НастройкиВзаимодействияСФедеральнымиМедрегистрами);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьРегистрыИдентификации()
	МедицинскиеРегистры.ОчиститьРегистрыИдентификации();
КонецПроцедуры

#КонецОбласти




