#Область СлужебныйПрограммныйИнтерфейс

//См. РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеРасчетногоДокумента
Процедура ДополнитьОписаниеРасчетногоДокумента(ПоляОписания) Экспорт
	
	ПоляОписания = ПоляОписания + ",
		|НалогиВзносыОтчисленияИмя,
		|ДоходыНеПодлежащиеНалогообложениюИмя,
		|ВычетыИПНИмя,
		|КомпонентыЕПИмя";
	
КонецПроцедуры

//Процедура дополняет описание документа, таблиц документа, панелей документа.
Процедура ОписаниеДокумента(Описание, ПередаватьКомпонентыЕП = Истина) Экспорт
	
	Если ТипЗнч(Описание) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Описание.Свойство("НалогиВзносыОтчисленияИмя") Тогда
		Описание.НалогиВзносыОтчисленияИмя = "НалогиВзносыОтчисления";
	КонецЕсли;
	Если Описание.Свойство("ДоходыНеПодлежащиеНалогообложениюИмя") Тогда
		Описание.ДоходыНеПодлежащиеНалогообложениюИмя = "ДоходыНеПодлежащиеНалогообложению";
	КонецЕсли;
	Если Описание.Свойство("ВычетыИПНИмя") Тогда
		Описание.ВычетыИПНИмя = "ВычетыИПН";
	КонецЕсли;
	Если ПередаватьКомпонентыЕП И Описание.Свойство("КомпонентыЕПИмя") Тогда
		Описание.КомпонентыЕПИмя = "КомпонентыЕП";
	КонецЕсли;
	
КонецПроцедуры

//См. РасчетЗарплатыРасширенныйКлиентСервер.ОчиститьТаблицыДокумента
Процедура ОчиститьТаблицыДокумента(ИменаПолейИменТаблиц) Экспорт
	
	ИменаПолейИменТаблиц.Добавить("НалогиВзносыОтчисленияИмя");
	ИменаПолейИменТаблиц.Добавить("ДоходыНеПодлежащиеНалогообложениюИмя");
	ИменаПолейИменТаблиц.Добавить("ВычетыИПНИмя");
	ИменаПолейИменТаблиц.Добавить("КомпонентыЕПИмя");
	
КонецПроцедуры

// Ключевые реквизиты документов начислений, очищаемые при изменении данных
//
Процедура ДополнитьКлючевыеРеквизитыТаблицыОчищаемыеПриИзменении(Массив, ПередаватьКомпонентыЕП = Истина) Экспорт
	
	Массив.Добавить("Объект.ДоходыНеПодлежащиеНалогообложению");
	Массив.Добавить("Объект.НалогиВзносыОтчисления");
	Массив.Добавить("Объект.ВычетыИПН");
	Если ПередаватьКомпонентыЕП Тогда
		Массив.Добавить("Объект.КомпонентыЕП");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьКонтролируемыеПоля(КонтролируемыеПоля) Экспорт
	
	КонтролируемыеПоля.Вставить("НалогиВзносыОтчисления", УчетНалоговВзносовОтчисленийРасширенныйВызовСервера.КонтролируемыеПоляДляФиксацииРезультатов());
	КонтролируемыеПоля.Вставить("ДоходыНеПодлежащиеНалогообложению", УчетНалоговВзносовОтчисленийРасширенныйВызовСервера.КонтролируемыеПоляНеоблагаемыхДоходовДляФиксацииРезультатов());
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементовФормы(Форма, ИмяМесяцНачисления = "МесяцНачисления") Экспорт
	
	ДатаПримененияКорректировкиДохода = '2019-01-01';
	ДатаУменьшенияОблагаемогоДохода = '2021-01-01';
	
	Объект = Форма.Объект;
	
	Если Объект[ИмяМесяцНачисления] >= ДатаУменьшенияОблагаемогоДохода Тогда
		Форма.Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Заголовок = НСтр("ru = 'Сумма уменьшения облагаемого дохода'");	
	ИначеЕсли Объект[ИмяМесяцНачисления] >= ДатаПримененияКорректировкиДохода Тогда
		Форма.Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Заголовок = НСтр("ru = 'Примененная корректировка'");	
	Иначе
		Форма.Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Заголовок = НСтр("ru = 'Примененная льгота ИПН (до 2018 г)'");	
	КонецЕсли;

КонецПроцедуры

Процедура НазначитьИдентификаторСтрокеНалогиВзносыОтчисления(СтрокаНалогиВзносыОтчисления, МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления, НоваяСтрока) Экспорт
	
	Если Не НоваяСтрока Или СтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления > 0 Тогда
		Возврат;
	КонецЕсли;
	
	МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления + 1;
	СтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
	
КонецПроцедуры

Функция ПолучитьКНПНВО(ВидНалогаВзносаОтчисления, ВидПлатежа, ВидОперации = Неопределено) Экспорт
	
	КНП = "";
	
	Если ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПениАкт")
		Или ВидПлатежа = ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПениСам") Тогда
		
		Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
			КНП = "019";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ") Тогда
			КНП = "009";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
			КНП = "017";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС") Тогда
			КНП = "124";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
			КНП = "123";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР") Тогда
			КНП = "098";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
			КНП = "187";
		КонецЕсли;		
		
	Иначе
		
		Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
			КНП = "010";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ") Тогда
			КНП = "015";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
			КНП = "012";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС") Тогда
			КНП = "122";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
			КНП = "121";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР") Тогда
			КНП = "089";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
			КНП = "185";
		ИначеЕсли ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Справочник.ВидыПрочихВыплат.ПрофессиональнаяВыплатаЗаСчетРаботодателя") Тогда
			КНП = "119";
		КонецЕсли;		
		
	КонецЕсли;
	
	Если КНП = "" Тогда
		КНП = УчетНалоговВзносовОтчисленийРасширенныйВызовСервера.ПолучитьКНППоВидуОперации(ВидОперации);
	КонецЕсли;
	
	Возврат КНП;
	
КонецФункции

Функция ПолучитьТекстКНППлатежейДляЕП(СтрокаПеречисления, ВидПлатежа) Экспорт
	
	МассивВидовНВО = Новый Массив;
	МассивВидовНВО.Добавить("ОПВ");
	МассивВидовНВО.Добавить("ВОСМС");
	МассивВидовНВО.Добавить("СО");
	МассивВидовНВО.Добавить("ООСМС");
	МассивВидовНВО.Добавить("ОПВР");
	
	СтрокаКНП = "";
	
	Для Каждого СтрокаНВО Из МассивВидовНВО Цикл
		
		Если СтрокаПеречисления[СтрокаНВО] > 0 Тогда
			СтрокаКНП = СтрокаКНП + ?(ЗначениеЗаполнено(СтрокаКНП), ",", "") + ПолучитьКНПНВО(ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений." + СтрокаНВО), ВидПлатежа);	
		КонецЕсли;
		
	КонецЦикла;
	
	КНПЕП = ПолучитьКНПНВО(ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП"), ВидПлатежа);
	
	СтрокаКНП = СтрокаКНП + ?(ЗначениеЗаполнено(СтрокаКНП), ",", "") + КНПЕП;
	
	СтруктураДанных = Новый Структура("СписокКНП, ТекстAssign");
	
	СтруктураДанных.СписокКНП = СтрокаКНП;
	СтруктураДанных.ТекстAssign = "
		|/ASSIGN/(" + Формат(СтрокаПеречисления.СуммаПлатежа, "ЧДЦ=2; ЧН=0; ЧГ=0") + "), " + "[" + СтрокаКНП + "]";
	
	Возврат	СтруктураДанных;
	
КонецФункции

#КонецОбласти