#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьРазмерыВычетовИПН();
	
КонецПроцедуры

Процедура ЗаполнитьРазмерыВычетовИПН()
	
	НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();

	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный1МЗП, 		   Перечисления.ВидыПределовВычетовИКорректировокДоходов.МЗП, 1);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.НаОплатуМедицинскихУслуг, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 94);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20220101', Справочники.ВидыВычетовИПН.Стандартный1МЗП, 		   Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 14);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20250101', Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 11.75);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20250101', Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 23.5);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 30);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 5000);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерВычетаИПН(НаборЗаписей, Период, ВидВычетаИПН, ВидПределаВычета, Размер) Экспорт
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидВычетаИПН = ВидВычетаИПН;
	НоваяЗапись.ВидПределаВычета = ВидПределаВычета;
	НоваяЗапись.Размер = Размер;
	
КонецПроцедуры	

Процедура ДобавитьРазмерВычетаИПНСПроверкой(Период, ВидВычетаИПН, ВидПределаВычета, Размер) 
	
	НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Отбор.ВидВычетаИПН.Установить(ВидВычетаИПН, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.ВидВычетаИПН = ВидВычетаИПН;
		// Ресурсы
		Движение.ВидПределаВычета = ВидПределаВычета;
		Движение.Размер = Размер;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРазмерыВычетовИПН2025() Экспорт
	
	ДобавитьРазмерВычетаИПНСПроверкой('20250101', Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 12);
	ДобавитьРазмерВычетаИПНСПроверкой('20250101', Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 23);

КонецПроцедуры

Процедура ОбновитьРазмерыВычетовИПНВычетыДляМногодетнойСемьи2025() Экспорт
    
    НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ВидВычетаИПН.Установить(Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя, Истина);
    НаборЗаписей.Отбор.Период.Установить('20250101', Истина);
    
	ДобавитьРазмерВычетаИПН(НаборЗаписей,'20250101', Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 11.75);
	
	НаборЗаписей.Записать();

    НаборЗаписей = РегистрыСведений.РазмерыВычетовИПН.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.ВидВычетаИПН.Установить(Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей, Истина);
    НаборЗаписей.Отбор.Период.Установить('20250101', Истина);
    
	ДобавитьРазмерВычетаИПН(НаборЗаписей,'20250101', Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 23.5);
	
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ОбновитьРазмерыВычетовИПН2026() Экспорт
	
	ДобавитьРазмерВычетаИПНСПроверкой('20260101', Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 30);
	ДобавитьРазмерВычетаИПНСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 5000);
	ДобавитьРазмерВычетаИПНСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);
	ДобавитьРазмерВычетаИПНСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 882);

КонецПроцедуры

#КонецОбласти

#КонецЕсли