#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20190101') Тогда
			
			ВызватьИсключение НСтр("ru = 'Данные в регистр сведений о размере предела вычета ИПН вводятся не ранее 2019 года (до 2019 используется реквизит справочника ""Виды вычетов ИПН""'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидВычетаИПН.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
			
			ВызватьИсключение НСтр("ru = 'Невозможно ввести данные о размере вычета для периода предоставления ""По исчисленной сумме взносов""'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетОПВ
			ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетВОСМС
			ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Невозможно ввести данные о размере для вычетов ""%1"", ""%2"", ""%3"", ""%4""'"), 
																						Справочники.ВидыВычетовИПН.ВычетОПВ, 
																						Справочники.ВидыВычетовИПН.ВычетВОСМС, 
																						Справочники.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы);
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20250101')
			И (СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя
			 	ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей) Тогда
			
			ВызватьИсключение НСтр("ru = 'Данные о вычетах для многодетных семей вводятся с 2025 года'");	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
