#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Программы") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Страхователь = Параметры.Страхователь;
	Заголовок = Строка(Параметры.Страхователь);
	ДатаНачалаСтрахования = Параметры.ДатаНачалаСтрахования;
	ДатаОкончанияСтрахования = Параметры.ДатаОкончанияСтрахования;
	ДатаПрикрепления = Параметры.ДатаПрикрепления;
	ДатаОткрепления = Параметры.ДатаОткрепления;
	ДатаРождения = Параметры.ДатаРождения;
	ДатаИзменения = Параметры.ДатаИзменения;
	СтраховаяКомпания = Параметры.СтраховаяКомпания;
	
	Для Каждого СтруктураПрограммы Из Параметры.Программы Цикл
		НоваяСтрока = ПрограммыСтрахования.Добавить();
		НоваяСтрока.ПрограммаСтрахования = СтруктураПрограммы.ПрограммаСтрахования;
		НоваяСтрока.СтраховаяПремия = СтруктураПрограммы.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = СтруктураПрограммы.ДатаНачала;
		НоваяСтрока.ДатаОкончания = СтруктураПрограммы.ДатаОкончания;
		НоваяСтрока.Действие = СтруктураПрограммы.Действие;
		НоваяСтрока.ПериодСтрахования = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
			Формат(СтруктураПрограммы.ДатаНачала, "ДЛФ=Д"),
			Формат(СтруктураПрограммы.ДатаОкончания, "ДЛФ=Д"));
			
		Если НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить Тогда
			НоваяСтрока.ДатаНачала = ДатаИзменения;
			НоваяСтрока.ДатаОкончания = ДатаОткрепления;
			НоваяСтрока.ПериодСтрахования = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
				Формат(НоваяСтрока.ДатаНачала, "ДЛФ=Д"),
				Формат(НоваяСтрока.ДатаОкончания, "ДЛФ=Д"));
			НоваяСтрока.Комментарий = СтрШаблон(НСтр("ru = 'прикрепить с %1'"),
				Формат(ДатаИзменения, "ДЛФ=Д"));
		ИначеЕсли НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Изменить Тогда
			НоваяСтрока.ДатаОкончания = ДатаИзменения;
			НоваяСтрока.Комментарий = СтрШаблон(НСтр("ru = 'открепить %1'"),
				Формат(ДатаИзменения, "ДЛФ=Д"));
			НоваяСтрока.ПериодСтрахования = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
				Формат(ДатаПрикрепления, "ДЛФ=Д"),
				Формат(ДатаИзменения, "ДЛФ=Д"));
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Параметры.ШкалаВозрастов, ШкалаВозрастов);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммы

&НаКлиенте
Процедура ПрограммыСтрахованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.ДатаНачала = ДатаИзменения;
		ТекущиеДанные.ДатаОкончания = ДатаОткрепления;
		ТекущиеДанные.ПериодСтрахования = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
			Формат(ТекущиеДанные.ДатаНачала, "ДЛФ=Д"),
			Формат(ТекущиеДанные.ДатаОкончания, "ДЛФ=Д"));
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить");
		ТекущиеДанные.Комментарий = СтрШаблон(НСтр("ru = 'прикрепить с %1'"),
			Формат(ДатаИзменения, "ДЛФ=Д"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммыСтрахованияПрограммаСтрахованияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СтраховаяПремия = СтраховаяПремия(ТекущиеДанные.ПрограммаСтрахования, ТекущиеДанные.ДатаНачала, ТекущиеДанные.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммыСтрахованияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		Элементы.ПрограммыСтрахованияОткрепить.Заголовок = НСтр("ru = 'Удалить'");
		Элементы.ПрограммыСтрахованияОткрепить.Картинка = БиблиотекаКартинок.Удалить;
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить") Тогда
		Элементы.ПрограммыСтрахованияОткрепить.Заголовок = НСтр("ru = 'Продолжить'");
		Элементы.ПрограммыСтрахованияОткрепить.Картинка = БиблиотекаКартинок.ОперацияВыполненаУспешно;
	Иначе
		Элементы.ПрограммыСтрахованияОткрепить.Заголовок = НСтр("ru = 'Открепить'");
		Элементы.ПрограммыСтрахованияОткрепить.Картинка = БиблиотекаКартинок.Удалить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммыСтрахованияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		ПрограммыСтрахования.Удалить(ПрограммыСтрахования.Индекс(ТекущиеДанные));
	ИначеЕсли ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить") Тогда
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.ПустаяСсылка");
		ТекущиеДанные.ПериодСтрахования = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
			Формат(ДатаПрикрепления, "ДЛФ=Д"),
			Формат(ДатаОткрепления, "ДЛФ=Д"));
		ТекущиеДанные.Комментарий = "";
		ТекущиеДанные.ДатаОкончания = ДатаОткрепления;
	Иначе 
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить");
		ТекущиеДанные.ДатаОкончания = ДатаИзменения;
		ТекущиеДанные.Комментарий = СтрШаблон(НСтр("ru = 'открепить %1'"),
			Формат(ДатаИзменения, "ДЛФ=Д"));
		ТекущиеДанные.ПериодСтрахования = СтрШаблон(НСтр("ru = 'с %1 по %2'"),
			Формат(ДатаПрикрепления, "ДЛФ=Д"),
			Формат(ДатаИзменения, "ДЛФ=Д"));
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ПрограммыСтрахования Цикл
		СтрокаТаблицы.СтраховаяПремия = СтраховаяПремия(СтрокаТаблицы.ПрограммаСтрахования, СтрокаТаблицы.ДатаНачала, СтрокаТаблицы.ДатаОкончания);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	МассивСтруктурПрограмм = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ПрограммыСтрахования Цикл
		СтруктураПрограммы = Новый Структура;
		СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
		СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
		СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
		СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
		СтруктураПрограммы.Вставить("ДатаИзменения", ДатаИзменения);
		СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
		МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
	КонецЦикла;
	
	Закрыть(МассивСтруктурПрограмм);
	
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	
	Для Каждого СтрокаТаблицы Из ПрограммыСтрахования Цикл
		СтрокаТаблицы.СтраховаяПремия = СтраховаяПремия(СтрокаТаблицы.ПрограммаСтрахования, СтрокаТаблицы.ДатаНачала, СтрокаТаблицы.ДатаОкончания);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	// Оформляемые поля.
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПрограммаСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПериодСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияСтраховаяПремия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияКомментарий.Имя);

	// Отбор.
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрограммыСтрахования.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить;

	// Оформление.
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);

	// Использование.
	Элемент.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	// Оформляемые поля.
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПрограммаСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПериодСтрахования.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияСтраховаяПремия.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияКомментарий.Имя);

	// Отбор.
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрограммыСтрахования.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Изменить;

	// Оформление.
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ВажныеДанныеЦветБЭД);

	// Использование.
	Элемент.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	// Оформляемые поля.
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПрограммыСтрахованияПрограммаСтрахования.Имя);
	
	// Отбор.
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрограммыСтрахования.Действие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление.
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Использование.
	Элемент.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Функция СтраховаяПремия(ПрограммаСтрахования, ДатаНачала, ДатаОкончания)
	
	ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
	ПараметрыРасчета.ДатаНачала = ДатаНачала;
	ПараметрыРасчета.ДатаОкончания = ДатаОкончания;
	ПараметрыРасчета.ДатаНачалаСтрахования = ДатаНачалаСтрахования;
	ПараметрыРасчета.ДатаОкончанияСтрахования = ДатаОкончанияСтрахования;
	ПараметрыРасчета.ДатаРождения = ДатаРождения;
	ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
	Если ТипЗнч(Страхователь) = Тип("СправочникСсылка.Сотрудники") Тогда
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ПрограммаСтрахования);
	Иначе
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(ПрограммаСтрахования);
	КонецЕсли;
	
	Возврат МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	
КонецФункции

#КонецОбласти
