// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет наименование на основании фамилии, имени, отчества и уточнений наименований физического лица
// и личных данных канидата.
Процедура ЗаполнитьНаименованиеПоФИО() Экспорт
	
	Если ПустаяСтрока(Фамилия) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество", Фамилия, Имя, Отчество);
	
	УточнениеНаименованияФизическогоЛица = "";
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ФизическоеЛицо = ПодборПерсонала.ФизическоеЛицоЛичныхДанныхКандидата(Ссылка);
		Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			УточнениеНаименованияФизическогоЛица =
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "УточнениеНаименования");
		КонецЕсли;
	КонецЕсли;
	
	Наименование = Справочники.ЛичныеДанныеКандидатов.НаименованиеКандидата(
		СтруктураФИО, УточнениеНаименованияФизическогоЛица, УточнениеНаименования);
	
КонецПроцедуры

// Установливает пол по отчеству.
Процедура УстановитьПолПоОтчеству() Экспорт
	
	Если ПустаяСтрока(Отчество) Тогда
		Возврат;
	КонецЕсли;
	
	Пол = СотрудникиКлиентСервер.ОпределитьПолПоОтчеству(Отчество);
	
КонецПроцедуры

#Область ЗаполнениеТабличныхЧастей

// Заполняет табличную часть Образование.
// 
// Параметры:
//  ДанныеОбразования - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица
Процедура ЗаполнитьОбразование(ДанныеОбразования) Экспорт
	ЗаполнитьТабличнуюЧасть("Образование", ДанныеОбразования);
КонецПроцедуры

// Заполняет табличную часть Курсы.
// 
// Параметры:
//  ДанныеКурсы - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовыйКурсы
Процедура ЗаполнитьКурсы(ДанныеКурсы) Экспорт
	ЗаполнитьТабличнуюЧасть("Курсы", ДанныеКурсы);
КонецПроцедуры

// Заполняет табличную часть ЗнаниеЯзыков.
// 
// Параметры:
//  ДанныеЗнаниеЯзыков - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовоеЗнаниеЯзыка
Процедура ЗаполнитьЗнаниеЯзыков(ДанныеЗнаниеЯзыков) Экспорт
	ЗаполнитьТабличнуюЧасть("ЗнаниеЯзыков", ДанныеЗнаниеЯзыков);
КонецПроцедуры

// Заполняет табличную часть ОпытРаботы.
// 
// Параметры:
//  ДанныеОпытРаботы - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НовыйОпытРаботы
Процедура ЗаполнитьОпытРаботы(ДанныеОпытРаботы) Экспорт
	ЗаполнитьТабличнуюЧасть("ОпытРаботы", ДанныеОпытРаботы);
КонецПроцедуры

// Заполняет табличную часть ОпытРаботы.
// 
// Параметры:
//  ДанныеУченыеСтепени - Массив из Структура - см. Справочники.ЛичныеДанныеКандидатов.НоваяУченаяСтепень
Процедура ЗаполнитьУченыеСтепени(ДанныеУченыеСтепени) Экспорт
	ЗаполнитьТабличнуюЧасть("УченыеСтепени", ДанныеУченыеСтепени);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Обработка заполнения.
// 
// Параметры:
//  ДанныеЗаполнения - Произвольный
//  ТекстЗаполнения - Строка,Неопределено
//  СтандартнаяОбработка - Булево
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ЗаполнитьПоФизическомуЛицу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Кандидаты") Тогда
		ЗаполнитьПоКандидату(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей") Тогда
		ГруппаДоступаИндекс = ПроверяемыеРеквизиты.Найти("ГруппаДоступа");
		Если ГруппаДоступаИндекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ГруппаДоступаИндекс);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаименованиеСлужебное();
	ЗаполнитьЧастиИмени();
	ЗаполнитьИнициалы();
	
	ЗапомнитьРеквизитыПрежнегоСостоянияОбъекта();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ФизическоеЛицоСсылка - СправочникСсылка.ФизическиеЛица
Процедура ЗаполнитьПоФизическомуЛицу(ФизическоеЛицоСсылка)

	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Ложь, ФизическоеЛицоСсылка,
		СтрСоединить(РеквизитыДляЗаполнения(), ","));
		
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФизическогоЛица = КадровыеДанные[0];
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеФизическогоЛица);
	//@skip-check statement-type-change
	Гражданство = ДанныеФизическогоЛица.Страна;
	ЗаполнитьНаименованиеПоФИО();
	
	ЗаполнитьКонтактнуюИнформациюПоДаннымФизическогоЛица(ФизическоеЛицоСсылка);
	ЗаполнитьЗнаниеЯзыковПоДаннымФизическогоЛица(ФизическоеЛицоСсылка);
	ЗаполнитьОбразованиеПоДаннымФизическогоЛица(ПодборПерсонала.ОбразованиеФизическогоЛица(ФизическоеЛицоСсылка));
	ЗаполнитьУченыеСтепениПоДаннымФизическогоЛица(ДанныеФизическогоЛица);
	ЗаполнитьОпытРаботыПоДаннымФизическогоЛица(ПодборПерсонала.ТрудоваяДеятельностьФизическогоЛица(ФизическоеЛицоСсылка));
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Фотография = Справочники.ЛичныеДанныеКандидатов.КопияФотографииФизическогоЛица(Ссылка, ФизическоеЛицоСсылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоКандидату(Кандидат)
	
	ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "Наименование");
	ФамилияИмяОтчество = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ФамилияИмяОтчество, "Фамилия,Имя,Отчество");
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - Структура
Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИменаТабличныхЧастей = Новый Массив; // Массив из Строка
	ИменаТабличныхЧастей.Добавить("Образование");
	ИменаТабличныхЧастей.Добавить("Курсы");
	ИменаТабличныхЧастей.Добавить("ЗнаниеЯзыков");
	ИменаТабличныхЧастей.Добавить("ОпытРаботы");
	ИменаТабличныхЧастей.Добавить("УченыеСтепени");
	
	ИменаРеквизитов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ОбщегоНазначенияБЗККлиентСервер.ВыгрузитьКолонку(ДанныеЗаполнения, "Ключ"), ИменаТабличныхЧастей);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, СтрСоединить(ИменаРеквизитов, ","),
		СтрСоединить(ИменаТабличныхЧастей, ","));
	
	ЗаполнитьНаименованиеПоФИО();
	
	Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастей Цикл
		Если ДанныеЗаполнения.Свойство(ИмяТабличнойЧасти) Тогда
			//@skip-check invocation-parameter-type-intersect
			ЗаполнитьТабличнуюЧасть(ИмяТабличнойЧасти, ДанныеЗаполнения[ИмяТабличнойЧасти]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполнить табличную часть.
// 
// Параметры:
//  ИмяТабличнойЧасти - Строка
//  ДанныеЗаполнения - Массив из Структура
//@skip-check dynamic-access-method-not-found
//@skip-check variable-value-type
Процедура ЗаполнитьТабличнуюЧасть(ИмяТабличнойЧасти, ДанныеЗаполнения)

	Если ДанныеЗаполнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ИмяТабличнойЧасти].Очистить();
	Для Каждого Запись Из ДанныеЗаполнения Цикл
		НоваяСтрока = ЭтотОбъект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьНаименованиеСлужебное()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	НаименованиеСлужебное = ФизическиеЛицаЗарплатаКадры.НаименованиеСлужебное(Наименование);
	
КонецПроцедуры

Процедура ЗаполнитьЧастиИмени()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ФИОУстановлены") Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЧастиИмени, "Фамилия,Имя,Отчество");
	
КонецПроцедуры

Процедура ЗаполнитьИнициалы()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Инициалы) Тогда
		
		Если Не ПустаяСтрока(Имя) Тогда
			Инициалы = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ИнициалыПоИмениОтчеству(Имя, Отчество);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОбразованиеПоДаннымФизическогоЛица(ОбразованиеФизическогоЛица)
	
	Образование.Очистить();
	Для Каждого СтрокаОбразование Из ОбразованиеФизическогоЛица Цикл
		ДобавитьДанныеОбОбразованииПоДаннымФизическогоЛица(СтрокаОбразование);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОпытРаботыПоДаннымФизическогоЛица(ТрудоваяДеятельностьФизическогоЛица)
	
	ОпытРаботы.Очистить();
	Для Каждого СтрокаТрудовойДеятельности Из ТрудоваяДеятельностьФизическогоЛица Цикл
		НоваяСтрока = ОпытРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТрудовойДеятельности);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ДанныеФизическогоЛица - СтрокаТаблицыЗначений:
//   * УченаяСтепень - СправочникСсылка.УченыеСтепени
//   * УченаяСтепеньДатаПрисуждения - Дата
Процедура ЗаполнитьУченыеСтепениПоДаннымФизическогоЛица(ДанныеФизическогоЛица)
	
	УченыеСтепени.Очистить();
	Если ЗначениеЗаполнено(ДанныеФизическогоЛица.УченаяСтепень) Тогда
		НоваяСтрока = УченыеСтепени.Добавить();
		НоваяСтрока.УченаяСтепень = ДанныеФизическогоЛица.УченаяСтепень;
		НоваяСтрока.ДатаПрисужденияУченойСтепени = ДанныеФизическогоЛица.УченаяСтепеньДатаПрисуждения;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеОбОбразовании - СтрокаТаблицыЗначений:
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидПослевузовскогоОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//   * Окончание - Дата
//   * НаименованиеКурса - Строка
//   * ВидДополнительногоОбучения - ПеречислениеСсылка.ВидыПрофессиональнойПодготовки
Процедура ДобавитьДанныеОбОбразованииПоДаннымФизическогоЛица(ДанныеОбОбразовании)
	
	ЭтоДополнительноеОбразование = Справочники.ВидыОбразованияФизическихЛиц.ЭтоДополнительноеОбразование(
		ДанныеОбОбразовании.ВидОбразования, ДанныеОбОбразовании.ВидДополнительногоОбучения);
	
	ГодОкончания = Год(ДанныеОбОбразовании.Окончание);
		
	Если ЭтоДополнительноеОбразование Тогда
		НоваяСтрокаКурсы = Курсы.Добавить();
		НоваяСтрокаКурсы.НаименованиеКурса = ДанныеОбОбразовании.НаименованиеКурса;
		НоваяСтрокаКурсы.УчебноеЗаведение = ДанныеОбОбразовании.УчебноеЗаведение;
		Если ЗначениеЗаполнено(ДанныеОбОбразовании.Окончание) Тогда
			НоваяСтрокаКурсы.ГодОкончания = ГодОкончания;
		КонецЕсли;
	Иначе
		НоваяСтрокаОбразование = Образование.Добавить();
		НоваяСтрокаОбразование.ВидОбразования = ДанныеОбОбразовании.ВидОбразования;
		НоваяСтрокаОбразование.Специальность = ДанныеОбОбразовании.Специальность;
		НоваяСтрокаОбразование.УчебноеЗаведение = ДанныеОбОбразовании.УчебноеЗаведение;
		Если ЗначениеЗаполнено(ДанныеОбОбразовании.Окончание) Тогда
			НоваяСтрокаОбразование.ГодОкончания = ГодОкончания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
Процедура ЗаполнитьЗнаниеЯзыковПоДаннымФизическогоЛица(ФизическоеЛицо)
	
	ЗнаниеЯзыков.Очистить();
	
	ВыборкаДетальныеЗаписи = ВыборкаЗнанияЯзыковФизическогоЛица(ФизическоеЛицо);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДобавитьЗнаниеЯзыка(ВыборкаДетальныеЗаписи.Язык, ВыборкаДетальныеЗаписи.СтепеньЗнанияЯзыка);
	КонецЦикла;
	
КонецПроцедуры

// Выборка знания языков физического лица.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//   * Язык - СправочникСсылка.ЯзыкиНародовМира
//   * СтепеньЗнанияЯзыка - СправочникСсылка.СтепениЗнанияЯзыка
Функция ВыборкаЗнанияЯзыковФизическогоЛица(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗнаниеЯзыковФизическихЛиц.Язык КАК Язык,
		|	ЗнаниеЯзыковФизическихЛиц.СтепеньЗнанияЯзыка КАК СтепеньЗнанияЯзыка
		|ИЗ
		|	РегистрСведений.ЗнаниеЯзыковФизическихЛиц КАК ЗнаниеЯзыковФизическихЛиц
		|ГДЕ
		|	ЗнаниеЯзыковФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Параметры:
//  Язык - СправочникСсылка.ЯзыкиНародовМира
//  СтепеньЗнанияЯзыка - СправочникСсылка.СтепениЗнанияЯзыка
Процедура ДобавитьЗнаниеЯзыка(Язык, СтепеньЗнанияЯзыка)
	
	НоваяСтрока = ЗнаниеЯзыков.Добавить();
	НоваяСтрока.Язык = Язык;
	Если ЗначениеЗаполнено(СтепеньЗнанияЯзыка) Тогда
		НоваяСтрока.СтепеньЗнанияЯзыкаКандидата =
			Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаКандидатаПоСтепениЗнанияЯзыка(
			СтепеньЗнанияЯзыка);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//@skip-check statement-type-change
//@skip-check invocation-parameter-type-intersect
//@skip-check wrong-type-expression
Процедура ЗаполнитьКонтактнуюИнформациюПоДаннымФизическогоЛица(ФизическоеЛицо)
	
	СоответствиеКИ = СоответствиеКонтактнойИнформацииФизическихЛицИКандидатов();
	
	КИКандидата = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
	КИФизическогоЛица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизическоеЛицо, , , Ложь);
	
	Для Каждого ТекущаяСтрока Из КИФизическогоЛица Цикл
		
		ВидКИФизическогоЛица = ТекущаяСтрока.Вид;
		ВидКИКандидата = СоответствиеКИ.Получить(ВидКИФизическогоЛица);
		Если ВидКИКандидата = Неопределено Тогда
			ЭтоПредопределенный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидКИФизическогоЛица, "Предопределенный");
			Если ЭтоПредопределенный Тогда
				Продолжить;
			КонецЕсли;
			ВидКИКандидата = СоздатьВидКИКандидата(ВидКИФизическогоЛица);
			СоответствиеКИ.Вставить(ВидКИФизическогоЛица, ВидКИКандидата);
		КонецЕсли;
		
		НоваяСтрока = КИКандидата.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.Объект = ЭтотОбъект;
		НоваяСтрока.Вид = ВидКИКандидата;
			
	КонецЦикла;
	
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ЭтотОбъект, КИКандидата);
	
КонецПроцедуры

// Параметры:
//  ВидКИФизическогоЛица - СправочникСсылка.ВидыКонтактнойИнформации
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации
Функция СоздатьВидКИКандидата(ВидКИФизическогоЛица)
	
	ВидКИКандидатаОбъект = ВидКИФизическогоЛица.Скопировать();
	//@skip-check statement-type-change
	ВидКИКандидатаОбъект.Родитель = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Справочник.ВидыКонтактнойИнформации.СправочникЛичныеДанныеКандидатов");
	ВидКИКандидатаОбъект.ИмяГруппы = "СправочникЛичныеДанныеКандидатов";
	ВидКИКандидатаОбъект.Записать();
	
	Возврат ВидКИКандидатаОбъект.Ссылка;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение
//   * Ключ - СправочникСсылка.ВидыКонтактнойИнформации
//   * Значение - СправочникСсылка.ВидыКонтактнойИнформации
Функция СоответствиеКонтактнойИнформацииФизическихЛицИКандидатов()
	
	СоответствиеКИ = Новый Соответствие();
	
	СоответствиеКИ.Вставить(
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица"),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"));
	
	СоответствиеКИ.Вставить(
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица"),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"));
	
	СоответствиеКИ.Вставить(
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица"),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов"));
		
	Возврат СоответствиеКИ;
	
КонецФункции

Функция РеквизитыДляЗаполнения()
	
	ИменаРеквизиитов = Новый Массив;
	ИменаРеквизиитов.Добавить("ФИО");
	ИменаРеквизиитов.Добавить("Фамилия");
	ИменаРеквизиитов.Добавить("Имя");
	ИменаРеквизиитов.Добавить("Отчество");
	ИменаРеквизиитов.Добавить("Инициалы");
	ИменаРеквизиитов.Добавить("ИНН");
	ИменаРеквизиитов.Добавить("СтраховойНомерПФР");
	ИменаРеквизиитов.Добавить("Пол");
	ИменаРеквизиитов.Добавить("ДатаРождения");
	ИменаРеквизиитов.Добавить("МестоРождения");
	ИменаРеквизиитов.Добавить("ИмеетНаучныеТруды");
	ИменаРеквизиитов.Добавить("ИмеетИзобретения");
	ИменаРеквизиитов.Добавить("СостояниеВБраке");
	ИменаРеквизиитов.Добавить("Страна");
	ИменаРеквизиитов.Добавить("ВладеемыйЯзык1");
	ИменаРеквизиитов.Добавить("ВладеемыйЯзык1СтепеньЗнания");
	ИменаРеквизиитов.Добавить("ВладеемыйЯзык2");
	ИменаРеквизиитов.Добавить("ВладеемыйЯзык2СтепеньЗнания");
	ИменаРеквизиитов.Добавить("УченаяСтепень");
	ИменаРеквизиитов.Добавить("УченаяСтепеньДатаПрисуждения");
	
	Возврат ИменаРеквизиитов;
	
КонецФункции

//@skip-check invocation-parameter-type-intersect
Процедура ЗапомнитьРеквизитыПрежнегоСостоянияОбъекта()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = ОбщегоНазначения.ВыгрузитьКолонку(Метаданные.Справочники.ЛичныеДанныеКандидатов.Реквизиты, "Имя");
	ПрежниеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтрСоединить(ИменаРеквизитов, ",")); 
	ПрежниеЗначения.Вставить("ТаблицаКИ", Новый ФиксированныйМассив(Новый Массив));
	ПрежниеЗначения.Вставить("МобильныйТелефон", "");
	ПрежниеЗначения.Вставить("ЭлектроннаяПочта", "");
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Ссылка,,,Ложь);
	
	Если ТаблицаКИ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПрежниеЗначения.ТаблицаКИ = ОбщегоНазначения.ФиксированныеДанные(ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаКИ));
	
	НайденнаяСтрокаТелефон = ТаблицаКИ.Найти(ОбщегоНазначения.ПредопределенныйЭлемент(
		"Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"), "Вид");
	Если НайденнаяСтрокаТелефон <> Неопределено Тогда
		ПрежниеЗначения.МобильныйТелефон = НайденнаяСтрокаТелефон.Представление;
	КонецЕсли;
	
	НайденнаяСтрокаЭлектроннаяПочта = ТаблицаКИ.Найти(ОбщегоНазначения.ПредопределенныйЭлемент(
		"Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"), "Вид");
	Если НайденнаяСтрокаЭлектроннаяПочта <> Неопределено Тогда
		ПрежниеЗначения.ЭлектроннаяПочта = НайденнаяСтрокаЭлектроннаяПочта.Представление;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежниеЗначения", ПрежниеЗначения);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
