#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Ссылка") Тогда
		// Установлен отбор на конкретные ссылки
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ 
		|	ТаблицаВидов.Ссылка,
		|	ТаблицаВидов.Синоним
		|ПОМЕСТИТЬ ВТТаблицаВидов
		|ИЗ
		|	&ТаблицаВидов КАК ТаблицаВидов
		|;
		|ВЫБРАТЬ
		|	ВидыНалоговВзносовОтчислений.Ссылка
		|ИЗ
		|	ВТТаблицаВидов КАК ВидыНалоговВзносовОтчислений
		|ГДЕ
		|	НЕ ВидыНалоговВзносовОтчислений.Ссылка В (&ИсключаемыеЗначения)
		|   И ВидыНалоговВзносовОтчислений.Синоним ПОДОБНО &СтрокаПоиска
		|";
		
		
	Если Параметры.СтрокаПоиска = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ТаблицаКатегорий.Синоним ПОДОБНО &СтрокаПоиска", "");
	КонецЕсли;

	ТаблицаВидов = Новый ТаблицаЗначений;
	ТаблицаВидов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений"));
	ТаблицаВидов.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(256)));
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ВидыНалоговВзносовОтчислений.ЗначенияПеречисления Цикл
		НоваяСтрока = ТаблицаВидов.Добавить();
		НоваяСтрока.Ссылка = Перечисления.ВидыНалоговВзносовОтчислений[ЗначениеПеречисления.Имя];
		НоваяСтрока.Синоним = ЗначениеПеречисления.Синоним;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВидов", ТаблицаВидов);
	Запрос.УстановитьПараметр("ИсключаемыеЗначения", ИсключаемыеЗначения(Параметры));
	Запрос.УстановитьПараметр("СтрокаПоиска", Строка(Параметры.СтрокаПоиска) + "%");
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
	
Функция ИсключаемыеЗначения(Параметры)
	
	Если Параметры.Свойство("ТолькоВзносыИОтчисления") Тогда
		ТолькоВзносыИОтчисления = Параметры.ТолькоВзносыИОтчисления;
	Иначе 
		ТолькоВзносыИОтчисления = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоНалоги") Тогда
		ТолькоНалоги = Параметры.ТолькоНалоги;
	Иначе 
		ТолькоНалоги = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоНалогиВзносыРаботодателя") Тогда
		ТолькоНалогиВзносыРаботодателя = Параметры.ТолькоНалогиВзносыРаботодателя;
	Иначе 
		ТолькоНалогиВзносыРаботодателя = Ложь;
	КонецЕсли;
		
	МассивИсключений = Новый Массив;
	
	Если ТолькоНалоги Тогда
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ОПВ);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ОППВ);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ОПВР);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.СО);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ООСМС);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ЕП);
	КонецЕсли;
	
	Если ТолькоВзносыИОтчисления Тогда
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ИПН);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.СН);
	КонецЕсли;
	
	Если ТолькоНалогиВзносыРаботодателя Тогда
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ОПВ);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ИПН);
		МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС);
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Организация") И НЕ ТолькоНалоги Тогда
		Если НЕ ПолучитьФункциональнуюОпцию("ПлательщикОППВЗарплатаКадры", Новый Структура("Организация", Параметры.Отбор.Организация)) Тогда
			МассивИсключений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ОППВ);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат МассивИсключений;
	
КонецФункции

#КонецЕсли