
// ИсходныеДанные - Структура. Элементы - ДатаСреза и Организация.
// Функция возвращает структуру, собранную из РС СоответствиеРеквизитовНаРусскомИГосударственномЯзыках, включающую актуальные значения на дату среза 
// по трем реквизитам в разрезе переданной организации.
Функция ПолучитьАктуальныеДанныеСоответствийРеквизитовПечати(ИсходныеДанные) Экспорт
	
	Если ТипЗнч(ИсходныеДанные) = Тип("Структура") Тогда
		ДатаСреза 	= ИсходныеДанные.ДатаСреза;
		Организация = ИсходныеДанные.Организация;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыкахСрезПоследних.Реквизит КАК Реквизит,
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыкахСрезПоследних.Период КАК ДатаНачалаДействия,
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыкахСрезПоследних.НаРусскомЯзыке КАК НаРусскомЯзыке,
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыкахСрезПоследних.НаГосЯзыке КАК НаГосЯзыке
	|ИЗ
	|	РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК СоответствиеРеквизитовНаРусскомИГосударственномЯзыкахСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|ИТОГИ ПО
	|	Реквизит";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	АктуальныеДанныеСоответствий = Новый Структура();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ВыборкаПоРеквизитам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
		
		Пока ВыборкаПоРеквизитам.Следующий() Цикл
			
			Если РезультатЗапроса.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НаименованиеОрганизации Тогда
				
				АктуальныеДанныеСоответствий.Вставить("НаименованиеОрганизации_Рус", ВыборкаПоРеквизитам.НаРусскомЯзыке);
				АктуальныеДанныеСоответствий.Вставить("НаименованиеОрганизации_Гос", ВыборкаПоРеквизитам.НаГосЯзыке);
								
			ИначеЕсли РезультатЗапроса.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.ФормаСобственности Тогда
				
				АктуальныеДанныеСоответствий.Вставить("ФормаСобственности_Рус", 	 ВыборкаПоРеквизитам.НаРусскомЯзыке);
				АктуальныеДанныеСоответствий.Вставить("ФормаСобственности_Гос",		 ВыборкаПоРеквизитам.НаГосЯзыке);
							
			ИначеЕсли РезультатЗапроса.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НазваниеНаселенногоПункта Тогда
				
				АктуальныеДанныеСоответствий.Вставить("МестоИздания_Рус", 			 ВыборкаПоРеквизитам.НаРусскомЯзыке);
				АктуальныеДанныеСоответствий.Вставить("МестоИздания_Гос", 			 ВыборкаПоРеквизитам.НаГосЯзыке);
								
			КонецЕсли;
			
			Если Не АктуальныеДанныеСоответствий.Свойство("ДатаНачалаДействия") Тогда
				АктуальныеДанныеСоответствий.Вставить("ДатаНачалаДействия", 		 ВыборкаПоРеквизитам.ДатаНачалаДействия);
			КонецЕсли;

			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Если в регистре еще нет записей по этой организации, либо не все реквизиты заполнены, структура будет заполнена некорректно.
	// Необходимо добавить пустые элементы
	
	Если Не АктуальныеДанныеСоответствий.Свойство("НаименованиеОрганизации_Рус") Тогда
		АктуальныеДанныеСоответствий.Вставить("НаименованиеОрганизации_Рус", "");
	КонецЕсли;
	
	Если Не АктуальныеДанныеСоответствий.Свойство("НаименованиеОрганизации_Гос") Тогда
		АктуальныеДанныеСоответствий.Вставить("НаименованиеОрганизации_Гос", "");
	КонецЕсли;
	
	Если Не АктуальныеДанныеСоответствий.Свойство("ФормаСобственности_Рус") Тогда
		АктуальныеДанныеСоответствий.Вставить("ФормаСобственности_Рус", "");
	КонецЕсли;
	
	Если Не АктуальныеДанныеСоответствий.Свойство("ФормаСобственности_Гос") Тогда
		АктуальныеДанныеСоответствий.Вставить("ФормаСобственности_Гос", "");
	КонецЕсли;
	
	Если Не АктуальныеДанныеСоответствий.Свойство("МестоИздания_Рус") Тогда
		АктуальныеДанныеСоответствий.Вставить("МестоИздания_Рус", "");
	КонецЕсли;
	
	Если Не АктуальныеДанныеСоответствий.Свойство("МестоИздания_Гос") Тогда
		АктуальныеДанныеСоответствий.Вставить("МестоИздания_Гос", "");
	КонецЕсли;
	
	Если Не АктуальныеДанныеСоответствий.Свойство("ДатаНачалаДействия") Тогда
		АктуальныеДанныеСоответствий.Вставить("ДатаНачалаДействия", "");
	КонецЕсли;
	
	Возврат АктуальныеДанныеСоответствий;
	
КонецФункции

Функция ПолучитьСтандартныеНаименованияДляМакета() Экспорт
	
	СтандартныеНаименования = Новый Структура();
	СтандартныеНаименования.Вставить("НаименованиеОрганизации_Гос", "(ұйымның атауы)");
	СтандартныеНаименования.Вставить("НаименованиеОрганизации_Рус", "(наименование организации)");
	СтандартныеНаименования.Вставить("ФормаСобственности_Гос", 		"(меншік нысаны)");
	СтандартныеНаименования.Вставить("ФормаСобственности_Рус", 		"(форма собственности)");
	СтандартныеНаименования.Вставить("МестоИздания_Гос",            "(құжаттың шығарылған орны)");
	СтандартныеНаименования.Вставить("МестоИздания_Рус", 			"(место издания документа)");
	
	Возврат СтандартныеНаименования;
	
КонецФункции

Процедура ЗаписатьДанныеВРегистр(Набор) Экспорт
	
	НаборЗаписей = РегистрыСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.СоздатьНаборЗаписей();
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Отбор.Организация.Установить(Набор.Организация);
	НаборЗаписей.Отбор.Реквизит.Установить(Набор.Реквизит);
	НаборЗаписей.Отбор.Период.Установить(Набор.Дата);
	НаборЗаписей.Прочитать();

	Запись = НаборЗаписей.Добавить();
	Запись.Организация = Набор.Организация;
	Запись.Период = Набор.Дата;
	Запись.Реквизит = Набор.Реквизит;
	Запись.НаГосЯзыке = Набор.НаименованиеГос;
	Запись.НаРусскомЯзыке = Набор.НаименованиеРус;
	
	// Для случая, когда записываем элемент, у которого поменялись только ресурсы, т.е. необходимо перезаписать данные с теми же измерениями
	Если НаборЗаписей.Количество() > 1 Тогда
			
		СтараяЗапись = НаборЗаписей.Получить(0);
		СтараяЗапись.НаГосЯзыке = Набор.НаименованиеГос;
		СтараяЗапись.НаРусскомЯзыке = Набор.НаименованиеРус;
		
		Для НомерЗаписи  = 1 По НаборЗаписей.Количество()-1 Цикл
			
			НаборЗаписей.Удалить(НомерЗаписи);
			
		КонецЦикла;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
конецпроцедуры

Функция ПолучитьТекстЗапросаДанныеДляЗаполненияШапкиДокументов() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Организация КАК Организация,
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Реквизит КАК Реквизит,
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Период КАК ДатаНачалаДействия,
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.НаРусскомЯзыке КАК НаРусскомЯзыке,
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.НаГосЯзыке КАК НаГосЯзыке
	|ИЗ
	|	РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках КАК СоответствиеРеквизитовНаРусскомИГосударственномЯзыках
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеДокументовДляОтбора КАК ДанныеДокументов
	|		ПО (ДанныеДокументов.Организация = СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Организация)
	|ГДЕ
	|	СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Период <= ДанныеДокументов.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачалаДействия УБЫВ
	|ИТОГИ ПО
	|	Организация,
	|	Реквизит";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ВывестиЛоготипВТабличныйДокумент(Макет, ОбластьМакета, ИмяОбласти, Организация) Экспорт
	
	ФайлКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ФайлЛоготип");
	
	Если Не ЗначениеЗаполнено(ФайлКартинки) И ОбластьМакета <> Неопределено Тогда
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Логотип);
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ФайлКартинки);
	
	Если ТипЗнч(ДвоичныеДанныеФайла) = Тип("Картинка") Тогда
		Картинка = ДвоичныеДанныеФайла;
	ИначеЕсли ТипЗнч(ДвоичныеДанныеФайла) = Тип("ДвоичныеДанные") Тогда
		Картинка = Новый Картинка(ДвоичныеДанныеФайла);
	Иначе
		Картинка = Новый Картинка;
	КонецЕсли; 
	
	ОбластьМакета.Рисунки.Логотип.Картинка = Картинка;
	
КонецПроцедуры

Процедура ЗаполнениеРеквизитовШапки(МакетПечатнойФормы, ДанныеНаПечать, РеквизитДата, РеквизитОрганизация, РеквизитОрганизацияНаименование) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МакетПечатнойФормы, "Параметры")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МакетПечатнойФормы.Параметры, "НаименованиеОрганизацииНаГосЯзыке")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеНаПечать, РеквизитДата)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеНаПечать, РеквизитОрганизация)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеНаПечать, РеквизитОрганизацияНаименование) Тогда
		
		ДатаДокумента = ДанныеНаПечать[РеквизитДата];
		Если ТипЗнч(ДатаДокумента) = Тип("Строка") Тогда
			Если Найти(ДатаДокумента, ":") = 0
				И Найти(ДатаДокумента, ".") > 0 Тогда
				ДатаДокумента = ДатаДокумента + " 0:00:00";
			КонецЕсли;
			ДатаДокумента = Дата(ДатаДокумента);
		КонецЕсли;
		
		ДанныеШапка = ДанныеДляЗаполненияШапки(ДатаДокумента, ДанныеНаПечать[РеквизитОрганизация], ДанныеНаПечать[РеквизитОрганизацияНаименование]);
		
		ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(МакетПечатнойФормы, ДанныеШапка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнениеРеквизитовШапкиБезОрганизации(МакетПечатнойФормы, ДанныеНаПечать) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МакетПечатнойФормы, "Параметры")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(МакетПечатнойФормы.Параметры, "НаименованиеОрганизацииНаГосЯзыке")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеНаПечать, "СсылкаНаОбъект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеНаПечать, "СсылкаНаОбъектДата") Тогда
		
		РаботаОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеНаПечать.СсылкаНаОбъект, "Организация");
		
		Если ТипЗнч(РаботаОрганизация) = Тип("СправочникСсылка.Организации") Тогда
			ДанныеШапка = ДанныеДляЗаполненияШапки(ДанныеНаПечать.СсылкаНаОбъектДата, РаботаОрганизация, РаботаОрганизация.НаименованиеПолное);
			
			ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(МакетПечатнойФормы, ДанныеШапка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнениеРеквизитовШапкиЧерезМассивОбъектов(МакетПечатнойФормы, МассивОбъектов, ДокументСтрокой, НазваниеОрганизации) Экспорт
	
	ДанныеШапка = ДанныеДляЗаполненияШапкиЧерезМассивОбъектов(МассивОбъектов, ДокументСтрокой, НазваниеОрганизации);
	
	ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(МакетПечатнойФормы, ДанныеШапка);
	
КонецПроцедуры

Функция ДанныеДляЗаполненияШапки(Дата, Организация, НазваниеОрганизации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&Дата КАК Дата,
		|	&Организация КАК Организация
		|ПОМЕСТИТЬ ВТДанныеДокументовДляОтбора";
	
	Запрос.Выполнить();
	
	Запрос.Текст = ПолучитьТекстЗапросаДанныеДляЗаполненияШапкиДокументов();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеСтруктурой = ДанныеДляЗаполненияШапкиСтруктурой(РезультатЗапроса, НазваниеОрганизации);
	
	Возврат ДанныеСтруктурой;
	
КонецФункции

Функция ДанныеДляЗаполненияШапкиЧерезМассивОбъектов(МассивОбъектов, ДокументСтрокой, НазваниеОрганизации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.Ссылка КАК Ссылка,
		|	Документ.Дата КАК Дата,
		|	Документ.Организация КАК Организация
		|ПОМЕСТИТЬ ВТДанныеДокументовДляОтбора
		|ИЗ
		|	#Документ КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&МассивОбъектов)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Документ", "Документ."+ДокументСтрокой);
	
	Запрос.Выполнить();
	
	Запрос.Текст = ПолучитьТекстЗапросаДанныеДляЗаполненияШапкиДокументов();
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеСтруктурой = ДанныеДляЗаполненияШапкиСтруктурой(РезультатЗапроса, НазваниеОрганизации);
	
	Возврат ДанныеСтруктурой;
	
КонецФункции

Функция ДанныеДляЗаполненияШапкиСтруктурой(ДанныеШапка, НазваниеОрганизации)
	
	ОрганизацияНаименование_Рус = "";
	ОрганизацияНаименование_Гос = "";
	ФормаСобственности_Рус = "";
	ФормаСобственности_Гос = "";
	МестоИздания_Рус = "";
	МестоИздания_Гос = "";
	
	ДанныеШапка_УровеньОрганизация = ДанныеШапка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ДанныеШапка_УровеньОрганизация.Следующий() Цикл
		
		Если ДанныеШапка_УровеньОрганизация.Организация.НаименованиеПолное = НазваниеОрганизации Тогда
			
			ДанныеШапка_УровеньРеквизит = ДанныеШапка_УровеньОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ДанныеШапка_УровеньРеквизит.Следующий() Цикл
				
				Если ДанныеШапка_УровеньРеквизит.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НаименованиеОрганизации Тогда
					
					ДанныеШапка_ВыборкаПоРегистру = ДанныеШапка_УровеньРеквизит.Выбрать();
					
					Пока ДанныеШапка_ВыборкаПоРегистру.Следующий() Цикл 
						
						ОрганизацияНаименование_Рус = ДанныеШапка_ВыборкаПоРегистру.НаРусскомЯзыке;
						ОрганизацияНаименование_Гос = ДанныеШапка_ВыборкаПоРегистру.НаГосЯзыке;
						Прервать;
						
					КонецЦикла;
					
				ИначеЕсли ДанныеШапка_УровеньРеквизит.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.ФормаСобственности Тогда
					
					ДанныеШапка_ВыборкаПоРегистру = ДанныеШапка_УровеньРеквизит.Выбрать();
					
					Пока ДанныеШапка_ВыборкаПоРегистру.Следующий() Цикл 
						
						ФормаСобственности_Рус = ДанныеШапка_ВыборкаПоРегистру.НаРусскомЯзыке;
						ФормаСобственности_Гос = ДанныеШапка_ВыборкаПоРегистру.НаГосЯзыке;
						Прервать;
						
					КонецЦикла;
					
				ИначеЕсли ДанныеШапка_УровеньРеквизит.Реквизит = Перечисления.РеквизитыСоответствияДляВыводаПечатныхФормПоУтвержденнымПравиламДО.НазваниеНаселенногоПункта Тогда
					
					ДанныеШапка_ВыборкаПоРегистру = ДанныеШапка_УровеньРеквизит.Выбрать();
					
					Пока ДанныеШапка_ВыборкаПоРегистру.Следующий() Цикл 
						
						МестоИздания_Рус = ДанныеШапка_ВыборкаПоРегистру.НаРусскомЯзыке;
						МестоИздания_Гос = ДанныеШапка_ВыборкаПоРегистру.НаГосЯзыке;
						Прервать;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеСтруктурой = Новый Структура("НаименованиеОрганизацииНаРусЯзыке,НаименованиеОрганизацииНаГосЯзыке,ФормаСобственностиНаРусЯзыке,
							|ФормаСобственностиНаГосЯзыке,МестоИзданияНаРусЯзыке,МестоИзданияНаГосЯзыке", ОрганизацияНаименование_Рус,
							ОрганизацияНаименование_Гос, ФормаСобственности_Рус, ФормаСобственности_Гос, МестоИздания_Рус, МестоИздания_Гос);
	
	Возврат ДанныеСтруктурой;
	
КонецФункции
