#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИнициализироватьОтчет();

КонецПроцедуры

#КонецОбласти

Процедура ИнициализироватьОтчет() Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект);
	
	КлючВарианта = Неопределено;
	СтандартнаяОбработка = Ложь;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючВарианта", КлючВарианта);	
	
	ПараметрВидНалогаВзносаОтчисления = ОтчетыКлиентСервер.НайтиПараметр(КомпоновщикНастроек, КомпоновщикНастроек.ПользовательскиеНастройки,  "ВидНалогаВзносаОтчисления");

    ВидимостьКомпонентЕП = (ПараметрВидНалогаВзносаОтчисления.Значение = Перечисления.ВидыНалоговВзносовОтчислений.ЕП);
    
    ПараметрСтруктурноеПодразделение = ОтчетыКлиентСервер.НайтиПараметр(КомпоновщикНастроек, КомпоновщикНастроек.ПользовательскиеНастройки, "СтруктурноеПодразделение"); 
    ПараметрРегистрацияВНалоговомОргане = ОтчетыКлиентСервер.НайтиПараметр(КомпоновщикНастроек, КомпоновщикНастроек.ПользовательскиеНастройки, "РегистрацияВНалоговомОргане"); 
    ПараметрРегистрацияВНалоговомОргане.Значение = ПолучитьРегистрацииВналоговомОрганеПоСтруктурномуПодразделению(КомпоновщикНастроек);
    ПараметрРегистрацияВНалоговомОргане.Использование = Истина;
    
    Если НЕ КлючВарианта = Неопределено Тогда
		
		Если КлючВарианта = "СтруктураЗадолженностиПоМесяцам" Тогда
			ВыборЭлементы = КомпоновщикНастроек.Настройки.Выбор.Элементы;
		Иначе
            Если КомпоновщикНастроек.Настройки.Структура[0].Структура.Количество() > 0 Тогда
                ВыборЭлементы = КомпоновщикНастроек.Настройки.Структура[0].Структура[0].Выбор.Элементы;
            Иначе
                ВыборЭлементы = КомпоновщикНастроек.Настройки.Структура[0].Выбор.Элементы;           
            КонецЕсли; 
		КонецЕсли;
	
		Для Каждого ЭлементыПараметров Из ВыборЭлементы Цикл
			
			Если ТипЗнч(ЭлементыПараметров) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных")
				И ЭлементыПараметров.Заголовок = "Компоненты ЕП" Тогда
				ЭлементыПараметров.Использование = ВидимостьКомпонентЕП;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> "СхемаИнициализирована" Тогда
		
		ИнициализироватьОтчет();
		
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		КлючСхемы = "СхемаИнициализирована";
		
	КонецЕсли;
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

Процедура СформироватьОтчетРасшифровку(Параметры, ДокументРезультат) Экспорт
	
	СхемаКомпоновки = Отчеты.СтруктураЗадолженностиВзносовИОтчислений.ПолучитьМакет(Параметры.ИмяСКД);
	
	ТекстЗапроса = СхемаКомпоновки.НаборыДанных.Данные.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация = &Организация", "Организация В (&Организация)");
	СхемаКомпоновки.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	ТекстЗапроса = СхемаКомпоновки.НаборыДанных.КомпонентыЕП.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация = &Организация", "Организация В (&Организация)");
	СхемаКомпоновки.НаборыДанных.КомпонентыЕП.Запрос = ТекстЗапроса;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
        
	Если Параметры.Свойство("ФизическоеЛицо") Тогда
		
		НастройкиОтчета = ЗаполнитьКомпоновщикНастроек("СтруктураЗадолженностиПоСотрудникам", Параметры, СхемаКомпоновки);
		
		Попытка
			ЭлементыФизическоЛицо = НастройкиОтчета.Структура[0].Структура[0].Выбор.Элементы;
		Исключение
			ЭлементыФизическоЛицо = Неопределено;
		КонецПопытки;
		
		Если ТипЗнч(ЭлементыФизическоЛицо) = Тип("КоллекцияВыбранныхПолейКомпоновкиДанных") Тогда
			УстановитьИспользованиеПолей(ЭлементыФизическоЛицо, Ложь, "НачальныйОстаток");
			УстановитьИспользованиеПолей(ЭлементыФизическоЛицо, Ложь, "КонечныйОстаток");
			УстановитьИспользованиеПолей(ЭлементыФизическоЛицо, Ложь, "Расход");
		КонецЕсли;
		
	Иначе
		
		НастройкиОтчета = ЗаполнитьКомпоновщикНастроек("СтруктураЗадолженностиПоМесяцам", Параметры, СхемаКомпоновки);
		
		УстановитьИспользованиеПолей(НастройкиОтчета.Выбор.Элементы, Ложь, "НачальныйОстаток");
		УстановитьИспользованиеПолей(НастройкиОтчета.Выбор.Элементы, Ложь, "КонечныйОстаток");
		УстановитьИспользованиеПолей(НастройкиОтчета.Выбор.Элементы, Ложь, "Расход");
		
	КонецЕсли;
    
    ПараметрРегистрацияВНалоговомОргане = ОтчетыКлиентСервер.НайтиПараметр(НастройкиОтчета, НастройкиОтчета.ПараметрыДанных, "РегистрацияВНалоговомОргане");
    
    СписокРегистрацийВНалоговомОргание = Новый СписокЗначений;
    СписокРегистрацийВНалоговомОргание.Добавить(Параметры.РегистрацияВНО);
    СписокРегистрацийВНалоговомОргание.Добавить(Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка()); 
    
    ПараметрРегистрацияВНалоговомОргане.Значение = СписокРегистрацийВНалоговомОргание;
    ПараметрРегистрацияВНалоговомОргане.Использование = Истина;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиОтчета);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроек(КлючВарианта, ПараметрыОтчета, СхемаКД)
	
	КомпНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));
	КомпНастроек.ЗагрузитьНастройки(СхемаКД.ВариантыНастроек[КлючВарианта].Настройки);
	КомпНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	
	ПараметрПериод = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпНастроек, "Период");
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрПериод.Значение.ДатаНачала = ПараметрыОтчета.ДатаНачалаПериодаОтчета;
		ПараметрПериод.Значение.ДатаОкончания = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	КонецЕсли;
	
	ПараметрОрганизация = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпНастроек, "Организация");
	Если ПараметрОрганизация <> Неопределено Тогда
		ПараметрОрганизация.Значение = ПолучитьСписокСтруктурныхЕдиниц(ПараметрыОтчета);
	КонецЕсли;
	
	ПараметрВидНалогаВзносаОтчисления = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпНастроек, "ВидНалогаВзносаОтчисления");
	Если ПараметрВидНалогаВзносаОтчисления <> Неопределено Тогда
		ПараметрВидНалогаВзносаОтчисления.Значение = Перечисления.ВидыНалоговВзносовОтчислений.ЕП;
	КонецЕсли;
	
    Настройки = КомпНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	Если ПараметрыОтчета.ИндивидуальныйПредприниматель Тогда
		УстановитьОтборИП(ПараметрыОтчета, Отбор);
	КонецЕсли;
		
	Если ПараметрыОтчета.Свойство("ФизическоеЛицо")
		И Отбор.ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных("ФизическоеЛицо")) <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ПараметрыОтчета.ФизическоеЛицо, ВидСравненияКомпоновкиДанных.Равно);
		
	КонецЕсли;
	
	Возврат КомпНастроек.ПолучитьНастройки();
	
КонецФункции

Функция ПолучитьСписокСтруктурныхЕдиниц(ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСтруктурныхЕдиниц",ПараметрыОтчета.СписокСтруктурныхЕдиниц);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.РегистрацияВНалоговомОргане В(&СписокСтруктурныхЕдиниц)";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьРегистрацииВналоговомОрганеПоСтруктурномуПодразделению(КомпоновщикНастроек)

    ПараметрСтруктурноеПодразделение = ОтчетыКлиентСервер.НайтиПараметр(КомпоновщикНастроек, КомпоновщикНастроек.ПользовательскиеНастройки, "СтруктурноеПодразделение"); 
    ПараметрОрганизация = ОтчетыКлиентСервер.НайтиПараметр(КомпоновщикНастроек, КомпоновщикНастроек.ПользовательскиеНастройки, "Организация"); 
    ПараметрПериод = ОтчетыКлиентСервер.НайтиПараметр(КомпоновщикНастроек, КомпоновщикНастроек.ПользовательскиеНастройки, "Период");
    
    Если ПараметрСтруктурноеПодразделение <> Неопределено И ПараметрПериод <> Неопределено  
        И ПараметрСтруктурноеПодразделение.Использование Тогда
        
        СписокСтруктурныхЕдиниц = ПараметрСтруктурноеПодразделение.Значение;
        ДатаКонцаПериодаОтчета = ПараметрПериод.Значение.ДатаОкончания;
        Запрос = Новый Запрос;
        Запрос.УстановитьПараметр("СписокСтруктурныхЕдиниц",СписокСтруктурныхЕдиниц);
        Запрос.УстановитьПараметр("Дата",ДатаКонцаПериодаОтчета);
        
        СписокРегистрацийВНалоговомОргание = Новый СписокЗначений;
        
        Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
        |	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
        |ИЗ
        |	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
        |			&Дата,
        |			ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)
        |				И ВЫРАЗИТЬ(СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
        |		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
        |ГДЕ
        |	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница В (&СписокСтруктурныхЕдиниц)
        |";
        
        Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РегистрацияВНалоговомОргане");
        Если Результат.Количество() <> 0 Тогда
            СписокРегистрацийВНалоговомОргание.ЗагрузитьЗначения(Результат);
        КонецЕсли;
        
        Если СписокСтруктурныхЕдиниц = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() ИЛИ 
            (ТипЗнч(СписокСтруктурныхЕдиниц) = Тип("СписокЗначений") 
            И СписокСтруктурныхЕдиниц.НайтиПоЗначению(Справочники.ПодразделенияОрганизаций.ПустаяСсылка()) <> Неопределено) Тогда
            Запрос = Новый Запрос;
            Запрос.УстановитьПараметр("Организация", ПараметрОрганизация.Значение);
            Запрос.УстановитьПараметр("Дата",ДатаКонцаПериодаОтчета);
            
            Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
            |	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
            |	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
            |ИЗ
            |	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
            |			&Дата,
            |			ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.Организации)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
            |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
            |		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
            |ГДЕ
            |	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = &Организация
            |";
            
            Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РегистрацияВНалоговомОргане");

            Если Результат.Количество() <> 0 Тогда	
                СписокРегистрацийВНалоговомОргание.Добавить(Результат[0]);
            КонецЕсли;
        КонецЕсли; 
        
        // Для вывода компонентов ЕП, для которых не требуется регистрация в налоговом органе всегда добавляем пустое значение Регистрации в налоговом органе
        СписокРегистрацийВНалоговомОргание.Добавить(Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
               
        Возврат СписокРегистрацийВНалоговомОргание;
    Иначе
        Возврат Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
    КонецЕсли;
   
КонецФункции

Процедура УстановитьОтборИП(ПараметрыОтчета, Отбор)
	
	ИндивидуальныйПредприниматель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОтчета.Организация, "ИндивидуальныйПредприниматель");
	
	// ячейки расшиврофки определяются в отчете формы
	Если ПараметрыОтчета.Свойство("ЭтоРасшиврофкаИП") И ПараметрыОтчета.ЭтоРасшиврофкаИП <> Неопределено Тогда
		Если ПараметрыОтчета.ЭтоРасшиврофкаИП = Истина Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.Равно);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Отбор, "ФизическоеЛицо", ИндивидуальныйПредприниматель, ВидСравненияКомпоновкиДанных.НеРавно);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьИспользованиеПолей(Элементы, ИспользоватьПоле, ИмяПоля)
    
    Для Каждого Элемент Из Элементы Цикл 
		
		Если ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
        
		    Если Найти(Строка(Элемент.Поле),ИмяПоля) = 1 Тогда
		        Элемент.Использование = ИспользоватьПоле;    
		    КонецЕсли;
        КонецЕсли;
		
	КонецЦикла;
   
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли