///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = Истина;
	// ЗУПК
	ПриОткрытииЗаписьВЖурнал();
	// ЗУПК
КонецПроцедуры

// ЗУПК
&НаСервереБезКонтекста
Процедура ПриОткрытииЗаписьВЖурнал()
	
	УровеньСобытия = УровеньЖурналаРегистрации.Информация;
	
	Если Найти(ВРег(Метаданные.Имя), "ДЛЯКАЗАХСТАНА") > 0 Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытияВЖурналеРегистрации(), УровеньСобытия, , , НСтр("ru = 'В решениях для Казахстана загрузка классификатора банков не предусмотрена'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ИмяСобытияВЖурналеРегистрации()
	
	Возврат НСтр("ru = 'Загрузка классификатора банков.1С'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти
// ЗУПК