#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ЗУПК
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ОтношениеКВоинскойОбязанности.Военнообязанный);
	ДанныеВыбора.Добавить(Перечисления.ОтношениеКВоинскойОбязанности.Невоеннообязанный);
	ДанныеВыбора.Добавить(Перечисления.ОтношениеКВоинскойОбязанности.Призывник);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
// ЗУПК

#КонецЕсли