#Область ПроцедурыИФункцииМеханизмаАтозаполнения

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
// Пример:
//	Если ИДОтчета = "РегламентированныйОтчет210Форма" Тогда
//		Если ИДРедакцииОтчета = "ФормаОтчета2102016Кв1" Тогда
//			ЗаполнитьФорма2102016Кв1(ПараметрыОтчета, Контейнер);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ЗаполнитьОтчетРК(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	РегламентированнаяОтчетностьПереопределяемыйРК.ЗаполнитьОтчетРК(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
	
КонецПроцедуры

// Функция возвращает список используемых в конфигурации регламентированных отчетов.
//
// Пример:
// 	СписокРегламентированныхОтчетов = Новый СписокЗначений;
//	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетНДС");
//	Возврат СписокРегламентированныхОтчетов;
//
Функция ПолучитьСписокРегламентированныхОтчетовРК(СписокРегламентированныхОтчетов) Экспорт
	
	//Регламентированные отчеты РК
	СписокРегламентированныхОтчетов = РегламентированнаяОтчетностьПереопределяемыйРК.ПолучитьСписокРегламентированныхОтчетовРК(СписокРегламентированныхОтчетов);
	
	Возврат СписокРегламентированныхОтчетов;
		
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииВыгрузки

// Формирует построчно структуру XML файла из макета "ВыгрузкаВXML"
//
Процедура ВыгрузитьСтрокуВXML(Форма, Запись, ТаблицаВыгрузки, КоличествоСтрокВТаблице, НомерСтроки, ТекущаяФорма = Неопределено, ТекСтраница = Неопределено)
	
	СтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки);
	НоваяФорма = СтрокаВыгрузки.Форма;
	НоваяСтраница = СтрокаВыгрузки.Страница;
	
	Если ТекущаяФорма <> Неопределено И НоваяФорма <> ТекущаяФорма Тогда
		Запись.ЗаписатьКонецЭлемента();			// </sheet>
	КонецЕсли;
	
	Если НЕ НоваяФорма = ТекущаяФорма Тогда
		Если НЕ ТекущаяФорма = Неопределено Тогда
			Запись.ЗаписатьКонецЭлемента();			// </sheetGroup>
			Запись.ЗаписатьКонецЭлемента();			// </form>
		КонецЕсли;
		Запись.ЗаписатьНачалоЭлемента("form");
		Запись.ЗаписатьАтрибут("name",СтрокаВыгрузки.Форма);
		Запись.ЗаписатьНачалоЭлемента("sheetGroup");
	КонецЕсли;
	
	Если НЕ НоваяСтраница = ТекСтраница Тогда
		Если ТекущаяФорма <> Неопределено И НоваяФорма <> ТекущаяФорма Тогда
			// ничего не делаем
		ИначеЕсли НЕ ТекСтраница = Неопределено Тогда
			Запись.ЗаписатьКонецЭлемента();			// </sheet>
		КонецЕсли;
		Запись.ЗаписатьНачалоЭлемента("sheet");
		Запись.ЗаписатьАтрибут("name",СтрокаВыгрузки.Страница);
	КонецЕсли;
	
	Если СтрокаВыгрузки.Многострочность <> Неопределено И СтрокаВыгрузки.Многострочность = 1 Тогда
		ВыгрузитьМногострочнуюФорму(Форма, Запись, ТаблицаВыгрузки, КоличествоСтрокВТаблице, НомерСтроки, ТекСтраница);
	// Проверим многострочное ли значение.
	ИначеЕсли ЗначениеЗаполнено(СтрокаВыгрузки.КоличествоROW) И СтрокаВыгрузки.КоличествоROW <> "0" Тогда  // для обычных форм
		// Если в обычной форме встретилась многострочность.
		КоличествоПовторений = Число(СтрокаВыгрузки.КоличествоROW);
		Для Н = 1 По КоличествоПовторений Цикл
			Запись.ЗаписатьНачалоЭлемента("row");
			СтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки);
			Если Н = 1 Тогда
				ТаблицаМногострочныхТегов = ТаблицаВыгрузки.СкопироватьКолонки();
				НоваяСтрока = ТаблицаМногострочныхТегов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыгрузки);
				
				// Проверим многострочная ли следующая строка
				СледСтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки+1);
				Пока ЗначениеЗаполнено(СледСтрокаВыгрузки.КоличествоROW) И СледСтрокаВыгрузки.КоличествоROW <> "0" Цикл
					НомерСтроки = НомерСтроки+1;
					НоваяСтрока = ТаблицаМногострочныхТегов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СледСтрокаВыгрузки);
					СледСтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки+1);
				КонецЦикла;
			КонецЕсли;
			Для Каждого МногСтрока Из ТаблицаМногострочныхТегов Цикл
				ЗаписатьЗначениеЭлемента(Запись, МногСтрока);
			КонецЦикла;
			Запись.ЗаписатьКонецЭлемента();			// </row>
		КонецЦикла;
	Иначе
		ЗаписатьЗначениеЭлемента(Запись, СтрокаВыгрузки);
	КонецЕсли;
	
	ТекущаяФорма = НоваяФорма;
	ТекСтраница = НоваяСтраница;
	
КонецПроцедуры

// Выгружает многострочные формы в XML
//
Процедура ВыгрузитьМногострочнуюФорму(Форма, Запись, ТаблицаВыгрузки, КоличествоСтрокВТаблице, НомерСтроки, ТекСтраница)
	
	Перем СтруктураГруппы;
	
	СтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки);
	
	Если СтрокаВыгрузки.КоличествоНаЛисте = 1 Тогда  // форма многостраничная
		
		// для многострочной = одностраничной
		
		НачальнаяСтрока = НомерСтроки;
		КонечнаяСтрока = 0;
		
		ТекущаяФорма = СтрокаВыгрузки.Форма;
		СледСтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки+1);
		НоваяФорма = СледСтрокаВыгрузки.Форма;
		Пока НоваяФорма = ТекущаяФорма Цикл
			НомерСтроки = НомерСтроки+1;
			
			ТекущаяФорма = СледСтрокаВыгрузки.Форма;
			Если НомерСтроки+1 < КоличествоСтрокВТаблице Тогда
				СледСтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки+1);
				НоваяФорма = СледСтрокаВыгрузки.Форма;
				КонечнаяСтрока = НомерСтроки;
			Иначе
				НоваяФорма = Неопределено;
				КонечнаяСтрока = НомерСтроки;
			КонецЕсли;
		КонецЦикла;
		
		МногСтруктура = Форма.СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(СтрокаВыгрузки.КодФормы);
		
		КоличествоЗаписей = 0;
		
		Для Каждого КлючИЗначение Из МногСтруктура Цикл
			ТаблицаСтрокГруппы = КлючИЗначение.Значение.Строки;
			КоличествоЗаписей =  ТаблицаСтрокГруппы.Количество();
			Прервать;
		КонецЦикла;
		
		ВсегоСтр = 0;
		
		Если КоличествоЗаписей <= 1 Тогда
			ВсегоСтр = 0;
		Иначе
			ВсегоСтр = КоличествоЗаписей - 1;
		КонецЕсли;
		
		ОдинШаг = Истина;
		НачальнаяСтрока = НачальнаяСтрока - 1;
		
		Для ШагФорм = 0 По ВсегоСтр Цикл
			
			Для Шаг = НачальнаяСтрока По КонечнаяСтрока Цикл
				
				Если Шаг = КонечнаяСтрока Тогда
					Прервать;
				КонецЕсли;
				
				СтрокаВыгрузкиТек = ТаблицаВыгрузки.Получить(Шаг);
				ТекущаяФорма 	  = СтрокаВыгрузкиТек.Форма; 
				ТекСтраница   = СтрокаВыгрузкиТек.Страница;
				
				СтрокаВыгрузкиСлед = ТаблицаВыгрузки.Получить(Шаг + 1);
				
				НоваяФорма 		   = СтрокаВыгрузкиСлед.Форма;
				НоваяСтраница      = СтрокаВыгрузкиСлед.Страница;
				
				Если ОдинШаг Тогда 
					НомерЛиста = Новый Структура;
					НомерЛиста.Вставить("НомерЛиста",ШагФорм);
					ЗаписатьЗначениеЭлемента(Запись, СтрокаВыгрузкиСлед, МногСтруктура, НомерЛиста);
					ОдинШаг = Ложь;
					Продолжить;
				КонецЕсли;
				
				Если НЕ НоваяФорма = ТекущаяФорма Тогда
					Запись.ЗаписатьКонецЭлемента();			// </sheet>
					Запись.ЗаписатьКонецЭлемента();			// </sheetGroup>
					Запись.ЗаписатьКонецЭлемента();			// </form>
					Запись.ЗаписатьНачалоЭлемента("form");
					Запись.ЗаписатьАтрибут("name",СтрокаВыгрузкиСлед.Форма);
					Запись.ЗаписатьНачалоЭлемента("sheetGroup");
				КонецЕсли;
				Если НЕ НоваяСтраница = ТекСтраница Тогда
					Если НоваяФорма <> ТекущаяФорма Тогда
						// ничего не делаем
					Иначе
						Запись.ЗаписатьКонецЭлемента();			// </sheet>
					КонецЕсли;
					Запись.ЗаписатьНачалоЭлемента("sheet");
					Запись.ЗаписатьАтрибут("name",СтрокаВыгрузкиСлед.Страница);
				КонецЕсли;

                ОтметкаПриложение3 = Неопределено;
                Если Найти(СтрокаВыгрузки.ИмяФормы, "form200") 
                    И Форма.СтруктураДанныхФорма200Страница1.Свойство("Приложение3") Тогда
                        ОтметкаПриложение3 = ?(ЗначениеЗаполнено(Форма.СтруктураДанныхФорма200Страница1["Приложение3"]), Истина, Ложь);
                КонецЕсли;
               
				НомерЛиста = Новый Структура;
				НомерЛиста.Вставить("НомерЛиста",ШагФорм);
                НомерЛиста.Вставить("ОтметкаПриложение3", ОтметкаПриложение3);
				ЗаписатьЗначениеЭлемента(Запись, СтрокаВыгрузкиСлед, МногСтруктура, НомерЛиста);
			КонецЦикла;
			//
			//Если ОдинШагНазад Тогда
			//	НачальнаяСтрока = НачальнаяСтрока - 1;
			//	ОдинШагНазад = Ложь;
			//КонецЕсли;
		КонецЦикла;

	Иначе // форма многострочная
		
		// Определяем одинаковое ли количество строк на всех страницах формы и создаем таблицу значений
		// например, в форме 300.07 и 300.08 одинаковое количество
		// а в других может быть неодинаковое - и там другой механизм выгрузки по строкам
		ОдинаковоеКоличествоСтрок = Истина;
		КоличествоСтрокНаЛисте = 0;
		
		ТаблицаМногострочнойФормы = ТаблицаВыгрузки.СкопироватьКолонки();
		НоваяСтрока = ТаблицаМногострочнойФормы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыгрузки);
		
		ТекущаяФорма = СтрокаВыгрузки.Форма;
		СледСтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки+1);
		НоваяФорма = СледСтрокаВыгрузки.Форма;
		Пока НоваяФорма = ТекущаяФорма Цикл
			НомерСтроки = НомерСтроки+1;
			НоваяСтрока = ТаблицаМногострочнойФормы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СледСтрокаВыгрузки);
			Если ЗначениеЗаполнено(СледСтрокаВыгрузки.КоличествоROW) И СледСтрокаВыгрузки.КоличествоROW <> "0" Тогда
				ТекКоличествоСтрокНаЛисте = Число(СледСтрокаВыгрузки.КоличествоROW);
				Если КоличествоСтрокНаЛисте <> 0 И КоличествоСтрокНаЛисте <> ТекКоличествоСтрокНаЛисте Тогда
					 ОдинаковоеКоличествоСтрок = Ложь;
				КонецЕсли;
				КоличествоСтрокНаЛисте = Число(СледСтрокаВыгрузки.КоличествоROW);
			КонецЕсли;
			ТекущаяФорма = СледСтрокаВыгрузки.Форма;
			Если НомерСтроки+1 < КоличествоСтрокВТаблице Тогда
				СледСтрокаВыгрузки = ТаблицаВыгрузки.Получить(НомерСтроки+1);
				НоваяФорма = СледСтрокаВыгрузки.Форма;
			Иначе
				НоваяФорма = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		//Выгружаем многострочные данные, у которых одинаковое количество строк
		//Если ОдинаковоеКоличествоСтрок Тогда //как для 300.07, 300.08 и большинства других многострочных
			
			// Определим количество <sheetGroup>
			//МногСтруктура = СтрокаВыгрузки.Значение[0].Данные;
			МногСтруктура = Форма.СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(СтрокаВыгрузки.КодФормы, ТаблицаМногострочнойФормы); 
			
			Если ТипЗнч(МногСтруктура) = Тип("Структура") Тогда
				ВыгрузитьМногострочныеДанные(МногСтруктура, СтрокаВыгрузки, Запись, ТаблицаМногострочнойФормы);
			ИначеЕсли ТипЗнч(МногСтруктура) = Тип("Массив") Тогда // 200.06
				Для Каждого ЭлементМногСтруктуры Из МногСтруктура Цикл
					ВыгрузитьМногострочныеДанные(ЭлементМногСтруктуры, СтрокаВыгрузки, Запись, ТаблицаМногострочнойФормы);
					
					Если ЭлементМногСтруктуры <> МногСтруктура[МногСтруктура.ВГраница()] Тогда
						Запись.ЗаписатьКонецЭлемента();			// </sheet>
						Запись.ЗаписатьКонецЭлемента();			// </sheetGroup>
						Запись.ЗаписатьКонецЭлемента();			// </form>
						
						Запись.ЗаписатьНачалоЭлемента("form");
						Запись.ЗаписатьАтрибут("name",СтрокаВыгрузки.Форма);
						Запись.ЗаписатьНачалоЭлемента("sheetGroup");
						Запись.ЗаписатьНачалоЭлемента("sheet");
						Запись.ЗаписатьАтрибут("name",СтрокаВыгрузки.Страница);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьМногострочныеДанные(МногСтруктура, СтрокаВыгрузки, Запись, ТаблицаМногострочнойФормы)
	
	КоличествоЗаписей = 0;
	Для Каждого КлючИЗначение Из МногСтруктура Цикл
		ТаблицаСтрокГруппы = КлючИЗначение.Значение.Строки;
		КоличествоЗаписей =  ТаблицаСтрокГруппы.Количество();
		Прервать;
	КонецЦикла;

	мКоличествоНаЛисте = СтрокаВыгрузки.КоличествоНаЛисте; // из макета Показатели
	Стр =  Цел(КоличествоЗаписей/мКоличествоНаЛисте);
	Если Стр = КоличествоЗаписей/мКоличествоНаЛисте  Тогда
		ВсегоСтр = Стр;
	Иначе
		ВсегоСтр = Стр + 1;
	КонецЕсли;
	
	Если КоличествоЗаписей = 0 Тогда // форма не заполнена, то выгружаем пустые теги
		ВсегоСтр = 1;
	КонецЕсли;
	
	Для КолСтр = 1 По ВсегоСтр Цикл // sheetgroup
		Если КолСтр <> 1 Тогда
			Запись.ЗаписатьКонецЭлемента();		// </sheet>
			Запись.ЗаписатьКонецЭлемента();		// </sheetgroup>
			Запись.ЗаписатьНачалоЭлемента("sheetGroup");
			Запись.ЗаписатьНачалоЭлемента("sheet");
			Запись.ЗаписатьАтрибут("name", СтрокаВыгрузки.Страница);
		КонецЕсли;

		ТекСтраница = СтрокаВыгрузки.Страница;
		Для Ном = 0 По ТаблицаМногострочнойФормы.Количество()-1 Цикл
			СтрокаТаблицы = ТаблицаМногострочнойФормы[Ном];
			НоваяСтраница = СтрокаТаблицы.Страница;
			Если НоваяСтраница <> ТекСтраница Тогда
				 Запись.ЗаписатьКонецЭлемента();		// </sheet>
				 Запись.ЗаписатьНачалоЭлемента("sheet");
				 Запись.ЗаписатьАтрибут("name", СтрокаТаблицы.Страница);
			КонецЕсли;
			// если перешли на новую страницу
			Если ЗначениеЗаполнено(СтрокаТаблицы.Отображение) И КолСтр <> Число(СтрокаТаблицы.Отображение) Тогда
				Продолжить;
			КонецЕсли;
			// проверим элемент это или нет
			Если Лев(СтрокаТаблицы.ИмяАтрибута,1) = "#" Тогда
				Атрибут = Сред(СтрокаТаблицы.ИмяАтрибута,2);
				// опеределим начальный или конечный элемент
				Если Лев(Атрибут,1) = "/" Тогда // это конечный элемент
					Запись.ЗаписатьКонецЭлемента();
				Иначе // это начальный
					Запись.ЗаписатьНачалоЭлемента(Атрибут);
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.КоличествоROW) И СтрокаТаблицы.КоличествоROW <> "0" Тогда
				
				КоличествоПовторений = Число(СтрокаТаблицы.КоличествоROW);
				Если КолСтр = ВсегоСтр И КолСтр <> 1  Тогда // рассчитаем сколько должно быть строк на последней странице, при этом на 1 стр - должно быть количество строк как в макете
					КоличествоПовторений = КоличествоЗаписей - КоличествоПовторений*(КолСтр-1);
				КонецЕсли;
				Для Н = 1 По КоличествоПовторений Цикл // ТаблицаМногострочнойФормы.Количество() Цикл 
					Запись.ЗаписатьНачалоЭлемента("row");
					Если Н = 1 Тогда
						ТаблицаМногострочныхТегов = ТаблицаМногострочнойФормы.СкопироватьКолонки();
						НоваяСтрока = ТаблицаМногострочныхТегов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
						
						// Проверим многострочная ли следующая строка
						СледСтрокаВыгрузки = ТаблицаМногострочнойФормы.Получить(Ном+1);
						Пока ЗначениеЗаполнено(СледСтрокаВыгрузки.КоличествоROW) И СледСтрокаВыгрузки.КоличествоROW <> "0" Цикл
							Ном = Ном+1;
							НоваяСтрока = ТаблицаМногострочныхТегов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СледСтрокаВыгрузки);
							Если Ном + 1 = ТаблицаМногострочнойФормы.Количество() Тогда
								Прервать;
							КонецЕсли;
							СледСтрокаВыгрузки = ТаблицаМногострочнойФормы.Получить(Ном+1);
						КонецЦикла;
					КонецЕсли;
					Для Каждого МногСтрока Из ТаблицаМногострочныхТегов Цикл
						СтруктураПараметров = Новый Структура;
						СтруктураПараметров.Вставить("КоличествоГруппСтраниц", КолСтр);
						СтруктураПараметров.Вставить("НомерЗаписи", Н);
						ЗаписатьЗначениеЭлемента(Запись, МногСтрока, МногСтруктура, СтруктураПараметров);
					КонецЦикла;
					
					Запись.ЗаписатьКонецЭлемента();			// </row>
				КонецЦикла;
			Иначе
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("КоличествоГруппСтраниц", КолСтр);
				ЗаписатьЗначениеЭлемента(Запись, СтрокаТаблицы, МногСтруктура, СтруктураПараметров);
			КонецЕсли;
			СтрокаТаблицы = ТаблицаМногострочнойФормы[Ном];
			ТекСтраница = СтрокаТаблицы.Страница;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Приводит значение к нужному формату для выгрузки в формате XML
//
Функция ПривестиЗначениеКФорматуСОНО(Значение, ВыгружатьНулевыеЗначения = Ложь) Экспорт
	
	Если Врег(Значение) = "Х" ИЛИ Врег(Значение) = "X" Тогда
		Значение = Истина;
	ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
		Если Значение = Дата('00010101') Тогда
			Значение = "";
		Иначе
			Значение = Лев(Значение,10);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") И Значение = 0 И НЕ ВыгружатьНулевыеЗначения Тогда
		Значение = "";
	ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда    
    	МассивЗначение = Значение.ВыгрузитьЗначения();
       	Значение = СтрСоединить(МассивЗначение, ";");
  	ИначеЕсли Значение = Неопределено И ВыгружатьНулевыеЗначения Тогда
		Значение = 0;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Записываем значение в поле field из структуры хранения данных
//
Процедура ЗаписатьЗначениеЭлемента(Запись, СтрокаВыгрузки, МногСтруктура = Неопределено,  СтруктураПараметров = Неопределено)
	
	Запись.ЗаписатьНачалоЭлемента("field");
	Запись.ЗаписатьАтрибут("name",СтрокаВыгрузки.ИмяАтрибута);
	// Выгрузим значение ячейки, если оно есть в форме
	ИмяЯчейки = СтрокаВыгрузки.ИмяЯчейки;
	Если ЗначениеЗаполнено(ИмяЯчейки) Тогда
		//получаем и записываем значение из отчета
		Если СтрокаВыгрузки.Выгружать = 1 Тогда
			Если СтрокаВыгрузки.Многострочность Тогда
				// определим имя Листа по имени страницы
				ИмяЛиста = СтрокаВыгрузки.ИмяЛиста;
				СтруктураГруппы = Неопределено;
				//если в обычной форме, есть многострочность
				Если МногСтруктура = Неопределено Тогда
					МногСтруктура = СтрокаВыгрузки.Значение[0].Данные;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИмяЛиста) И МногСтруктура.Свойство(ИмяЛиста) Тогда
					МногСтруктура.Свойство(ИмяЛиста,СтруктураГруппы);
				Иначе
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1: Не заполнено ""Имя листа"" или ""Имя листа"" указано неверно для ячейки ""%2"" в макете для выгрузки значения в XML'"),
						СтрокаВыгрузки.КодФормы,
						ИмяЯчейки);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
				
				Если ИмяЯчейки = "НомерСтраницы"  И НЕ СтруктураПараметров = Неопределено Тогда
					КолСтр = Неопределено;
					СтруктураПараметров.Свойство("КоличествоГруппСтраниц", КолСтр);
					Запись.ЗаписатьТекст(XMLСтрока(Формат(КолСтр,"ЧЦ=3; ЧВН=")));
					// заполнения многостраничных данных
				ИначеЕсли СтрокаВыгрузки.КоличествоНаЛисте = 1 Тогда
					Если СтруктураГруппы <> Неопределено
						И СтруктураГруппы.Строки.Количество() > 0 Тогда
						НомерЛиста = СтруктураПараметров.НомерЛиста;
						СтрокаЗначений = СтруктураГруппы.Строки[НомерЛиста];
						Попытка
							Строка = СтрокаЗначений[ИмяЯчейки];
						Исключение
							Строка = Неопределено;
						КонецПопытки;
						Если Строка <> Неопределено Тогда
							Значение = Строка;
                            ОтметкаПриложение3 = Неопределено;
                            СтруктураПараметров.Свойство("ОтметкаПриложение3", ОтметкаПриложение3);
                            Если СтрокаВыгрузки.ИмяФормы = "form200_03" Тогда
                                Значение = ПривестиЗначениеКФорматуСОНО(Значение, ?(ОтметкаПриложение3, СтрокаВыгрузки.ВыгружатьНулевыеЗначения, Ложь))
                            Иначе
                                Значение = ПривестиЗначениеКФорматуСОНО(Значение, СтрокаВыгрузки.ВыгружатьНулевыеЗначения); //СтрокаФорматов);
                            КонецЕсли;
							Запись.ЗаписатьТекст(XMLСтрока(Значение));
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(СтрокаВыгрузки.КоличествоROW) И СтрокаВыгрузки.КоличествоROW <> "0" Тогда  // многострочная часть row
					КоличествоНаЛисте = Число(СтрокаВыгрузки.КоличествоROW);
					НомерЗаписиНаЛисте = Неопределено;
					СтруктураПараметров.Свойство("НомерЗаписи", НомерЗаписиНаЛисте);
					КолСтр = Неопределено;
					СтруктураПараметров.Свойство("КоличествоГруппСтраниц", КолСтр);
					Если СтруктураГруппы <> Неопределено Тогда
						ТаблицаСтрокГруппы = СтруктураГруппы.Строки;
						// рассчитаем индекс строки и проверим есть ли такая строка в таблице данных
						ИндексСтроки = НомерЗаписиНаЛисте + (КолСтр-1)* КоличествоНаЛисте - 1;
						Если ИндексСтроки < ТаблицаСтрокГруппы.Количество() Тогда  // строк в таблице может быть меньше, чем выгружается в XML
							Строка = ТаблицаСтрокГруппы.Получить(ИндексСтроки);
							Если Строка <> Неопределено Тогда // найдена строка для выгрузки значения
								ИмяЯчейки = ?(СтрНайти(ИмяЯчейки, "_") = 0, ИмяЯчейки, Сред(ИмяЯчейки, 1, СтрНайти(ИмяЯчейки, "_") - 1));
								Если ТаблицаСтрокГруппы.Колонки.Найти(ИмяЯчейки) <> Неопределено Тогда 
									Значение = Строка[ИмяЯчейки];
									// для числовых ячеек будем выгружать 0. Так как это обычно требуется в ФЛК суммовых полей
									Значение = ПривестиЗначениеКФорматуСОНО(Значение, СтрокаВыгрузки.ВыгружатьНулевыеЗначения); 
									Запись.ЗаписатьТекст(XMLСтрока(Значение));
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе // шапка или подвал
					Если СтруктураГруппы <> Неопределено Тогда
						ОбщиеЭлементыГруппы = СтруктураГруппы.ШапкаИПодвал;
						Строка = ОбщиеЭлементыГруппы.Найти(ИмяЯчейки,"ИмяОбласти");
						Если Строка <> Неопределено Тогда
							Значение = Строка.Значение;
							Значение = ПривестиЗначениеКФорматуСОНО(Значение); //СтрокаФорматов);
							Запись.ЗаписатьТекст(XMLСтрока(Значение));
						Иначе
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = '%1: Не найден в структуре хранения данных показатель %2'"),
								СтрокаВыгрузки.КодФормы,
								ИмяЯчейки);
							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ТаблицаДанных = СтрокаВыгрузки.Значение;
				СтрокаОбласти = ТаблицаДанных.Найти(ИмяЯчейки,"ИмяОбласти");
                Если СтрокаОбласти <> Неопределено Тогда
                    Значение = СтрокаОбласти.Значение;
                    Значение = ПривестиЗначениеКФорматуСОНО(Значение, СтрокаВыгрузки.ВыгружатьНулевыеЗначения); //СтрокаФорматов);                
                    Запись.ЗаписатьТекст(XMLСтрока(Значение));
				Иначе
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1: Не найдена ячейка %2 для выгрузки значения в XML'"),
						СтрокаВыгрузки.КодФормы,
						ИмяЯчейки);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Если приложение 100.01 не заполнено, то запишем номер страниц "001"
			Если Найти(СтрокаВыгрузки.ИмяФормы, "form_100") И ИмяЯчейки = "НомерСтраницы" Тогда
				КолСтр = Неопределено;
				СтруктураПараметров.Свойство("КоличествоГруппСтраниц", КолСтр);
				Запись.ЗаписатьТекст(XMLСтрока(Формат(КолСтр,"ЧЦ=3; ЧВН=")));
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	Запись.ЗаписатьКонецЭлемента();			// </field>

КонецПроцедуры

// Выгружает данные отчета в формат XML.
//
// Параметры:
//   ИмяФайла - файл, куда будет идти запись текста XML.
//   Объект - объект регламентированного отчета.
//
Функция ВыгрузитьОтчетВXMLДляСОНО(Объект, ВыдаватьСообщение = Истина) Экспорт
	
	Префикс = Прав(Объект.СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
	
	// запишем общие атрибуты (code, version) и создадим элемент form
	Запись = Новый ЗаписьXML;
	Запись.Отступ = Истина;
	Запись.УстановитьСтроку("utf-8");
	
	//Запись.ОткрытьФайл(ИмяВременногоФайла,"UTF-8");
	Запись.ЗаписатьОбъявлениеXML();
	
	// Запишем корневой элемент
	Запись.ЗаписатьНачалоЭлемента("fno");
	
	МакетВыгрузки = Отчеты[Сред(Лев(Объект.ИмяФормы, СтрНайти(Объект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("ВыгрузкаВXML");

	ТаблОбщиеРеквизиты = Новый ТаблицаЗначений;
	ТаблОбщиеРеквизиты.Колонки.Добавить("ИмяАтрибута");
	ТаблОбщиеРеквизиты.Колонки.Добавить("ЗначениеАтрибута");
	
	ОбластьОбщихРеквизитов = МакетВыгрузки.Область("ОбщиеРеквизиты" + Префикс);
	Для Ном = ОбластьОбщихРеквизитов.Верх По ОбластьОбщихРеквизитов.Низ Цикл
		Строка = ТаблОбщиеРеквизиты.Добавить();
		Строка.ИмяАтрибута 		  = СокрП(МакетВыгрузки.Область(Ном, 1).Текст);
		Строка.ЗначениеАтрибута   = СокрП(МакетВыгрузки.Область(Ном, 2).Текст);
	КонецЦикла;
	
	// Запишем атрибуты корневого элемента
	Для Каждого Строка Из ТаблОбщиеРеквизиты Цикл
		Запись.ЗаписатьАтрибут(Строка.ИмяАтрибута,Строка.ЗначениеАтрибута);
	КонецЦикла;
	
	// создадим таблицу для выгрузки
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	ТаблицаВыгрузки.Колонки.Добавить("Форма");
	ТаблицаВыгрузки.Колонки.Добавить("Страница");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяАтрибута");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяЯчейки");
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоROW");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяФормы");
	ТаблицаВыгрузки.Колонки.Добавить("ИмяЛиста");
	ТаблицаВыгрузки.Колонки.Добавить("Отображение");
	ТаблицаВыгрузки.Колонки.Добавить("ВыгружатьНулевыеЗначения");
	
	ТаблицаВыгрузки.Колонки.Добавить("КодФормы");
	ТаблицаВыгрузки.Колонки.Добавить("Выгружать");
	ТаблицаВыгрузки.Колонки.Добавить("Многострочность");
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоНаЛисте");
	ТаблицаВыгрузки.Колонки.Добавить("Значение");
	
	ОбластьВыгрузки = МакетВыгрузки.Область("Выгрузка" + Префикс);
	СписокФормБезИерархии = Объект.РеквизитФормыВЗначение("мСписокФормБезИерархии");
	ТекущееИмяФормы = Неопределено;
	Для Ном = ОбластьВыгрузки.Верх По ОбластьВыгрузки.Низ Цикл
		Строка = ТаблицаВыгрузки.Добавить();
		Строка.Форма 	       			= СокрП(МакетВыгрузки.Область(Ном, 1).Текст);
		Строка.Страница        			= СокрП(МакетВыгрузки.Область(Ном, 2).Текст);
		Строка.ИмяАтрибута     			= СокрП(МакетВыгрузки.Область(Ном, 3).Текст);
		Строка.ИмяЯчейки      	 		= СокрП(МакетВыгрузки.Область(Ном, 4).Текст);
		Строка.КоличествоROW   			= СокрП(МакетВыгрузки.Область(Ном, 5).Текст);
		Строка.ИмяФормы        			= СокрП(МакетВыгрузки.Область(Ном, 6).Текст);
		Строка.ИмяЛиста        			= СокрП(МакетВыгрузки.Область(Ном, 7).Текст);
		Строка.Отображение     			= СокрП(МакетВыгрузки.Область(Ном, 8).Текст);
		Строка.ВыгружатьНулевыеЗначения = ?(СокрП(МакетВыгрузки.Область(Ном, 9).Текст) = "1", Истина, Ложь);

		НовоеИмяФормы = Строка.ИмяФормы;
		Если НовоеИмяФормы <> ТекущееИмяФормы Тогда
			Форма = СписокФормБезИерархии.Строки.Найти(Строка.ИмяФормы, "ИмяФормы");
		КонецЕсли;
		
		Если Форма <> Неопределено Тогда
			Строка.КодФормы  		 = Форма.КодФормы;
			Строка.Выгружать  		 = Форма.Выгружать;
			Строка.Многострочность   = Форма.Многострочность;
			Строка.КоличествоНаЛисте = Форма.КоличествоНаЛисте;
			Строка.Значение  		 = Форма.Значение;
		КонецЕсли;
		
		ТекущееИмяФормы = Строка.имяФормы;
	КонецЦикла;
	
	// Выгрузка в XML.
	КоличествоСтрокВТаблице = ТаблицаВыгрузки.Количество();
	НомерСтроки = 0;
	
	ТекущаяФорма = Неопределено;
	ТекСтраница = Неопределено;
	
	Пока Истина Цикл
		Если НомерСтроки >= КоличествоСтрокВТаблице Тогда
			Прервать;
		КонецЕсли;
		ВыгрузитьСтрокуВXML(Объект, Запись, ТаблицаВыгрузки, КоличествоСтрокВТаблице, НомерСтроки, ТекущаяФорма, ТекСтраница);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Запись.ЗаписатьКонецЭлемента();		// </sheet>
	Запись.ЗаписатьКонецЭлемента();		// </sheetGroup>
	Запись.ЗаписатьКонецЭлемента();		// </form>
	Запись.ЗаписатьКонецЭлемента();		// fno
	
	Возврат Запись.Закрыть();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСписокСтруктурныхЕдиниц(РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям", Налогоплательщик = Неопределено, НалоговыйКомитет = Неопределено, Дата = Неопределено) Экспорт
	
	Возврат РегламентированнаяОтчетностьПереопределяемыйРК.СформироватьСписокСтруктурныхЕдиниц(РежимВыбораСтруктурныхЕдиниц, Налогоплательщик, НалоговыйКомитет, Дата);
	
КонецФункции

Функция РегистрацияВНалоговомОргане(СтруктурнаяЕдиница, Знач ДатаАктуальности = Неопределено, РегистрацияВНалоговомОргане = Неопределено) Экспорт
	
	Возврат РегламентированнаяОтчетностьПереопределяемыйРК.РегистрацияВНалоговомОргане(СтруктурнаяЕдиница, ДатаАктуальности, РегистрацияВНалоговомОргане);
	
КонецФункции

Функция ИндивидуальныйПредприниматель(Организация) Экспорт
	
	Возврат РегламентированнаяОтчетностьПереопределяемыйРК.ИндивидуальныйПредприниматель(Организация);
	
КонецФункции

Функция ЮридическоеЛицо(Организация) Экспорт
	
	Возврат РегламентированнаяОтчетностьПереопределяемыйРК.ЮридическоеЛицо(Организация);
	
КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходам() Экспорт

	Возврат РегламентированнаяОтчетностьПереопределяемыйРК.ТекстЗапросаЗадолженностьПоДоходамДо2025();

КонецФункции

Функция ТекстЗапросаВыплаченоДохода() Экспорт

	Возврат РегламентированнаяОтчетностьПереопределяемыйРК.ТекстЗапросаВыплаченоДоходаДо2025();

КонецФункции

Функция СформироватьСписокНалоговыхКомитетов(Налогоплательщик, Знач ДатаАктуальности = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = ТекущаяДатаСеанса()
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Налогоплательщик",	Налогоплательщик);
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокСтруктурныхЕдениц
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Налогоплательщик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &Налогоплательщик
	|	И Организации.ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПолныйСписокПлательщиков
	|ИЗ
	|	ВТ_СписокСтруктурныхЕдениц КАК ВТ_СписокСтруктурныхЕдениц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ПО ВТ_СписокСтруктурныхЕдениц.Ссылка = ПодразделенияОрганизаций.Владелец
	|ГДЕ
	|	ПодразделенияОрганизаций.ОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СписокСтруктурныхЕдениц.Ссылка
	|ИЗ
	|	ВТ_СписокСтруктурныхЕдениц КАК ВТ_СписокСтруктурныхЕдениц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
	|			&ДатаАктуальности,
	|			СтруктурнаяЕдиница В
	|				(ВЫБРАТЬ
	|					ВТ_ПолныйСписокПлательщиков.Ссылка
	|				ИЗ
	|					ВТ_ПолныйСписокПлательщиков КАК ВТ_ПолныйСписокПлательщиков)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокНК = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.РегистрацияВНалоговомОргане) Тогда
			ЭлементСписка 				= СписокНК.Добавить();
			ЭлементСписка.Значение 		= Выборка.РегистрацияВНалоговомОргане;
			ЭлементСписка.Представление = Выборка.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокНК;
	
КонецФункции

Функция ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
				
	Возврат РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ДатаЗначения, СписокПоказателей);

КонецФункции

Функция ПолучитьТекстСтруктурныхЕдиницПоГоловнойОрганизации() Экспорт 
	
	Возврат РегламентированнаяОтчетностьПереопределяемыйРК.ПолучитьТекстСтруктурныхЕдиницПоГоловнойОрганизации();
	
КонецФункции

Функция  ЗаполнитьКАТО(Запись)Экспорт
	
	Если ПустаяСтрока(Запись.ЗначенияПолей) Тогда
		ЗначенияПолейКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Запись.Представление, Запись.Вид);
	Иначе
		ЗначенияПолейКИ = Запись.ЗначенияПолей;
	КонецЕсли;
	КодТерритории = "";
	
	СтруктураАдреса = РаботаСАдресами.ПредыдущаяСтруктураКонтактнойИнформацииXML(ЗначенияПолейКИ);
	
	Город = ?(СтруктураАдреса.Свойство("Город"), СтруктураАдреса.Город, "");
	НаселенныйПункт = ?(СтруктураАдреса.Свойство("НаселенныйПункт"), СтруктураАдреса.НаселенныйПункт, "");
	Регион = ?(СтруктураАдреса.Свойство("Регион"), СтруктураАдреса.Регион, "");
	Район = ?(СтруктураАдреса.Свойство("Район"), СтруктураАдреса.Район, "");

	СписокУровней = АдресныйКлассификаторПовтИсп.НомераУровнейАдресаПоНаименованию();
	
	Если НаселенныйПункт <> "" Тогда
		НаименованиеТерритории = СокрЛП(НаселенныйПункт);
		Уровень = СписокУровней.locality;
		Сокращение = СтруктураАдреса.НаселенныйПунктСокращение;
	ИначеЕсли Город <> "" Тогда
		НаименованиеТерритории = СокрЛП(Город);
		Уровень = СписокУровней.city;
		Сокращение = СтруктураАдреса.ГородСокращение;
	ИначеЕсли Район <> "" Тогда
		// "Ауэзовский район", уберем "район"
		НаименованиеТерритории = СокрЛП(Район);
		Уровень = СписокУровней.district;
		Сокращение = СтруктураАдреса.РайонСокращение;
	ИначеЕсли Регион <> "" Тогда
		// в том числе города республиканского значения
		НаименованиеТерритории = СокрЛП(Регион);
		Уровень = СписокУровней.area;
		Сокращение = СтруктураАдреса.РегионСокращение;
	Иначе
		НаименованиеТерритории = "";
		Уровень = 0;
		Сокращение = "";
	КонецЕсли;
	
	// Если территория выбиралась из адресного классификатора, то сокращения предопределены
	НаименованиеТерритории = СокрЛП(СтрЗаменить(НаименованиеТерритории, Сокращение, ""));
	
	// заменим спецсимволы
	НаименованиеТерритории = СтрЗаменить(НаименованиеТерритории, "~", "~~");
	НаименованиеТерритории = СтрЗаменить(НаименованиеТерритории, "%", "~%");
	НаименованиеТерритории = СтрЗаменить(НаименованиеТерритории, "_", "~_");
	НаименованиеТерритории = СтрЗаменить(НаименованиеТерритории, "[", "~[");
	НаименованиеТерритории = СтрЗаменить(НаименованиеТерритории, "-", "~-");
	НаименованиеТерритории = НаименованиеТерритории + "%";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", НаименованиеТерритории);
	Запрос.УстановитьПараметр("Уровень", Уровень);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АдресныеОбъекты.КодКЛАДР КАК Код,
	|	АдресныеОбъекты.Наименование
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|ГДЕ
	|	АдресныеОбъекты.Уровень = &Уровень
	|	И АдресныеОбъекты.Наименование ПОДОБНО &Наименование СПЕЦСИМВОЛ ""~""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	ВыборкаКод = Запрос.Выполнить().Выбрать();
	Если ВыборкаКод.Следующий() Тогда
		КодТерритории = ВыборкаКод.Код;
	КонецЕсли;
	
	Возврат Формат(КодТерритории, "ЧГ=");	

КонецФункции 

Функция РазрешитьНастройкуВыгрузкиОтчетов(ИмяОтчета) Экспорт

    Возврат РегламентированнаяОтчетностьПереопределяемыйРК.РазрешитьНастройкуВыгрузкиОтчетов(ИмяОтчета);
    
КонецФункции

#КонецОбласти
