////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицинское страхование"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает данные о прикрепленных сотрудниках и родственниках
//
// Параметры:
//   МассивДокументов - Массив из ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования
//
// Возвращаемое значение:
//  Структура - структура застрахованных. Значения структуры:
//      Сотрудники - Массив - массив структур с ключами:
//      	ДокументПрикрепления - ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования - ссылка на документ прикрепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаНачала - Дата - Дата начала страхования
//      	ДатаОкончания - Дата - Дата окончания страхования
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Сведения - структура сведений о контактной информации застрахованного
//      	Сотрудник - СправочникСсылка.Сотрудники
//      	СтраховаяПремия - Число
//      Родственники - Массив - массив структур с ключами:
//      	ДокументПрикрепления - ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования - ссылка на документ прикрепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаНачала - Дата - Дата начала страхования
//      	ДатаОкончания - Дата - Дата окончания страхования
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Сведения - структура сведений о контактной информации застрахованного
//      	Родственник - СправочникСсылка.РодственникиФизическихЛиц
//      	СтраховаяПремия - Число.
//
Функция ДанныеПрикреплений(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрикреплениеКПрограммамМедицинскогоСтрахования", МассивДокументов);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Организация КАК Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Сотрудник КАК Сотрудник,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.ДатаПрикрепления КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.ДатаОкончанияСтрахования КАК ДатаОкончания,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК ПредставлениеКИ,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК ВидКИ,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка КАК ДокументПрикрепления
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК МедицинскоеСтрахованиеПрикреплениеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|		ПО МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеСотрудники.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеСотрудники.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|ГДЕ
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка.Проведен = ИСТИНА
		|	И МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка В(&ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Сотрудник,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.ДатаПрикрепления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Организация КАК Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка КАК Родственник,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ДатаПрикрепления КАК ДатаНачала,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ДатаОткрепления КАК ДатаОкончания,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК ВидКИ,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК ПредставлениеКИ,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка КАК ДокументПрикрепления
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК МедицинскоеСтрахованиеПрикреплениеРодственники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|		ПО МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|ГДЕ
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка.Проведен = ИСТИНА
		|	И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка В(&ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Родственник,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ДатаПрикрепления";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеПрикреплений = Новый Структура;
	ДанныеПрикреплений.Вставить("Сотрудники", Новый Массив);
	ДанныеПрикреплений.Вставить("Родственники", Новый Массив);
	ВыборкаСотрудников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();

	Пока ВыборкаСотрудников.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеСотрудника = Новый Структура;
		ДанныеСотрудника.Вставить("ДокументПрикрепления", ВыборкаСотрудников.ДокументПрикрепления);
		ДанныеСотрудника.Вставить("Организация", ВыборкаСотрудников.Организация);
		ДанныеСотрудника.Вставить("СтраховаяКомпания", ВыборкаСотрудников.СтраховаяКомпания);
		ДанныеСотрудника.Вставить("Сотрудник", ВыборкаСотрудников.Сотрудник);
		ДанныеСотрудника.Вставить("ДатаНачала", ВыборкаСотрудников.ДатаНачала);
		ДанныеСотрудника.Вставить("ДатаОкончания", ВыборкаСотрудников.ДатаОкончания);
		ДанныеСотрудника.Вставить("ПрограммыСтрахования", ВыборкаСотрудников.ПрограммыСтрахования);
		ДанныеСотрудника.Вставить("РасширенияПрограммСтрахования", ВыборкаСотрудников.РасширенияПрограммСтрахования);
		ДанныеСотрудника.Вставить("СтраховаяПремия", ВыборкаСотрудников.СтраховаяПремия);
		
		ДанныеСведений = Новый Структура;
		ДанныеСведений.Вставить("ДатаРождения", ВыборкаСотрудников.ДатаРождения);
		ДанныеСведений.Вставить("СтраховойНомерПФР", ВыборкаСотрудников.СтраховойНомерПФР);
		ДанныеСведений.Вставить("Пол", ВыборкаСотрудников.Пол);
		ДанныеСведений.Вставить("Страна", ВыборкаСотрудников.Страна);
		ДанныеСведений.Вставить("ДокументПредставление", ВыборкаСотрудников.ДокументПредставление);
		Пока ВыборкаСотрудников.Следующий() Цикл
			ДанныеСведений.Вставить(ВыборкаСотрудников.ВидКИ.ИдентификаторДляФормул, ВыборкаСотрудников.ПредставлениеКИ);
		КонецЦикла;
		ДанныеСотрудника.Вставить("Сведения", ДанныеСведений);
		
		ДанныеПрикреплений.Сотрудники.Добавить(ДанныеСотрудника);
	КонецЦикла;
	
	ВыборкаРодственников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	Пока ВыборкаРодственников.СледующийПоЗначениюПоля("Родственник") Цикл
		ДанныеРодственника = Новый Структура;
		ДанныеРодственника.Вставить("ДокументПрикрепления", ВыборкаРодственников.ДокументПрикрепления);
		ДанныеРодственника.Вставить("Организация", ВыборкаРодственников.Организация);
		ДанныеРодственника.Вставить("СтраховаяКомпания", ВыборкаРодственников.СтраховаяКомпания);
		ДанныеРодственника.Вставить("Родственник", ВыборкаРодственников.Родственник);
		ДанныеРодственника.Вставить("ДатаНачала", ВыборкаРодственников.ДатаНачала);
		ДанныеРодственника.Вставить("ДатаОкончания", ВыборкаРодственников.ДатаОкончания);
		ДанныеРодственника.Вставить("ПрограммыСтрахования", ВыборкаРодственников.ПрограммыСтрахования);
		ДанныеРодственника.Вставить("РасширенияПрограммСтрахования", ВыборкаРодственников.РасширенияПрограммСтрахования);
		ДанныеРодственника.Вставить("СтраховаяПремия", ВыборкаРодственников.СтраховаяПремия);
		
		ДанныеСведений = Новый Структура;
		ДанныеСведений.Вставить("ДатаРождения", ВыборкаРодственников.ДатаРождения);
		ДанныеСведений.Вставить("СтраховойНомерПФР", ВыборкаРодственников.СтраховойНомерПФР);
		ДанныеСведений.Вставить("Пол", ВыборкаРодственников.Пол);
		ДанныеСведений.Вставить("Страна", ВыборкаРодственников.Страна);
		ДанныеСведений.Вставить("ДокументПредставление", ВыборкаРодственников.ДокументПредставление);
		Пока ВыборкаРодственников.Следующий() Цикл
			ДанныеСведений.Вставить(ВыборкаРодственников.ВидКИ.ИдентификаторДляФормул, ВыборкаРодственников.ПредставлениеКИ);
		КонецЦикла;
		
		ДанныеРодственника.Вставить("Сведения", ДанныеСведений);
		
		ДанныеПрикреплений.Родственники.Добавить(ДанныеРодственника);
	КонецЦикла;
	
	Возврат ДанныеПрикреплений;
	
КонецФункции

// Возвращает данные о открепленных сотрудниках и родственниках
//
// Параметры:
//   МассивДокументов - Массив из ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования
//
// Возвращаемое значение:
//  Структура - структура застрахованных. Значения структуры:
//      Сотрудники - Массив - массив структур с ключами:
//      	ДокументОткрепления - ДокументСсылка.ОткреплениеОтПрограммМедицинскогоСтрахования - ссылка на документ открепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаОткрепления - Дата - Дата открепления сотрудника
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Сотрудник - СправочникСсылка.Сотрудники
//      	СтраховаяПремия - Число
//      Родственники - Массив - массив структур с ключами:
//      	ДокументОткрепления - ДокументСсылка.ОткреплениеОтПрограммМедицинскогоСтрахования - ссылка на документ открепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаОткрепления - Дата - Дата открепления родственника
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Родственник - СправочникСсылка.РодственникиФизическихЛиц
//      	СтраховаяПремия - Число.
//
Функция ДанныеОткреплений(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОткреплениеОтПрограммМедицинскогоСтрахования", МассивДокументов);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка.Организация КАК Организация,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Сотрудник КАК Сотрудник,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.ДатаОткрепления КАК ДатаОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка В(&ОткреплениеОтПрограммМедицинскогоСтрахования)
		|	И ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Сотрудник,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.ДатаОткрепления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка КАК ДокументОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.Организация КАК Организация,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РодственникСсылка КАК Родственник,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.ДатаОткрепления КАК ДатаОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка В(&ОткреплениеОтПрограммМедицинскогоСтрахования)
		|	И ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РодственникСсылка,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.ДатаОткрепления";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеОткреплений = Новый Структура;
	ДанныеОткреплений.Вставить("Сотрудники", Новый Массив);
	ДанныеОткреплений.Вставить("Родственники", Новый Массив);
	
	ВыборкаСотрудников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();
	Пока ВыборкаСотрудников.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеСотрудника = Новый Структура;
		ДанныеСотрудника.Вставить("ДокументОткрепления", ВыборкаСотрудников.ДокументОткрепления);
		ДанныеСотрудника.Вставить("Организация", ВыборкаСотрудников.Организация);
		ДанныеСотрудника.Вставить("СтраховаяКомпания", ВыборкаСотрудников.СтраховаяКомпания);
		ДанныеСотрудника.Вставить("Сотрудник", ВыборкаСотрудников.Сотрудник);
		ДанныеСотрудника.Вставить("ДатаОткрепления", ВыборкаСотрудников.ДатаОткрепления);
		ДанныеСотрудника.Вставить("ПрограммыСтрахования", ВыборкаСотрудников.ПрограммыСтрахования);
		ДанныеСотрудника.Вставить("РасширенияПрограммСтрахования", ВыборкаСотрудников.РасширенияПрограммСтрахования);
		ДанныеСотрудника.Вставить("СтраховаяПремия", ВыборкаСотрудников.СтраховаяПремия);
		ДанныеОткреплений.Сотрудники.Добавить(ДанныеСотрудника);
	КонецЦикла;
	
	ВыборкаРодственников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	Пока ВыборкаРодственников.СледующийПоЗначениюПоля("Родственник") Цикл
		ДанныеРодственника = Новый Структура;
		ДанныеРодственника.Вставить("ДокументОткрепления", ВыборкаРодственников.ДокументОткрепления);
		ДанныеРодственника.Вставить("Организация", ВыборкаРодственников.Организация);
		ДанныеРодственника.Вставить("СтраховаяКомпания", ВыборкаРодственников.СтраховаяКомпания);
		ДанныеРодственника.Вставить("Родственник", ВыборкаРодственников.Родственник);
		ДанныеРодственника.Вставить("ДатаОткрепления", ВыборкаРодственников.ДатаОткрепления);
		ДанныеРодственника.Вставить("ПрограммыСтрахования", ВыборкаРодственников.ПрограммыСтрахования);
		ДанныеРодственника.Вставить("РасширенияПрограммСтрахования", ВыборкаРодственников.РасширенияПрограммСтрахования);
		ДанныеРодственника.Вставить("СтраховаяПремия", ВыборкаРодственников.СтраховаяПремия);
		ДанныеОткреплений.Родственники.Добавить(ДанныеРодственника);
	КонецЦикла;
	
	Возврат ДанныеОткреплений;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуетсяМедицинскоеСтрахованиеСотрудников() Экспорт
	Возврат Константы.ИспользоватьМедицинскоеСтрахованиеСотрудников.Получить();
КонецФункции

Функция ИспользуютсяУдержанияВМедицинскомСтрахованииСотрудников() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.Получить();
КонецФункции

Процедура УстановитьИспользованиеМедицинскогоСтрахования(Использовать) Экспорт
	Константы.ИспользоватьМедицинскоеСтрахованиеСотрудников.Установить(Использовать);
КонецПроцедуры

Процедура УстановитьИспользованиеУдержанийВМедицинскомСтрахованииСотрудников(Использовать) Экспорт
	Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.Установить(Использовать);
КонецПроцедуры

Процедура ДополнитьФормуЭлементаСправочникаОрганизации(Форма, ИмяГруппыДляВставки = "ГруппаНастройкиМедицинскогоСтрахования") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.УсловияМедицинскогоСтрахования) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "НастройкиМедицинскогоСтрахования";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Медицинское страхование'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппыДляВставки);
	Если Форма.Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаФормы);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОтправкиПисьма(Форма, ВыбранныеПараметры, Получатели, ТемаПисьма) Экспорт
	
	НастройкиПечатныхФорм = Новый ТаблицаЗначений;
	НастройкиПечатныхФорм.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	НастройкиПечатныхФорм.Колонки.Добавить("Печатать", Новый ОписаниеТипов("Булево"));
	НастройкиПечатныхФорм.Колонки.Добавить("ИмяМакета", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("Название", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("ПолноеИмяОбъекта", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("ТабличныйДокумент", Неопределено);
	НастройкиПечатныхФорм.Колонки.Добавить("СсылкаДокумента", Неопределено);
	НастройкиПечатныхФорм.Колонки.Добавить("ДополнительныеПараметры", Неопределено);
	
	КомандыПечати = УправлениеПечатью.КомандыПечатиФормы(Форма);
	Для каждого КомандаПечати Из КомандыПечати Цикл
		НоваяСтрока = НастройкиПечатныхФорм.Добавить();
		НоваяСтрока.ИмяМакета = КомандаПечати.Идентификатор;
		НоваяСтрока.ПолноеИмяОбъекта = КомандаПечати.МенеджерПечати;
		НоваяСтрока.СсылкаДокумента = Форма.Объект.Ссылка;
		НоваяСтрока.ИмяФайлаПечатнойФормы = "<Undefined xmlns="""" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:nil=""true""/>";
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Название = КомандаПечати.Представление;
		НоваяСтрока.Печатать = Истина;
		НоваяСтрока.Представление = КомандаПечати.Представление;
		НоваяСтрока.ДополнительныеПараметры = КомандаПечати.ДополнительныеПараметры;
	КонецЦикла;
	
	СписокВложений = ПоместитьТабличныеДокументыВоВременноеХранилище(Форма, ВыбранныеПараметры, НастройкиПечатныхФорм);
	
	// Контроль уникальности имен.
	ШаблонИмениФайла = "%1%2.%3";
	ИспользованныеИменаФайлов = Новый Соответствие;
	Для Каждого Вложение Из СписокВложений Цикл
		ИмяФайла = Вложение.Представление;
		НомерИспользования = ?(ИспользованныеИменаФайлов[ИмяФайла] <> Неопределено,
			ИспользованныеИменаФайлов[ИмяФайла] + 1, 1);
		ИспользованныеИменаФайлов.Вставить(ИмяФайла, НомерИспользования);
		Если НомерИспользования > 1 Тогда
			Файл = Новый Файл(ИмяФайла);
			ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонИмениФайла,
				Файл.ИмяБезРасширения, " (" + НомерИспользования + ")", Файл.Расширение);
		КонецЕсли;
		Вложение.Представление = ИмяФайла;
	КонецЦикла;
	
	Если ВыбранныеПараметры.Свойство("Получатели") Тогда
		Получатели = ВыбранныеПараметры.Получатели;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Получатель", Получатели);
	Результат.Вставить("Тема", ТемаПисьма);
	Результат.Вставить("Вложения", СписокВложений);
	Результат.Вставить("УдалятьФайлыПослеОтправки", Истина);
	
	ПечатныеФормы = Новый ТаблицаЗначений;
	ПечатныеФормы.Колонки.Добавить("Название");
	ПечатныеФормы.Колонки.Добавить("ТабличныйДокумент");
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаПечатнойФормы.ТабличныйДокумент = Неопределено Тогда
			ТабличныйДокумент = ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы);
		Иначе
			ТабличныйДокумент = НастройкаПечатнойФормы.ТабличныйДокумент;
		КонецЕсли;
		Если ПечатныеФормы.НайтиСтроки(Новый Структура("ТабличныйДокумент", ТабличныйДокумент)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВычислитьИспользованиеВывода(ТабличныйДокумент) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТабличныйДокумент.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеПечатнойФормы = ПечатныеФормы.Добавить();
		ОписаниеПечатнойФормы.Название = НастройкаПечатнойФормы.Название;
		ОписаниеПечатнойФормы.ТабличныйДокумент = ТабличныйДокумент;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтраховаяПремияСотрудника(ЭлементСтрахования) Экспорт
	
	СтраховаяПремияСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСтрахования, "СтраховаяПремияСотрудника");
	Возврат ?(СтраховаяПремияСотрудника = Неопределено, 0, СтраховаяПремияСотрудника);
	
КонецФункции

Функция СтраховаяПремияРодственника(ЭлементСтрахования) Экспорт
	
	СтраховаяПремияРодственника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСтрахования, "СтраховаяПремияРодственника");
	Возврат ?(СтраховаяПремияРодственника = Неопределено, 0, СтраховаяПремияРодственника);
	
КонецФункции

Функция ПараметрыРасчетаСтраховойПремии() Экспорт
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ДатаНачала");
	ПараметрыРасчета.Вставить("ДатаОкончания");
	ПараметрыРасчета.Вставить("ДатаНачалаСтрахования");
	ПараметрыРасчета.Вставить("ДатаОкончанияСтрахования");
	ПараметрыРасчета.Вставить("ДатаРождения");
	ПараметрыРасчета.Вставить("СтраховаяПремияСтрахователя", 0);
	
	ШкалаВозрастов = Новый ТаблицаЗначений;
	ШкалаВозрастов.Колонки.Добавить("ЗначениеОт", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	ШкалаВозрастов.Колонки.Добавить("ЗначениеДо", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ШкалаВозрастов.Колонки.Добавить("ЗначениеПоказателя", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ПараметрыРасчета.Вставить("ШкалаВозрастов", ШкалаВозрастов);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

Функция СтраховаяПремия(ПараметрыРасчета) Экспорт
	
	КоличествоДнейВМесяце = День(КонецМесяца(Дата(Год(ПараметрыРасчета.ДатаНачала), Месяц(ПараметрыРасчета.ДатаРождения), 1)));
	ДеньРожденияТекущийГод = Дата(Год(ПараметрыРасчета.ДатаНачала), Месяц(ПараметрыРасчета.ДатаРождения), Мин(День(ПараметрыРасчета.ДатаРождения), КоличествоДнейВМесяце));
	КоличествоЛетНаНачалоПериода = Год(ПараметрыРасчета.ДатаНачала) - Год(ПараметрыРасчета.ДатаРождения) + ?(Месяц(ПараметрыРасчета.ДатаРождения) > Месяц(ПараметрыРасчета.ДатаНачала), -1,
		?(Месяц(ПараметрыРасчета.ДатаРождения) = Месяц(ПараметрыРасчета.ДатаНачала) И День(ПараметрыРасчета.ДатаРождения) > День(ПараметрыРасчета.ДатаНачала), -1, 0));
	КоличествоЛетНаТекущуюДатуРождения = Год(ДеньРожденияТекущийГод) - Год(ПараметрыРасчета.ДатаРождения);
	КоэффициентНаНачалоПериода = 0;
	КоэффициентНаТекущуюДатуРождения = 0;
	Для Каждого СтрокаШкалы Из ПараметрыРасчета.ШкалаВозрастов Цикл
		Если СтрокаШкалы.ЗначениеОт <= КоличествоЛетНаНачалоПериода И СтрокаШкалы.ЗначениеДо >= КоличествоЛетНаНачалоПериода Тогда
			КоэффициентНаНачалоПериода = СтрокаШкалы.ЗначениеПоказателя;
		КонецЕсли;
		Если СтрокаШкалы.ЗначениеОт <= КоличествоЛетНаТекущуюДатуРождения И СтрокаШкалы.ЗначениеДо >= КоличествоЛетНаТекущуюДатуРождения Тогда
			КоэффициентНаТекущуюДатуРождения = СтрокаШкалы.ЗначениеПоказателя;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоДнейПериода = (ПараметрыРасчета.ДатаОкончанияСтрахования - ПараметрыРасчета.ДатаНачалаСтрахования) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
	Если КоэффициентНаНачалоПериода <> КоэффициентНаТекущуюДатуРождения Тогда
		КоличествоДней = (ДеньРожденияТекущийГод - ПараметрыРасчета.ДатаНачала - ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах()) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
		СтраховаяПремия = ПараметрыРасчета.СтраховаяПремияСтрахователя / КоличествоДнейПериода * КоличествоДней * КоэффициентНаНачалоПериода;
		КоличествоДней = (ПараметрыРасчета.ДатаОкончания - ДеньРожденияТекущийГод) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
		СтраховаяПремия = СтраховаяПремия + ПараметрыРасчета.СтраховаяПремияСтрахователя / КоличествоДнейПериода * КоличествоДней * КоэффициентНаТекущуюДатуРождения;
	Иначе
		КоличествоДней = (ПараметрыРасчета.ДатаОкончания - ПараметрыРасчета.ДатаНачала) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
		СтраховаяПремия = ПараметрыРасчета.СтраховаяПремияСтрахователя / КоличествоДнейПериода * КоличествоДней * КоэффициентНаНачалоПериода;
	КонецЕсли;
	
	Возврат СтраховаяПремия;
	
КонецФункции

// Создает или выключает удержание за ДМС
//
Процедура СоздатьОтключитьУдержаниеЗаДМС(КоллекторУдержаний) Экспорт
	
	ОписаниеУдержания = ПланыВидовРасчета.Удержания.ОписаниеУдержания();
	
	ОписаниеУдержания.КатегорияУдержания	= Перечисления.КатегорииУдержаний.ДМС;
	ОписаниеУдержания.СпособВыполненияУдержания = Перечисления.СпособыВыполненияУдержаний.ЕжемесячноПриОкончательномРасчете;
	ОписаниеУдержания.СпособРасчета = Перечисления.СпособыРасчетаУдержаний.ДМС;
	ОписаниеУдержания.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками;
	
	ОписаниеУдержания.Код						= НСтр("ru = 'ДМС'");
	ОписаниеУдержания.Наименование				= НСтр("ru = 'Удержание за ДМС'");
	ОписаниеУдержания.КраткоеНаименование 		= НСтр("ru = 'За ДМС'");
	ОписаниеУдержания.ФормулаРасчета 			= "";
	ОписаниеУдержания.Рассчитывается 			= Ложь;

	Если ИспользуютсяУдержанияВМедицинскомСтрахованииСотрудников() Тогда
		ПланыВидовРасчета.Удержания.СоздатьИзменитьУдержанияПоОписанию(КоллекторУдержаний, ОписаниеУдержания);
	Иначе
		ПланыВидовРасчета.Удержания.ОтключитьИспользованиеУдержания(КоллекторУдержаний, Перечисления.КатегорииУдержаний.ДМС);
	КонецЕсли;
	
	// Расставляем порядок для вновь созданных видов расчета.
	ПланыВидовРасчета.Удержания.ЗаполнитьПорядокУдержаний(КоллекторУдержаний);
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(КоллекторУдержаний);
	
КонецПроцедуры

// Дополняет соответствие СвойстваПоКатегориям описанием категории ДМС.
//
Процедура ДополнитьСвойстваПоКатегориямУдержаниемПоДМС(СвойстваПоКатегориям, Описание) Экспорт

	Описание.СпособВыполненияУдержания = Перечисления.СпособыВыполненияУдержаний.ЕжемесячноПриОкончательномРасчете;
	Описание.СпособРасчета = Перечисления.СпособыРасчетаУдержаний.ДМС;
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками;
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ДМС, Описание);

КонецПроцедуры

Процедура РассчитатьУдержанияПоГрафику(СпособРасчета, СтрокиРасчета, Организация, МесяцНачисления) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособРасчета <> Перечисления.СпособыРасчетаУдержаний.ДМС Тогда
		Возврат;
	КонецЕсли;
	
	МассивФизическихЛиц = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиРасчета Цикл
		МассивФизическихЛиц.Добавить(СтрокаТаблицы.ФизическоеЛицо);
	КонецЦикла;
	
	ФизическиеЛицаСУдержаниемПоГрафику = ФизическиеЛицаСУдержаниемПоГрафику(Организация, МассивФизическихЛиц);
	ГрафикУдержаний = ГрафикУдержаний(Организация, ФизическиеЛицаСУдержаниемПоГрафику, МесяцНачисления);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ГрафикУдержаний, "ФизическоеЛицо");
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ГрафикУдержаний, "ДокументОснование");
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ГрафикУдержаний, "Удержание");
	
	Для Каждого СтрокаТаблицы Из СтрокиРасчета Цикл
		Если ФизическиеЛицаСУдержаниемПоГрафику.Найти(СтрокаТаблицы.ФизическоеЛицо) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборСтрок = Новый Структура("ФизическоеЛицо, ДокументОснование, Удержание");
		ОтборСтрок.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
		ОтборСтрок.ДокументОснование = СтрокаТаблицы.ДокументОснование;
		ОтборСтрок.Удержание = СтрокаТаблицы.Удержание;
		СтрокиУдержаний = ГрафикУдержаний.НайтиСтроки(ОтборСтрок);
		Если СтрокиУдержаний.Количество() = 0 Тогда
			СтрокаТаблицы.Результат = 0;
		Иначе
			СтрокаТаблицы.Результат = СтрокиУдержаний[0].Сумма;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ПрограммыСтрахования,Сотрудники.РасширенияПрограммСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховаяПремия,Сотрудники.СуммаУдержания,Сотрудники.СуммаПредела";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "ПрограммыСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "ПрограммыСтрахованияСотрудников.ПрограммаСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "РасширенияПрограммСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "РасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Родственники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Родственники.ПрограммыСтрахования,Родственники.РасширенияПрограммСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Родственники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Родственники.СтраховаяПремия";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "ПрограммыСтрахованияРодственников.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ПрограммыСтрахованияРодственников.ПрограммаСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "РасширенияПрограммСтрахованияРодственников.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "РасширенияПрограммСтрахованияРодственников.РасширениеСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "СведенияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "СведенияСотрудников.СведениеЗначение";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "СведенияРодственников.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СведенияРодственников.СведениеЗначение";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ДатаРождения,Сотрудники.ПрограммыСтрахования,Сотрудники.РасширенияПрограммСтрахования,Сотрудники.ДатаОткрепления";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховаяПремия";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "ПрограммыСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "ПрограммыСтрахованияСотрудников.ПрограммаСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "РасширенияПрограммСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "РасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "МедицинскоеСтрахование";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("20bfa77a-4395-4d2d-a4e6-d32ceab316f0");
	Раздел.Представление = НСтр("ru = 'Медицинское страхование'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования",	"Дата", "МедицинскоеСтрахование", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования",	"Дата", "МедицинскоеСтрахование", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеУсловийМедицинскогоСтрахования",	"Дата", "МедицинскоеСтрахование", "Организация");

КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.МедицинскоеСтрахование);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АнализУдержанийМедицинскогоСтрахования);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МедицинскоеСтрахование, "МедицинскоеСтрахование");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьМедицинскоеСтрахованиеСотрудников");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МедицинскоеСтрахование, "ПрограммыСтрахования");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьМедицинскоеСтрахованиеСотрудников");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализУдержанийМедицинскогоСтрахования, "АнализУдержаний");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников");
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования);
	СписокОбъектов.Добавить(Документы.ОткреплениеОтПрограммМедицинскогоСтрахования);
	СписокОбъектов.Добавить(Документы.ИзменениеУсловийМедицинскогоСтрахования);
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаДокументов

Процедура ДобавитьКомандыРассылки(Команды) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Команды.Добавить();
	Команда.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования");
	Команда.Представление = НСтр("ru = 'Рассылка заявлений на удержания за ДМС'");
	Команда.Назначение = РассылкаДокументов.ВидыНазначенияКомандыРассылки().ДляСписка;
	Команда.РежимЗаписи = РассылкаДокументов.РежимыЗаписиОбъектаПередВыполнениемКомандыРассылки().Проводить;
	Команда.ПечатныеФормы = РассылкаДокументовКлиентСервер.НоваяПечатнаяФорма();
	Команда.ПечатныеФормы.Идентификатор = "ЗаявлениеНаУдержание";
	Команда.ПечатныеФормы.ОбработчикПолученияДанных = 
		"Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗаявленияНаУдержание";
	Команда.ТемаПисьма = НСтр("ru = 'Заявление на удержание за ДМС'");
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	Команда.ТекстПисьма = 
		НСтр("ru = 'Добрый день!
			 |
			 |Во вложении заявление на удержание за ДМС.
			 |Пожалуйста, распечатайте его, поставьте свою подпись в обозначенных местах и пришлите нам фотографию или скан-копию в ответ на это письмо.
			 |
			 |С уважением, Администрация.'");
	// АПК:374-вкл

КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.6.51";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("03829d6c-0ce7-4f9f-b7e8-b0297e2dd155");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьДатыСтрахования";
	Обработчик.Комментарий = НСтр("ru = 'Обновление дат медицинского страхования работников и их родственников.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.32";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("501817a4-2608-4aef-b3bd-1b01a9a6ad44");
	Обработчик.Процедура = "МедицинскоеСтрахование.СоздатьПоказателиМедицинскогоСтрахования";
	Обработчик.Комментарий = НСтр("ru = 'Обновление показателей расчета зарплаты.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.21.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c36bc56a-682e-4af1-94d2-650f933f71d8");
	Обработчик.Процедура = "МедицинскоеСтрахование.УстановитьИспользованиеУдержаний";
	Обработчик.Комментарий = НСтр("ru = 'Установка константы Использовать удержания в медицинском страховании сотрудников.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.21.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("193a9b24-597f-4e14-b968-d88c5051e934");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьСпособыУдержания";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение способов удержания в документах Прикрепления к программам страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("87761a6c-df4a-470f-adf6-733c8e28d334");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьОтправляемыеДанныеЗастрахованных";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек отправляемых данных застрахованных.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("464c68d8-efc2-4a52-866a-0329c6957596");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьОтправляемуюКонтактнуюИнформациюЗастрахованных";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек отправляемой контактной информации  застрахованных.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9080d1c9-edfb-4f30-9ba8-ba9105238f3d");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьРодственниковВДокументахПрикрепления";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ссылок на родственников в документах Прикрепление к программам медицинского страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8d59082c-646d-4bf8-aa41-de538cee5e53");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьРодственниковВДокументахОткрепления";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ссылок на родственников в документах Открепление от программ медицинского страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ec62c24a-05f0-49f6-a420-2f71519d86e2");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьДанныеИКонтактнуюИнформациюЗастрахованныхВДокументахПрикрепления";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение данных и контактной информации в документах Прикрепление к программам медицинского страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9127dd2f-4540-4883-962e-11146f83e0a3");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьУсловияМедицинскогоСтрахованияИзПрикреплений";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение регистров сведений Программы медицинского страхования сотрудников и Расширения программ медицинского страхования сотрудников по данным документов прикреплений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("73af19de-267c-481b-b9c2-8cdbe4171745");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьУсловияМедицинскогоСтрахованияИзОткреплений";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение регистров сведений Программы медицинского страхования сотрудников и Расширения программ медицинского страхования сотрудников по данным документов откреплений.'");
	
КонецПроцедуры

Процедура ЗаполнитьДатыСтрахования(ПараметрыОбновления) Экспорт
	
	ОбновляемыеДокументы = ДатыСтрахованияОбновляемыеДокументы(ПараметрыОбновления);
	
	Если ОбновляемыеДокументы.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ВыполнитьЗаполнениеДатСтрахования(ПараметрыОбновления, ОбновляемыеДокументы)
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоказателиМедицинскогоСтрахования(ПараметрыОбновления) Экспорт
	
	ПараметрыПланаВидовРасчета = РасчетЗарплатыРасширенный.ОписаниеПараметровПланаВидовРасчета();
	
	ИспользоватьМедицинскоеСтрахованиеСотрудников = Константы.ИспользоватьМедицинскоеСтрахованиеСотрудников.Получить();
	
	Если ИспользоватьМедицинскоеСтрахованиеСотрудников Тогда
		
		// Страховая премия
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "СтраховаяПремия";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Страховая премия'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Страховая премия'");
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя);
		
		// Количество дней периода страхования
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "КоличествоДнейПериодаСтрахования";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Количество дней периода страхования'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Дней страхования'");
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя);
		
	Иначе
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПредопределенногоЭлемента("СтраховаяПремия");
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПредопределенногоЭлемента("КоличествоДнейПериодаСтрахования");
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура УстановитьИспользованиеУдержаний(ПараметрыОбновления) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбработкаВыполнена = Истина;
	Если Не Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
			|ГДЕ
			|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Удержание <> ЗНАЧЕНИЕ(ПланВидовРасчета.Удержания.ПустаяСсылка)";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			Возврат;
		КонецЕсли;
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Константа.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников", "", "") Тогда
			ОбработкаВыполнена = Ложь;
		Иначе
			МенеджерКонстанты = Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.СоздатьМенеджерЗначения();
			МенеджерКонстанты.Значение = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
			СоздатьОтключитьУдержаниеЗаДМС(Новый Соответствие);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		КонецЕсли;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбработкаВыполнена);
	
КонецПроцедуры

Процедура ЗаполнитьСпособыУдержания(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.Удержание <> ЗНАЧЕНИЕ(ПланВидовРасчета.Удержания.ПустаяСсылка)
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументПрикрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаСотрудник Из ДокументПрикрепление.Сотрудники Цикл
				СтрокаСотрудник.УдерживатьИзЗарплаты = Истина;
				СтрокаСотрудник.Удержание = ДокументПрикрепление.Удержание;
				Если СтрокаСотрудник.СуммаУдержания > 0 Тогда
					СтрокаСотрудник.СпособУдержания = Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно;
				Иначе
					СтрокаСотрудник.СпособУдержания = Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Единовременно;
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументПрикрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли
	
КонецПроцедуры

Процедура ЗаполнитьОтправляемыеДанныеЗастрахованных(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УсловияМедицинскогоСтрахования.Организация КАК Организация,
		|	УсловияМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.УсловияМедицинскогоСтрахования КАК УсловияМедицинскогоСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправляемыеДанныеЗастрахованных КАК ОтправляемыеДанныеЗастрахованных
		|		ПО (УсловияМедицинскогоСтрахования.Организация = ОтправляемыеДанныеЗастрахованных.Организация)
		|		И (УсловияМедицинскогоСтрахования.СтраховаяКомпания = ОтправляемыеДанныеЗастрахованных.СтраховаяКомпания)
		|ГДЕ
		|	ОтправляемыеДанныеЗастрахованных.Организация ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ОтправляемыеДанныеЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Выборка.СтраховаяКомпания);
		Для Каждого Сведение Из Перечисления.ДанныеЗастрахованных Цикл
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);
			ЗаписьНабора.Сведение = Сведение;
			ЗаписьНабора.Отправлять = Истина;
			ЗаписьНабора.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОтправляемуюКонтактнуюИнформациюЗастрахованных(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УсловияМедицинскогоСтрахования.Организация КАК Организация,
		|	УсловияМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.УсловияМедицинскогоСтрахования КАК УсловияМедицинскогоСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправляемаяКонтактнаяИнформацияЗастрахованных КАК ОтправляемаяКонтактнаяИнформацияЗастрахованных
		|		ПО УсловияМедицинскогоСтрахования.Организация = ОтправляемаяКонтактнаяИнформацияЗастрахованных.Организация
		|			И УсловияМедицинскогоСтрахования.СтраховаяКомпания = ОтправляемаяКонтактнаяИнформацияЗастрахованных.СтраховаяКомпания
		|ГДЕ
		|	ОтправляемаяКонтактнаяИнформацияЗастрахованных.Организация ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	МассивОтправляемойКИ = Новый Массив;
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.ОтправляемаяКонтактнаяИнформацияЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Выборка.СтраховаяКомпания);
		Для Каждого КИ Из МассивОтправляемойКИ Цикл
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);
			ЗаписьНабора.Вид = КИ;
			ЗаписьНабора.Отправлять = Истина;
			ЗаписьНабора.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРодственниковВДокументахПрикрепления(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.СведенияРодственников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.РодственникСсылка = ЗНАЧЕНИЕ(Справочник.РодственникиФизическихЛиц.ПустаяСсылка)
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.Родственник <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.Ссылка.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументПрикрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаРодственник Из ДокументПрикрепление.Родственники Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаРодственник.Родственник)) Тогда
					СтрокаРодственник.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаРодственник.Родственник));
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаПрограммыСтрахования Из ДокументПрикрепление.ПрограммыСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаПрограммыСтрахования.Родственник)) Тогда
					СтрокаПрограммыСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаПрограммыСтрахования.Родственник));
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаРасширениеПрограммСтрахования Из ДокументПрикрепление.РасширенияПрограммСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаРасширениеПрограммСтрахования.Родственник)) Тогда
					СтрокаРасширениеПрограммСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаРасширениеПрограммСтрахования.Родственник));
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаСведениеРодственника Из ДокументПрикрепление.СведенияРодственников Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаСведениеРодственника.Родственник)) Тогда
					СтрокаСведениеРодственника.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаСведениеРодственника.Родственник));
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументПрикрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРодственниковВДокументахОткрепления(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РодственникСсылка = ЗНАЧЕНИЕ(Справочник.РодственникиФизическихЛиц.ПустаяСсылка)
		|	И ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Родственник <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОткрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаРодственник Из ДокументОткрепление.Родственники Цикл
				Если ЗначениеЗаполнено(СтрокаРодственник.Родственник) Тогда
					СтрокаРодственник.РодственникСсылка = РодственникМедицинскогоСтрахования(СтрокаРодственник.Родственник);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаПрограммыСтрахования Из ДокументОткрепление.ПрограммыСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СтрокаПрограммыСтрахования.Родственник) Тогда
					СтрокаПрограммыСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СтрокаПрограммыСтрахования.Родственник);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаРасширениеПрограммСтрахования Из ДокументОткрепление.РасширенияПрограммСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СтрокаРасширениеПрограммСтрахования.Родственник) Тогда
					СтрокаРасширениеПрограммСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СтрокаРасширениеПрограммСтрахования.Родственник);
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОткрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеИКонтактнуюИнформациюЗастрахованныхВДокументахПрикрепления(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный ЕСТЬ NULL
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахования.КраткийСоставДокумента <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументПрикрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СведениеСотрудника Из ДокументПрикрепление.СведенияСотрудников Цикл
				ОтборСтрок = Новый Структура("Сотрудник", СведениеСотрудника.Сотрудник);
				НайденнаяСтрока = ДокументПрикрепление.Сотрудники.НайтиСтроки(ОтборСтрок);
				Если НайденнаяСтрока.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				Застрахованный = НайденнаяСтрока[0].ФизическоеЛицо;
				Если ДанныеЗастрахованных()[СведениеСотрудника.СведениеИмя] Тогда
					ЗаполнитьДанныеЗастрахованного(Застрахованный, ДокументПрикрепление, СведениеСотрудника);
				Иначе
					ЗаполнитьКонтактнуюИнформациюЗастрахованного(Застрахованный, ДокументПрикрепление, СведениеСотрудника);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СведениеРодственника Из ДокументПрикрепление.СведенияРодственников Цикл
				Если ДанныеЗастрахованных()[СведениеРодственника.СведениеИмя] Тогда
					ЗаполнитьДанныеЗастрахованного(СведениеРодственника.РодственникСсылка, ДокументПрикрепление, СведениеРодственника);
				Иначе
					ЗаполнитьКонтактнуюИнформациюЗастрахованного(СведениеРодственника.РодственникСсылка, ДокументПрикрепление, СведениеРодственника);
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументПрикрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУсловияМедицинскогоСтрахованияИзПрикреплений(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Проведен = ИСТИНА
		|	И НЕ ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка В (&Обработанные)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Дата УБЫВ";
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Обработанные.Добавить(Выборка.Ссылка);
			ЗаполнитьПрограммыМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Выборка.Ссылка);
			ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Выборка.Ссылка);
		КонецЦикла;
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУсловияМедицинскогоСтрахованияИзОткреплений(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ОткреплениеОтПрограммМедицинскогоСтрахования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ОткреплениеОтПрограммМедицинскогоСтрахования
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахования.Проведен = ИСТИНА
		|	И НЕ ОткреплениеОтПрограммМедицинскогоСтрахования.Ссылка В (&Обработанные)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахования.Дата УБЫВ";
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Обработанные.Добавить(Выборка.Ссылка);
			ЗаполнитьПрограммыМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Выборка.Ссылка);
			ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Выборка.Ссылка);
		КонецЦикла;
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf27-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ОткреплениеОтПрограммМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf41-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "96f9098d-56fa-488b-9b37-98c600b0f941", Метаданные.Справочники.ПрограммыМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "96f9045d-56fa-488b-9b37-98c600b0f941", Метаданные.Справочники.РасширенияПрограммМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "65a84ead-6554-423b-8fef-86ce4ea29edd", Метаданные.Документы.ИзменениеУсловийМедицинскогоСтрахования);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ОткреплениеОтПрограммМедицинскогоСтрахования, Истина);
	Списки.Вставить(Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеУсловийМедицинскогоСтрахования, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.МедицинскоеСтрахование, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.АдресаОтправкиУведомленийСтраховыхКомпаний, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВозрастныеКоэффициентыСтраховыхКомпаний, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрограммыМедицинскогоСтрахованияПоУмолчанию, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрограммыМедицинскогоСтрахованияСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УсловияМедицинскогоСтрахования, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.Организации
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Чтение.ГруппыФизическихЛиц
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Чтение.Организации
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Изменение.ГруппыФизическихЛиц
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Изменение.Организации
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Чтение.ГруппыФизическихЛиц
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Чтение.Организации
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Изменение.ГруппыФизическихЛиц
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Изменение.Организации
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Чтение.Организации
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Изменение.Организации
	|ЖурналДокументов.МедицинскоеСтрахование.Чтение.Организации
	|РегистрСведений.АдресаОтправкиУведомленийСтраховыхКомпаний.Чтение.Организации
	|РегистрСведений.АдресаОтправкиУведомленийСтраховыхКомпаний.Изменение.Организации
	|РегистрСведений.ВозрастныеКоэффициентыСтраховыхКомпаний.Чтение.Организации
	|РегистрСведений.ВозрастныеКоэффициентыСтраховыхКомпаний.Изменение.Организации
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Чтение.Организации
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Изменение.Организации
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияПоУмолчанию.Чтение.Организации
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияПоУмолчанию.Изменение.Организации
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Изменение.Организации
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Чтение.Организации
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Изменение.Организации
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Чтение.Организации
	|РегистрСведений.УсловияМедицинскогоСтрахования.Чтение.Организации
	|РегистрСведений.УсловияМедицинскогоСтрахования.Изменение.Организации";
	
КонецПроцедуры

#КонецОбласти

Процедура ПроверитьИзменениеДокументаУдостоверяющегоЛичность(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.СозданиеНового Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Организация КАК Организация,
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ПрограммаСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних
		|ГДЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Действует = ИСТИНА
		|	И ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДействуетДо >= &ТекущаяДата
		|	И ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ФизическоеЛицо", Форма.ФизическоеЛицоСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеСтрахования = РезультатЗапроса.Выгрузить();
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(
			ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания);
		ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
		Если ОтправляемыеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ОтправляемыеДанные.Найти("ДокументВид") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОтборСтруктура = Новый Структура("Организация, СтраховаяКомпания, Застрахованный",ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания, Форма.ФизическоеЛицоСсылка);
		ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
		Если ТаблицаОтправленныеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтправленныеДанные = ТаблицаОтправленныеДанные[0];
		
		Если Форма.ДокументыФизическихЛиц.ВидДокумента <> ОтправленныеДанные.ДокументВид Тогда
			Продолжить;
		КонецЕсли;
		
		ИзменилисьОтправленныеДанные = Ложь;
		ИзмениласьСерия = Ложь;
		Если Форма.ДокументыФизическихЛиц.Серия <> Форма.ДокументыФизическихЛицПрежняя.Серия И Форма.ДокументыФизическихЛиц.Серия <> ОтправленныеДанные.ДокументСерия Тогда
			ИзмениласьСерия = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяНомер = Ложь;
		Если Форма.ДокументыФизическихЛиц.Номер <> Форма.ДокументыФизическихЛицПрежняя.Номер И Форма.ДокументыФизическихЛиц.Номер <> ОтправленныеДанные.ДокументНомер Тогда
			ИзменилсяНомер = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзмениласьДатаВыдачи = Ложь;
		Если Форма.ДокументыФизическихЛиц.ДатаВыдачи <> Форма.ДокументыФизическихЛицПрежняя.ДатаВыдачи И Форма.ДокументыФизическихЛиц.ДатаВыдачи <> ОтправленныеДанные.ДокументДатаВыдачи Тогда
			ИзмениласьДатаВыдачи = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяСрокДействия = Ложь;
		Если Форма.ДокументыФизическихЛиц.СрокДействия <> Форма.ДокументыФизическихЛицПрежняя.СрокДействия И Форма.ДокументыФизическихЛиц.СрокДействия <> ОтправленныеДанные.ДокументСрокДействия Тогда
			ИзменилсяСрокДействия = Ложь;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяКемВыдан = Ложь;
		Если Форма.ДокументыФизическихЛиц.КемВыдан <> Форма.ДокументыФизическихЛицПрежняя.КемВыдан И Форма.ДокументыФизическихЛиц.КемВыдан <> ОтправленныеДанные.ДокументКемВыдан Тогда
			ИзменилсяКемВыдан = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяКодПодразделения = Ложь;
		Если Форма.ДокументыФизическихЛиц.КодПодразделения <> Форма.ДокументыФизическихЛицПрежняя.КодПодразделения И Форма.ДокументыФизическихЛиц.КодПодразделения <> ОтправленныеДанные.ДокументКодПодразделения Тогда
			ИзменилсяКодПодразделения = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		Если Не ИзменилисьОтправленныеДанные Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Форма.ФизическоеЛицоСсылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Организация = ТекущееСтрахование.Организация;
			Запись.СтраховаяКомпания = ТекущееСтрахование.СтраховаяКомпания;
			Запись.Застрахованный = Форма.ФизическоеЛицоСсылка;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Если ИзмениласьСерия  Тогда
			Запись.ДокументСерия = Форма.ДокументыФизическихЛиц.Серия;
		КонецЕсли;
		Если ИзменилсяНомер  Тогда
			Запись.ДокументНомер = Форма.ДокументыФизическихЛиц.Номер;
		КонецЕсли;
		Если ИзмениласьДатаВыдачи  Тогда
			Запись.ДокументДатаВыдачи = Форма.ДокументыФизическихЛиц.ДатаВыдачи;
		КонецЕсли;
		Если ИзменилсяСрокДействия  Тогда
			Запись.ДокументСрокДействия = Форма.Форма.ДокументыФизическихЛиц.СрокДействия;
		КонецЕсли;
		Если ИзменилсяКемВыдан  Тогда
			Запись.ДокументКемВыдан = Форма.ДокументыФизическихЛиц.КемВыдан;
		КонецЕсли;
		Если ИзменилсяКодПодразделения  Тогда
			Запись.ДокументКодПодразделения = Форма.ДокументыФизическихЛиц.КодПодразделения;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправляемыеДанныеВСтраховуюКомпанию(Организация, СтраховаяКомпания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправляемыеДанныеЗастрахованных.Сведение КАК Сведение,
		|	ОтправляемыеДанныеЗастрахованных.СпособПроверкиЗаполнения КАК СпособПроверкиЗаполнения
		|ИЗ
		|	РегистрСведений.ОтправляемыеДанныеЗастрахованных КАК ОтправляемыеДанныеЗастрахованных
		|ГДЕ
		|	ОтправляемыеДанныеЗастрахованных.Организация = &Организация
		|	И ОтправляемыеДанныеЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ОтправляемыеДанныеЗастрахованных.Отправлять = ИСТИНА";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	ОтправляемыеДанные = Новый ТаблицаЗначений;
	ОтправляемыеДанные.Колонки.Добавить("Сведение", Новый ОписаниеТипов("Строка"));
	ОтправляемыеДанные.Колонки.Добавить("СпособПроверкиЗаполнения", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сведение = Перечисления.ДанныеЗастрахованных.ДокументУдостоверяющийЛичность Тогда
			СведенияДокументаУдостоверяющегоЛичность = СоставСведенийДокументаУдостоверяющегоЛичность();
			Для Каждого  Сведение Из СведенияДокументаУдостоверяющегоЛичность Цикл
				НоваяСтрока = ОтправляемыеДанные.Добавить();
				НоваяСтрока.Сведение = Сведение;
				НоваяСтрока.СпособПроверкиЗаполнения = Выборка.СпособПроверкиЗаполнения;
			КонецЦикла;
		Иначе
			ИндексЗначения = Перечисления.ДанныеЗастрахованных.Индекс(Выборка.Сведение);
			НоваяСтрока = ОтправляемыеДанные.Добавить();
			НоваяСтрока.Сведение = Метаданные.Перечисления.ДанныеЗастрахованных.ЗначенияПеречисления[ИндексЗначения].Имя;
			НоваяСтрока.СпособПроверкиЗаполнения = Выборка.СпособПроверкиЗаполнения;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтправляемыеДанные;
	
КонецФункции

Функция ТекущиеСтрахованияФизическогоЛица(ФизическоеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Организация КАК Организация,
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ПрограммаСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних(, ФизическоеЛицо = &ФизическоеЛицо
		|	И Действует = ИСТИНА) КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииОбъектовСКомандамиУчетаОригиналов.
Процедура ПриОпределенииОбъектовСКомандамиУчетаОригиналов(СписокОбъектов) Экспорт
	
	// Формы списков журналов документов
	СписокОбъектов.Добавить("ЖурналДокументов.МедицинскоеСтрахование.Форма.ФормаСписка");
	
	// Формы списков документов
	СписокОбъектов.Добавить("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Форма.ФормаСписка");
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииМногосотрудниковыхДокументов.
Процедура ПриОпределенииМногосотрудниковыхДокументов(СписокОбъектов) Экспорт
	
	СписокОбъектов.Вставить(Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПолноеИмя(), "Сотрудники");
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ЗаполнитьТаблицуУчетаОригиналов.
Процедура ЗаполнитьТаблицуУчетаОригиналов(ТаблицаУчетаОригиналов) Экспорт
	
	// Прикрепление к программам страхования
	НоваяСтрока = ТаблицаУчетаОригиналов.Добавить();
	НоваяСтрока.ОбъектМетаданных = Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования;
	НоваяСтрока.Идентификатор = "ЗаявлениеНаУдержание";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОтправкиПисьма

Функция ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы)
	
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НастройкаПечатнойФормы.СсылкаДокумента);
	
	ПараметрыПечати = НастройкаПечатнойФормы.ДополнительныеПараметры;
	ДанныеПечати = УправлениеПечатью.СформироватьПечатныеФормы(
		НастройкаПечатнойФормы.СсылкаДокумента.Метаданные().ПолноеИмя(),
		НастройкаПечатнойФормы.ИмяМакета, МассивОбъектов, ПараметрыПечати);
	КоллекцияПечатныхФорм = ДанныеПечати.КоллекцияПечатныхФорм;
	ОбъектыПечати = ДанныеПечати.ОбъектыПечати;
	ПараметрыВывода = ДанныеПечати.ПараметрыВывода;
	
	ПечатнаяФорма = Новый ТабличныйДокумент;
	Если НастройкаПечатнойФормы.ПолноеИмяОбъекта = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
		ПараметрыИсточника = Новый Структура;
		ПараметрыИсточника.Вставить("ИдентификаторКоманды", НастройкаПечатнойФормы.ИмяМакета);
		ПараметрыИсточника.Вставить("ОбъектыНазначения", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НастройкаПечатнойФормы.СсылкаДокумента));
		УправлениеПечатью.ПечатьПоВнешнемуИсточнику(
			НастройкаПечатнойФормы.ДополнительныеПараметры.Ссылка, ПараметрыИсточника, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	Иначе
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(НастройкаПечатнойФормы.ПолноеИмяОбъекта);
		МенеджерОбъекта.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	Для Каждого ЭлементКоллекции Из КоллекцияПечатныхФорм Цикл
		НастройкаПечатнойФормы.ТабличныйДокумент = ЭлементКоллекции.ТабличныйДокумент;
		ПечатнаяФорма = ЭлементКоллекции.ТабличныйДокумент;
	КонецЦикла;
	
	Возврат ПечатнаяФорма;
	
КонецФункции

Функция ПоместитьТабличныеДокументыВоВременноеХранилище(Форма, ПереданныеНастройки, НастройкиПечатныхФорм)
	Перем ЗаписьZipФайла, ИмяАрхива;
	
	НастройкиСохранения = НастройкиСохранения();
	ЗаполнитьЗначенияСвойств(НастройкиСохранения, ПереданныеНастройки);
	
	Результат = Новый Массив;
	
	// подготовка архива
	Если НастройкиСохранения.УпаковатьВАрхив Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	ИспользованныеИменаФайлов = Новый Соответствие;
	
	ВыбранныеФорматыСохранения = НастройкиСохранения.ФорматыСохранения;
	ПереводитьИменаФайловВТранслит = НастройкиСохранения.ПереводитьИменаФайловВТранслит;
	ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	
	// сохранение печатных форм
	ОбработанныеПечатныеФормы = Новый Массив;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаПечатнойФормы.ТабличныйДокумент = Неопределено Тогда
			ПечатнаяФорма = ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы);
		Иначе
			ПечатнаяФорма = НастройкаПечатнойФормы.ТабличныйДокумент;
		КонецЕсли;
		Если ОбработанныеПечатныеФормы.Найти(ПечатнаяФорма) = Неопределено Тогда
			ОбработанныеПечатныеФормы.Добавить(ПечатнаяФорма);
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПечатнаяФорма.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПечатнаяФорма.ВысотаТаблицы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПечатныеФормыПоОбъектам = Новый Соответствие;
		ПечатныеФормыПоОбъектам.Вставить(Форма.Объект.Ссылка, ПечатнаяФорма);
		Для Каждого СоответствиеОбъектаПечатнойФорме Из ПечатныеФормыПоОбъектам Цикл
			ОбъектПечати = СоответствиеОбъектаПечатнойФорме.Ключ;
			ПечатнаяФорма = СоответствиеОбъектаПечатнойФорме.Значение;
			
			Для Каждого ВыбранныйФормат Из ВыбранныеФорматыСохранения Цикл
				ТипФайла = ТипФайлаТабличногоДокумента[ВыбранныйФормат];
				НастройкиФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("ТипФайлаТабличногоДокумента", ТипФайла))[0];
				ЗаданныеИменаПечатныхФорм = ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаПечатнойФормы.ИмяФайлаПечатнойФормы);
				
				ИмяФайла = УправлениеПечатью.ИмяФайлаПечатнойФормыОбъекта(ОбъектПечати, ЗаданныеИменаПечатныхФорм, НастройкаПечатнойФормы.Название);
				ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
				
				Если ПереводитьИменаФайловВТранслит Тогда
					ИмяФайла = СтроковыеФункции.СтрокаЛатиницей(ИмяФайла);
				КонецЕсли;
				
				ИмяФайла = ИмяФайла + "." + НастройкиФормата.Расширение;
				
				ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайла);
				ПечатнаяФорма.Записать(ПолноеИмяФайла, ТипФайла);
				
				Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
					УправлениеПечатью.ВставитьКартинкиВHTML(ПолноеИмяФайла);
				КонецЕсли;
				
				Если ЗаписьZipФайла <> Неопределено Тогда 
					ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
				Иначе
					ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
					ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Форма.УникальныйИдентификатор);
					ОписаниеФайла = Новый Структура;
					ОписаниеФайла.Вставить("Представление", ИмяФайла);
					ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
					Если ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT Тогда
						ОписаниеФайла.Вставить("Кодировка", "windows-1251");
					КонецЕсли;
					Результат.Добавить(ОписаниеФайла);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Если архив подготовлен, записываем и помещаем его во временное хранилище.
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Записать();
		ФайлАрхива = Новый Файл(ИмяАрхива);
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Форма.УникальныйИдентификатор);
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ПолучитьИмяФайлаДляАрхива(Форма, НастройкиПечатныхФорм, ПереводитьИменаФайловВТранслит));
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		Результат.Добавить(ОписаниеФайла);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременнойПапки);
	Если ЗначениеЗаполнено(ИмяАрхива) Тогда
		УдалитьФайлы(ИмяАрхива);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиСохранения()
	
	НастройкиСохранения = Новый Структура;
	НастройкиСохранения.Вставить("ФорматыСохранения", Новый Массив);
	НастройкиСохранения.Вставить("УпаковатьВАрхив", Ложь);
	НастройкиСохранения.Вставить("ПереводитьИменаФайловВТранслит", Ложь);
	
	Возврат НастройкиСохранения;
	
КонецФункции

Функция ВычислитьИспользованиеВывода(ТабличныйДокумент)
	Если ТабличныйДокумент.Вывод = ИспользованиеВывода.Авто Тогда
		Возврат ?(ПравоДоступа("Вывод", Метаданные), ИспользованиеВывода.Разрешить, ИспользованиеВывода.Запретить);
	Иначе
		Возврат ТабличныйДокумент.Вывод;
	КонецЕсли;
КонецФункции

Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;

КонецФункции

Функция ПолучитьИмяФайлаДляАрхива(Форма, НастройкиПечатныхФорм, ПереводитьИменаФайловВТранслит)
	
	Результат = "";
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаПечатнойФормы.ТабличныйДокумент = Неопределено Тогда
			ПечатнаяФорма = ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы);
		Иначе
			ПечатнаяФорма = НастройкаПечатнойФормы.ТабличныйДокумент;
		КонецЕсли;
		
		Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(Результат) Тогда
			Результат = НастройкаПечатнойФормы.Название;
		Иначе
			Результат = НСтр("ru = 'Документы'");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПереводитьИменаФайловВТранслит Тогда
		Результат = СтроковыеФункции.СтрокаЛатиницей(Результат);
	КонецЕсли;
	
	Возврат Результат + ".zip";
	
КонецФункции

#КонецОбласти

Функция ДатыСтрахованияОбновляемыеДокументы(ПараметрыОбновления)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрограммыСтрахованияСотрудников.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТОбновляемыеДокументы
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ПрограммыСтрахованияСотрудников
	|ГДЕ
	|	ПрограммыСтрахованияСотрудников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И ПрограммыСтрахованияСотрудников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрограммыСтрахованияСотрудников.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасширенияПрограммСтрахованияСотрудников.Ссылка
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК РасширенияПрограммСтрахованияСотрудников
	|ГДЕ
	|	РасширенияПрограммСтрахованияСотрудников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И РасширенияПрограммСтрахованияСотрудников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенияПрограммСтрахованияСотрудников.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрограммыСтрахованияРодственников.Ссылка
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрограммыСтрахованияРодственников
	|ГДЕ
	|	ПрограммыСтрахованияРодственников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И ПрограммыСтрахованияРодственников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрограммыСтрахованияРодственников.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасширенияПрограммСтрахованияРодственников.Ссылка
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК РасширенияПрограммСтрахованияРодственников
	|ГДЕ
	|	РасширенияПрограммСтрахованияРодственников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И РасширенияПрограммСтрахованияРодственников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенияПрограммСтрахованияРодственников.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Документы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТОбновляемыеДокументы КАК Документы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.Ссылка.Дата УБЫВ";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 100", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ВыполнитьЗаполнениеДатСтрахования(ПараметрыОбновления, ОбновляемыеДокументы)
	
	Выборка = ОбновляемыеДокументы.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого СтрокаДокумента Из ДокументОбъект.Сотрудники Цикл
			ОтборСтрок = Новый Структура("Сотрудник", СтрокаДокумента.Сотрудник);
			НайденныеСтроки = ДокументОбъект.ПрограммыСтрахованияСотрудников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = ДокументОбъект.ДатаОкончанияСтрахования;
			КонецЦикла;
			НайденныеСтроки = ДокументОбъект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = ДокументОбъект.ДатаОкончанияСтрахования;
			КонецЦикла;
		КонецЦикла;
		Для каждого СтрокаДокумента Из ДокументОбъект.Родственники Цикл
			ОтборСтрок = Новый Структура("ФизическоеЛицо, Родственник", СтрокаДокумента.ФизическоеЛицо, СтрокаДокумента.Родственник);
			НайденныеСтроки = ДокументОбъект.ПрограммыСтрахованияРодственников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = СтрокаДокумента.ДатаОткрепления;
			КонецЦикла;
			НайденныеСтроки = ДокументОбъект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = СтрокаДокумента.ДатаОткрепления;
			КонецЦикла;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;

КонецПроцедуры

Функция РодственникМедицинскогоСтрахования(ФИОРодственника)
	
	РодственникСсылка = Справочники.РодственникиФизическихЛиц.НайтиПоНаименованию(ФИОРодственника);
	Если ЗначениеЗаполнено(РодственникСсылка) Тогда
		Возврат РодственникСсылка;
	КонецЕсли;
	
	РодственникОбъект = Справочники.РодственникиФизическихЛиц.СоздатьЭлемент();
	РодственникОбъект.Наименование = ФИОРодственника;
	ФИО = СокрЛП(ФИОРодственника);
	Пока СтрНайти(ФИО, "  ") > 0 Цикл
		ФИО = СтрЗаменить(ФИО, "  ", " ");
	КонецЦикла;
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	РодственникОбъект.Фамилия  = СтруктураФИО.Фамилия;
	РодственникОбъект.Имя = СтруктураФИО.Имя;
	РодственникОбъект.Отчество = СтруктураФИО.Отчество;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РодственникОбъект);
	
	Возврат РодственникОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьДанныеЗастрахованного(Застрахованный, ДокументПрикрепление, СтрокаСведение)
	
	НайденныеДанные = ДокументПрикрепление.ДанныеЗастрахованных.НайтиСтроки(Новый Структура("Застрахованный", Застрахованный));
	Если НайденныеДанные.Количество() = 0 Тогда
		СтрокаДанные = ДокументПрикрепление.ДанныеЗастрахованных.Добавить();
		СтрокаДанные.Застрахованный = Застрахованный;
	Иначе
		СтрокаДанные = НайденныеДанные[0];
	КонецЕсли;
	Если СтрокаСведение.СведениеИмя = "ДатаРождения" Тогда
		СтрокаДанные.ДатаРождения = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДатаРожденияДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "СтраховойНомерПФР" Тогда
		СтрокаДанные.СтраховойНомерПФР = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.СтраховойНомерПФРДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "Пол" Тогда
		СтрокаДанные.Пол = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ПолДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "Страна" Тогда
		СтрокаДанные.Страна = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.СтранаДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументПредставление" Тогда
		СтрокаДанные.ДокументПредставление = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументПредставлениеДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументВид" Тогда
		СтрокаДанные.ДокументВид = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументВидДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументСерия" Тогда
		СтрокаДанные.ДокументСерия = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументСерияДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументНомер" Тогда
		СтрокаДанные.ДокументНомер = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументНомерДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументДатаВыдачи" Тогда
		СтрокаДанные.ДокументДатаВыдачи = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументДатаВыдачиДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументСрокДействия" Тогда
		СтрокаДанные.ДокументСрокДействия = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументСрокДействияДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументКемВыдан" Тогда
		СтрокаДанные.ДокументКемВыдан = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументКемВыданДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументКодПодразделения" Тогда
		СтрокаДанные.ДокументКодПодразделения = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументКодПодразделенияДоИзменения = СтрокаСведение.СведениеЗначение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтактнуюИнформациюЗастрахованного(Застрахованный, ДокументПрикрепление, СтрокаСведение)
	
	ВидКИ = ВидКонтактнойИнформацииПоСведению()[СтрокаСведение.СведениеИмя];
	ОтборСтрок = Новый Структура("Застрахованный, Вид", Застрахованный, ВидКИ);
	НайденнаяКИ = ДокументПрикрепление.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
	Если НайденнаяКИ.Количество() = 0 Тогда
		СтрокаКИ = ДокументПрикрепление.КонтактнаяИнформацияЗастрахованных.Добавить();
		СтрокаКИ.Застрахованный = Застрахованный;
		СтрокаКИ.Вид = ВидКИ;
	Иначе
		СтрокаКИ = НайденнаяКИ[0];
	КонецЕсли;
	Если СтрокаСведение.СведениеИмя = "КонтактнаяИнформация1"
		Или СтрокаСведение.СведениеИмя = "КонтактнаяИнформация2"
		Или СтрокаСведение.СведениеИмя = "КонтактнаяИнформация3"
		Или СтрокаСведение.СведениеИмя = "КонтактнаяИнформация4" Тогда
		СтрокаКИ.Значение = СтрокаСведение.СведениеЗначение;
	Иначе
		СтрокаКИ.Представление = СтрокаСведение.СведениеЗначение;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеЗастрахованных()
	
	ДанныеЗастрахованных = Новый Структура;
	ДанныеЗастрахованных.Вставить("ДатаРождения", Истина);
	ДанныеЗастрахованных.Вставить("СтраховойНомерПФР", Истина);
	ДанныеЗастрахованных.Вставить("Пол", Истина);
	ДанныеЗастрахованных.Вставить("Страна", Истина);
	ДанныеЗастрахованных.Вставить("ДокументПредставление", Истина);
	ДанныеЗастрахованных.Вставить("ДокументВид", Истина);
	ДанныеЗастрахованных.Вставить("ДокументСерия",Истина);
	ДанныеЗастрахованных.Вставить("ДокументНомер", Истина);
	ДанныеЗастрахованных.Вставить("ДокументДатаВыдачи", Истина);
	ДанныеЗастрахованных.Вставить("ДокументСрокДействия", Истина);
	ДанныеЗастрахованных.Вставить("ДокументКемВыдан", Истина);
	ДанныеЗастрахованных.Вставить("ДокументКодПодразделения", Истина);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация1", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация2", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация3", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация4", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация1Представление", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация2Представление", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация3Представление", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация4Представление", Ложь);
	
	Возврат ДанныеЗастрахованных;
	
КонецФункции

Функция ВидКонтактнойИнформацииПоСведению()
	
	СтруктураВидимостьНаФорме = Новый Структура;
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация1", Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация2", Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация3", Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация4", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация1Представление", Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация2Представление", Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация3Представление", Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация4Представление", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	
	Возврат СтруктураВидимостьНаФорме;
	
КонецФункции

#Область ПоказателиРасчетаЗарплаты

Процедура ЗаполнитьИсточникДанныхПоказателейИсключений(ПоказательРасчетаЗарплаты) Экспорт
	
	Если ПоказательРасчетаЗарплаты.ИмяПредопределенныхДанных = "СтраховаяПремия"
		Или ПоказательРасчетаЗарплаты.ИмяПредопределенныхДанных = "КоличествоДнейПериодаСтрахования" Тогда
		ПоказательРасчетаЗарплаты.ПериодическийПоказательСотрудника = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТаблицуУдержанийИзвестнымиПоказателями(ДатаУвольнения, МенеджерРасчета) Экспорт
	
	ЗначениеКалендарныеДни = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(НачалоМесяца(ДатаУвольнения), ДатаУвольнения);
	ПоказательКалендарныеДни = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КалендарныеДни");
	Для Каждого СтрокаУдержаний Из МенеджерРасчета.Зарплата.Удержания Цикл
		МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(СтрокаУдержаний, ПоказательКалендарныеДни, ЗначениеКалендарныеДни);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ФизическиеЛицаСУдержаниемПоГрафику(Организация, ФизическиеЛица)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УдержанияМедицинскогоСтрахования.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.УдержанияМедицинскогоСтрахования КАК УдержанияМедицинскогоСтрахования
		|ГДЕ
		|	УдержанияМедицинскогоСтрахования.Организация = &Организация
		|	И УдержанияМедицинскогоСтрахования.ФизическоеЛицо В (&ФизическиеЛица)
		|	И
		|		УдержанияМедицинскогоСтрахования.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику)";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	
КонецФункции

Функция ГрафикУдержаний(Организация, ФизическиеЛица, МесяцНачисления)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(УдержанияМедицинскогоСтрахованияСрезПоследних.ДокументОснование) КАК ДокументОснование
		|ПОМЕСТИТЬ ВТУдержанияПоГрафику
		|ИЗ
		|	РегистрСведений.УдержанияМедицинскогоСтрахования.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И ФизическоеЛицо В (&ФизическиеЛица)) КАК УдержанияМедицинскогоСтрахованияСрезПоследних
		|ГДЕ
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику)
		|
		|СГРУППИРОВАТЬ ПО
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТУдержанияПоГрафику.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТУдержанияПоГрафику.ДокументОснование КАК ДокументОснование,
		|	ГрафикУдержанийМедицинскогоСтрахования.Удержание КАК Удержание,
		|	ГрафикУдержанийМедицинскогоСтрахования.Сумма КАК Сумма
		|ИЗ
		|	ВТУдержанияПоГрафику КАК ВТУдержанияПоГрафику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикУдержанийМедицинскогоСтрахования КАК ГрафикУдержанийМедицинскогоСтрахования
		|		ПО ВТУдержанияПоГрафику.ФизическоеЛицо = ГрафикУдержанийМедицинскогоСтрахования.ФизическоеЛицо
		|			И ВТУдержанияПоГрафику.ДокументОснование = ГрафикУдержанийМедицинскогоСтрахования.ДокументОснование
		|ГДЕ
		|	ГрафикУдержанийМедицинскогоСтрахования.Дата = &МесяцНачисления";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗарегистрироватьИзменениеФизическогоЛицаПриЗаписи(Объект) Экспорт
	
	ТекущиеСтрахования = ТекущиеСтрахованияФизическогоЛица(Объект.Ссылка);
	Если ТекущиеСтрахования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтборСтруктура = Новый Структура("Организация, СтраховаяКомпания, Застрахованный",
			ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания, Объект.Ссылка);
			
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(
			ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания);
		Если ОтправляемыеДанныеТаблица.Количество() > 0 Тогда
			ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
			Если ТаблицаОтправленныеДанные.Количество() > 0 Тогда
				ОбработатьИзменениеОтправленныхДанныхФизическогоЛица(
					Объект,
					ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение"),
					ТаблицаОтправленныеДанные[0],
					ТекущееСтрахование);
			КонецЕсли;
		КонецЕсли;
		
		ОтправленнаяКонтактнаяИнформация = РегистрыСведений.ОтправленнаяКонтактнаяИнформацияЗастрахованных.СрезПоследних(, ОтборСтруктура);
		Если ОтправленнаяКонтактнаяИнформация.Количество() > 0 Тогда
			ОбработатьИзменениеКонтактнойИнформацииФизическогоЛица(
				Объект,
				ОтправленнаяКонтактнаяИнформация,
				ТекущееСтрахование);
		КонецЕсли; 
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны() Тогда
			ОтправленныеДополнительныеРеквизитыИСведения = РегистрыСведений.ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных.СрезПоследних(, ОтборСтруктура);
			Если ОтправленныеДополнительныеРеквизитыИСведения.Количество() > 0 Тогда
				ОбработатьИзменениеДополнительныхРеквизитовИСведенийФизическогоЛица(
					Объект,
					ОтправленныеДополнительныеРеквизитыИСведения,
					ТекущееСтрахование);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеРодственникаПриЗаписи(Объект) Экспорт

	ТекущиеСтрахования = ТекущиеСтрахованияРодственника(Объект.Ссылка);
	Если ТекущиеСтрахования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтборСтруктура = Новый Структура("Организация, СтраховаяКомпания, Застрахованный",
			ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания, Объект.Ссылка);
			
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(
			ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания);
		Если ОтправляемыеДанныеТаблица.Количество() > 0 Тогда
			ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
			Если ТаблицаОтправленныеДанные.Количество() > 0 Тогда
				ОбработатьИзменениеОтправленныхДанныхРодственника(
					Объект,
					ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение"),
					ТаблицаОтправленныеДанные[0],
					ТекущееСтрахование);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапомнитьПрежнееЗначениеГражданстваФизическогоЛицаПередЗаписью(Источник, ФизическоеЛицо) Экспорт
	
	ТекущиеСтрахования = ТекущиеСтрахованияФизическогоЛица(ФизическоеЛицо);
	Если ТекущиеСтрахования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеСтрахованияМассив = Новый Массив;
	ЗапоминатьГражданство = Ложь;
	
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(
			ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания);
		ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
		Если ОтправляемыеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ОтправляемыеДанные.Найти("Страна") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗапоминатьГражданство = Истина;
		ТекущиеСтрахованияМассив.Добавить(Новый Структура("Организация, СтраховаяКомпания", ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания));
	КонецЦикла;
	
	Если ЗапоминатьГражданство Тогда
		Таблица = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическоеЛицо, "Страна");
		СоответствиеПрежнееЗначениеГражданства = Новый Соответствие;
		СоответствиеПрежнееЗначениеГражданства.Вставить(ФизическоеЛицо, Таблица);
		Источник.ДополнительныеСвойства.Вставить("СоответствиеПрежнееЗначениеГражданстваМедицинскогоСтрахования", СоответствиеПрежнееЗначениеГражданства);
		Источник.ДополнительныеСвойства.Вставить("ТекущиеСтрахованияМассив", ТекущиеСтрахованияМассив);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИзменениеГражданстваМедицинскогоСтрахованияПриЗаписи(Источник) Экспорт
	
	СоответствиеПрежнееЗначениеГражданства = Источник.ДополнительныеСвойства["СоответствиеПрежнееЗначениеГражданстваМедицинскогоСтрахования"];
	ТаблицаПрежнееЗначения = СоответствиеПрежнееЗначениеГражданства.Получить(Источник[0].ФизическоеЛицо);
	ТекущиеСтрахованияМассив = Источник.ДополнительныеСвойства["ТекущиеСтрахованияМассив"];
	
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахованияМассив Цикл
		ОтборСтруктура = Новый Структура("Организация, СтраховаяКомпания, Застрахованный",ТекущееСтрахование.Организация, ТекущееСтрахование.СтраховаяКомпания, Источник[0].ФизическоеЛицо);
		ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
		Если ТаблицаОтправленныеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтправленныеДанные = ТаблицаОтправленныеДанные[0];
		
		ИзменилосьГражданство = Ложь;
		Если ТаблицаПрежнееЗначения.Количество() > 0 Тогда
			Если ТаблицаПрежнееЗначения[0].Страна <> Источник[0].Страна И Источник[0].Страна <> ОтправленныеДанные.Страна Тогда
				ИзменилосьГражданство = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ИзменилосьГражданство = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Источник[0].ФизическоеЛицо);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Организация = ТекущееСтрахование.Организация;
			Запись.СтраховаяКомпания = ТекущееСтрахование.СтраховаяКомпания;
			Запись.Застрахованный = Источник[0].ФизическоеЛицо;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		Запись.Страна = Источник[0].Страна;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзменениеОтправленныхДанныхФизическогоЛица(Объект, ОтправляемыеДанные, ОтправленныеДанные, ТекущееСтрахование)
	
	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзменилисьОтправленныеДанные = Ложь;
	
	ИзмениласьФамилия = Ложь;
	Если Объект.Фамилия <> ПрежниеЗначения.Фамилия Тогда
		ИзмениласьФамилия = Истина;
		Если Объект.Фамилия <> ОтправленныеДанные.Фамилия Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьИмя = Ложь;
	Если Объект.Имя <> ПрежниеЗначения.Имя Тогда
		ИзменилосьИмя = Истина;
		Если Объект.Имя <> ОтправленныеДанные.Имя Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьОтчество = Ложь;
	Если Объект.Отчество <> ПрежниеЗначения.Отчество Тогда
		ИзменилосьОтчество = Истина;
		Если Объект.Отчество <> ОтправленныеДанные.Отчество Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзмениласьДатаРождения = Ложь;
	Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
		Если Объект.ДатаРождения <> ПрежниеЗначения.ДатаРождения Тогда
			ИзменилисьОтправленныеДанные = Истина;
			Если Объект.ДатаРождения <> ОтправленныеДанные.ДатаРождения Тогда
				ИзмениласьДатаРождения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилсяСНИЛС = Ложь;
	Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
		Если Объект.СтраховойНомерПФР <> ПрежниеЗначения.СтраховойНомерПФР Тогда
			ИзменилисьОтправленныеДанные = Истина;
		 	Если Объект.СтраховойНомерПФР <> ОтправленныеДанные.СтраховойНомерПФР Тогда
				ИзменилсяСНИЛС = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилсяПол = Ложь;
	Если ОтправляемыеДанные.Найти("Пол") <> Неопределено Тогда
		Если Объект.Пол <> ПрежниеЗначения.Пол Тогда
			ИзменилисьОтправленныеДанные = Истина;
			Если Объект.Пол <> ОтправленныеДанные.Пол Тогда
				ИзменилсяПол = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИзменилисьОтправленныеДанные Тогда
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Организация = ТекущееСтрахование.Организация;
			Запись.СтраховаяКомпания = ТекущееСтрахование.СтраховаяКомпания;
			Запись.Застрахованный = Объект.Ссылка;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.ИзмениласьФамилия = ИзмениласьФамилия;
		Запись.Фамилия = ?(ИзмениласьФамилия = Истина, Объект.Фамилия, Неопределено);
		
		Запись.ИзменилосьИмя = ИзменилосьИмя;
		Запись.Имя = ?(ИзменилосьИмя = Истина, Объект.Имя, Неопределено);
		
		Запись.ИзменилосьОтчество = ИзменилосьОтчество;
		Запись.Отчество = ?(ИзменилосьОтчество = Истина, Объект.Отчество, Неопределено);
		
		Запись.ИзмениласьДатаРождения = ИзмениласьДатаРождения;
		Запись.ДатаРождения = ?(ИзмениласьДатаРождения = Истина, Объект.ДатаРождения, Неопределено);
		
		Запись.ИзменилсяСтраховойНомерПФР = ИзменилсяСНИЛС;
		Запись.СтраховойНомерПФР = ?(ИзменилсяСНИЛС = Истина, Объект.СтраховойНомерПФР, Неопределено);
		
		Запись.ИзменилсяПол = ИзменилсяПол;
		Запись.Пол = ?(ИзменилсяПол = Истина, Объект.Пол, Неопределено);

		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьИзменениеКонтактнойИнформацииФизическогоЛица(Объект, ТаблицаОтправленнаяКонтактнаяИнформация, ТекущееСтрахование)
	
	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзмененнаяКИ = Новый Массив;
	ВосстановленнаяКИ = Новый Массив;
	
	Для Каждого ОтправленнаяКонтактнаяИнформация Из ТаблицаОтправленнаяКонтактнаяИнформация Цикл
		Если ПрежниеЗначения.Свойство("ТаблицаКИ") Тогда
			ПрежниеЗначенияКонтактнойИнформации = ПрежниеЗначения.ТаблицаКИ;
			БылоПрежнееЗначениеКИ = Ложь;
			Для Каждого ПрежнееЗначениеСтруктура Из ПрежниеЗначенияКонтактнойИнформации Цикл
				Если ПрежнееЗначениеСтруктура.Вид = ОтправленнаяКонтактнаяИнформация.Вид Тогда
					БылоПрежнееЗначениеКИ = Истина;
					НовоеПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
						Объект, ОтправленнаяКонтактнаяИнформация.Вид);
					Если Не ЗначениеЗаполнено(НовоеПредставление) Тогда
						НовоеПредставление = "";
					КонецЕсли;
					Если ПрежнееЗначениеСтруктура.Представление <> НовоеПредставление Тогда
						Если НовоеПредставление = ОтправленнаяКонтактнаяИнформация.Представление Тогда
							ВосстановленнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
						Иначе
							ИзмененнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если Не БылоПрежнееЗначениеКИ Тогда
				ДобавитьИзменениеКонтактнойИнформацииВМассив(Объект, ОтправленнаяКонтактнаяИнформация, ИзмененнаяКИ, ВосстановленнаяКИ);
			КонецЕсли;
		Иначе
			ДобавитьИзменениеКонтактнойИнформацииВМассив(Объект, ОтправленнаяКонтактнаяИнформация, ИзмененнаяКИ, ВосстановленнаяКИ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КИ Из ИзмененнаяКИ Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Вид.Установить(КИ.Вид);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация = ТекущееСтрахование.Организация;
		НоваяЗапись.СтраховаяКомпания = ТекущееСтрахование.СтраховаяКомпания;
		НоваяЗапись.Застрахованный = Объект.Ссылка;
		НоваяЗапись.Вид = КИ.Вид;
		НоваяЗапись.Представление = КИ.Представление;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
	Для Каждого КИ Из ВосстановленнаяКИ Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Вид.Установить(КИ.Вид);
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзменениеДополнительныхРеквизитовИСведенийФизическогоЛица(Объект, ТаблицаОтправленныеДополнительныеРеквизитыИСведения, ТекущееСтрахование)

	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзмененныеСвойства = Новый Массив;
	ВосстановленныеСвойства = Новый Массив;
	
	Если ТаблицаОтправленныеДополнительныеРеквизитыИСведения.Количество() > 0 Тогда
		Для Каждого ОтправленноеСвойство Из ТаблицаОтправленныеДополнительныеРеквизитыИСведения Цикл
			Если ПрежниеЗначения.Свойство("ДополнительныеРеквизитыИСведения") Тогда
				ПрежниеЗначенияСвойств = ПрежниеЗначения.ДополнительныеРеквизитыИСведения;
				Для Каждого ПрежнееЗначениеСтруктура Из ПрежниеЗначенияСвойств Цикл
					Если ПрежнееЗначениеСтруктура.Свойство = ОтправленноеСвойство.Свойство Тогда
						НовоеЗначение = Объект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ОтправленноеСвойство.Свойство));
						Если НовоеЗначение.Количество() > 0 Тогда
							НовоеЗначениеСвойства = НовоеЗначение[0].Значение;
						Иначе
							НовоеЗначениеСвойства = Неопределено;
						КонецЕсли;
						Если ПрежнееЗначениеСтруктура.Значение <> НовоеЗначениеСвойства Тогда
							Если НовоеЗначениеСвойства = ОтправленноеСвойство.Значение Тогда
								ВосстановленныеСвойства.Добавить(Новый Структура("Свойство, Значение", ОтправленноеСвойство.Свойство, НовоеЗначениеСвойства));
							Иначе
								ИзмененныеСвойства.Добавить(Новый Структура("Свойство, Значение", ОтправленноеСвойство.Свойство, НовоеЗначениеСвойства));
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				НовоеЗначение = Объект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ОтправленноеСвойство.Свойство));
				Если НовоеЗначение.Количество() > 0 Тогда
					НовоеЗначениеСвойства = НовоеЗначение[0].Значение;
				Иначе
					НовоеЗначениеСвойства = Неопределено;
				КонецЕсли;
				Если НовоеЗначениеСвойства <> Неопределено И НовоеЗначениеСвойства <> ОтправленноеСвойство.Значение Тогда
					ИзмененныеСвойства.Добавить(Новый Структура("Свойство, Значение", ОтправленноеСвойство.Свойство, НовоеЗначениеСвойства));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИзмененноеСвойство Из ИзмененныеСвойства Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Свойство.Установить(ИзмененноеСвойство.Свойство);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация = ТекущееСтрахование.Организация;
		НоваяЗапись.СтраховаяКомпания = ТекущееСтрахование.СтраховаяКомпания;
		НоваяЗапись.Застрахованный = Объект.Ссылка;
		НоваяЗапись.Свойство = ИзмененноеСвойство.Свойство;
		НоваяЗапись.Значение = ИзмененноеСвойство.Значение;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;

	Для Каждого ИзмененноеСвойство Из ВосстановленныеСвойства Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Свойство.Установить(ИзмененноеСвойство.Свойство);
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьИзменениеОтправленныхДанныхРодственника(Объект, ОтправляемыеДанные, ОтправленныеДанные, ТекущееСтрахование)
	
	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзменилисьОтправленныеДанные = Ложь;
	
	ИзмениласьФамилия = Ложь;
	Если Объект.Фамилия <> ПрежниеЗначения.Фамилия Тогда
		ИзмениласьФамилия = Истина;
		Если Объект.Фамилия <> ОтправленныеДанные.Фамилия Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьИмя = Ложь;
	Если Объект.Имя <> ПрежниеЗначения.Имя Тогда
		ИзменилосьИмя = Истина;
		Если Объект.Имя <> ОтправленныеДанные.Имя Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьОтчество = Ложь;
	Если Объект.Отчество <> ПрежниеЗначения.Отчество Тогда
		ИзменилосьОтчество = Истина;
		Если Объект.Отчество <> ОтправленныеДанные.Отчество Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзмениласьДатаРождения = Ложь;
	Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
		Если Объект.ДатаРождения <> ПрежниеЗначения.ДатаРождения Тогда
			ИзменилисьОтправленныеДанные = Истина;
			Если Объект.ДатаРождения <> ОтправленныеДанные.ДатаРождения Тогда
				ИзмениласьДатаРождения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилсяСНИЛС = Ложь;
	Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
		Если Объект.СНИЛС <> ПрежниеЗначения.СНИЛС Тогда
			ИзменилисьОтправленныеДанные = Истина;
		 	Если Объект.СНИЛС <> ОтправленныеДанные.СтраховойНомерПФР Тогда
				ИзменилсяСНИЛС = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИзменилисьОтправленныеДанные Тогда
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущееСтрахование.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(ТекущееСтрахование.СтраховаяКомпания);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Организация = ТекущееСтрахование.Организация;
			Запись.СтраховаяКомпания = ТекущееСтрахование.СтраховаяКомпания;
			Запись.Застрахованный = Объект.Ссылка;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.ИзмениласьФамилия = ИзмениласьФамилия;
		Запись.Фамилия = ?(ИзмениласьФамилия = Истина, Объект.Фамилия, Неопределено);
		
		Запись.ИзменилосьИмя = ИзменилосьИмя;
		Запись.Имя = ?(ИзменилосьИмя = Истина, Объект.Имя, Неопределено);
		
		Запись.ИзменилосьОтчество = ИзменилосьОтчество;
		Запись.Отчество = ?(ИзменилосьОтчество = Истина, Объект.Отчество, Неопределено);
		
		Запись.ИзмениласьДатаРождения = ИзмениласьДатаРождения;
		Запись.ДатаРождения = ?(ИзмениласьДатаРождения = Истина, Объект.ДатаРождения, Неопределено);
		
		Запись.ИзменилсяСтраховойНомерПФР = ИзменилсяСНИЛС;
		Запись.СтраховойНомерПФР = ?(ИзменилсяСНИЛС = Истина, Объект.СНИЛС, Неопределено);

		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекущиеСтрахованияРодственника(Родственник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Организация КАК Организация,
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ПрограммаСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних(, Родственник = &Родственник
		|	И Действует = ИСТИНА) КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Родственник", Родственник);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СоставСведенийДокументаУдостоверяющегоЛичность()
	
	Сведения = Новый Массив;
	
	Сведения.Добавить("ДокументПредставление");
	Сведения.Добавить("ДокументВид");
	Сведения.Добавить("ДокументСерия");
	Сведения.Добавить("ДокументНомер");
	Сведения.Добавить("ДокументДатаВыдачи");
	Сведения.Добавить("ДокументКемВыдан");
	Сведения.Добавить("ДокументСрокДействия");
	Сведения.Добавить("ДокументКодПодразделения");
	
	Возврат Сведения;
	
КонецФункции

Функция ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Организация, СтраховаяКомпания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправляемаяКонтактнаяИнформацияЗастрахованных.Вид КАК Вид,
		|	ОтправляемаяКонтактнаяИнформацияЗастрахованных.СпособПроверкиЗаполнения КАК СпособПроверкиЗаполнения
		|ИЗ
		|	РегистрСведений.ОтправляемаяКонтактнаяИнформацияЗастрахованных КАК ОтправляемаяКонтактнаяИнформацияЗастрахованных
		|ГДЕ
		|	ОтправляемаяКонтактнаяИнформацияЗастрахованных.Организация = &Организация
		|	И ОтправляемаяКонтактнаяИнформацияЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ОтправляемаяКонтактнаяИнформацияЗастрахованных.Отправлять = ИСТИНА";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Организация, СтраховаяКомпания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.Свойство КАК Свойство,
		|	ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.СпособПроверкиЗаполнения
		|ИЗ
		|	РегистрСведений.ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных КАК
		|		ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных
		|ГДЕ
		|	ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.Организация = &Организация
		|	И ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.Отправлять = ИСТИНА";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьПрограммыМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Прикрепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ПрикреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ПрикреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ИСТИНА КАК Действует,
		|	ПрикреплениеСотрудники.ДатаПрикрепления КАК Период,
		|	ТаблицаДокумента.ДатаОкончанияСтрахования КАК ДействуетДо,
		|	ПрикреплениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ПрикреплениеПрограммыСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
		|		ПО ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка = ПрикреплениеСотрудники.Ссылка
		|			И ПрикреплениеПрограммыСтрахованияСотрудников.Сотрудник = ПрикреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ПрикреплениеРодственники.ФизическоеЛицо,
		|	ПрикреплениеРодственники.РодственникСсылка,
		|	ПрикреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования,
		|	ИСТИНА,
		|	ПрикреплениеРодственники.ДатаПрикрепления,
		|	ПрикреплениеРодственники.ДатаОткрепления,
		|	ПрикреплениеПрограммыСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрикреплениеПрограммыСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеРодственники
		|		ПО ПрикреплениеПрограммыСтрахованияРодственников.Ссылка = ПрикреплениеРодственники.Ссылка
		|			И ПрикреплениеПрограммыСтрахованияРодственников.РодственникСсылка = ПрикреплениеРодственники.РодственникСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеПрограммыСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Прикрепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Прикрепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Прикрепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Прикрепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Прикрепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ПрикреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ПрикреплениеРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеПрограммСтрахования,
		|	ИСТИНА КАК Действует,
		|	ПрикреплениеСотрудники.ДатаПрикрепления КАК Период,
		|	ТаблицаДокумента.ДатаОкончанияСтрахования КАК ДействуетДо,
		|	ПрикреплениеРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ПрикреплениеРасширенияПрограммСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ПрикреплениеСотрудники.Ссылка
		|			И ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Сотрудник = ПрикреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ПрикреплениеРодственники.ФизическоеЛицо,
		|	ПрикреплениеРодственники.РодственникСсылка,
		|	ПрикреплениеРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования,
		|	ИСТИНА,
		|	ПрикреплениеРодственники.ДатаПрикрепления,
		|	ПрикреплениеРодственники.ДатаОткрепления,
		|	ПрикреплениеРасширенияПрограммСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ПрикреплениеРасширенияПрограммСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеРодственники
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ПрикреплениеРодственники.Ссылка
		|			И ПрикреплениеРасширенияПрограммСтрахованияРодственников.РодственникСсылка = ПрикреплениеРодственники.РодственникСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Прикрепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Прикрепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Прикрепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Прикрепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьПрограммыМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Открепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ОткреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ОткреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ЛОЖЬ КАК Действует,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК Период,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК ДействуетДо,
		|	ОткреплениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ОткреплениеПрограммыСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеСотрудники
		|		ПО ОткреплениеПрограммыСтрахованияСотрудников.Ссылка = ОткреплениеСотрудники.Ссылка
		|			И ОткреплениеПрограммыСтрахованияСотрудников.Сотрудник = ОткреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеПрограммыСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ОткреплениеРодственники.ФизическоеЛицо,
		|	ОткреплениеПрограммыСтрахованияРодственников.РодственникСсылка,
		|	ОткреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования,
		|	ЛОЖЬ,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеПрограммыСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ОткреплениеПрограммыСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеРодственники
		|		ПО ОткреплениеПрограммыСтрахованияРодственников.Ссылка = ОткреплениеРодственники.Ссылка
		|			И ОткреплениеПрограммыСтрахованияРодственников.ФизическоеЛицо = ОткреплениеРодственники.ФизическоеЛицо
		|			И ОткреплениеПрограммыСтрахованияРодственников.Родственник = ОткреплениеРодственники.Родственник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеПрограммыСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Открепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Открепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Открепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Открепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Открепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ОткреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ОткреплениеРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеПрограммСтрахования,
		|	ЛОЖЬ КАК Действует,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК Период,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК ДействуетДо,
		|	ОткреплениеРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ОткреплениеРасширенияПрограммСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеСотрудники
		|		ПО ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ОткреплениеСотрудники.Ссылка
		|			И ОткреплениеРасширенияПрограммСтрахованияСотрудников.Сотрудник = ОткреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ОткреплениеРодственники.ФизическоеЛицо,
		|	ОткреплениеРасширенияПрограммСтрахованияРодственников.РодственникСсылка,
		|	ОткреплениеРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования,
		|	ЛОЖЬ,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеРасширенияПрограммСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ОткреплениеРасширенияПрограммСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеРодственники
		|		ПО ОткреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ОткреплениеРодственники.Ссылка
		|			И ОткреплениеРасширенияПрограммСтрахованияРодственников.ФизическоеЛицо = ОткреплениеРодственники.ФизическоеЛицо
		|			И ОткреплениеРасширенияПрограммСтрахованияРодственников.Родственник = ОткреплениеРодственники.Родственник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Открепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Открепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Открепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Открепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ДобавитьИзменениеКонтактнойИнформацииВМассив(Объект, ОтправленнаяКонтактнаяИнформация, ИзмененнаяКИ, ВосстановленнаяКИ)
	
	НовоеПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Объект, ОтправленнаяКонтактнаяИнформация.Вид);
	Если Не ЗначениеЗаполнено(НовоеПредставление) Тогда
		НовоеПредставление = "";
	КонецЕсли;
	Если НовоеПредставление = ОтправленнаяКонтактнаяИнформация.Представление Тогда
		ВосстановленнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
	Иначе
		ИзмененнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
