////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицинское страхование"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьИнформациюПоСпособуРасчета(Форма) Экспорт

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаУдержаний.ДМС") Тогда
		Элементы.СпособРасчетаСтраницы.ТекущаяСтраница = Элементы.ДМССтраница;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтображениеСвойстваУчаствуетВРасчетеПервойПоловиныМесяца(Форма) Экспорт

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.КатегорияУдержания = ПредопределенноеЗначение("Перечисление.КатегорииУдержаний.ДМС") Тогда
		Элементы.УдерживаетсяПриРасчетеПервойПоловиныМесяцаСтраницы.ТекущаяСтраница = Элементы.УдерживаетсяПриРасчетеПервойПоловиныМесяцаНеОтображаетсяСтраница;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти