////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дистанционная работа".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает доступность.
//
// Параметры:
//   Форма - Форма - имя форма кадрового перевода".
//
Процедура КадровыйПереводУстановитьДоступностьЭлементов(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ИзменитьДистанционнуюРаботу = Объект.ИзменитьДистанционнуюРаботу И ЗначениеЗаполнено(Объект.Сотрудник);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"РаботаетДистанционно",
		"Доступность",
		ИзменитьДистанционнуюРаботу);
	
	// ЗУПК
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"РежимДистанционнойРаботы",
		"Доступность",
		ИзменитьДистанционнуюРаботу);
	// ЗУПК
	
КонецПроцедуры

Процедура РежимДистанционнойРаботыПриИзмененииПриИзменении(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.РежимДистанционнойРаботы)
		И НЕ Объект.РаботаетДистанционно Тогда
		
		Объект.РаботаетДистанционно = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.РежимДистанционнойРаботы)
		И Объект.РаботаетДистанционно Тогда
		
		Объект.РаботаетДистанционно = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти