
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		
		// ЗУПК
		СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		// ЗУПК

		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("Организация",	"Объект.Организация");
		ЗначенияДляЗаполнения.Вставить("Ответственный",	"Объект.Ответственный");
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		ПриПолученииДанныхНаСервере();
		
	КонецЕсли;
	
    Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	ВидыДоходовИсполнительногоПроизводстваКлиентСервер.НастроитьПолеВидДоходаДляВыплатыЗарплаты(ЭтотОбъект,Объект.Дата);
    КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
    Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	ОбменСБанками.ПриСозданииФормыДокументаНаСервере(ЭтотОбъект);
    КонецЕсли;
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ЗУПК
	ЗарплатаКадрыРасширенныйРК.УстановитьСвойстваФактическогоПлательщика(Элементы.ФактическийПлательщик, Объект.Организация);
	// ЗУПК
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ЗУПК
	СобытияФормЗУПК.ПриЧтенииНаСервере(ЭтаФорма);
	// ЗУПК
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	ВзаиморасчетыССотрудникамиВХОФормы.ПриЧтенииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, КонтекстПодключаемыхКоманд(ЭтотОбъект));
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ВзаиморасчетыССотрудникамиВХОКлиент.ПлатежноеПоручениеОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
 	ОбменСБанкамиКлиент.ОбработатьОповещениеФормыДокумента(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
	ОбменСБанками.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
	ВзаиморасчетыССотрудникамиВХОФормы.ПослеЗаписиНаСервере(ЭтотОбъект);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.СостоянияДокументовЗачисленияЗарплаты"));
	// ЗУПК
	Оповестить("Запись_ПлатежноеПоручение", ПараметрыЗаписи, Объект.Ссылка);
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов") Тогда
		Оповестить(ВзаиморасчетыПоПрочимДоходамКлиент.ИмяСобытияИзмененияОплатыВедомости(), ПараметрыЗаписи, Объект.Ссылка);
	Иначе
		Оповестить(ВзаиморасчетыССотрудникамиКлиент.ИмяСобытияИзмененияОплатыВедомости(), ПараметрыЗаписи, Объект.Ссылка);
	КонецЕсли;
	// ЗУПК
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
	ОбменСБанкамиКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	НастроитьВидДоходаИсполнительногоПроизводства();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомостиПриИзменении(Элемент)
	
	ВедомостиПриИзмененииНаСервере();
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);

КонецПроцедуры

// ЗУПК
&НаКлиенте
Процедура Подключаемый_ВедомостиПрочиеПриИзменении()
	
	ВедомостиПриИзмененииНаСервере();
	
КонецПроцедуры
// ЗУПК

&НаКлиенте
Процедура ВедомостиВедомостьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// ЗУПК
	// в рамках платежного поручения выбираем документы одного типа
	// определяем тип выбираемых документов по первой строке
	ТипДокументаПервойСтроки = ТипЗнч(Неопределено);
	Если Объект.Ведомости.Количество() > 0 Тогда
		
		// для первой строки дадим возможность выбора
		ВедомостьПервойСтроки = Объект.Ведомости[0].Ведомость;
		
		Если НЕ Элементы.Ведомости.ТекущиеДанные = Неопределено
			И Элементы.Ведомости.ТекущиеДанные.Ведомость = ВедомостьПервойСтроки Тогда
			ТипДокументаПервойСтроки = ТипЗнч(Неопределено);	
		Иначе
			ТипДокументаПервойСтроки = ТипЗнч(Объект.Ведомости[0].Ведомость);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ТипДокументаПервойСтроки = Тип("Неопределено") Тогда
		Если ТипДокументаПервойСтроки = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
			ТипыВедомости = "ДокументСсылка.ВедомостьПрочихДоходовВБанк";	
		ИначеЕсли ТипДокументаПервойСтроки = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
			ТипыВедомости = "ДокументСсылка.ВедомостьПрочихДоходовПеречислением";	
		ИначеЕсли ТипДокументаПервойСтроки = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
			ТипыВедомости = "ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением";	
		Иначе
			ТипыВедомости = "ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк";
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты") Тогда
		ТипыВедомости = "ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением,ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк";
	Иначе
		ТипыВедомости = "ДокументСсылка.ВедомостьПрочихДоходовПеречислением,ДокументСсылка.ВедомостьПрочихДоходовВБанк";
	КонецЕсли;		
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(ТипыВедомости);
	// ЗУПК

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, КонтекстПодключаемыхКоманд(ЭтотОбъект));
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец ЭлектронноеВзаимодействие.ОбменСБанками

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОткрытьДокументПодтверждение(Команда)
	ОбменСБанкамиПоЗарплатнымПроектамКлиент.ОткрытьДокументПодтверждение(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьДокументПодтверждение(Команда)
	
	ОткрытьФорму("Документ.ПодтверждениеЗачисленияЗарплаты.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьВнутреннююКоманду(Команда)
	
	ВыполнениеКомандыНаСервере();
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ЭлектронноеВзаимодействие.ОбменСБанками
&НаКлиенте
Процедура Подключаемый_ПриНажатииНаСсылкуДиректБанк()
    ОбменСБанкамиКлиент.ОткрытьАктуальныйЭД(Объект.Ссылка, ЭтотОбъект);
 КонецПроцедуры
// Конец ЭлектронноеВзаимодействие.ОбменСБанками

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	Если Параметры.Ключ.Пустая() Тогда
		СсылкаНаОбъект = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка).ПолучитьСсылку();
	Иначе
		СсылкаНаОбъект = Объект.Ссылка;
		ТолькоПросмотр = ТолькоПросмотр Или Не ОбменСБанкамиПоЗарплатнымПроектам.ДоступностьПлатежногоДокумента(СсылкаНаОбъект);
	КонецЕсли;
	
	СоздатьКонтекстПодключаемыхКоманд();

	ЗначенияДляЗаполнения = Новый Структура;
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	ЗначенияДляЗаполнения.Вставить("Получатель", "Получатель");
	ЗначенияДляЗаполнения.Вставить("РасчетныйСчет", "РасчетныйСчет");
	КонецЕсли;
	ЗначенияДляЗаполнения.Вставить("ИНН", "ИНН");
	ЗначенияДляЗаполнения.Вставить("КПП", "КПП");
	ЗначенияДляЗаполнения.Вставить("СуммаПлатежа", "СуммаПлатежа");
	ЗначенияДляЗаполнения.Вставить("ЗарплатныйПроект", "ЗарплатныйПроектВедомостей");
	
	ОбменСБанкамиПоЗарплатнымПроектам.ЗаполнитьРеквизитыНаФормеПлатежногоДокумента(
	// ЗУПК
		ЭтотОбъект, Объект.Организация, ЗначенияДляЗаполнения, ПолучитьВедомостиНаСервере());
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		НадписьРеквизитыПлательщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ИНН %1, КПП %2'"), ИНН, КПП);
	Иначе
		НадписьРеквизитыПлательщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ИИН %1'"), ИНН);
    	Элементы.Ведомости.Видимость = (Объект.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты)
										ИЛИ (Объект.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов);
    	Элементы["ВедомостиПрочие"].Видимость = (Объект.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат);
	КонецЕсли;
    // ЗУПК
   	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныйОбменСБанкамиПоЗарплатнымПроектам") Тогда
	    ОбменСБанкамиПоЗарплатнымПроектам.ГруппаПодтверждениеИзБанкаДополнитьФорму(ЭтотОбъект);
	КонецЕсли;
	
	ОграничиватьТипВедомостьюНаВыплатуЗарплатыВБанк = Истина;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.Выплаты.ВзаиморасчетыПоПрочимДоходам") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыПоПрочимДоходам");
		ОграничиватьТипВедомостьюНаВыплатуЗарплатыВБанк = Не Модуль.ИспользуютсяВзаиморасчетыПоПрочимДоходам();
	КонецЕсли;

	НастроитьВидДоходаИсполнительногоПроизводства();
	
	// ЗУПК
	УстановитьФункциональныеОпцииФормы();
	// ЗУПК
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидДоходаИсполнительногоПроизводства()
	ОбщегоНазначенияБЗККлиентСервер.УстановитьОбязательностьПоляВводаФормы(
		ЭтотОбъект, 
		"ВидДоходаИсполнительногоПроизводства", 
		Документы.ПлатежноеПоручение.ВидДоходаИсполнительногоПроизводстваОбязателен(Объект));
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗначенияДляЗаполнения = Новый Структура;
	ЗначенияДляЗаполнения.Вставить("ИНН", "ИНН");
	ЗначенияДляЗаполнения.Вставить("КПП", "КПП");
	ЗначенияДляЗаполнения.Вставить("ЗарплатныйПроект", "ЗарплатныйПроектВедомостей");
        
	ОбменСБанкамиПоЗарплатнымПроектам.ЗаполнитьРеквизитыНаФормеПлатежногоДокумента(
	// ЗУПК
		ЭтотОбъект, Объект.Организация, ЗначенияДляЗаполнения, ПолучитьВедомостиНаСервере());
	
    Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
        ЭтотОбъект.НадписьРеквизитыПлательщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ИНН %1, КПП %2'"), ЭтотОбъект.ИНН, ЭтотОбъект.КПП);
    Иначе
        ЭтотОбъект.НадписьРеквизитыПлательщика = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ИИН %1'"), ЭтотОбъект.ИНН);
    КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
			Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
				Объект.Организация);
		КонецЕсли;
	КонецЕсли;

	УстановитьФункциональныеОпцииФормы();
	
	ЗарплатаКадрыРасширенныйРК.УстановитьСвойстваФактическогоПлательщика(Элементы.ФактическийПлательщик, Объект.Организация, Объект.ФактическийПлательщик);
	// ЗУПК
	
КонецПроцедуры

&НаСервере
Процедура ВедомостиПриИзмененииНаСервере()
	
	ЗначенияДляЗаполнения = Новый Структура;
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	ЗначенияДляЗаполнения.Вставить("Получатель", "Получатель");
	ЗначенияДляЗаполнения.Вставить("РасчетныйСчет", "РасчетныйСчет");
	КонецЕсли;
	ЗначенияДляЗаполнения.Вставить("СуммаПлатежа", "СуммаПлатежа");
	ЗначенияДляЗаполнения.Вставить("ЗарплатныйПроект", "ЗарплатныйПроектВедомостей");
	
	ОбменСБанкамиПоЗарплатнымПроектам.ЗаполнитьРеквизитыНаФормеПлатежногоДокумента(
		// ЗУПК
		ЭтотОбъект, Объект.Организация, ЗначенияДляЗаполнения, ПолучитьВедомостиНаСервере());
		// ЗУПК
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПослеОтправкиВБанк()
	
	ВзаиморасчетыССотрудникамиВХОКлиент.ОбработчикОжиданияПослеОтправкиВБанк(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнениеКомандыНаСервере()
	
	ВзаиморасчетыССотрудникамиВХОФормы.ВыполнениеКомандыНаСервере(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ДанныеЗУПК

&НаКлиенте
Процедура Подключаемый_ВыгрузитьМТ102(Команда)
	
	Если Параметры.Ключ.Пустая()
		ИЛИ ЭтаФорма.Модифицированность Тогда
		ТекстВопроса =
			НСтр("ru = 'Данные еще не записаны.
					|Выполнение действия ""Выгрузить в МТ-102"" возможно только после записи данных.
					|Данные будут записаны.'");
		Обработчик = Новый ОписаниеОповещения("ВыгрузитьВыгрузитьМТ102Завершение", ЭтотОбъект);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		Ведомости = ПолучитьВедомостиНаСервере();
		Если Ведомости.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В табличной части платежного поручения должна быть выбрана как минимум одна ведомость'"));
			Возврат;
		КонецЕсли;
        Если ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
        	ВидОперации = "ВыплатаЗарплатыПеречислением";  
		ИначеЕсли ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда
			ВидОперации = "ПеречислениеПрочихВыплат";
		ИначеЕсли ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
			ВидОперации = "ВедомостьПрочихДоходовВБанк";
		ИначеЕсли ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
			ВидОперации = "ВедомостьПрочихДоходовПеречислением";
        Иначе
		    ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту";
        КонецЕсли; 
		ДанныеДокумента = Новый Структура("ВидОперации, Организация, БанковскийСчет, Получатель, БанковскийСчетПолучателя, 
											|Дата, Номер, КодНазначенияПлатежа, НазначениеПлатежа, СтруктурноеПодразделение, ФактическийПлательщик, Ведомости", 
											ВидОперации, Объект.Организация, Объект.БанковскийСчет, Объект.Контрагент, Объект.БанковскийСчетКонтрагента,
											Объект.Дата, Объект.Номер, Объект.КодНазначенияПлатежа, Объект.НазначениеПлатежа, Объект.Подразделение, Объект.ФактическийПлательщик, Ведомости); 
		ПараметрыФормы = Новый Структура("ДанныеДокумента", ДанныеДокумента);
		ОткрытьФорму("Обработка.ВыгрузкаДанныхМТ102.Форма.Форма",
				ПараметрыФормы,ЭтаФорма,,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВыгрузитьМТ102Завершение(Ответ, ПараметрыОповещения) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда 
		Записать();
		СсылкаНаОбъект = Объект.Ссылка;
		Ведомости = ПолучитьВедомостиНаСервере();
		Если Ведомости.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В табличной части платежного поручения должна быть выбрана как минимум одна ведомость'"));
			Возврат;
		КонецЕсли;
        Если ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
            ВидОперации = "ВыплатаЗарплатыПеречислением";  
		ИначеЕсли ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда
			ВидОперации = "ПеречислениеПрочихВыплат";
		ИначеЕсли ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
			ВидОперации = "ВедомостьПрочихДоходовВБанк";
		ИначеЕсли ТипЗнч(Ведомости[0])= Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
			ВидОперации = "ВедомостьПрочихДоходовПеречислением";
        Иначе
            ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту";
        КонецЕсли; 
		ДанныеДокумента = Новый Структура("ВидОперации, Организация, БанковскийСчет, Получатель, БанковскийСчетПолучателя, 
											|Дата, Номер, КодНазначенияПлатежа, НазначениеПлатежа, Ведомости", 
											ВидОперации, Объект.Организация, Объект.БанковскийСчет, Объект.Контрагент, Объект.БанковскийСчетКонтрагента,
											Объект.Дата, Объект.Номер, Объект.КодНазначенияПлатежа, Объект.НазначениеПлатежа, Ведомости); 
		ПараметрыФормы = Новый Структура("ДанныеДокумента", ДанныеДокумента);
		ОткрытьФорму("Обработка.ВыгрузкаДанныхМТ102.Форма.Форма",
				ПараметрыФормы,ЭтаФорма,,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

// ЗУПК
&НаСервере
Функция ПолучитьВедомостиНаСервере()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов Тогда
		Возврат Объект.Ведомости.Выгрузить(,"Ведомость").ВыгрузитьКолонку("Ведомость");
	Иначе
		Возврат Объект.ВедомостиПрочие.Выгрузить(,"Ведомость").ВыгрузитьКолонку("Ведомость");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ЗаполнитьНазначениеПлатежа(Команда)
	
	ЗаполнитьНазначениеПлатежаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНазначениеПлатежаСервер()
	
	УчетНалоговВзносовОтчисленийРасширенный.ЗаполнитьНазначениеПлатежаСервер(Объект.Контрагент, Объект.БанковскийСчетКонтрагента, ПолучитьВедомостиНаСервере(), Объект.НазначениеПлатежа, Объект.КодНазначенияПлатежа, СуммаПлатежа, Объект.ВидОперации);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) Тогда
			Объект.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(
				Объект.Контрагент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВидОперацииПриИзменении(Элемент)
	
	Элементы.Ведомости.Видимость = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты")
									ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов"));
    Элементы["ВедомостиПрочие"].Видимость = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат"));
	
	Объект.Ведомости.Очистить();
	Объект.ВедомостиПрочие.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодразделениеПриИзменении(Элемент)

	Объект.Ведомости.Очистить();
	Объект.ВедомостиПрочие.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Объект.ФактическийПлательщик = Объект.Подразделение;
	Иначе
		Объект.ФактическийПлательщик = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()

	ПараметрыФО = Новый Структура("Организация, Период", Объект.Организация, НачалоДня(Объект.Дата));
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

// ЗУПК

#КонецОбласти

&НаСервере
Процедура СоздатьКонтекстПодключаемыхКоманд()
	
	Контекст = Новый Структура;
	Для Каждого РеквизитОбъекта Из ПолучитьРеквизиты("Объект") Цикл
		Контекст.Вставить(РеквизитОбъекта.Имя);
	КонецЦикла;	
	Контекст.Вставить("ЗарплатныйПроект");
	
	КонтекстПодключаемыхКоманд = Новый ФиксированнаяСтруктура(Контекст);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КонтекстПодключаемыхКоманд(Форма)
	
	КонтекстПодключаемыхКоманд = Новый Структура(Форма.КонтекстПодключаемыхКоманд);
	
	ЗаполнитьЗначенияСвойств(КонтекстПодключаемыхКоманд, Форма.Объект);
	КонтекстПодключаемыхКоманд.ЗарплатныйПроект = Форма.ЗарплатныйПроектВедомостей;
	
	Возврат КонтекстПодключаемыхКоманд;
	
КонецФункции

#КонецОбласти
