#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОДоляхЕП();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОДоляхЕП()
	
	НаборЗаписей = РегистрыСведений.СведенияОДоляхЕП.СоздатьНаборЗаписей();

	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20230101', 50, 10, 9, 16, 15, 0);
	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20240101', 46.5, 9.3, 8.4, 14.9, 13.95, 6.95);
	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20250101', 42, 8.4, 7.6, 18.9, 12.6, 10.5);
	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20260101', 40.3, 8.1, 7.3, 18.1, 12.1, 14.1);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕП(НаборЗаписей, Период, ДоляОПВ, ДоляВОСМС, ДоляИПН, ДоляСО, ДоляООСМС, ДоляОПВР)
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.ДоляОПВ = ДоляОПВ;
	НоваяЗапись.ДоляВОСМС = ДоляВОСМС;
	НоваяЗапись.ДоляИПН = ДоляИПН;
	НоваяЗапись.ДоляСО = ДоляСО;
	НоваяЗапись.ДоляООСМС = ДоляООСМС;
	НоваяЗапись.ДоляОПВР = ДоляОПВР;
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕдиногоПлатежа2024() Экспорт
	
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20240101', 46.5, 9.3, 8.4, 14.9, 14, 7);
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕдиногоПлатежа2024ВКонфигурацииЗарплатногоУчета() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20240101', 46.5, 9.3, 8.4, 14.9, 14, 7);
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕдиногоПлатежа2024Корректировка() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийКорректировка('20240101', 46.5, 9.3, 8.4, 14.9, 13.95, 6.95);
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕдиногоПлатежа2025() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', 42, 8.4, 7.6, 18.9, 12.6, 10.5);
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕдиногоПлатежа2026() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', 40.3, 8.1, 7.3, 18.1, 12.1, 14.1);
	
КонецПроцедуры

#КонецОбласти

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой(Период, ДоляОПВ, ДоляВОСМС, ДоляИПН, ДоляСО, ДоляООСМС, ДоляОПВР) 
	
	НаборЗаписей = РегистрыСведений.СведенияОДоляхЕП.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		// Ресурсы
		Движение.ДоляОПВ = ДоляОПВ;
		Движение.ДоляВОСМС = ДоляВОСМС;
		Движение.ДоляИПН = ДоляИПН;
		Движение.ДоляСО = ДоляСО;
		Движение.ДоляООСМС = ДоляООСМС;
		Движение.ДоляОПВР = ДоляОПВР;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчисленийКорректировка(Период, ДоляОПВ, ДоляВОСМС, ДоляИПН, ДоляСО, ДоляООСМС, ДоляОПВР)
	
	НаборЗаписей = РегистрыСведений.СведенияОДоляхЕП.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		НаборЗаписей.Очистить();
		
	КонецЕсли;
	
	Движение = НаборЗаписей.Добавить();
	// Свойства
	Движение.Период = Период;
	//Измерения
	// Ресурсы
	Движение.ДоляОПВ = ДоляОПВ;
	Движение.ДоляВОСМС = ДоляВОСМС;
	Движение.ДоляИПН = ДоляИПН;
	Движение.ДоляСО = ДоляСО;
	Движение.ДоляООСМС = ДоляООСМС;
	Движение.ДоляОПВР = ДоляОПВР;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

#КонецЕсли
