#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20230101') Тогда
			
			ТекстОшибки = НСтр("ru = 'Сведения о долях единого платежа указываются с 01.01.2023 года.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20240101')
			И ЗначениеЗаполнено(СтрокаНабора.ДоляОПВР) Тогда
			
			ТекстОшибки = НСтр("ru = 'Сведения о доле ОПВР в составе единого платежа указываются с 01.01.2024 года.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
