#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РабочиеМестаОхраныТрудаСотрудников");
	НастройкиВарианта.Описание = НСтр("ru = 'Информация о рабочих местах охраны труда, назначенных сотрудникам.'");
	НастройкиВарианта.Включен = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда");
	НастройкиВарианта.Размещение.Очистить();
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ОхранаТруда, "Важный");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли