#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КадровыеИзменения");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Приемы на работу, увольнения, переводы и перемещения между подразделениями.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СводКадровыхИзменений");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Количество приемов, увольнений, переводов с точностью до позиции 
		|штатного расписания.'");
	
    // ЗУПК
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РегламентированныйОтчетСтатистикаФорма1Т");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РегламентированныйОтчетСтатистикаФорма1ТГодовая");
	НастройкиВарианта.Включен = Ложь;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КадровыеИзмененияСтатистика");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Приемы на работу, увольнения, переводы и перемещения между подразделениями для проверки статистических форм'");
    // ЗУПК
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли