
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьЭлементОтбораВидДняДополнительныйВыходной(ГруппаОтбора, НомерДня) Экспорт
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДанныеГрафика.ВидДня" + НомерДня);
	ЭлементОтбора.ПравоеЗначение = Перечисления.ВидыДнейПроизводственногоКалендаря.ДополнительныйВыходной;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	
КонецПроцедуры

Функция ЗаменитьТекстЗапросаРасчетРабочихЧасов(Знач ТекстЗапроса) Экспорт
	
	Возврат СтрЗаменить(ТекстЗапроса, 
			"СУММА(ВЫБОР
			|			КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
			|					И ГрафикиРаботыСотрудников.РабочихДнейВНеделе <> 6
			|				ТОГДА ГрафикиРаботыСотрудников.ДлительностьРабочейНедели / 5
			|			КОГДА (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
			|					ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий))
			|					И ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|					И ГрафикиРаботыСотрудников.ДлительностьРабочейНедели <> 40
			|				ТОГДА ГрафикиРаботыСотрудников.ДлительностьРабочейНедели / 6
			|			КОГДА ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|					И ГрафикиРаботыСотрудников.ДлительностьРабочейНедели = 40
			|				ТОГДА ВЫБОР
			|						КОГДА (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
			|								ИЛИ ДЕНЬНЕДЕЛИ(ДанныеПроизводственногоКалендаря.Дата) = 6
			|									И НЕ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник))
			|								И ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|							ТОГДА 5
			|						ИНАЧЕ 0
			|					КОНЕЦ + ВЫБОР
			|						КОГДА (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
			|								ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
			|								И ДЕНЬНЕДЕЛИ(ДанныеПроизводственногоКалендаря.Дата) <> 6
			|								И ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|							ТОГДА 7
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
			|				ТОГДА ГрафикиРаботыСотрудников.ДлительностьРабочейНедели / 5 - 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК РабочихЧасов",
			"СУММА(ВЫБОР
			|			КОГДА (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
			|				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
			|					И ГрафикиРаботыСотрудников.РабочихДнейВНеделе <> 6
			|				ТОГДА ГрафикиРаботыСотрудников.ДлительностьРабочейНедели / 5
			|			КОГДА (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
			|					ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
			|				ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
			|					И ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|					И ГрафикиРаботыСотрудников.ДлительностьРабочейНедели <> 40
			|				ТОГДА ГрафикиРаботыСотрудников.ДлительностьРабочейНедели / 6
			|			КОГДА ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|					И ГрафикиРаботыСотрудников.ДлительностьРабочейНедели = 40
			|				ТОГДА ВЫБОР
			|						КОГДА (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)
			|								ИЛИ ДЕНЬНЕДЕЛИ(ДанныеПроизводственногоКалендаря.Дата) = 6
			|									И НЕ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник))
			|								И ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|							ТОГДА 5
			|						ИНАЧЕ 0
			|					КОНЕЦ + ВЫБОР
			|						КОГДА (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
			|								ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
			|								И ДЕНЬНЕДЕЛИ(ДанныеПроизводственногоКалендаря.Дата) <> 6
			|								И ГрафикиРаботыСотрудников.РабочихДнейВНеделе = 6
			|							ТОГДА 7
			|						ИНАЧЕ 0
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК РабочихЧасов ");    	
	
КонецФункции

Функция ПолучитьСледующуюРабочуюДату(СрокСдачи) Экспорт
	
	МассивСроков = Новый Массив;
	МассивСроков.Добавить(СрокСдачи);
	
	Запрос = Новый Запрос();
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПроизводственныеКалендари.Ссылка
	|ИЗ
	|	Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари";
	Запрос.Текст = ТекстЗапроса;
	График = Запрос.Выполнить().Выгрузить();
	
	Если СрокСдачи = КонецГода(СрокСдачи) Или СрокСдачи = НачалоДня(КонецГода(СрокСдачи)) Тогда
				
		СрокСдачи = НачалоДня(СрокСдачи);
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("СрокСдачи", СрокСдачи);
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.ВидДня,
		|	ДанныеПроизводственногоКалендаря.Дата,
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь,
		|	ПроизводственныеКалендари.Ссылка
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари
		|		ПО ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = ПроизводственныеКалендари.Ссылка
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата = &СрокСдачи";
		Запрос.Текст = ТекстЗапроса;
		ДатаКонцаГода = Запрос.Выполнить().Выгрузить();
		
		Если ДатаКонцаГода.Количество() > 0 Тогда
			
			Если ДатаКонцаГода[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий
			 ИЛИ ДатаКонцаГода[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
				Возврат СрокСдачи;
			Иначе
				ПредыдущаяРабочаяДата = КалендарныеГрафики.ДатыБлижайшихРабочихДней(График[0].Ссылка, МассивСроков, Истина, Ложь);
				Возврат ПредыдущаяРабочаяДата.Получить(СрокСдачи);
			КонецЕсли;
			
		Иначе
						
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							  НСтр("ru = 'Невозможно определить ближайшую рабочую дату для даты %1, возможно, календарь не заполнен.'"), 
						 	  Формат(СрокСдачи, "ДЛФ=D"));
			Сообщение.Сообщить();
			Возврат Неопределено;

		КонецЕсли;
		
	Иначе
		
		СледующаяРабочаяДата = КалендарныеГрафики.ДатыБлижайшихРабочихДней(График[0].Ссылка, МассивСроков, , Ложь);
		Если СледующаяРабочаяДата <> Неопределено Тогда
			
			Возврат СледующаяРабочаяДата.Получить(НачалоДня(СрокСдачи));
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							  НСтр("ru = 'Невозможно определить ближайшую рабочую дату для даты %1, возможно, календарь не заполнен.'"), 
							  Формат(СрокСдачи, "ДЛФ=D"));
			Сообщение.Сообщить();
			Возврат Неопределено;
			
		КонецЕсли
		
	КонецЕсли;

КонецФункции

#КонецОбласти