#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПлатежногоПоручения = РеквизитыПлатежногоПоручения();
	// Посчитать сумму документа и записать ее в соответствующий реквизит шапки.
	СуммаПоДокументу = ВедомостиНаПеречислениеВзносовИОтчислений.Итог("Сумма");
	МассивВедомостей = ВедомостиНаПеречислениеВзносовИОтчислений.Выгрузить(, "Ведомость").ВыгрузитьКолонку("Ведомость");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ВедомостьНаПеречислениеВзносовОтчислений.СуммаПоДокументу, 0)) КАК СуммаПоВедомостям,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА &СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|					ИЛИ ЕСТЬNULL(ПодразделенияОрганизаций.ОбособленноеПодразделение, ЛОЖЬ) = ЛОЖЬ
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА &СтруктурноеПодразделение = ВедомостьНаПеречислениеВзносовОтчислений.Подразделение
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		КОНЕЦ) КАК НеСоответствуетСтруктурное
		|ИЗ
		|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО ВедомостьНаПеречислениеВзносовОтчислений.Подразделение = ПодразделенияОрганизаций.Ссылка
		|ГДЕ
		|	ВедомостьНаПеречислениеВзносовОтчислений.Ссылка В(&МассивВедомостей)";
	
	Запрос.УстановитьПараметр("МассивВедомостей", МассивВедомостей);
	Запрос.УстановитьПараметр("СтруктурноеПодразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если НЕ СуммаПоДокументу = ВыборкаДетальныеЗаписи.СуммаПоВедомостям Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не совпадает сумма документа и суммы по ведомостям на перечисление налогов/взносов/отчислений'"));	
		ИначеЕсли ВыборкаДетальныеЗаписи.НеСоответствуетСтруктурное Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не совпадает структурное подразделение ведомости и платежного документа'"));	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ВзносыОтчисленияРасчетыСБюджетомИФондами = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами;
	ВыборкаВзносыОтчисленияРасчетыСБюджетомИФондами = ДанныеДляПроведения();
	ДатаКорректировкиВеденияУчетаПоДаннымНВО = НачалоМесяца(Константы.ДатаКорректировкиВеденияУчетаПоДаннымНВО.Получить()); 
    
	Пока ВыборкаВзносыОтчисленияРасчетыСБюджетомИФондами.Следующий() Цикл
		НоваяСтрока = ВзносыОтчисленияРасчетыСБюджетомИФондами.ДобавитьРасход();
        Если НЕ ЗначениеЗаполнено(ДатаКорректировкиВеденияУчетаПоДаннымНВО)
            ИЛИ ДатаКорректировкиВеденияУчетаПоДаннымНВО <= ВыборкаВзносыОтчисленияРасчетыСБюджетомИФондами.МесяцНалоговогоПериода Тогда
            НоваяСтрока.ВидДохода = ВыборкаВзносыОтчисленияРасчетыСБюджетомИФондами.ВидДохода; 
        Иначе
            НоваяСтрока.ВидДохода = Справочники.ВидыДоходов.ПустаяСсылка();
        КонецЕсли;
        ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаВзносыОтчисленияРасчетыСБюджетомИФондами);
	КонецЦикла;
	
	ВзносыОтчисленияРасчетыСБюджетомИФондами.Записать();
	ВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Ложь;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РеквизитыПлатежногоПоручения() Экспорт
	
	РеквизитыПлатежногоПорученияПоДатеНомеру = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		 	НСтр("ru = '№ %1 от %2'"), 
			ПлатежноеПоручениеНомер,  
			Формат(ПлатежноеПоручениеДата, "ДЛФ=D"));

	Возврат РеквизитыПлатежногоПорученияПоДатеНомеру
	
КонецФункции	

Функция	ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеречислениеВзносовИОтчислений.Ссылка КАК Ссылка,
	|	ПеречислениеВзносовИОтчислений.Ведомость КАК Ведомость,
	|	ПеречислениеВзносовИОтчислений.Ссылка.Дата КАК Дата,
	|	ПеречислениеВзносовИОтчислений.Ссылка.Организация КАК Организация,
	|	ВедомостиНаПеречислениеВзносовОтчислений.РегистрацияВНалоговомОргане,
	|	ВедомостиНаПеречислениеВзносовОтчислений.ФизическоеЛицо,
	|	ВедомостиНаПеречислениеВзносовОтчислений.МесяцНалоговогоПериода,
	|	ВедомостиНаПеречислениеВзносовОтчислений.ВидДохода,
	|	СУММА(ВедомостиНаПеречислениеВзносовОтчислений.НалогВзнос) КАК НалогВзнос
	|ПОМЕСТИТЬ ВТВедомости
	|ИЗ
	|	Документ.ПеречислениеВзносовИОтчислений.ВедомостиНаПеречислениеВзносовИОтчислений КАК ПеречислениеВзносовИОтчислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ВедомостиНаПеречислениеВзносовОтчислений
	|		ПО ПеречислениеВзносовИОтчислений.Ведомость = ВедомостиНаПеречислениеВзносовОтчислений.Ссылка
	|ГДЕ
	|	ПеречислениеВзносовИОтчислений.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеречислениеВзносовИОтчислений.Ссылка,
	|	ПеречислениеВзносовИОтчислений.Ведомость,
	|	ВедомостиНаПеречислениеВзносовОтчислений.РегистрацияВНалоговомОргане,
	|	ВедомостиНаПеречислениеВзносовОтчислений.ФизическоеЛицо,
	|	ВедомостиНаПеречислениеВзносовОтчислений.МесяцНалоговогоПериода,
	|	ВедомостиНаПеречислениеВзносовОтчислений.ВидДохода,
	|	ПеречислениеВзносовИОтчислений.Ссылка.Дата,
	|	ПеречислениеВзносовИОтчислений.Ссылка.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ведомости.Дата КАК Период,
	|	Ведомости.Организация,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ВидПлатежа,
	|	Ведомости.ВидДохода,
	|	Ведомости.ФизическоеЛицо,
	|	Ведомости.МесяцНалоговогоПериода,
	|	Ведомости.РегистрацияВНалоговомОргане,
	|	Ведомости.НалогВзнос
	|ИЗ
	|	ВТВедомости КАК Ведомости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
	|		ПО Ведомости.Ведомость = ВедомостьНаПеречислениеВзносовОтчислений.Ссылка";
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьНаПеречислениеВзносовОтчислений")
		ИЛИ (ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И (ДанныеЗаполнения.Свойство("МассивВедомостей"))) Тогда
		
		МассивВедомостей = ДанныеЗаполнения.МассивВедомостей;
		ДанныеЗаполнения = Новый Структура("Организация, ВидНалогаВзносаОтчисления, ВидПлатежа, Сумма, Подразделение");
		
		ДанныеВедомостей = ДанныеВедомостейНаВыплатуВзносовИОтчислений(МассивВедомостей);
		
		Если ДанныеВедомостей.РеквизитыШапки = Неопределено Тогда
			Текст = НСтр("ru='Команда не может быть выполнена для указанного объекта!'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если ДанныеВедомостей.МассивОшибок.Количество() > 0 Тогда
			Текст = ДанныеВедомостей.МассивОшибок[0].Текст;
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ДанныеВедомостей.РеквизитыШапки,
		"Организация, ВидНалогаВзносаОтчисления, ВидПлатежа, Подразделение");
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Организация",           		  ДанныеЗаполнения.Организация);
		СтруктураПараметров.Вставить("МассивВедомостей",      		  МассивВедомостей);
		
		ЗаполнитьПоВедомостямКОплате(ВедомостиНаПеречислениеВзносовИОтчислений, СтруктураПараметров);
		
		Если ВедомостиНаПеречислениеВзносовИОтчислений.Количество() = 0 Тогда
			Текст = НСтр("ru='На основании выбранных ведомостей заявки уже созданы или оплата не требуется.'");
			ВызватьИсключение Текст;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ФактическийПлательщик = Подразделение;	
		КонецЕсли;
		
		ДанныеЗаполнения.Сумма = ВедомостиНаПеречислениеВзносовИОтчислений.Итог("Сумма");
		
	КонецЕсли;
	
КонецПроцедуры

// Функция данные ведомостей для заполнения платежных документов.
//
// Параметры:
//   МассивВедомостей - Массив - массив ведомостей на выплату зарплаты.
//
// Возвращаемое значение:
//   Структура   - структура со значениями РеквизитыШапки и МассивОшибок
//
Функция ДанныеВедомостейНаВыплатуВзносовИОтчислений(МассивВедомостей) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Ведомость,
	|	Ведомость.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Ведомость.Подразделение.ОбособленноеПодразделение
	|			ТОГДА Ведомость.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	Ведомость.СуммаПоДокументу КАК Сумма,
	|	НЕ Ведомость.Проведен КАК ЕстьОшибкиПроведен,
	|	Ведомость.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	Ведомость.ВидПлатежа КАК ВидПлатежа
	|ПОМЕСТИТЬ ВТДанныеЗаполнения
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК Ведомость
	|ГДЕ
	|	Ведомость.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТДанныеЗаполнения.Организация) КАК Организация,
	|	МАКСИМУМ(ВТДанныеЗаполнения.Подразделение) КАК Подразделение,
	|	СУММА(ВТДанныеЗаполнения.Сумма) КАК Сумма,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВТДанныеЗаполнения.Ведомость.Проведен
	|				ТОГДА ВТДанныеЗаполнения.Ведомость
	|			ИНАЧЕ ЗНАЧЕНИЕ(Документ.ВедомостьНаПеречислениеВзносовОтчислений.ПустаяСсылка)
	|		КОНЕЦ) КАК ВедомостьНеПроведена,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанныеЗаполнения.Организация) КАК КоличествоОрганизаций,
	|	МАКСИМУМ(ВТДанныеЗаполнения.ВидНалогаВзносаОтчисления) КАК ВидНалогаВзносаОтчисления,
	|	МАКСИМУМ(ВТДанныеЗаполнения.ВидПлатежа) КАК ВидПлатежа,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанныеЗаполнения.ВидНалогаВзносаОтчисления) КАК КоличествоВидНалогаВзносаОтчисления,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДанныеЗаполнения.ВидПлатежа) КАК КоличествоВидПлатежа
	|ИЗ
	|	ВТДанныеЗаполнения КАК ВТДанныеЗаполнения");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивВедомостей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РеквизитыШапки = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура("РеквизитыШапки, МассивОшибок", Неопределено, Новый Массив);
	
	Если Не РеквизитыШапки.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.РеквизитыШапки = РеквизитыШапки;
	
	Если ЗначениеЗаполнено(РеквизитыШапки.ВедомостьНеПроведена) Тогда
		Текст = НСтр("ru='Документ %Документ% не проведен. Ввод на основании непроведенного документа запрещен.'");
		Текст = СтрЗаменить(Текст, "%Документ%", РеквизитыШапки.ВедомостьНеПроведена);
		СтруктураОшибки = Новый Структура("Идентификатор, Текст", "ОшибкаПроведен", Текст);
		Результат.МассивОшибок.Добавить(СтруктураОшибки);
	КонецЕсли;
	
	
	Если РеквизитыШапки.КоличествоОрганизаций > 1 Тогда
		Текст = НСтр("ru='У выделенных ведомостей отличается поле ""Организация"". Ввод одного документа на основании выделенных ведомостей невозможен.'");
		СтруктураОшибки = Новый Структура("Идентификатор, Текст", "ОшибкаОрганизации", Текст);
		Результат.МассивОшибок.Добавить(СтруктураОшибки);
	КонецЕсли;
	
	Если РеквизитыШапки.КоличествоВидНалогаВзносаОтчисления > 1 Тогда
		Текст = НСтр("ru='У выделенных ведомостей отличается поле ""Вид налога, взноса, отчисления"". Ввод одного документа на основании выделенных ведомостей невозможен.'");
		СтруктураОшибки = Новый Структура("Идентификатор, Текст", "ОшибкаЗарплатныеПроекты", Текст);
		Результат.МассивОшибок.Добавить(СтруктураОшибки);
	КонецЕсли;
	
	Если РеквизитыШапки.КоличествоВидПлатежа > 1 Тогда
		Текст = НСтр("ru='У выделенных ведомостей отличается поле ""Вид платежа"". Ввод одного документа на основании выделенных ведомостей невозможен.'");
		СтруктураОшибки = Новый Структура("Идентификатор, Текст", "ОшибкаБанки", Текст);
		Результат.МассивОшибок.Добавить(СтруктураОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура заполняет таблицу на основании ведомостей различных типов оплаты в соответствии с отборами.
//
// Параметры:
//	ТаблицаВедомостей - ТаблицаЗначений, ТабличнаяЧасть - Заполняемая таблица
//	СтруктураПараметров - Структура - Структура отборов
//
Процедура ЗаполнитьПоВедомостямКОплате(ТаблицаВедомостей, СтруктураПараметров) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДанныеОбОплатеВедомостей(МенеджерВременныхТаблиц, СтруктураПараметров);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТВедомости.Ведомость КАК Ведомость,
	|	МАКСИМУМ(ВТВедомости.Сумма) КАК Сумма,
	|	МАКСИМУМ(ВТВедомости.СуммаПоДокументу) КАК СуммаПоДокументу
	|ИЗ
	|	ДанныеВедомостейНаОплату КАК ВТВедомости
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТВедомости.Ведомость";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока				= ТаблицаВедомостей.Добавить();
		НоваяСтрока.Ведомость	= Выборка.Ведомость;
		НоваяСтрока.Сумма 		= Выборка.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура формирует временную таблицу физических лиц по ведомостям различных типов в соответствии с параметрами.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц
//	Параметры - Структура - Структура параметров
//
Процедура ДанныеОбОплатеВедомостей(МенеджерВременныхТаблиц, Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	МассивВедомостей = Неопределено;
	Параметры.Свойство("МассивВедомостей", МассивВедомостей);

	Запрос.УстановитьПараметр("МассивВедомостей", МассивВедомостей);
	Запрос.УстановитьПараметр("БезОтбораПоВедомостям", МассивВедомостей = Неопределено Или МассивВедомостей.Количество() = 0);
	
	Работник = Неопределено;
	Параметры.Свойство("Работник", Работник);
	Запрос.УстановитьПараметр("Работник", Работник);
	Запрос.УстановитьПараметр("БезОтбораПоРаботнику", Не ЗначениеЗаполнено(Работник));

	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ведомость,
	|	ДанныеДокумента.СуммаПоДокументу КАК СуммаПоДокументу
	|ПОМЕСТИТЬ ВТВедомости
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Организация = &Организация
	|	И (&БезОтбораПоВедомостям
	|			ИЛИ ДанныеДокумента.Ссылка В (&МассивВедомостей))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Работники.Ссылка КАК Ведомость,
	|	Работники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Работники.НалогВзнос КАК Сумма
	|ПОМЕСТИТЬ ВТРаботники
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК Работники
	|ГДЕ
	|	Работники.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Ведомость
	|			ИЗ
	|				ВТВедомости КАК Т)
	|	И (&БезОтбораПоРаботнику
	|			ИЛИ Работники.ФизическоеЛицо = &Работник)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ведомость,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРаботники.Ведомость,
	|	ВТВедомости.СуммаПоДокументу,
	|	СУММА(ВТРаботники.Сумма) КАК Сумма,
	|	ЕСТЬNULL(ВедомостиПеречисление.Ссылка, ЗНАЧЕНИЕ(Документ.ПеречислениеВзносовИОтчислений.ПустаяСсылка)) КАК ПеречислениеВзносовОтчислений
	|ПОМЕСТИТЬ ДанныеВедомостейНаОплату
	|ИЗ
	|	ВТРаботники КАК ВТРаботники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВедомости КАК ВТВедомости
	|		ПО ВТРаботники.Ведомость = ВТВедомости.Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеречислениеВзносовИОтчислений.ВедомостиНаПеречислениеВзносовИОтчислений КАК ВедомостиПеречисление
	|		ПО ВТРаботники.Ведомость = ВедомостиПеречисление.Ведомость
	|			И (ВедомостиПеречисление.Ссылка.Проведен)
	|ГДЕ
	|	ЕСТЬNULL(ВедомостиПеречисление.Ссылка, ЗНАЧЕНИЕ(Документ.ПеречислениеВзносовИОтчислений.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.ПеречислениеВзносовИОтчислений.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРаботники.Ведомость,
	|	ВТВедомости.СуммаПоДокументу,
	|	ВедомостиПеречисление.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВедомости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТРаботники";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли