
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Соединение; // HTTPСоединение

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Код - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция Подключить(Код) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	КодАвторизации = Код;
	
	СтруктураМаркеров = СтруктураМаркеров();
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе = ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторПользователя;
		Результат.КодАвторизации = КодАвторизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе
Функция ИнформацияОПользователе() Экспорт
	
	ИнформацияОПользователе = РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе();
	
	Если Не УстановитьСоединение() Тогда
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/core/v1/accounts/self");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ИнформацияОПользователеAvito = ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса);
	Иначе
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеИнформацияОПользователе(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	ИнформацияОПользователе.ИдентификаторПользователя = Формат(ИнформацияОПользователеAvito.id, "ЧГ=0");
	ИнформацияОПользователе.ИмяПользователя = ИнформацияОПользователеAvito.name;
	
	Возврат ИнформацияОПользователе;
	
КонецФункции

// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция ПроверитьПодключение() Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если ЗначениеЗаполнено(РеквизитыСайта) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
		Результат.Подключен = МаркерАктивен();
	КонецЕсли;
	
	Если Результат.Подключен Тогда
		ИнформацияОПользователе = ИнформацияОПользователе();
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьКлассификаторы() Экспорт
	
	Возврат Новый ФиксированнаяСтруктура(Новый Структура());
	
КонецФункции

// Найти кандидатов.
// 
// Параметры:
//  ТаблицаНайденныхКандидатов - ТаблицаЗначений: см. Обработки.ПоискРезюмеВИнтернете.НайденныеКандидаты
//  СтруктураОтбора - Структура: см. РекрутинговыеСайтыСлужебный.СтруктураОтбораКандидатов
//  ПараметрыПоиска - Структура: см. РекрутинговыеСайтыСлужебный.НовыеПараметрыПоиска
Процедура НайтиКандидатов(ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска) Экспорт
	
	НомерСтраницы = ПараметрыПоиска.НомерСтраницы;
	ПолеСортировки = ПараметрыПоиска.ПолеСортировки;
	ВсегоКандидатов = ПараметрыПоиска.ВсегоКандидатов;
	
	СтрокаОтбора = СтрокаОтбора(СтруктураОтбора, НомерСтраницы);
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/job/v1/resumes?" + СтрокаОтбора);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоискаРезюме(Сайт, ЭтотОбъект, РезультатЗапроса)
	Иначе
		РезультатПоискаРезюме = ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса);
		
		Если РезультатПоискаРезюме.resumes = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВсегоКандидатов = ЗначениеСвойстваУзла(РезультатПоискаРезюме, "meta", "pages")
			* ЗначениеСвойстваУзла(РезультатПоискаРезюме, "meta", "per_page");
		
		ПараметрыПоиска.ВсегоКандидатов = Мин(Число(ВсегоКандидатов), 500);
		
		ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  Массив из См. СтруктураПоля
Функция ПоляВакансии(ОбновлениеПубликации = Ложь, ПовторнаяПубликация = Ложь) Экспорт
	
	ТипЗначенияJSONСтрока = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONСтрока();
	ТипЗначенияJSONНачалоОбъекта = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоОбъекта();
	ТипЗначенияJSONЧисло = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONЧисло();

	МассивПолей = Новый Массив;
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "name";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Название (не более 50 символов)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "description";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Описание (от 200 до 5000)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "billing_type";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Вариант платного размещения'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "business_area";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Сфера деятельности'");
	СтруктураПоля.Обязательное = Не ОбновлениеПубликации;
	СтруктураПоля.Использование = Не ОбновлениеПубликации И Не ПовторнаяПубликация;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "address";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Полный адрес объекта (не более 256 символов)'");
	СтруктураПоля.Обязательное = Не ОбновлениеПубликации;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "salary";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Зарплата, рублей в месяц'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "schedule";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'График работы'");
	СтруктураПоля.Обязательное = Истина;
	СтруктураПоля.Использование = Не ОбновлениеПубликации И Не ПовторнаяПубликация;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "experience";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Опыт работы'");
	СтруктураПоля.Обязательное = Не ОбновлениеПубликации;
	МассивПолей.Добавить(СтруктураПоля);

	Возврат МассивПолей;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Строка
Функция АдресВакансии(ИдентификаторВакансии) Экспорт
	
	Результат = "";
	
	Если Не УстановитьСоединение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/core/v1/accounts/%1/items/%2", ИдентификаторПользователя, ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ИнформацияОбОбъявлении = ПрочитатьОтветАдресВакансии(РезультатЗапроса);
	Иначе
		ВызватьИсключение СтрШаблон("%1:%2", РезультатЗапроса.КодСостояния, РезультатЗапроса.ТелоОтвета);
	КонецЕсли;
	
	Результат = ИнформацияОбОбъявлении["url"];
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИдентификаторРезюмеПоАдресу(АдресРезюме) Экспорт
	
	ИдентификаторРезюме = АдресРезюме;
	
	Разделитель = "_";
	
	Пока РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель) > 0 Цикл
		НомерВхожденияРазделителя = 
			РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
		ИдентификаторРезюме = 
			Сред(ИдентификаторРезюме, 
				НомерВхожденияРазделителя + СтрДлина(Разделитель), 
				СтрДлина(ИдентификаторРезюме) - НомерВхожденияРазделителя);
	КонецЦикла;
	
	Возврат ИдентификаторРезюме;

КонецФункции

// Параметры:
//  ИдентификаторРезюме - Строка
// 
// Возвращаемое значение:
//  Структура
Функция ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме) Экспорт
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	Если ЗначениеЗаполнено(СтруктураРезюме) Тогда
		ДанныеКандидата = ДанныеКандидатаПоРезюме(СтруктураРезюме);
		
		ДанныеКандидата.Комментарии = ЗначениеСвойстваУзла(СтруктураРезюме, "Комментарии");
		ДанныеКандидата.ДанныеПубликации = СтруктураРезюме;
	Иначе
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстИсключенияПриОшибкеЗагрузкиРезюмеПоСсылке(Сайт);
	КонецЕсли;
	
	Возврат ДанныеКандидата;

КонецФункции

Функция ЭлементКлассификатора(ИмяСписка, Значение) Экспорт
	
	ЭлементКлассификатора = Неопределено;
	ИмяКлассификатора = "";
	
	ИменаСписковВыбора = РекрутинговыеСайтыСлужебный.ИменаСписковВыбора();
	Если ИмяСписка = ИменаСписковВыбора.Пол Тогда
		ИмяКлассификатора = "gender";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.УровеньОбразования Тогда
		ИмяКлассификатора = "education_level";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.ПериодРазмещения Тогда
		ИмяКлассификатора = "periods";
	Иначе
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	Классификатор = СписокВыбораПоКлассификатору(ИмяКлассификатора);
	
	Найдено = Ложь;
	Для Каждого Элемент Из Классификатор Цикл
		ЗначениеСравнения = НРег(СокрЛП(Элемент.Представление));
		
		Если ЗначениеСравнения = НРег(Значение) Тогда
			Найдено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Найдено Тогда
		ЭлементКлассификатора = Элемент.Значение;
	КонецЕсли;
	
	Возврат ЭлементКлассификатора;
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Показатель = Вакансия;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "title");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "name";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "description");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "description";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "address");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "address";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "business_area");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "business_area";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "experience");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "experience";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "schedule");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "schedule";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидыПолей(ОбновлениеПубликации) Экспорт
	
	ВидыПолей = РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	
	ВидыПолей.СОдиночнымВыборомИзСписка = ПоляВакансииСОдиночнымВыборомИзСписка();
	ВидыПолей.НедоступныеДляРедактирования = ПоляВакансииНедоступныеДляРедактирования();
	
	Возврат ВидыПолей;
	
КонецФункции

// Параметры:
//  Путь - Строка
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка
Функция СписокВыбораПоКлассификатору(Путь) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	Если Путь = "billing_type" Тогда
		СписокВыбора.Добавить("package", НСтр("ru = 'при наличии подходящего пакета размещения'"));
		СписокВыбора.Добавить("packageOrSingle", НСтр("ru = 'если нет подходящего пакета, то разовое размещение'"));
		СписокВыбора.Добавить("single", НСтр("ru = 'только разовое размещение'"));
	ИначеЕсли Путь = "business_area" Тогда
		СписокВыбора.Добавить(1, НСтр("ru = 'IT, интернет, телеком'"));
		СписокВыбора.Добавить(13, НСтр("ru = 'Медицина, фармацевтика'"));
		СписокВыбора.Добавить(17, НСтр("ru = 'Продажи'"));
		СписокВыбора.Добавить(19, НСтр("ru = 'Страхование'"));
		СписокВыбора.Добавить(21, НСтр("ru = 'Транспорт, логистика'"));
		СписокВыбора.Добавить(14, НСтр("ru = 'Образование, наука'"));
		СписокВыбора.Добавить(20, НСтр("ru = 'Строительство'"));
		СписокВыбора.Добавить(22, НСтр("ru = 'Туризм, рестораны'"));
		СписокВыбора.Добавить(24, НСтр("ru = 'Фитнес, салоны красоты'"));
		СписокВыбора.Добавить(15, НСтр("ru = 'Без опыта, студенты'"));
		СписокВыбора.Добавить(7, НСтр("ru = 'Автомобильный бизнес'"));
		СписокВыбора.Добавить(2, НСтр("ru = 'Бухгалтерия, финансы'"));
		СписокВыбора.Добавить(9, НСтр("ru = 'Высший менеджмент'"));
		СписокВыбора.Добавить(16, НСтр("ru = 'Госслужба, НКО'"));
		СписокВыбора.Добавить(10124, НСтр("ru = 'ЖКХ, эксплуатация'"));
		СписокВыбора.Добавить(11, НСтр("ru = 'Искусство, развлечения'"));
		СписокВыбора.Добавить(12, НСтр("ru = 'Консультирование'"));
		СписокВыбора.Добавить(3, НСтр("ru = 'Маркетинг, реклама, PR'"));
		СписокВыбора.Добавить(8, НСтр("ru = 'Охрана, безопасность'"));
		СписокВыбора.Добавить(6, НСтр("ru = 'Управление персоналом'"));
		СписокВыбора.Добавить(23, НСтр("ru = 'Юриспруденция'"));
		СписокВыбора.Добавить(4, НСтр("ru = 'Административная работа'"));
		СписокВыбора.Добавить(5, НСтр("ru = 'Банки, инвестиции'"));
		СписокВыбора.Добавить(18, НСтр("ru = 'Производство, сырьё, с/х'")); // АПК:163 Значение классификатора
		СписокВыбора.Добавить(27, НСтр("ru = 'Домашний персонал'"));
	ИначеЕсли Путь = "schedule" Тогда
		СписокВыбора.Добавить("flyInFlyOut", НСтр("ru = 'Вахтовый метод'"));
		СписокВыбора.Добавить("partTime", НСтр("ru = 'Неполный день'"));
		СписокВыбора.Добавить("fullDay", НСтр("ru = 'Полный день'"));
		СписокВыбора.Добавить("flexible", НСтр("ru = 'Свободный график'"));
		СписокВыбора.Добавить("shift", НСтр("ru = 'Сменный график'"));
		СписокВыбора.Добавить("remote", НСтр("ru = 'Удаленная работа'"));
	ИначеЕсли Путь = "experience" Тогда
		СписокВыбора.Добавить("noMatter", НСтр("ru = 'Не имеет значения'"));
		СписокВыбора.Добавить("moreThan1", НСтр("ru = 'Более 1 года'"));
		СписокВыбора.Добавить("moreThan3", НСтр("ru = 'Более 3 лет'"));
		СписокВыбора.Добавить("moreThan5", НСтр("ru = 'Более 5 лет'"));
		СписокВыбора.Добавить("moreThan10", НСтр("ru = 'Более 10 лет'"));
	ИначеЕсли Путь = "gender" Тогда
		СписокВыбора.Добавить("male", НСтр("ru = 'Мужской'"));
		СписокВыбора.Добавить("female", НСтр("ru = 'Женский'"));
	ИначеЕсли Путь = "education_level" Тогда
		СписокВыбора.Добавить("secondary", НСтр("ru = 'Среднее'"));
		СписокВыбора.Добавить("special-secondary", НСтр("ru = 'Среднее специальное'"));
		СписокВыбора.Добавить("unfinished-higher", НСтр("ru = 'Незаконченное высшее'"));
		СписокВыбора.Добавить("higher", НСтр("ru = 'Высшее'"));
	ИначеЕсли Путь = "periods" Тогда
		СписокВыбора.Добавить(0, НСтр("ru = 'За все время'"));
		СписокВыбора.Добавить(1, НСтр("ru = 'За последние 24 часа'"));
		СписокВыбора.Добавить(3, НСтр("ru = 'За последние 3 дня'"));
		СписокВыбора.Добавить(7, НСтр("ru = 'За последнюю неделю'"));
		СписокВыбора.Добавить(14, НСтр("ru = 'За последние 2 недели'"));
		СписокВыбора.Добавить(30, НСтр("ru = 'За последний 1 месяц'"));
		СписокВыбора.Добавить(60, НСтр("ru = 'За последние 2 месяца'"));
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОпубликоватьВакансию(Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево);
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/job/v1/vacancies");
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 201 Тогда
		СтруктураВакансии = ПрочитатьОтветВакансия(РезультатЗапроса);
		Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией(СтруктураВакансии.id);
	Иначе
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Вакансия - СправочникСсылка.Вакансии
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ПовторноОпубликоватьВакансию(Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Результат = РеактивироватьВакансию(ИдентификаторВакансии, Дерево);
	
	Если Не Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Вакансия - СправочникСсылка.Вакансии
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура - см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево, Истина);
	
	Если Не ЗначениеЗаполнено(JSONОписаниеВакансии) Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/job/v1/vacancies/%1", ИдентификаторВакансии));
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция СнятьПубликациюВакансии(ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/job/v1/vacancies/archived/%1", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
// - Неопределено
// - Структура: см. РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии
Функция СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Если Не УстановитьСоединение() Тогда
		Возврат СвойстваПубликации;
	КонецЕсли;
	
	Описание = ОписаниеПубликацииВакансии(ИдентификаторВакансии, Ложь);
	Если ЗначениеЗаполнено(Описание) Тогда
		СвойстваПубликации.Опубликована = ЗначениеСвойстваУзла(Описание, "is_active");
		
		Если СвойстваПубликации.Опубликована Тогда
			СвойстваПубликации.ДатаПубликации = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Описание, "start_time"));
			СвойстваПубликации.ДатаОбновления = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Описание, "update_time"));
		Иначе
			Если ЗначениеЗаполнено(СвойстваПубликации.ДатаПубликации) Тогда
				СвойстваПубликации.ДатаСнятияСПубликации =
					Мин(ДобавитьМесяц(СвойстваПубликации.ДатаПубликации, 1), ТекущаяДатаСеанса());
			Иначе
				СвойстваПубликации.ДатаСнятияСПубликации = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СвойстваПубликации;
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Реквизит = "Наименование" Тогда
		ЗначениеСвойства = ЗначениеСвойстваУзла(Вакансия, "title");
		Результат = ?(ЗначениеЗаполнено(ЗначениеСвойства), ЗначениеСвойства, "");
	ИначеЕсли Реквизит = "ПредполагаемыйДоход" Тогда
		ЗначениеСвойства = ЗначениеСвойстваУзла(Вакансия, "salary");
		Результат = ?(ЗначениеЗаполнено(ЗначениеСвойства), ЗначениеСвойства, 0);
	ИначеЕсли Реквизит = "ДатаОткрытия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Вакансия, "start_time"));
	ИначеЕсли Реквизит = "ПланируемаяДатаЗакрытия" Тогда
		Результат = ДобавитьМесяц(РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Вакансия, "start_time")), 1);
	ИначеЕсли Реквизит = "Требования" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Требования;
	ИначеЕсли Реквизит = "Обязанности" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Обязанности;
	ИначеЕсли Реквизит = "Условия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Условия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВакансииССайта(БылиОшибки = Ложь) Экспорт
	
	МассивВакансий = Новый Массив;
	
	Если Не УстановитьСоединение() Тогда
		БылиОшибки = Истина;
		Возврат МассивВакансий;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/core/v1/items?category=111&per_page=99");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		БылиОшибки = Истина;
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансий(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		Вакансии = ПрочитатьОтветВакансииССайта(РезультатЗапроса);
		
		Для Каждого Вакансия Из Вакансии Цикл
			Описание = ОписаниеПубликацииВакансии(Формат(Вакансия.id, "ЧГ=0"));
			Если ЗначениеЗаполнено(Описание) Тогда
				МассивВакансий.Добавить(Описание);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВакансий;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
Процедура ПолучитьОтклики(Вакансия) Экспорт
	
	ИдентификаторВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторВакансии(Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторВакансии) Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОтсутствииПубликации(Сайт);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуПолученияОткликов(Сайт, Пользователь);
		Возврат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияОткликов = Новый Массив;
	
	ТекстЗапроса = СтрШаблон("/job/v1/negotiations?vacancy_id=%1", Формат(ИдентификаторВакансии, "ЧН=0; ЧГ="));
	ПолучитьВсеСтраницыРесурса(ТекстЗапроса, "result", КоллекцияОткликов);
	
	МаксимальныйНомерОтклика = РекрутинговыеСайтыСлужебный.МаксимальныйНомерОтклика(Вакансия);
	ЗагруженныеОткликиВакансии = РекрутинговыеСайтыСлужебный.ЗагруженныеОткликиВакансии(Вакансия);
	
	Отклики = ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("ОткликиКандидатов");
	
	Для Каждого Отклик Из КоллекцияОткликов Цикл
		Если Отклик.Свойство("resume") Тогда
			ИдентификаторРезюме = Отклик["resume"]["id"];
		Иначе
			ИдентификаторРезюме = Отклик["id"];
		КонецЕсли;
		
		ИдентификаторРезюме = Формат(ИдентификаторРезюме, "ЧГ=0");
		
		Если Не ЗагруженныеОткликиВакансии.Найти(ИдентификаторРезюме) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КонтактныеДанные = Отклик["contact"];
		
		СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(КонтактныеДанные["name"]);
		
		НоваяЗапись = Отклики.Добавить();
		НоваяЗапись.Вакансия = Вакансия;
		НоваяЗапись.НомерОтклика = МаксимальныйНомерОтклика + 1;
		НоваяЗапись.Имя = СтруктураФИО.Имя;
		НоваяЗапись.Фамилия = СтруктураФИО.Фамилия;
		НоваяЗапись.Отчество = СтруктураФИО.Отчество;
		НоваяЗапись.Источник = Сайт;
		НоваяЗапись.Рассмотрено = Отклик["called"];
		НоваяЗапись.ДатаОтклика = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(Отклик["created_at"]);
		
		Если КонтактныеДанные.Свойство("phone") Тогда
			НоваяЗапись.Телефон = КонтактныеДанные["phone"];
		КонецЕсли;
		
		Если Отклик.Свойство("resume") Тогда
			НоваяЗапись.АдресРезюме = "https://www.avito.ru" + Отклик["resume"]["url"];
			НоваяЗапись.Адрес = Отклик["resume"]["params"]["address"];
		КонецЕсли;
		
		НоваяЗапись.ИдентификаторРезюме = ИдентификаторРезюме;
		
		МаксимальныйНомерОтклика = МаксимальныйНомерОтклика + 1;
	КонецЦикла;
	
	РекрутинговыеСайтыСлужебный.ЗаписатьОтклики(Сайт, Вакансия, Отклики);
	
КонецПроцедуры

// Параметры:
//  Классификатор - Строка
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  Булево
Функция ЗаполнитьДеревоКлассификатора(Классификатор, Дерево) Экспорт
	
	Результат = Ложь;
	
	Если Классификатор = "areas_towns" Тогда
		Дерево = ДеревоРегионов();
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Структура: см. ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме
Функция ДоступныеДляПолученияКонтакты(АдресРезюме) Экспорт
	
	ДоступностьКонтактов = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме);
	
	Возврат ДоступностьКонтактов;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме
Функция КонтактыРезюме(АдресРезюме) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме();
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
	Если Не УстановитьСоединение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/job/v1/resumes/" + ИдентификаторРезюме + "/contacts");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибки(
			НСтр("ru = 'Не удалось получить контакты резюме.'"), Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Контакты = ПрочитатьОтветКонтактыРезюме(РезультатЗапроса);
	
	ЗаполнитьЗначенияСвойств(Результат, ФизическиеЛицаКлиентСервер.ЧастиИмени(Контакты["name"]));
	
	Для Каждого Контакт Из Контакты["contacts"] Цикл
		Если Контакт["type"] = "e-mail" Тогда
			Результат.ЭлектроннаяПочта = Контакт["value"];
		ИначеЕсли Контакт["type"] = "phone" Тогда
			Результат.Телефон = Контакт["value"];
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки) Экспорт
	
	УточненноеОписаниеОшибки = "";
	
	Если СтрНайти(ОписаниеОшибки, "Payment required") <> 0 Тогда
		УточненноеОписаниеОшибки = НСтр("ru = 'Требуется оплата.'");
	ИначеЕсли СтрНайти(ОписаниеОшибки, "invalid_grant") <> 0 Тогда
		УточненноеОписаниеОшибки = РекрутинговыеСайтыСлужебный.ОписаниеОшибкиАвторизации();
	ИначеЕсли СтрНайти(ОписаниеОшибки, "not_enough_purchased_services") <> 0 Тогда
		УточненноеОписаниеОшибки = РекрутинговыеСайтыСлужебный.ОписаниеНеоплаченныхУслуг();
	КонецЕсли;
	
	Возврат УточненноеОписаниеОшибки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьСоединение()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(МаркерДоступа) Тогда
		Результат = Инициализировать();
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Соединение = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Инициализировать()
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если РеквизитыСайта = Неопределено Или Не ЗначениеЗаполнено(РеквизитыСайта.МаркерДоступа) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не настроена интеграция с %1.'"), АдресСайта());
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
	
	Возврат МаркерАктивен();
	
КонецФункции

Функция МетодыЗапросов()
	
	Возврат РекрутинговыеСайтыСлужебный.МетодыЗапросов();
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Метод, Запрос, ВызыватьИсключение = Истина) Экспорт
	
	Возврат РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос, ВызыватьИсключение);
	
КонецФункции

// Параметры:
//  Обновление - Булево
// 
// Возвращаемое значение:
// Структура: см. РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров
Функция СтруктураМаркеров(Обновление = Ложь)
	
	СтруктураМаркеров = РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров();
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляАвитоРабота();
	Структура_token_uri = ОбщегоНазначенияКлиентСервер.СтруктураURI(ИдентификаторПриложения.token_uri);
	АдресАутентификации = Структура_token_uri.Хост;
	
	Если Обновление Тогда
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1?grant_type=refresh_token&client_id=%2&client_secret=%3&refresh_token=%4",
					Структура_token_uri.ПутьНаСервере,
					ИдентификаторПриложения.client_id,
					ИдентификаторПриложения.client_secret,
					МаркерОбновления);
	Иначе
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1?grant_type=authorization_code&client_id=%2&client_secret=%3&code=%4",
					Структура_token_uri.ПутьНаСервере,
					ИдентификаторПриложения.client_id,
					ИдентификаторПриложения.client_secret,
					КодАвторизации);
	КонецЕсли;

	СоединениеАутентификации = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресАутентификации, Истина);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	
	РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
		СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	// Авито при ошибках возвращает 200
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат СтруктураМаркеров;
	КонецЕсли;
	
	ОтветОбъект = ПрочитатьОтветМаркерыДоступа(РезультатЗапроса);
	
	Если ОтветОбъект.Свойство("error") Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат СтруктураМаркеров;
	КонецЕсли;
	
	СтруктураМаркеров.МаркерДоступа = ОтветОбъект.access_token;
	СтруктураМаркеров.МаркерОбновления = ОтветОбъект.refresh_token;
	СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа = ТекущаяДатаСеанса() + ОтветОбъект.expires_in;
	
	МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
	МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
	ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
	
	Возврат СтруктураМаркеров;
	
КонецФункции

Функция МаркерАктивен()
	
	МаркерДействителен = ЗначениеЗаполнено(МаркерДоступа) 
			И ДатаОкончанияДействияМаркераДоступа > ТекущаяДатаСеанса();
		
	МаркерАктивен = Ложь;
		
	Если МаркерДействителен Тогда
		МаркерАктивен = СайтДоступен();
	КонецЕсли;
		
	Если Не МаркерАктивен И ЗначениеЗаполнено(МаркерОбновления) Тогда
		РезультатОбновления = ОбновитьМаркеры();
		Если ЗначениеЗаполнено(РезультатОбновления.МаркерДоступа) Тогда
			МаркерАктивен = Истина;
			РезультатОбновления.Пользователь = Пользователь;
			РекрутинговыеСайтыСлужебный.СохранитьНастройкиАвторизации(РезультатОбновления);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МаркерАктивен;
	
КонецФункции

Функция СайтДоступен()
	
	Возврат ЗначениеЗаполнено(ИнформацияОПользователе().ИмяПользователя);
	
КонецФункции

Функция ОбновитьМаркеры()
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	Результат.Сайт = Сайт;
	
	СтруктураМаркеров = СтруктураМаркеров(Истина);
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе= ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторКомпании;
		Результат.КодАвторизации = КодАвторизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйHTTPЗапрос(ТекстЗапроса)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/json");
	
	Если ЗначениеЗаполнено(МаркерДоступа) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + МаркерДоступа);
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
	
	Возврат Запрос;
	
КонецФункции

Функция АдресСервера()
	
	Возврат ДанныеСайта.АдресЗапроса;
	
КонецФункции

Функция АдресСайта()
	
	Возврат ДанныеСайта.ИмяСайта;
	
КонецФункции

Функция ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветМаркерыДоступа(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветАдресВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветВакансия(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветКонтактыРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветСтруктураРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветВакансииССайта(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект.resources;
	
КонецФункции

Функция ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  СтрокаJSON - Строка
//  ПрочитатьВСоответствие - Булево
// 
// Возвращаемое значение:
//  см. РекрутинговыеСайтыСлужебный.ПарсерJSON
Функция ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь)
	
	Возврат РекрутинговыеСайтыСлужебный.ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие);
	
КонецФункции

// Возвращаемое значение:
// см. РекрутинговыеСайтыСлужебный.СтруктураПоля
Функция СтруктураПоля()
	
	Возврат РекрутинговыеСайтыСлужебный.СтруктураПоля();
	
КонецФункции

Функция СтруктураРезюмеССайта(ИдентификаторРезюме, ПолучатьФото = Истина, ПолучатьКонтакты = Ложь)
	
	Резюме = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Резюме;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/job/v2/resumes/" + ИдентификаторРезюме + "?photos=true");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоОписанию(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Резюме = ПрочитатьОтветСтруктураРезюме(РезультатЗапроса);
	
	Если ПолучатьФото Тогда
		Фотографии = ЗначениеСвойстваУзла(Резюме, "photos");
		Если ЗначениеЗаполнено(Фотографии) Тогда
			АдресФото = Фотографии[0]["url"];
			Если ЗначениеЗаполнено(АдресФото) Тогда
				Резюме.Вставить("Фото", РекрутинговыеСайтыСлужебный.КартинкаПоАдресу(АдресФото));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПолучатьКонтакты = Резюме["is_purchased"] Или ПолучатьКонтакты;
	
	Если ПолучатьКонтакты Тогда
		Запрос = НовыйHTTPЗапрос("/job/v1/resumes/" + ИдентификаторРезюме + "/contacts/");
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	КонецЕсли;
	
	Контакты = ПрочитатьОтветКонтактыРезюме(РезультатЗапроса);
	Резюме.Вставить("contact_name", ЗначениеСвойстваУзла(Контакты, "name"));
	Резюме.Вставить("contacts", ЗначениеСвойстваУзла(Контакты, "contacts"));
	
	Резюме.Вставить("Комментарии", Новый Массив());
	
	Возврат Резюме;
	
КонецФункции

// Параметры:
//  СтруктураРезюме - Структура: см. СтруктураРезюмеССайта
// 
// Возвращаемое значение:
//  Структура: см. ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата
Функция ДанныеКандидатаПоРезюме(СтруктураРезюме)
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	ДанныеКандидата.ИсточникИнформации = Сайт;

	ЗаполнитьДоступностьКонтактов(ДанныеКандидата.ДоступностьКонтактов, СтруктураРезюме);

	// Адрес резюме
	АдресРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "url", , Неопределено);
	Если Не АдресРезюме = Неопределено Тогда
		ДанныеКандидата.АдресРезюме = СтрШаблон("https://www.avito.ru%1", АдресРезюме);
	КонецЕсли;
	
	// ФИО
	ФИО = ЗначениеСвойстваУзла(СтруктураРезюме, "contact_name", , , Неопределено);
	Если Не ФИО = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДанныеКандидата, ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО));
	КонецЕсли;
	
	// Контактная информация
	ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, ДанныеКандидата.КонтактнаяИнформация);
	
	// Пол
	Пол = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "pol", , Неопределено);
	Если Не Пол = Неопределено Тогда
		Если Пол = "Мужской" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли Пол = "Женский" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		КонецЕсли;
	КонецЕсли;
	
	// Гражданство
	СтранаГражданства = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "nationality", , Неопределено);
	Если Не СтранаГражданства = Неопределено Тогда
		СтруктураГражданство = Новый Структура("Страна, Дата");
		СтруктураГражданство.Страна = СтранаГражданства;
		ДанныеКандидата.Гражданство.Добавить(СтруктураГражданство);
	КонецЕсли;
	
	// Образование
	ЗаполнитьМассивОбразование(СтруктураРезюме, ДанныеКандидата.Образование);
	
	// Трудовая деятельность
	МестаРаботы = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "experience_list", , Неопределено);
	Если Не МестаРаботы = Неопределено Тогда
		Для Каждого МестоРаботы Из МестаРаботы Цикл
			СтруктураТрудоваяДеятельность = РекрутинговыеСайтыСлужебный.НовыйОпытРаботы();
			СтруктураТрудоваяДеятельность.Компания = ЗначениеСвойстваУзла(МестоРаботы, "company");
			ДатаНачала = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(МестоРаботы, "work_start"), Ложь);
			ДатаОкончания = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(МестоРаботы, "work_finish"), Ложь);
			Если ЗначениеЗаполнено(ДатаНачала) Тогда
				СтруктураТрудоваяДеятельность.ДатаНачала = ДатаНачала;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДатаОкончания) Тогда
				СтруктураТрудоваяДеятельность.ДатаОкончания = ДатаОкончания;
			КонецЕсли;
			СтруктураТрудоваяДеятельность.Должность = ЗначениеСвойстваУзла(МестоРаботы, "position");
			СтруктураТрудоваяДеятельность.Обязанности = ЗначениеСвойстваУзла(МестоРаботы, "responsibilities");
			ДанныеКандидата.ТрудоваяДеятельность.Добавить(СтруктураТрудоваяДеятельность);
		КонецЦикла;
	КонецЕсли;
	
	// Знание языков
	ЗнанияЯзыков = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "language_list", , Неопределено);
	Если Не ЗнанияЯзыков = Неопределено Тогда
		Для Каждого ЗнаниеЯзыка Из ЗнанияЯзыков Цикл
			СтруктураЗнаниеЯзыков = РекрутинговыеСайтыСлужебный.НовоеЗнаниеЯзыка();
			СтруктураЗнаниеЯзыков.Язык = ЗначениеСвойстваУзла(ЗнаниеЯзыка, "language");
			СтруктураЗнаниеЯзыков.СтепеньЗнанияЯзыкаКандидата =
				СтепеньЗнанияЯзыкаПоИдентификатору(ЗначениеСвойстваУзла(ЗнаниеЯзыка, "language_level"));
			ДанныеКандидата.ЗнаниеЯзыков.Добавить(СтруктураЗнаниеЯзыков);
		КонецЦикла;
	КонецЕсли;
	
	// Ожидаемый доход
	ДанныеКандидата.ОжидаемыйДоход = ЗначениеСвойстваУзла(СтруктураРезюме, "salary", , , Неопределено);
	
	// О себе
	СтрокаОСебе = ЗначениеСвойстваУзла(СтруктураРезюме, "description");
	
	// Авито не возвращает дату рождения, только возраст.
	Возраст = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "age");
	Если ЗначениеЗаполнено(Возраст) Тогда
		СтрокаОСебе = СтрШаблон(НСтр("ru = 'Возраст: %1'"), Возраст) + Символы.ПС + СтрокаОСебе;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаОСебе) Тогда
		РекрутинговыеСайтыСлужебный.ЗаменитьУпрСимволы(СтрокаОСебе);
		ДанныеКандидата.ОСебе = СтрокаОСебе;
	КонецЕсли;
	
	// Фото
	ДанныеКандидата.Фото = ЗначениеСвойстваУзла(СтруктураРезюме, "Фото");
	
	Возврат ДанныеКандидата;
	
КонецФункции

Функция СтруктураКонтактнойИнформации() Экспорт
	
	СтруктураКонтактнойИнформации = Новый Структура();
	
	СтруктураКонтактнойИнформации.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка());
	СтруктураКонтактнойИнформации.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	СтруктураКонтактнойИнформации.Вставить("Представление", "");
	
	Возврат СтруктураКонтактнойИнформации
	
КонецФункции

// Параметры:
//  Узел - Структура
//  ИмяСвойства - Строка
//  ИмяСвойстваВторогоУровня - Неопределено, Строка -
//  ИмяСвойстваТретьегоУровня - Неопределено, Строка -
//  ЗначениеПоУмолчанию - Строка
// 
// Возвращаемое значение:
//  Строка, Массив, Произвольный -
Функция ЗначениеСвойстваУзла(Узел, ИмяСвойства, ИмяСвойстваВторогоУровня = Неопределено, ИмяСвойстваТретьегоУровня = Неопределено, ЗначениеПоУмолчанию = "")
	
	Возврат РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(
				Узел, ИмяСвойства, ИмяСвойстваВторогоУровня, ИмяСвойстваТретьегоУровня, ЗначениеПоУмолчанию);
	
КонецФункции

Процедура ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме)
	
	ДоступПриобретен = ЗначениеСвойстваУзла(СтруктураРезюме, "is_purchased", , Неопределено);

	Если ДоступПриобретен = Ложь Тогда
		ДоступностьКонтактов.КонтактыОткрыты = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция СтепеньЗнанияЯзыкаПоИдентификатору(Идентификатор)
	
	Если Идентификатор = "basic" Тогда // начальный
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.A1;
	ИначеЕсли Идентификатор = "middle" Тогда // средний
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B1;
	ИначеЕсли Идентификатор = "upper-middle" Тогда // выше среднего
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B2;
	Иначе // свободное владение
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.C2;
	КонецЕсли;
	
	Возврат Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(УровеньВладенияЯзыком);
	
КонецФункции

// Параметры:
//  СтруктураОтбора - Структура
//  НомерСтраницы - Число
// 
// Возвращаемое значение:
// Строка
Функция СтрокаОтбора(СтруктураОтбора, НомерСтраницы)
	
	СтрокаОтбора = "per_page=99&page=" + (НомерСтраницы + 1);
	
	СоответствиеПолей = СоответствиеПолейПоискаКандидатов();
	
	Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
		
		ИмяПараметра = СоответствиеПолей.Получить(КлючИЗначение.Ключ);
		
		Если Не ЗначениеЗаполнено(ИмяПараметра) Тогда
			Продолжить;
		КонецЕсли;

		ЗначениеПоля = КлючИЗначение.Значение;

		Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
			ЗначениеПоля = Формат(ЗначениеПоля, "ЧН=0; ЧГ=0");
		ИначеЕсли ТипЗнч(ЗначениеПоля) = Тип("Дата") Тогда
			ЗначениеПоля = Формат(ЗначениеПоля, "ДЛФ=Д");
		ИначеЕсли ТипЗнч(ЗначениеПоля) = Тип("Булево") Тогда
			Если КлючИЗначение.Ключ = "ТолькоВНазвании" Тогда
				ЗначениеПоля = Формат(ЗначениеПоля, "БЛ=fullthrottle; БИ=simple")
			Иначе
				ЗначениеПоля = Формат(ЗначениеПоля, "БЛ=false; БИ=true");
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеПоля) = Тип("СписокЗначений") Тогда
			Если КлючИЗначение.Ключ = "Регион" Тогда
				Индекс = 0;
				Для Каждого ЭлементСписка Из ЗначениеПоля Цикл
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
						Идентификатор = "";
						
						Если ЭлементСписка.Значение.Свойство("IDAvito") Тогда
							Если Не ЭлементСписка.Значение.Свойство("IDAvito", Идентификатор) Тогда
								Продолжить;
							КонецЕсли;
						ИначеЕсли ЭлементСписка.Значение.Свойство("ИдентификаторОбщий") Тогда
							Идентификатор = ЭлементСписка.Значение.ИдентификаторОбщий;
						Иначе
							Продолжить;
						КонецЕсли;
						
					Иначе
						Идентификатор = ЭлементСписка.Значение;
					КонецЕсли;
					
					Если Индекс = 0 Тогда
						СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						"&%1=%2", ИмяПараметра, Формат(Идентификатор, "ЧГ=0"));
					Иначе
						СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						",%1", Формат(Идентификатор, "ЧГ=0"));
					КонецЕсли;
					
					Индекс = Индекс + 1;
				КонецЦикла;
				
				Продолжить;
				
			ИначеЕсли ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ЗначениеПоля = ЗначениеПоля[0];
				
				Если ТипЗнч(ЗначениеПоля.Значение) = Тип("Структура") Тогда
					Если ЗначениеПоля.Значение.Свойство("IDAvito") Тогда
						ЗначениеПоля = ЗначениеПоля.Значение.IDAvito;
					Иначе
						Продолжить;
					КонецЕсли;
				Иначе
					ЗначениеПоля = ЗначениеПоля.Значение
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если КлючИЗначение.Ключ = "ПериодРазмещения" Тогда
			Если ЗначениеПоля = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеПоля = РекрутинговыеСайтыСлужебный.ДатаRFC3339(-ЗначениеПоля*86400);
		КонецЕсли;
	
		СтрокаОтбора = СтрокаОтбора
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("&%1=%2", ИмяПараметра, ЗначениеПоля);
	КонецЦикла;

	Возврат СтрокаОтбора;
	
КонецФункции

Функция СсылкаНаРезюме(ИдентификаторРезюме)
	
	СсылкаНаРезюме = "";
	
	Попытка
		Резюме = СтруктураРезюмеССайта(ИдентификаторРезюме, Ложь, Ложь);
	Исключение
		Возврат СсылкаНаРезюме;
	КонецПопытки;

	Если ЗначениеЗаполнено(Резюме) Тогда
		СсылкаНаРезюме = "https://www.avito.ru" + Резюме["url"];
	КонецЕсли;
	
	Возврат СсылкаНаРезюме;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Обновление - Булево
// 
// Возвращаемое значение:
//  Строка
Функция JSONОписаниеВакансии(Дерево, Обновление = Ложь, Реактивация = Ложь)
	
	СтрокаJSON = "";
	
	СтруктураОписанияВакансииAvito = СтруктураОписанияВакансии(Дерево, Обновление, Реактивация);
	СтрокаJSON = РекрутинговыеСайтыСлужебный.ЗаписьJSON(СтруктураОписанияВакансииAvito);
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция СтруктураОписанияВакансии(Дерево, Обновление = Ложь, Реактивация = Ложь)
	
	СтруктураВакансии = Новый Структура;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Если ТипЗнч(СтрокаДерева.Показатель) = Тип("СправочникСсылка.Вакансии") Тогда
			Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
				ДополнитьСтруктуруВакансииПростымОбъектом(СтруктураВакансии, СтрокаДереваПодчиненная, Обновление, Реактивация);
				ДополнитьСтруктуруВакансииОбъектом(СтруктураВакансии, СтрокаДереваПодчиненная, Обновление, Реактивация);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураВакансии;
	
КонецФункции

Процедура ДополнитьСтруктуруВакансииПростымОбъектом(СтруктураВакансии, СтрокаДерева, Обновление, Реактивация)
	
	Если Реактивация Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (СтрокаДерева.ТипРеквизита = "Строка"
		Или СтрокаДерева.ТипРеквизита = "Булево"
		Или СтрокаДерева.ТипРеквизита = "Число") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаДерева.ПубликацияВакансии) Тогда
		Возврат;
	КонецЕсли;
	
	Если Обновление И Не СтрокаДерева.СтрокаИзменена Тогда
		
		Если СтрокаДерева.Путь = "name" Или СтрокаДерева.Путь = "description" Тогда
			Если Не СтрокаДерева.ВакансияВПрограммеТекст = СтрокаДерева.ПубликацияВакансииТекст Тогда
				СтрокаДерева.СтрокаИзменена = Истина;
				СтрокаДерева.ПубликацияВакансии = СтрокаДерева.ВакансияВПрограмме;
				СтрокаДерева.ПубликацияВакансииТекст = СтрокаДерева.ВакансияВПрограммеТекст;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Значение = СтрокаДерева.ПубликацияВакансии;
	
	Если СтрокаДерева.ТипРеквизита = "Строка" Тогда
		ПоляСТекстомВHTML = ПоляВакансииСТекстомВHTML();
		Если ПоляСТекстомВHTML.Найти(СтрокаДерева.Путь) <> Неопределено Тогда
			Значение = СтрокаДерева.ПубликацияВакансииТекст;
		КонецЕсли
	КонецЕсли;
	
	СтруктураВакансии.Вставить(СтрокаДерева.Путь, Значение);

КонецПроцедуры

Процедура ДополнитьСтруктуруВакансииОбъектом(СтруктураВакансии, СтрокаДерева, Обновление, Реактивация)
	
	Если Не СтрокаДерева.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоОбъекта() Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДерева.Путь = "contacts" Тогда
		Возврат;
	КонецЕсли;
	
	Если Обновление И Не СтрокаДерева.СтрокаИзменена И Не СтрокаДерева.Путь = "billing_type" Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеПоля = СтрокаДерева.ПубликацияВакансии[0].Значение;
	
	Если СтрокаДерева.Путь = "billing_type" Тогда
		СтруктураВакансии.Вставить(СтрокаДерева.Путь, ЗначениеПоля);
		Возврат;
	КонецЕсли;
	
	Если Реактивация Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДерева.Путь = "business_area" Тогда
		СтруктураВакансии.Вставить(СтрокаДерева.Путь, ЗначениеПоля);
	Иначе
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("id", ЗначениеПоля);
		СтруктураВакансии.Вставить(СтрокаДерева.Путь, СтруктураОбъекта);
	КонецЕсли;
	
КонецПроцедуры

#Область ПоляВакансии

Функция ПоляВакансииСОдиночнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("billing_type");
	Поля.Добавить("business_area");
	Поля.Добавить("schedule");
	Поля.Добавить("experience");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииНедоступныеДляРедактирования()
	
	Поля = Новый Массив;
	Поля.Добавить("contacts");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСТекстомВHTML()
	
	Поля = Новый Массив;
	Поля.Добавить("description");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

#КонецОбласти

Функция РеактивироватьВакансию(ИдентификаторВакансии, Дерево)
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансииAvito = JSONОписаниеВакансии(Дерево, Истина, Истина);
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/job/v1/vacancies/%1/prolongate", ИдентификаторВакансии));
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансииAvito);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 И РезультатЗапроса.КодСостояния <> 403 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьВсеСтраницыРесурса(Ресурс, ИмяСвойстваРезультата, МассивРезультатов, Страница = 1, Курсор = 0)
	
	НаСтранице = 20;
	ТекРесурс = Ресурс;
	Если СтрНайти(Ресурс, "?") > 0 Тогда
		ТекРесурс = ТекРесурс + "&";
	Иначе
		ТекРесурс = ТекРесурс + "?";
	КонецЕсли;
	
	ТекРесурс = СтрШаблон("%1per_page=%2&page=%3&cursor=%4", ТекРесурс,
		Формат(НаСтранице, "ЧН=0; ЧГ="),
		Формат(Страница, "ЧН=0; ЧГ="),
		Формат(Курсор, "ЧН=0; ЧГ="));

	Запрос = НовыйHTTPЗапрос(ТекРесурс);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка получения содержимого ресурса %1 с сайта %2.'"), Ресурс, Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
	Если МассивРезультатов.Количество() = 0 Тогда
		МассивРезультатов = СтруктураОтвета[ИмяСвойстваРезультата];
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРезультатов, СтруктураОтвета[ИмяСвойстваРезультата]);
	КонецЕсли;
	
	ВсегоСтраниц = ЗначениеСвойстваУзла(СтруктураОтвета, "meta", "pages", Неопределено);
	
	Если ВсегоСтраниц = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка получения содержимого ресурса %1 с сайта %2.'"), Ресурс, Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат;
	КонецЕсли;
	
	Курсор = ЗначениеСвойстваУзла(СтруктураОтвета, "meta", "cursor", Неопределено);
	
	Страница = Страница + 1;
	
	Если ВсегоСтраниц < Страница Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьВсеСтраницыРесурса(Ресурс, ИмяСвойстваРезультата, МассивРезультатов, Страница, Курсор);
	
КонецПроцедуры

Функция СоответствиеПолейПоискаКандидатов()
	
	СоответствиеПолейПоиска = Новый Соответствие;
	
	СоответствиеПолейПоиска.Вставить("КлючевоеСлово", "query");
	СоответствиеПолейПоиска.Вставить("ВозрастОт", "age_min");
	СоответствиеПолейПоиска.Вставить("ВозрастДо", "age_max");
	СоответствиеПолейПоиска.Вставить("Пол", "gender");
	СоответствиеПолейПоиска.Вставить("УровеньОбразования", "education_level");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыОт", "salary_min");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыДо", "salary_max");
	СоответствиеПолейПоиска.Вставить("Регион", "location");
	СоответствиеПолейПоиска.Вставить("ПериодРазмещения", "updated_than");
	
	Возврат СоответствиеПолейПоиска;
	
КонецФункции

Функция ДеревоРегионов()
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ИдентификаторДоп", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Число"));
	
	Макет = ПолучитьМакет("ГородаАвитоРабота");
	СтрокаXML = Макет.ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	СтрокаРегион = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "Region" Тогда
				НоваяСтрока = Дерево.Строки.Добавить();
				СтрокаРегион = НоваяСтрока;
			ИначеЕсли ЧтениеXML.Имя = "City" Тогда
				НоваяСтрока = СтрокаРегион.Строки.Добавить();
			Иначе
				Продолжить;
			КонецЕсли;
			НоваяСтрока.Идентификатор = ЧтениеXML.ПолучитьАтрибут("Id");
			НоваяСтрока.Значение = ЧтениеXML.ПолучитьАтрибут("Name");
		КонецЕсли;
	КонецЦикла;

	Возврат Дерево;
	
КонецФункции

Функция ОписаниеПубликацииВакансии(ИдентификаторВакансии, СообщатьОбОшибке = Истина)
	
	ОписаниеПубликации = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат ОписаниеПубликации;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("job/v2/vacancies/%1", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Если СообщатьОбОшибке Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	Иначе
		ОписаниеПубликации = ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса);
		ОписаниеПубликации.url = ДанныеСайта.ГлавнаяСтраница + ОписаниеПубликации.url;
	КонецЕсли;
	
	Возврат ОписаниеПубликации;
	
КонецФункции

Процедура ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, МассивКИ)
	
	РегионРаботы = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "address",, Неопределено);
	Если Не РегионРаботы = Неопределено Тогда
		СтруктураКИ = СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = РегионРаботы;
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
	КонтактнаяИнформация = ЗначениеСвойстваУзла(СтруктураРезюме, "contacts", ,, Неопределено);
	Если Не ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Контакт Из КонтактнаяИнформация Цикл
		СтруктураКИ = СтруктураКонтактнойИнформации();
		Если ЗначениеСвойстваУзла(Контакт, "type") = "e-mail" Тогда
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		Иначе
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		КонецЕсли;
		СтруктураКИ.Представление = ЗначениеСвойстваУзла(Контакт, "value");
		МассивКИ.Добавить(СтруктураКИ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразование(СтруктураРезюме, МассивОбразование)
	
	Образования = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "education_list",, Неопределено);
	Если Образования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УровеньОбразования = ВидОбразованияПоИдентификатору(ЗначениеСвойстваУзла(СтруктураРезюме, "params", "education"));
		
	Для Каждого Образование Из Образования Цикл
		СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		СтруктураОбразование.УчебноеЗаведение = ЗначениеСвойстваУзла(Образование, "institution");
		СтруктураОбразование.Специальность = ЗначениеСвойстваУзла(Образование, "specialty");
		ДатаОкончания = ЗначениеСвойстваУзла(Образование, "education_stop");
		СтруктураОбразование.ВидОбразования = УровеньОбразования;
		МассивОбразование.Добавить(СтруктураОбразование);
	КонецЦикла;
	
КонецПроцедуры

Функция ВидОбразованияПоИдентификатору(Идентификатор)
	
	ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
	// АПК:1297-выкл Идентификаторы внешнего классификатора, не требуют локализации
	Если Идентификатор = "Среднее" Тогда // среднее
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");
	ИначеЕсли Идентификатор = "Среднее специальное" Тогда // средне-специальное
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
	ИначеЕсли Идентификатор = "Незаконченное высшее" Тогда // неполное высшее
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование");
	ИначеЕсли Идентификатор = "Высшее" Тогда // высшее
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
	КонецЕсли;
	// АПК:1297-вкл
	
	Возврат ВидОбразования;
	
КонецФункции

// Параметры:
//  ТаблицаНайденныхКандидатов - ТаблицаЗначений
//  РезультатПоискаРезюме - Соответствие
//  ПолеСортировки - Число
Процедура ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки)
	
	Для Каждого Резюме Из РезультатПоискаРезюме.resumes Цикл
		
		НоваяСтрока = ТаблицаНайденныхКандидатов.Добавить();
		НоваяСтрока.ГдеНайден = Сайт;
		НоваяСтрока.НазваниеРезюме = Резюме.title;
		НоваяСтрока.ФИО = НСтр("ru = 'Будут загружены при создании кандидата.'");
		НоваяСтрока.ПоследнееМестоРаботы = НСтр("ru = 'Будет загружено при создании кандидата.'");
		НоваяСтрока.УровеньЗарплаты = ЗначениеСвойстваУзла(Резюме, "salary",,, 0);
		НоваяСтрока.Регион = ЗначениеСвойстваУзла(Резюме, "location", "title");
		
		Пол = ЗначениеСвойстваУзла(Резюме, "gender");
		Если Пол = "male" Тогда
			НоваяСтрока.Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли Пол = "female" Тогда
			НоваяСтрока.Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		Иначе
			НоваяСтрока.Пол = "-";
		КонецЕсли;
		НоваяСтрока.Возраст = ЗначениеСвойстваУзла(Резюме, "age");
		НоваяСтрока.ИдентификаторРезюме = Формат(ЗначениеСвойстваУзла(Резюме, "id"), "ЧГ=");
		
		НоваяСтрока.СсылкаНаРезюме = СсылкаНаРезюме(НоваяСтрока.ИдентификаторРезюме);
		
		ДатаОбновления = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Резюме, "updated_at"), Ложь);
		ДатаСоздания = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Резюме, "created_at"), Ложь);
		Если ЗначениеЗаполнено(ДатаОбновления) Тогда
			НоваяСтрока.ДатаРазмещения = ДатаОбновления;
		ИначеЕсли ЗначениеЗаполнено(ДатаСоздания) Тогда
			НоваяСтрока.ДатаРазмещения = ДатаСоздания;
		КонецЕсли;
		
		НоваяСтрока.ПолеСортировки = ПолеСортировки;
		ПолеСортировки = ПолеСортировки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
