
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПараметрыВыбора();	
	УстановитьСвойстваВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНалогаВзносаОтчисленияОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов;
	Элемент.ВыбиратьТип = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВидНалогаВзносаОтчисленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ВыбранноеЗначение = Неопределено
		И Тип("Тип") = ТипЗнч(ВыбранноеЗначение) Тогда
		
		УстановитьСвойстваВыбора();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНалогаВзносаОтчисленияПриИзменении(Элемент)
	
	УстановитьПараметрыВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваВыбора()
	
	Элемент = Элементы.ВидНалогаВзносаОтчисления;
	
	Если ТипЗнч(Запись.ВидНалогаВзносаОтчисления) = Тип("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений") Тогда
		
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений");
		Элемент.ВыбиратьТип = Ложь;
		
	ИначеЕсли ТипЗнч(Запись.ВидНалогаВзносаОтчисления) = Тип("ПеречислениеСсылка.ВидыОперацийПоЗарплате") Тогда
		
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате");
		Элемент.ВыбиратьТип = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбора()
	
	Если Запись.ВидНалогаВзносаОтчисления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивПараметровВыбора = Новый Массив();
	
	Если ТипЗнч(Запись.ВидНалогаВзносаОтчисления) = Тип("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений") Тогда
		ПараметрВыбораВладельцаСчета = Новый ПараметрВыбора("ТолькоВзносыИОтчисления", Истина);
		МассивПараметровВыбора.Добавить(ПараметрВыбораВладельцаСчета);	
	ИначеЕсли ТипЗнч(Запись.ВидНалогаВзносаОтчисления) = Тип("ПеречислениеСсылка.ВидыОперацийПоЗарплате") Тогда
		ПараметрВыбораВладельцаСчета = Новый ПараметрВыбора("Отбор.ГруппаОпераций", "КоэффициентыСтавкиРефинансированияНБ");
		МассивПараметровВыбора.Добавить(ПараметрВыбораВладельцаСчета);	
	КонецЕсли;
	
	Элементы.ВидНалогаВзносаОтчисления.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора); 
	
КонецПроцедуры

