#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Месяц = Неопределено;
	НалоговыйПериод = Неопределено;
	ПредоставлятьВычет = Ложь;
	
	Параметры.Свойство("Месяц", Месяц);
	Параметры.Свойство("НалоговыйПериод", НалоговыйПериод);
	Параметры.Свойство("ПредоставлятьВычет", ПредоставлятьВычет);
	
	Если Месяц <> Неопределено И НалоговыйПериод = Неопределено Тогда
		НалоговыйПериод = Год(Месяц)
	КонецЕсли;
	
	Если НалоговыйПериод <> Неопределено Тогда
		
		Если ПредоставлятьВычет Тогда
			
			ДанныеВыбора = Новый СписокЗначений;

			ДоступныеВычеты = УчетНалоговВзносовОтчислений.ВычетыНалогоплательщика(НалоговыйПериод);
			ЗаполнитьДанныеВыбораПоДоступнымВычетам(ДанныеВыбора, ДоступныеВычеты, Параметры, СтандартнаяОбработка);
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеВыбораПоДоступнымВычетам(ДанныеВыбора, ДоступныеВычеты, Параметры, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.СтрокаПоиска) Тогда 
		
		ЗначенияРеквизитовВычетов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДоступныеВычеты, "Наименование");
		Для Каждого Вычет Из ДоступныеВычеты Цикл
			ДанныеВыбора.Добавить(Вычет);
		КонецЦикла;
		
	Иначе 	
		Параметры.Отбор.Вставить("Ссылка", Новый ФиксированныйМассив(ДоступныеВычеты));
		ЗаполнитьВычетыПоОтбору(
			Справочники.ВидыВычетовИПН,
			ДанныеВыбора, Параметры, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик получения данных выбора для справочников, упорядоченных по реквизиту допупорядочивания. 
//
Процедура ЗаполнитьВычетыПоОтбору(
		Источник, 
		ДанныеВыбора, Знач Параметры, СтандартнаяОбработка) Экспорт
	
	Запрос = Новый Запрос;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыВычетовИПН.Ссылка КАК Ссылка,
		|	ВидыВычетовИПН.Наименование КАК СсылкаПредставление
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.Наименование ПОДОБНО &СтрокаПоиска
		|	И ВидыВычетовИПН.Ссылка В(&ОтборСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыВычетовИПН.Приоритет";
	
	Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%");
    Запрос.УстановитьПараметр("ОтборСсылка", Параметры.Отбор.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
			Представление = Выборка.СсылкаПредставление;
		Иначе
			
			ДлинаСтрокиПоиска = СтрДлина(Параметры.СтрокаПоиска);
			Представление = 
				Новый ФорматированнаяСтрока(
					Новый ФорматированнаяСтрока(
						Лев(Выборка.СсылкаПредставление, ДлинаСтрокиПоиска), 
						Новый Шрифт( , , Истина), 
						WebЦвета.Зеленый),
					Сред(Выборка.СсылкаПредставление, ДлинаСтрокиПоиска + 1));
			
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
		
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьПредопределенныеЭлементы();
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеЭлементы()
	
	ЗаписатьПредопределенныйЭлемент(1,Справочники.ВидыВычетовИПН.ВычетОПВ,
		Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов,
		Перечисления.ВидыНалоговВзносовОтчислений.ОПВ,0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
	
	ЗаписатьПредопределенныйЭлемент(2,Справочники.ВидыВычетовИПН.ВычетВОСМС,
		Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов,
		Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
	
	ЗаписатьПредопределенныйЭлемент(3,Справочники.ВидыВычетовИПН.ВычетСО,
		Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов,
		Перечисления.ВидыНалоговВзносовОтчислений.СО,0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
        
	ЗаписатьПредопределенныйЭлемент(4,Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца);
        
	ЗаписатьПредопределенныйЭлемент(5,Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода);
        
	ЗаписатьПредопределенныйЭлемент(6,Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода);
        
	ЗаписатьПредопределенныйЭлемент(7,Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода);
        
	ЗаписатьПредопределенныйЭлемент(8,Справочники.ВидыВычетовИПН.Стандартный1МЗП,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),1,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца,
		Истина);
	
	ЗаписатьПредопределенныйЭлемент(9,Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),75,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода,
		Истина);
	
	ЗаписатьПредопределенныйЭлемент(10,Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),75,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода,
		Истина);
	
	ЗаписатьПредопределенныйЭлемент(11,Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца,
		Истина);
	
	ЗаписатьПредопределенныйЭлемент(12,Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя,
		Перечисления.ВидыПредоставленияВычетов.Стандартный,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца,
		Истина);
	
	ЗаписатьПредопределенныйЭлемент(13,Справочники.ВидыВычетовИПН.ПредварительнаяСуммаНалоговыхВычетов,
		Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода,
		Истина);

    ЗаписатьПредопределенныйЭлемент(14,Справочники.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы,
		Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца,
		Истина);
	
	ЗаписатьПредопределенныйЭлемент(15,Справочники.ВидыВычетовИПН.НаОплатуМедицинскихУслуг,
		Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),8,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода,
		Истина);
		
	ЗаписатьПредопределенныйЭлемент(16,Справочники.ВидыВычетовИПН.ВознагражденияПоЖилищнымЗаймам,
		Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам,
		Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка(),0,
		Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца,
		Истина);
	
КонецПроцедуры

Процедура ЗаписатьПредопределенныйЭлемент(Приоритет, Ссылка, ПредоставлениеВычета, ВидВзносов, ПределВычета, ПериодПредоставления, НеИспользуется = Ложь)
	
	СправочникОбъект = Ссылка.ПолучитьОбъект();
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	СправочникОбъект.Приоритет = Приоритет;
	СправочникОбъект.ПредоставлениеВычета = ПредоставлениеВычета;
	СправочникОбъект.ВидВзносов = ВидВзносов;
	СправочникОбъект.ПределВычета = ПределВычета;
	СправочникОбъект.ПериодПредоставления = ПериодПредоставления;
	СправочникОбъект.НеИспользуется = НеИспользуется;
	СправочникОбъект.Записать();
	
КонецПроцедуры

Функция МаксимальныйПриоритет() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ВидыВычетовИПН.Приоритет), 0) КАК Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.ПометкаУдаления <> ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Приоритет;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьПриоритетыВычетовИПН2025() Экспорт

	ЗаполнитьПредопределенныеЭлементы();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка КАК Ссылка,
		|	ВидыВычетовИПН.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	НЕ ВидыВычетовИПН.Предопределенный
		|
		// учтем порядок приоритетов установленных пользователем в непредопрелеленных вычетах
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МинимальныйПриоритет = 11;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Приоритет = МинимальныйПриоритет;
		
		
		Попытка
			
			СправочникОбъект.Записать();
			
			МинимальныйПриоритет = МинимальныйПриоритет + 1;
			
		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи элемента справочника ""Виды вычетов ИПН"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Справочник  ""Виды вычетов ИПН"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДанныеВычетовНК2025() Экспорт

    // обновим приоритеты
	ЗаполнитьПредопределенныеЭлементы();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка КАК Ссылка,
		|	ВидыВычетовИПН.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	НЕ ВидыВычетовИПН.Предопределенный
		|
		// учтем порядок приоритетов установленных пользователем в непредопрелеленных вычетах
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МинимальныйПриоритет = 13;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Приоритет = МинимальныйПриоритет;
		
		
		Попытка
			
			СправочникОбъект.Записать();
			
			МинимальныйПриоритет = МинимальныйПриоритет + 1;
			
		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи элемента справочника ""Виды вычетов ИПН"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Справочник  ""Виды вычетов ИПН"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
		
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбновитьПриоритетыВычетовИПН2026() Экспорт

	ЗаполнитьПредопределенныеЭлементы();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка КАК Ссылка,
		|	ВидыВычетовИПН.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	НЕ ВидыВычетовИПН.Предопределенный
		|
		// учтем порядок приоритетов установленных пользователем в непредопрелеленных вычетах
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МинимальныйПриоритет = 17;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.Приоритет = МинимальныйПриоритет;
		
		
		Попытка
			
			СправочникОбъект.Записать();
			
			МинимальныйПриоритет = МинимальныйПриоритет + 1;
			
		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи элемента справочника ""Виды вычетов ИПН"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Справочник  ""Виды вычетов ИПН"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли