
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПредоставлениеВычета <> Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидВзносов");
	КонецЕсли;
	Если ПредоставлениеВычета <> Перечисления.ВидыПредоставленияВычетов.Стандартный Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПределВычета");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления Тогда
		Если Предопределенный Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Предопределенные элементы данного справочника нельзя пометить на удаление.'"),,,,Отказ);
			Возврат;
		КонецЕсли;
		ОбновитьПриоритеты(Приоритет,Отказ);
	ИначеЕсли Приоритет = 0 Тогда
		Приоритет = Справочники.ВидыВычетовИПН.МаксимальныйПриоритет() + 1;
	Иначе
		ПроверитьУникальностьПриоритета(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Приоритет = 0;
	ПределВычета = 0;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьПриоритета(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.Приоритет = &Приоритет
		|	И ВидыВычетовИПН.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = НСтр("ru = 'В справочнике уже существует элемент с указанным приоритетом.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПриоритеты(Знач ПриоритетОбъекта,Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.Приоритет > &Приоритет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыВычетовИПН.Приоритет";
	
	Запрос.УстановитьПараметр("Приоритет", ПриоритетОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Приоритет = 0;
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотОбъект.Записать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыВычетовИПН");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаДетальныеЗаписи.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Приоритет = ПриоритетОбъекта;
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			ПриоритетОбъекта = ПриоритетОбъекта + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление приоритетов справочников'"),
			УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект.Метаданные(),
			Ссылка,ИнформацияОбОшибке());
		ТекстОшибки = НСтр("ru = 'При обновлении приоритетов справочника возникла ошибка, см. ""Журнал регистрации"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , ,Отказ);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли