#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Начисления.Акционер, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ДивидендыФизическимЛицам;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Функция СпособВыплатыПрочихДоходов() Экспорт
	Возврат Перечисления.СпособыВыплатыПрочихДоходов.Дивиденды;
КонецФункции

Процедура СоздатьВТДанныеДокумента(МенеджерВременныхТаблиц, ДокументСсылка, СписокФизическихЛиц = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Акционер КАК ФизическоеЛицо,
	|	Начисления.Ссылка.Организация,
	|	Начисления.Начислено КАК СуммаДохода,
	|	Начисления.Ссылка.ПериодРегистрации КАК ПланируемаяДатаВыплаты,
	|	НАЧАЛОПЕРИОДА(Начисления.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	НАЧАЛОПЕРИОДА(Начисления.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК ПериодРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды) КАК ВидДохода,
	|	Начисления.Начислено КАК Сумма,
	|	Начисления.Начислено КАК Начислено,
	|	Начисления.ВидДивидендов КАК Начисление,
	|	Начисления.НДФЛ КАК НДФЛ,
	|	Начисления.НДФЛСПревышения КАК НДФЛСПревышения,
	|	ВЫБОР
	|		КОГДА Начисления.Ссылка.ДатаВыплаты >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА Начисления.НалогНаПрибыльКЗачету
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНаПрибыльКЗачету,
	|	ВЫБОР
	|		КОГДА Начисления.Ссылка.ДатаВыплаты >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА 0
	|		ИНАЧЕ Начисления.ВычетПоНДФЛ
	|	КОНЕЦ КАК ВычетПоНДФЛ,
	|	Начисления.КВыплате КАК КВыплате,
	|	Начисления.Ссылка,
	|	Начисления.НомерСтроки,
	|	Начисления.Удержано,
	|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды)) КАК ВидДоходаИПН,
	|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.СпособОбложенияИПН, ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СпособОбложенияИПН,
	|	ЕСТЬNULL(НалогообложениеНачисленийСрезПоследних.ДоходНеПодлежащийНалогообложениюИПН, ЗНАЧЕНИЕ(Справочник.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка)) КАК ДоходНеПодлежащийНалогообложениюИПН, 
	|	ВЫБОР
	|		КОГДА Начисления.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка05)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05)
	|		КОГДА Начисления.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка10)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10)
	|		КОГДА Начисления.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка12)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|	КОНЕЦ КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.ДивидендыФизическимЛицам.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ПериодРегистрации, ) КАК НалогообложениеНачисленийСрезПоследних
	|		ПО Начисления.ВидДивидендов = НалогообложениеНачисленийСрезПоследних.Начисление
	|ГДЕ
	|	Начисления.Ссылка = &Ссылка
	|	И Начисления.Акционер В (&СписокФизическихЛиц)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ПериодРегистрации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка,"ПериодРегистрации"));
	Запрос.УстановитьПараметр("НачалоРасчетаНДФЛПоПрогрессивнойШкале", УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале().НачалоРасчетаНДФЛПоПрогрессивнойШкале);
	
	Если СписокФизическихЛиц = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Начисления.Акционер В (&СписокФизическихЛиц)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТНачисленияУдержанияДокумента(МенеджерВременныхТаблиц, ДокументОбъект, Организация, ПериодРегистрации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
	|	Начисления.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.Подразделение КАК Подразделение,
	|	Начисления.Начисление КАК Начисление,
	|	Начисления.НомерСтроки КАК НомерСтроки,
	|	Начисления.ВидДохода КАК ВидДохода,
	|	НАЧАЛОПЕРИОДА(Начисления.ПериодРегистрации, МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(Начисления.ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания,
	|	Начисления.Ссылка КАК ДокументОснование,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухучете.ПустаяСсылка) КАК СпособОтраженияЗарплатыВБухучете,
	|	ЛОЖЬ КАК ОблагаетсяЕНВД,
	|	Начисления.Сумма КАК Сумма,
	|	Начисления.Сумма КАК СуммаДохода,
	|	0 КАК СуммаВычета
	|ПОМЕСТИТЬ ВТНачисленияДокумента
	|ИЗ
	|	ВТДанныеДокумента КАК Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ПериодРегистрации КАК ПериодРегистрации,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокумента.Подразделение КАК Подразделение,
	|	ДанныеДокумента.Подразделение КАК ТерриторияВыполненияРаботВОрганизации,
	|	Удержания.Удержание КАК НачислениеУдержание,
	|	ВЫРАЗИТЬ(Удержания.Удержание КАК ПланВидовРасчета.Удержания).КатегорияУдержания КАК КатегорияУдержания,
	|	Удержания.НомерСтроки КАК НомерСтроки,
	|	НАЧАЛОПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ДанныеДокумента.ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания,
	|	Удержания.НомерСтроки КАК ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВБухучете.ПустаяСсылка) КАК СпособОтраженияЗарплатыВБухучете,
	|	ЛОЖЬ КАК ОблагаетсяЕНВД,
	|	Удержания.Результат КАК Сумма,
	|	Удержания.Получатель КАК Получатель,
	|	Удержания.ПлатежныйАгент КАК ПлатежныйАгент,
	|	Удержания.ДокументОснование КАК ИсполнительныйДокумент
	|ПОМЕСТИТЬ ВТУдержанияДокумента
	|ИЗ
	|	Документ.ДивидендыФизическимЛицам.Удержания КАК Удержания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокумента КАК ДанныеДокумента
	|		ПО Удержания.Ссылка = ДанныеДокумента.Ссылка
	|			И Удержания.ФизическоеЛицо = ДанныеДокумента.ФизическоеЛицо
	|ГДЕ
	|	Удержания.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеДокумента.Ссылка
	|			ИЗ
	|				ВТДанныеДокумента КАК ДанныеДокумента)";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТРегламентированныеУдержания(МенеджерВременныхТаблиц, ДокументСсылка, СписокФизическихЛиц = Неопределено) Экспорт
	
	ОписаниеСтатейРасходов = ЗарплатаКадры.СтатьиРасходовПоСпособамРасчетовСФизическимиЛицами();
	ДивидендыАкционерам  = ОписаниеСтатейРасходов[Перечисления.СпособыРасчетовСФизическимиЛицами.Дивиденды];
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Дивиденды", ДивидендыАкционерам);

	Запрос.Текст =
		"ВЫБРАТЬ
		|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЕСТЬNULL(ВТОсновныеСотрудникиФизическихЛиц.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
		|	НалогиВзносыОтчисления.Ссылка.Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
		|	НалогиВзносыОтчисления.Ссылка КАК Ссылка,
		|	НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения КАК Сумма,
		|	&Дивиденды КАК СтатьяРасходов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДивиденды) КАК НачислениеУдержание,
		|	НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходовИсполнительногоПроизводства.ДоходыБезОграниченияВзысканий) КАК ВидДоходаИсполнительногоПроизводства
		|ПОМЕСТИТЬ ВТРегламентированныеУдержания
		|ИЗ
		|	Документ.ДивидендыФизическимЛицам.НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеСотрудникиФизическихЛиц КАК ВТОсновныеСотрудникиФизическихЛиц
		|		ПО НалогиВзносыОтчисления.ФизическоеЛицо = ВТОсновныеСотрудникиФизическихЛиц.ФизическоеЛицо
		|ГДЕ
		|	НалогиВзносыОтчисления.Ссылка = &Ссылка
		|	И НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|	И НалогиВзносыОтчисления.ФизическоеЛицо В (&СписокФизическихЛиц)";
		
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если СписокФизическихЛиц = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НалогиВзносыОтчисления.ФизическоеЛицо В (&СписокФизическихЛиц)", "");
	Иначе
		Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры


#Область ОбработчикиРегистрацииФизическихЛиц

Функция ПринадлежностиОбъекта() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация");
КонецФункции

#КонецОбласти

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистрацииДвижений(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСовместноРегистрируемыхОбъектов(Настройки);
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// Регистрирует изменение организации или структурного подразделения для сотрудников и физических лиц
//
// Параметры:
//		МассивДокументов - Массив - Массив объектов заполненный при загрузке сообщения обмена
//
Процедура ЗарегистрироватьЗависимыеОбъектыПослеЗагрузкиОбменаДанными(МассивДокументов) Экспорт
	
	// Зарегистрируем сотрудников по виду документа, изменяющего принадлежность к организации
	Для Каждого ДокументОбъект Из МассивДокументов Цикл
		Для Каждого СтрокаДокумента Из ДокументОбъект.Начисления Цикл
			Если ЗначениеЗаполнено(СтрокаДокумента.Акционер) И ОбщегоНазначения.СсылкаСуществует(СтрокаДокумента.Акционер) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(ДокументОбъект.ОбменДанными.Получатели, СтрокаДокумента.Акционер);
			КонецЕсли;
		КонецЦикла;
		
		СинхронизацияДанныхЗарплатаКадрыСервер.ПринадлежностьФизлицаОрганизацииПриЗаписи(ДокументОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция СвойстваИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Реквизиты = ИсправлениеДокументовЗарплатаКадры.РеквизитыИсправляемогоРасчетногоДокумента();
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Реквизиты);
	
КонецФункции

Функция ПараметрыИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Возврат ИсправлениеДокументовЗарплатаКадры.ПараметрыИсправляемогоДокумента(ДокументСсылка,
		СвойстваИсправляемогоДокумента(ДокументСсылка));
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
	
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Справка о списании депонированной зарплаты.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ДивидендыФизическимЛицам";
	КомандаПечати.Идентификатор = "ПФ_MXL_СправкаОДивидендах";
	КомандаПечати.Представление = НСтр("ru = 'Справка о дивидендах'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//	МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//	ПараметрыПечати - Структура - дополнительные настройки печати;
//	КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//	ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//	ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьСправку = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОДивидендах");
	
	Если НужноПечататьСправку Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОДивидендах",
			НСтр("ru = 'Справка о дивидендах'"), ПечатьСправки(МассивОбъектов, ОбъектыПечати), ,
			"Документ.ДивидендыФизическимЛицам.ПФ_MXL_СправкаОРегистрацииПрочихДоходов");
	КонецЕсли;
						
КонецПроцедуры								

Функция ПечатьСправки(МассивОбъектов, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РегистрацияПрочихДоходов_СправкаОДивидендах";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		ДанныеДокумента = ДанныеПечати.Значение;
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
		
		Если ДанныеДокумента.Форма2021года Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДивидендыФизическимЛицам.ПФ_MXL_СправкаОДивидендах2021");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДивидендыФизическимЛицам.ПФ_MXL_СправкаОДивидендах");
		КонецЕсли;
		
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаШапкаПовторятьПриПечати = Макет.ПолучитьОбласть("ШапкаПовторятьПриПечати");
		ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакетаШапка.Параметры.Заполнить(ДанныеДокумента);
		ДокументРезультат.Вывести(ОбластьМакетаШапка);
		
		Для каждого ДанныеСотрудника Из ДанныеДокумента.ТабличнаяЧастьДокумента Цикл
			
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьМакетаСтрока);
			МассивВыводимыхОбластей.Добавить(ОбластьМакетаПодвал);
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, МассивВыводимыхОбластей) Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				ДокументРезультат.Вывести(ОбластьМакетаШапкаПовторятьПриПечати);
			КонецЕсли;
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ДанныеСотрудника);
			
			ДокументРезультат.Вывести(ОбластьМакетаСтрока);
			
		КонецЦикла;
		
		ПодписиДокументовКлиентСервер.ДополнитьТекстОснованиемПодписи(
			ДанныеДокумента.ИсполнительРасшифровкаПодписи, ДанныеДокумента.ОснованиеПодписиИсполнителя);
		
		ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДокумента);
		ДокументРезультат.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Ссылка);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	ВалютаУчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	// ЗУПК
	МассивНалоговВзносовОтчислений = Новый Массив;
	МассивНалоговВзносовОтчислений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ИПН);
	Запрос.УстановитьПараметр("ВидыНалоговВзносовОтчислений", МассивНалоговВзносовОтчислений);
	// ЗУПК
	
	Запрос.Текст = 
  		// ЗУПК
		"ВЫБРАТЬ
		|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НалогиВзносыОтчисления.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР	КОГДА
		|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
		|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
		|			ИНАЧЕ 0
		|	КОНЕЦ) КАК ИПН
		|ПОМЕСТИТЬ ВТ_НалогиВзносыОтчисления
		|ИЗ
		|	Документ.ДивидендыФизическимЛицам.НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|ГДЕ
		|	НалогиВзносыОтчисления.Ссылка В(&МассивОбъектов)
		|		И НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления В (&ВидыНалоговВзносовОтчислений)
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
  		// ЗУПК
		|	ДивидендыФизическимЛицам.Ссылка.Организация.НаименованиеПолное КАК Организация,
		|	ДивидендыФизическимЛицам.Ссылка КАК Ссылка,
		|	ДивидендыФизическимЛицам.Ссылка.Номер КАК Номер,
		|	НАЧАЛОПЕРИОДА(ДивидендыФизическимЛицам.Ссылка.Дата, ДЕНЬ) КАК Период,
		|	ДивидендыФизическимЛицам.Ссылка.ДатаВыплаты КАК ДатаВыплаты,
		|	ДивидендыФизическимЛицам.Акционер КАК ФизическоеЛицо,
		|	ДивидендыФизическимЛицам.НДФЛ + ДивидендыФизическимЛицам.НДФЛСПревышения КАК НДФЛ,
        // ЗУПК
		|	ЕСТЬNULL(НалогиВзносыОтчисления.ИПН, 0) КАК ИПН,
        // ЗУПК
		|	ДивидендыФизическимЛицам.Начислено КАК Начислено,
		|	ДивидендыФизическимЛицам.ВычетПоНДФЛ КАК СуммаВычета,
		|	ДивидендыФизическимЛицам.Удержано КАК Удержано,
		|	(ДивидендыФизическимЛицам.Начислено - ДивидендыФизическимЛицам.Удержано - ЕСТЬNULL(НалогиВзносыОтчисления.ИПН, 0)) КАК СуммаКВыплате,
		|	ДивидендыФизическимЛицам.Ссылка.Исполнитель.ФИО КАК Исполнитель,
		|	ДивидендыФизическимЛицам.Ссылка.ДолжностьИсполнителя КАК ДолжностьИсполнителя,
		|	ДивидендыФизическимЛицам.Ссылка.ОснованиеПодписиИсполнителя КАК ОснованиеПодписиИсполнителя,
		|	ДивидендыФизическимЛицам.НалогНаПрибыльКЗачету КАК НалогНаПрибыльКЗачету
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.ДивидендыФизическимЛицам.Начисления КАК ДивидендыФизическимЛицам
        // ЗУПК
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
		|		ПО ДивидендыФизическимЛицам.Ссылка = НалогиВзносыОтчисления.Ссылка
		|			И ДивидендыФизическимЛицам.Акционер = НалогиВзносыОтчисления.ФизическоеЛицо
        // ЗУПК
		|ГДЕ
		|	ДивидендыФизическимЛицам.Ссылка В(&МассивОбъектов)";
	
	Запрос.Выполнить();
	
	ОписательВТ = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц, "ВТДанныеДокументов");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВТ, Истина, "ФИОПолные");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДокументов.Организация КАК Организация,
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.Номер КАК Номер,
		|	ДанныеДокументов.Период КАК Дата,
		|	ДанныеДокументов.ДатаВыплаты КАК ДатаВыплаты,
		|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ФИОПолные, ДанныеДокументов.ФизическоеЛицо) КАК Акционер,
		|	ДанныеДокументов.НДФЛ КАК НДФЛ,
        // ЗУПК
		|	ДанныеДокументов.ИПН КАК ИПН,
        // ЗУПК
		|	ДанныеДокументов.Начислено КАК Начислено,
		|	ДанныеДокументов.СуммаВычета КАК СуммаВычета,
		|	ДанныеДокументов.НалогНаПрибыльКЗачету КАК НалогНаПрибыльКЗачету,
		|	ДанныеДокументов.Удержано КАК Удержано,
		|	ДанныеДокументов.СуммаКВыплате КАК СуммаКВыплате,
		|	ЕСТЬNULL(ДанныеДокументов.Исполнитель, """") КАК Исполнитель,
		|	ДанныеДокументов.ДолжностьИсполнителя КАК ДолжностьИсполнителя,
		|	ДанныеДокументов.ОснованиеПодписиИсполнителя КАК ОснованиеПодписиИсполнителя
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
		|		ПО ДанныеДокументов.Период = КадровыеДанныеФизическихЛиц.Период
		|			И ДанныеДокументов.ФизическоеЛицо = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
		|ИТОГИ
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(Номер),
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(ДатаВыплаты),
		|	СУММА(НДФЛ),
        // ЗУПК
		|	СУММА(ИПН),
        // ЗУПК
		|	СУММА(Начислено),
		|	СУММА(СуммаВычета),
		|	СУММА(НалогНаПрибыльКЗачету),
		|	СУММА(Удержано),
		|	СУММА(СуммаКВыплате),
		|	МАКСИМУМ(Исполнитель),
		|	МАКСИМУМ(ДолжностьИсполнителя),
		|	МАКСИМУМ(ОснованиеПодписиИсполнителя)
		|ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	ГруппировкаПоДокументу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ГруппировкаПоДокументу.Следующий() Цикл
		
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("Ссылка", ГруппировкаПоДокументу.Ссылка);
        Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		ДанныеПечати.Вставить("Форма2021года", ГруппировкаПоДокументу.ДатаВыплаты >= УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале().НачалоРасчетаНДФЛПоПрогрессивнойШкале);
        Иначе
			ДанныеПечати.Вставить("Форма2021года", Ложь);
		КонецЕсли;
		ДанныеПечати.Вставить("НазваниеОрганизации", ГруппировкаПоДокументу.Организация);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", ВалютаУчета.НаименованиеПолное);
		ДанныеПечати.Вставить("ДатаДокумента", Формат(ГруппировкаПоДокументу.Дата, "ДЛФ=D"));
		ДанныеПечати.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ГруппировкаПоДокументу.Номер, Истина, Истина));
		ДанныеПечати.Вставить("Начислено", ГруппировкаПоДокументу.Начислено);
		ДанныеПечати.Вставить("СуммаВычета", ГруппировкаПоДокументу.СуммаВычета);
		ДанныеПечати.Вставить("НалогНаПрибыльКЗачету", ГруппировкаПоДокументу.НалогНаПрибыльКЗачету);
		// ЗУПК
		ДанныеПечати.Вставить("ИПН", ГруппировкаПоДокументу.ИПН);
		// ЗУПК
		ДанныеПечати.Вставить("НДФЛ", ГруппировкаПоДокументу.НДФЛ);
		ДанныеПечати.Вставить("Удержано", ГруппировкаПоДокументу.Удержано);
		ДанныеПечати.Вставить("СуммаКВыплате", ГруппировкаПоДокументу.СуммаКВыплате);
		ДанныеПечати.Вставить("ДолжностьИсполнителя", ГруппировкаПоДокументу.ДолжностьИсполнителя);
		ДанныеПечати.Вставить("ИсполнительРасшифровкаПодписи", ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(ГруппировкаПоДокументу.Исполнитель));
		ДанныеПечати.Вставить("ОснованиеПодписиИсполнителя", ГруппировкаПоДокументу.ОснованиеПодписиИсполнителя);
		ДанныеПечати.Вставить("ТабличнаяЧастьДокумента", Новый Массив);
		
		ГруппировкаПоСотрудникам = ГруппировкаПоДокументу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ГруппировкаПоСотрудникам.Следующий() Цикл
			
			СтрокаДанныхПечати = Новый Структура;
			СтрокаДанныхПечати.Вставить("Акционер", ГруппировкаПоСотрудникам.Акционер);
			СтрокаДанныхПечати.Вставить("Начислено", ГруппировкаПоСотрудникам.Начислено);
            Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
			СтрокаДанныхПечати.Вставить("СуммаВычета", ГруппировкаПоСотрудникам.СуммаВычета);
			СтрокаДанныхПечати.Вставить("НалогНаПрибыльКЗачету", ГруппировкаПоСотрудникам.НалогНаПрибыльКЗачету);
			СтрокаДанныхПечати.Вставить("НДФЛ", ГруппировкаПоСотрудникам.НДФЛ);
            КонецЕсли;
			// ЗУПК
			СтрокаДанныхПечати.Вставить("ИПН", ГруппировкаПоСотрудникам.ИПН);
			// ЗУПК
			СтрокаДанныхПечати.Вставить("Удержано", ГруппировкаПоСотрудникам.Удержано);
			СтрокаДанныхПечати.Вставить("СуммаКВыплате", ГруппировкаПоСотрудникам.СуммаКВыплате);
			
			ДанныеПечати.ТабличнаяЧастьДокумента.Добавить(СтрокаДанныхПечати);
			
		КонецЦикла;
		
		ДанныеПечатиОбъектов.Вставить(ГруппировкаПоДокументу.Ссылка, ДанныеПечати);
		
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

#КонецОбласти

Функция ДанныеДляПроведенияДивиденды(МенеджерВременныхТаблиц, Период) Экспорт
	
	ОписаниеСтатейРасходов = ЗарплатаКадры.СтатьиРасходовПоСпособамРасчетовСФизическимиЛицами();
	ДивидендыАкционерам  = ОписаниеСтатейРасходов[Перечисления.СпособыРасчетовСФизическимиЛицами.Дивиденды];
	
	ВидыДоходаИсполнительногоПроизводства = УчетНачисленнойЗарплаты.ВидыДоходовИсполнительногоПроизводстваНачислений(Период);
	ВидДоходаДивидендыСотрудникам = ВидыДоходаИсполнительногоПроизводства[Перечисления.ВидыОсобыхНачисленийИУдержаний.ДивидендыСотрудников];
	ВидДоходаДивидендыАкционерам = ВидыДоходаИсполнительногоПроизводства[Перечисления.ВидыОсобыхНачисленийИУдержаний.Дивиденды];
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дивиденды", ДивидендыАкционерам);
	Запрос.УстановитьПараметр("ВидДоходаДивидендыСотрудникам", ВидДоходаДивидендыСотрудникам);
	Запрос.УстановитьПараметр("ВидДоходаДивидендыАкционерам", ВидДоходаДивидендыАкционерам);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Дивиденды.Ссылка КАК Ссылка,
	|	Дивиденды.НомерСтроки КАК НомерСтроки,
	|	Дивиденды.ФизическоеЛицо КАК Акционер,
	|	Дивиденды.КатегорияДохода КАК КатегорияДохода,
	|	Дивиденды.Начислено КАК Начислено,
	|	Дивиденды.ВычетПоНДФЛ КАК ВычетПоНДФЛ,
	|	Дивиденды.НДФЛ КАК НДФЛ,
	|	Дивиденды.НДФЛСПревышения КАК НДФЛСПревышения,
	|	Дивиденды.НалогНаПрибыльКЗачету КАК НалогНаПрибыльКЗачету,
	|	Дивиденды.КВыплате КАК КВыплате,
	|	Дивиденды.Удержано КАК Удержано,
	|	ЕСТЬNULL(ВТОсновныеСотрудникиФизическихЛиц.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
    // ЗУПК
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды) КАК Начисление,
    // ЗУПК
	|	ВЫБОР
	|		КОГДА ВТОсновныеСотрудникиФизическихЛиц.Сотрудник ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НФДЛДивиденды)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.НФДЛДивидендыСотрудникам)
	|	КОНЕЦ КАК ВидУдержания,
	|	&Дивиденды КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ВТОсновныеСотрудникиФизическихЛиц.Сотрудник ЕСТЬ NULL
	|			ТОГДА &ВидДоходаДивидендыАкционерам
	|		ИНАЧЕ &ВидДоходаДивидендыСотрудникам
	|	КОНЕЦ КАК ВидДоходаИсполнительногоПроизводства
	|ИЗ
	|	ВТДанныеДокумента КАК Дивиденды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновныеСотрудникиФизическихЛиц КАК ВТОсновныеСотрудникиФизическихЛиц
	|		ПО Дивиденды.ФизическоеЛицо = ВТОсновныеСотрудникиФизическихЛиц.ФизическоеЛицо";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ПеренестиВычетВНалогНаПрибыль(ПараметрыОбновления = Неопределено) Экспорт

	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	ДивидендыФизическимЛицамНачисления.Ссылка КАК Ссылка,
	|	ДивидендыФизическимЛицамНачисления.Ссылка.ДатаВыплаты КАК ДатаВыплаты
	|ИЗ
	|	Документ.ДивидендыФизическимЛицам.Начисления КАК ДивидендыФизическимЛицамНачисления
	|ГДЕ
	|	ДивидендыФизическимЛицамНачисления.Ссылка.ДатаВыплаты >= ДАТАВРЕМЯ(2021, 1, 1, 0, 0, 0)
	|	И ДивидендыФизическимЛицамНачисления.ВычетПоНДФЛ <> 0
	|	И ДивидендыФизическимЛицамНачисления.НалогНаПрибыльКЗачету = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыплаты";
	Если ПараметрыОбновления = НеОпределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ПЕРВЫЕ 1000", "");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса; 
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ВыборкаДокументов = РезультатЗапроса.Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ДивидендыФизическимЛицам", "Ссылка", ВыборкаДокументов.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		// Обновление документа.
		ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		Для каждого СтрокаДокумента Из ДокументОбъект.Начисления Цикл
			Если СтрокаДокумента.ВычетПоНДФЛ = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаДокумента.НалогНаПрибыльКЗачету = Окр(СтрокаДокумента.ВычетПоНДФЛ * 0.13);
			Если СтрокаДокумента.ВычетПоНДФЛ >= СтрокаДокумента.Начислено Тогда
				СтрокаДокумента.НДФЛ = СтрокаДокумента.НДФЛ + СтрокаДокумента.НалогНаПрибыльКЗачету;
			ИначеЕсли СтрокаДокумента.НДФЛСПревышения > 0 И СтрокаДокумента.НДФЛ = 0 Тогда
				СтрокаДокумента.НДФЛСПревышения = СтрокаДокумента.НДФЛСПревышения + СтрокаДокумента.НалогНаПрибыльКЗачету;
			Иначе
				СтрокаДокумента.НДФЛ = СтрокаДокумента.НДФЛ + СтрокаДокумента.НалогНаПрибыльКЗачету;
			КонецЕсли;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
		// Обновление строк исчисленного налога в движениях.
		Если ДокументОбъект.Проведен Тогда
			ТаблицаДивидендов = ДокументОбъект.Начисления.Выгрузить();
			ТаблицаДивидендов.Колонки.Добавить("КатегорияДохода", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииДоходовНДФЛ"));
			Для каждого СтрокаДокумента Из ТаблицаДивидендов Цикл
				Если СтрокаДокумента.СтавкаНДФЛ = Перечисления.НДФЛСтавки.Ставка05 Тогда
					СтрокаДокумента.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05
				ИначеЕсли СтрокаДокумента.СтавкаНДФЛ = Перечисления.НДФЛСтавки.Ставка10 Тогда
					СтрокаДокумента.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10
				ИначеЕсли СтрокаДокумента.СтавкаНДФЛ = Перечисления.НДФЛСтавки.Ставка12 Тогда
					СтрокаДокумента.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12
				Иначе
					СтрокаДокумента.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.Дивиденды
				КонецЕсли;
			КонецЦикла;
			Отказ = Ложь;
			Движения = Новый Структура("СведенияОДоходахНДФЛ, РасчетыНалогоплательщиковСБюджетомПоНДФЛ", 
				РегистрыНакопления.СведенияОДоходахНДФЛ.СоздатьНаборЗаписей(),
				РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей());
			УчетНДФЛ.СформироватьДоходыИНДФЛСДивидендов(ДокументОбъект.Ссылка, Движения, Отказ, ДокументОбъект.Организация, ДокументОбъект.ДатаВыплаты, ТаблицаДивидендов, ДокументОбъект.ВключатьВДекларациюПоНалогуНаПрибыль);
			
			НовыйНабор = Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ;
			СтарыйНабор = ДокументОбъект.Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ;
			СтарыйНабор.Прочитать();
			Для каждого СтрокаНабора Из СтарыйНабор Цикл
				Если СтрокаНабора.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НовыйНабор.Добавить(), СтрокаНабора);
			КонецЦикла; 
			НовыйНабор.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ);
		КонецЕсли;
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
