#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗУПК
	УчетНалоговВзносовОтчисленийРасширенный.ОчиститьДанныеНВОВДокументахПрочихДоходов(ЭтотОбъект, РежимЗаписи);
	// ЗУПК
	
	ВсегоНачислено = Начисления.Итог("Начислено");
	ВсегоВыплачено = Начисления.Итог("КВыплате");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	СпособРасчетовСФизическимиЛицами = ?(ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.РегистрироватьВзаиморасчеты,
											Перечисления.СпособыРасчетовСФизическимиЛицами.Дивиденды,Неопределено);
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	УчетНДФЛРасширенный.СформироватьДоходыИНДФЛСДивидендов(Ссылка, Движения, Отказ, Организация, ДатаВыплаты,
							ДанныеДляПроведения.Дивиденды, ВключатьВДекларациюПоНалогуНаПрибыль,
							Не ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.РегистрироватьВзаиморасчеты,
							ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.ДатаПлатежаНДФЛ,
							ДанныеДляПроведения.ПараметрыПеречисленияНДФЛ.ПеречислениеНДФЛРеквизиты);
	
	УчетНачисленнойЗарплаты.ПодготовитьДанныеНДФЛКРегистрации(ДанныеДляПроведения.Дивиденды, Организация, ДатаВыплаты);
	
	НДФЛПоСотрудникам = ДанныеДляПроведения.Дивиденды.СкопироватьКолонки();
	Для каждого СтрокаТЗ Из ДанныеДляПроведения.Дивиденды Цикл
		НалогНаПрибыльДляДивидендов = СтрокаТЗ.НалогНаПрибыльДляДивидендов;
		Если НалогНаПрибыльДляДивидендов * СтрокаТЗ.СуммаСПревышения > 0 Тогда 
			Если СтрокаТЗ.СуммаСПревышения > 0 Тогда
				ОстатокСуммыКЗачету = Макс(НалогНаПрибыльДляДивидендов - СтрокаТЗ.СуммаСПревышения, 0);
				СтрокаТЗ.СуммаСПревышения = Макс(СтрокаТЗ.СуммаСПревышения - НалогНаПрибыльДляДивидендов, 0);
			Иначе
				ОстатокСуммыКЗачету = Мин(НалогНаПрибыльДляДивидендов - СтрокаТЗ.СуммаСПревышения, 0);
				СтрокаТЗ.СуммаСПревышения = Мин(СтрокаТЗ.СуммаСПревышения - НалогНаПрибыльДляДивидендов, 0);
			КонецЕсли;
			НалогНаПрибыльДляДивидендов = ОстатокСуммыКЗачету;
		КонецЕсли;
		Если НалогНаПрибыльДляДивидендов * СтрокаТЗ.Сумма > 0 Тогда
			Если СтрокаТЗ.Сумма > 0 Тогда
				СтрокаТЗ.Сумма = Макс(СтрокаТЗ.Сумма - НалогНаПрибыльДляДивидендов, 0);
			Иначе
				СтрокаТЗ.Сумма = Мин(СтрокаТЗ.Сумма - НалогНаПрибыльДляДивидендов, 0);
			КонецЕсли;
		КонецЕсли;
		Если СтрокаТЗ.Сумма <> 0 Тогда
			НоваяСтрока = НДФЛПоСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЕсли;
		Если СтрокаТЗ.СуммаСПревышения <> 0 Тогда
			НоваяСтрока = НДФЛПоСотрудникам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
			НоваяСтрока.Сумма = СтрокаТЗ.СуммаСПревышения;
			НоваяСтрока.ВидУдержания = Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛСПревышения;
		КонецЕсли;
	КонецЦикла;
	УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьНачисленияУдержанияПоКонтрагентамАкционерам(Движения, Отказ, Организация, ПериодРегистрации,
							ДанныеДляПроведения.Начисления , ДанныеДляПроведения.УдержанияКонтрагентов, НДФЛПоСотрудникам, СпособРасчетовСФизическимиЛицами);
							
	// Дополняем доходы НДФЛ сведениями о распределении по статьям финансирования и/или статьям расходов.
	ОтражениеЗарплатыВУчетеРасширенный.ДополнитьСведенияОДоходахНДФЛКонтрагентовСведениямиОРаспределенииПоСтатьям(Движения);
	
	Иначе
	ДанныеДляОтраженияЗарплатыВБухучете = ОтражениеЗарплатыВБухучетеРасширенный.НовыеДанныеДляОтраженияВБухучете();
	ДанныеДляОтраженияЗарплатыВБухучете.Начисления = ДанныеДляПроведения.Начисления;
	ДанныеДляОтраженияЗарплатыВБухучете.Удержания = ДанныеДляПроведения.УдержанияКонтрагентов;
	ДанныеДляОтраженияЗарплатыВБухучете.НДФЛ = НДФЛПоСотрудникам;

	ОтражениеЗарплатыВБухучетеРасширенный.СформироватьДвиженияБухучетНачисленияУдержанияПоКонтрагентамАкционерам(
					Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляОтраженияЗарплатыВБухучете, ДатаВыплаты);
		
		УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьНачисленияУдержанияПоКонтрагентамАкционерам(Движения, Отказ, Организация, ПериодРегистрации, 
						ДанныеДляПроведения.Начисления, ДанныеДляПроведения.РегламентированныеУдержания,, СпособРасчетовСФизическимиЛицами);
	КонецЕсли;
	
	РасчетЗарплатыРасширенный.СформироватьДвиженияУдержаний(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляПроведения.Удержания);
	ИсполнительныеЛисты.СформироватьУдержанияПоИсполнительнымДокументам(Движения, ДанныеДляПроведения.УдержанияПоИсполнительнымДокументам);
	РасчетЗарплатыРасширенный.СформироватьДвиженияУдержанийДоПределаПоСотрудникам(Движения, Отказ, ПериодРегистрации, ДанныеДляПроведения.УдержанияДоПределаПоСотрудникам);
	РасчетЗарплатыРасширенный.СформироватьЗадолженностьПоУдержаниямФизическихЛиц(Движения, ДанныеДляПроведения.ЗадолженностьПоУдержаниям);
	РасчетЗарплатыРасширенный.СформироватьДополнениеРасчетнойБазыУдержаний(Движения, ДанныеДляПроведения.ДополнениеРасчетнойБазыУдержаний);
	ОграничениеВзысканий.ЗарегистрироватьДанныеСохраняемогоЗаработка(Движения, Отказ, ПериодРегистрации, Перечисления.ХарактерВыплатыЗарплаты.Межрасчет);

 	// ЗУПК
	// Сведения о доходах физических лиц
	УчетНалоговВзносовОтчислений.СформироватьСведенияОДоходахПоНачислениям(Движения, Отказ, Организация, ДанныеДляПроведения.МенеджерВременныхТаблиц, НачалоМесяца(ПериодРегистрации),, Ложь,"ВТНачисленияДокумента",,,Истина); 
	
	// Сведения о необлагаемых доходах физических лиц
	УчетНалоговВзносовОтчислений.СформироватьСведенияОНеоблагаемыхДоходахПоНачислениям(ДанныеДляПроведения, Движения, Отказ, Организация,, Ложь); 

	// Сведения об исчислении налогов взносов отчислений
	УчетНалоговВзносовОтчислений.СформироватьСведенияОбИсчисленииНалоговВзносовОтчислений(ДанныеДляПроведения, Движения, Отказ, Организация, НачалоМесяца(ПериодРегистрации), Ложь);
	
	// Налоги, взносы и отчисления - расчеты с бюджетом и фондами
	УчетНалоговВзносовОтчислений.СформироватьНалогиВзносыОтчисленияРасчетыСБюджетом(ДанныеДляПроведения, Движения, Отказ, Организация, НачалоМесяца(ПериодРегистрации));
	
	УчетНалоговВзносовОтчислений.СформироватьНалогиВзносыРасчетыНалогоплательщиков(ДанныеДляПроведения, Движения, Отказ, Организация, НачалоМесяца(ПериодРегистрации));
	
	// Сведения об исчислении вычетов ИПН
	УчетНалоговВзносовОтчислений.СформироватьСведенияОбИсчисленииВычетовИПН(ДанныеДляПроведения, Движения, Отказ, Организация, НачалоМесяца(ПериодРегистрации), Ложь);
 	// ЗУПК
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
    // ЗУПК
	ЗарплатаКадрыРасширенный.ПроверитьЗадвоениеФизическихЛицВТабличнойЧастиДокумента(
		ЭтотОбъект, "Начисления", Отказ, "Акционер");
    // ЗУПК
	
	Если НЕ ПеречислениеНДФЛВыполнено
			ИЛИ ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		ИсключаемыеРеквизиты = Новый Массив;
		ИсключаемыеРеквизиты.Добавить("ДатаПлатежаНДФЛ");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеДляПроведения() Экспорт

	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоРасчетаНДФЛПоПрогрессивнойШкале", УчетНДФЛ.ПараметрыРасчетаНДФЛПоПрогрессивнойШкале().НачалоРасчетаНДФЛПоПрогрессивнойШкале);
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Дивиденды.Ссылка КАК Ссылка,
	|	Дивиденды.Ссылка.ПериодРегистрации КАК Период,
	|	Дивиденды.Акционер КАК ФизическоеЛицо,
	|	Дивиденды.НДФЛ КАК НДФЛ,
	|	Дивиденды.НДФЛСПревышения КАК НДФЛСПревышения,
	|	ВЫБОР
	|		КОГДА Дивиденды.Ссылка.ДатаВыплаты >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА Дивиденды.НалогНаПрибыльКЗачету
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНаПрибыльКЗачету,
	|	Дивиденды.Начислено КАК Начислено,
	|	Дивиденды.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Дивиденды.Ссылка.ДатаВыплаты >= &НачалоРасчетаНДФЛПоПрогрессивнойШкале
	|			ТОГДА 0
	|		ИНАЧЕ Дивиденды.ВычетПоНДФЛ
	|	КОНЕЦ КАК ВычетПоНДФЛ,
	|	Дивиденды.КВыплате КАК КВыплате,
	|	Дивиденды.Удержано КАК Удержано,
	|	ВЫБОР
	|		КОГДА Дивиденды.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка05)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке05)
	|		КОГДА Дивиденды.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка10)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке10)
	|		КОГДА Дивиденды.СтавкаНДФЛ = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка12)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДивидендыПоСтавке12)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.Дивиденды)
	|	КОНЕЦ КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.ДивидендыФизическимЛицам.Начисления КАК Дивиденды
	|ГДЕ
	|	Дивиденды.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	ВТДанныеДокумента КАК ТаблицаНДФЛ";
	Иначе
		Документы.ДивидендыФизическимЛицам.СоздатьВТДанныеДокумента(Запрос.МенеджерВременныхТаблиц, Ссылка);
		Документы.ДивидендыФизическимЛицам.СоздатьВТНачисленияУдержанияДокумента(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект, Организация, ПериодРегистрации);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокумент.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТДанныеДокумента КАК ДанныеДокумент";
	КонецЕсли;
	
	// Физические лица, работающие в организации
	Акционеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	ОтборАкционеры = Новый Массив;
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ОтборАкционеры, "ФизическоеЛицо", "В", Акционеры, Истина);
	КадровыйУчет.СоздатьВТФизическиеЛицаРаботавшиеВОрганизации(МенеджерВременныхТаблиц, Истина, Организация, ДатаВыплаты, ДатаВыплаты, , Истина, ОтборАкционеры);
	Запрос.Текст = "ВЫБРАТЬ ФизическиеЛицаРаботавшиеВОрганизации.* ИЗ ВТФизическиеЛицаРаботавшиеВОрганизации КАК ФизическиеЛицаРаботавшиеВОрганизации";
	ФизическиеЛицаРаботавшиеВОрганизации = Запрос.Выполнить().Выгрузить();
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТФизическиеЛицаРаботавшиеВОрганизации");
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(МенеджерВременныхТаблиц, Истина, ФизическиеЛицаРаботавшиеВОрганизации, Организация, ДатаВыплаты, ДатаВыплаты);
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("Дивиденды", Документы.ДивидендыФизическимЛицам.ДанныеДляПроведенияДивиденды(МенеджерВременныхТаблиц, ДатаВыплаты));
	
	ДанныеДляПроведения.Вставить("Начисления", ДанныеДляПроведения.Дивиденды.Скопировать( , "Акционер,Начисление,Ссылка,Сотрудник,Начислено,СтатьяРасходов,ВидДоходаИсполнительногоПроизводства"));
	ДанныеДляПроведения.Начисления.Колонки["Акционер"].Имя = "ФизическоеЛицо";
	ДанныеДляПроведения.Начисления.Колонки["Ссылка"].Имя = "ДокументОснование";
	ДанныеДляПроведения.Начисления.Колонки["Начислено"].Имя = "Сумма";
	
	ДополнениеРасчетнойБазыУдержаний = ДанныеДляПроведения.Начисления.Скопировать();
	ДополнениеРасчетнойБазыУдержаний.Свернуть("ФизическоеЛицо,Сотрудник,Начисление", "Сумма");
	ДополнениеРасчетнойБазыУдержаний.Колонки.Добавить("ГоловнаяОрганизация");
	ДополнениеРасчетнойБазыУдержаний.Колонки.Добавить("Организация");
	ДополнениеРасчетнойБазыУдержаний.Колонки.Добавить("Период");
	ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация);
	ДополнениеРасчетнойБазыУдержаний.ЗаполнитьЗначения(ГоловнаяОрганизация, "ГоловнаяОрганизация");
	ДополнениеРасчетнойБазыУдержаний.ЗаполнитьЗначения(Организация, "Организация");
	ДополнениеРасчетнойБазыУдержаний.ЗаполнитьЗначения(ПериодРегистрации, "Период");
	ДанныеДляПроведения.Вставить("ДополнениеРасчетнойБазыУдержаний", ДополнениеРасчетнойБазыУдержаний);
	
	РаспределениеПоСтатьям = ДанныеДляПроведения.Дивиденды.Скопировать( , "Акционер,СтатьяРасходов,ВидДоходаИсполнительногоПроизводства");
	Запрос.УстановитьПараметр("РаспределениеПоСтатьям", РаспределениеПоСтатьям);
	
	// Удержания
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Распределение.Акционер КАК ФизическоеЛицо,
	|	Распределение.СтатьяРасходов КАК СтатьяРасходов,
	|	Распределение.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства
	|ПОМЕСТИТЬ ВТРаспределениеПоСтатьям
	|ИЗ
	|	&РаспределениеПоСтатьям КАК Распределение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Удержания.Удержание.КатегорияУдержания КАК КатегорияУдержания,
	|	Удержания.ДокументОснование КАК ДокументОснование,
	|	Удержания.Результат КАК Результат,
	|	Удержания.ДатаНачала КАК ДатаНачала,
	|	Удержания.ДатаОкончания КАК ДатаОкончания,
	|	Удержания.Получатель КАК Получатель,
	|	Удержания.ПлатежныйАгент КАК ПлатежныйАгент,
	|	Удержания.Ссылка.Организация КАК Организация,
	|	Удержания.Удержание КАК Удержание,
	|	РаспределениеПоСтатьям.СтатьяРасходов КАК СтатьяРасходов,
	|	РаспределениеПоСтатьям.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	Удержания.Задолженность КАК Задолженность
	|ПОМЕСТИТЬ ВТУдержания
	|ИЗ
	|	Документ.ДивидендыФизическимЛицам.Удержания КАК Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеПоСтатьям КАК РаспределениеПоСтатьям
	|		ПО Удержания.ФизическоеЛицо = РаспределениеПоСтатьям.ФизическоеЛицо
	|ГДЕ
	|	Удержания.Ссылка = &Ссылка
	|	И Удержания.Результат <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.Организация КАК Организация,
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Удержания.Результат КАК Сумма,
	|	Удержания.КатегорияУдержания КАК КатегорияУдержания,
	|	Удержания.ДокументОснование КАК ДокументОснование,
	|	Удержания.Удержание КАК НачислениеУдержание,
	|	ВЫБОР
	|		КОГДА Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
	|			ТОГДА Удержания.Получатель
	|		КОГДА Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ВознаграждениеПлатежногоАгента)
	|			ТОГДА Удержания.ПлатежныйАгент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	Удержания.СтатьяРасходов КАК СтатьяРасходов,
	|	Удержания.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства
	|ИЗ
	|	ВТУдержания КАК Удержания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсполнительныеЛисты.ДокументОснование КАК ИсполнительныйДокумент,
	|	ИсполнительныеЛисты.Получатель КАК Получатель,
	|	ИсполнительныеЛисты.ПлатежныйАгент КАК ПлатежныйАгент,
	|	НАЧАЛОПЕРИОДА(ИсполнительныеЛисты.ДатаНачала, МЕСЯЦ) КАК МесяцУдержания,
	|	СУММА(ВЫБОР
	|			КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
	|				ТОГДА ИсполнительныеЛисты.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаУдержания,
	|	СУММА(ВЫБОР
	|			КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ВознаграждениеПлатежногоАгента)
	|				ТОГДА ИсполнительныеЛисты.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВознагражденияПлатежногоАгента
	|ИЗ
	|	ВТУдержания КАК ИсполнительныеЛисты
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсполнительныеЛисты.ДокументОснование,
	|	ИсполнительныеЛисты.Получатель,
	|	ИсполнительныеЛисты.ПлатежныйАгент,
	|	НАЧАЛОПЕРИОДА(ИсполнительныеЛисты.ДатаНачала, МЕСЯЦ)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВЫБОР
	|				КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
	|					ТОГДА ИсполнительныеЛисты.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ИсполнительныеЛисты.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ВознаграждениеПлатежногоАгента)
	|					ТОГДА ИсполнительныеЛисты.Результат
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Удержания.Результат КАК Результат,
	|	Удержания.ДокументОснование КАК ДокументОснование,
	|	Удержания.Удержание КАК Удержание,
	|	Удержания.Получатель КАК Получатель,
	|	Удержания.ПлатежныйАгент КАК ПлатежныйАгент,
	|	Удержания.ДатаНачала КАК ДатаНачала,
	|	Удержания.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТУдержания КАК Удержания";
	
	Результат = Запрос.ВыполнитьПакет();
	ДанныеДляПроведения.Вставить("УдержанияКонтрагентов", Результат[2].Выгрузить());
	ДанныеДляПроведения.Вставить("УдержанияПоИсполнительнымДокументам", Результат[3].Выгрузить());
	ДанныеДляПроведения.Вставить("Удержания", Результат[4].Выгрузить());
	
	// Удержания до предела по сотрудникам
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.Организация КАК Организация,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.Удержание КАК Удержание,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.ДокументОснование КАК ДокументОснование,
	|	ПредельныеСуммыУдержанийСотрудниковСрезПоследних.ПрекратитьПоДостижениюПредела КАК ПрекратитьПоДостижениюПредела
	|ПОМЕСТИТЬ ВТПредельныеСуммыУдержаний
	|ИЗ
	|	РегистрСведений.ПредельныеСуммыУдержанийСотрудников.СрезПоследних(
	|			,
	|			(Организация, ФизическоеЛицо, Удержание, ДокументОснование) В
	|				(ВЫБРАТЬ
	|					ЗаписиУдержаний.Организация,
	|					ЗаписиУдержаний.ФизическоеЛицо,
	|					ЗаписиУдержаний.Удержание,
	|					ЗаписиУдержаний.ДокументОснование
	|				ИЗ
	|					ВТУдержания КАК ЗаписиУдержаний)) КАК ПредельныеСуммыУдержанийСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ЗаписиУдержаний.Организация КАК Организация,
	|	ЗаписиУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗаписиУдержаний.Удержание КАК Удержание,
	|	ЗаписиУдержаний.ДокументОснование КАК ДокументОснование,
	|	ЗаписиУдержаний.Результат - ЗаписиУдержаний.Задолженность КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЗаписиУдержаний.Результат > ЗаписиУдержаний.Задолженность
	|			ТОГДА ЗаписиУдержаний.Результат - ЗаписиУдержаний.Задолженность
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаМежрасчет
	|ИЗ
	|	ВТУдержания КАК ЗаписиУдержаний
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПредельныеСуммыУдержаний КАК ПредельныеСуммыУдержаний
	|		ПО ЗаписиУдержаний.Организация = ПредельныеСуммыУдержаний.Организация
	|			И ЗаписиУдержаний.ФизическоеЛицо = ПредельныеСуммыУдержаний.ФизическоеЛицо
	|			И ЗаписиУдержаний.Удержание = ПредельныеСуммыУдержаний.Удержание
	|			И ЗаписиУдержаний.ДокументОснование = ПредельныеСуммыУдержаний.ДокументОснование
	|			И (ПредельныеСуммыУдержаний.ПрекратитьПоДостижениюПредела)";
		
	ДанныеДляПроведения.Вставить("УдержанияДоПределаПоСотрудникам", Запрос.Выполнить().Выгрузить());
	
	ДанныеДляПроведения.Вставить("ЗадолженностьПоУдержаниям");
	РасчетЗарплатыРасширенный.ЗаполнитьПогашениеЗадолженностиПоУдержаниям(ДанныеДляПроведения, Ссылка, ПериодРегистрации);
	
	ПараметрыПеречисленияНДФЛ = Новый Структура("РегистрироватьВзаиморасчеты,ДатаПлатежаНДФЛ,ПеречислениеНДФЛРеквизиты,ПеречислениеНДФЛВыполнено");
	ПараметрыПеречисленияНДФЛ.РегистрироватьВзаиморасчеты = ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов") И РегистрироватьВыплатуВедомостью;
	ПараметрыПеречисленияНДФЛ.ПеречислениеНДФЛВыполнено = ПеречислениеНДФЛВыполнено;
	ПараметрыПеречисленияНДФЛ.ПеречислениеНДФЛРеквизиты = ?(ПеречислениеНДФЛВыполнено,ПеречислениеНДФЛРеквизиты,Неопределено);
	ПараметрыПеречисленияНДФЛ.ДатаПлатежаНДФЛ 			= ?(ПеречислениеНДФЛВыполнено,ДатаПлатежаНДФЛ,Неопределено);
	ДанныеДляПроведения.Вставить("ПараметрыПеречисленияНДФЛ", ПараметрыПеречисленияНДФЛ);

	Документы.ДивидендыФизическимЛицам.СоздатьВТРегламентированныеУдержания(Запрос.МенеджерВременныхТаблиц, Ссылка);
	ДанныеДляПроведения.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегламентированныеУдержания.Организация КАК Организация,
		|	РегламентированныеУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РегламентированныеУдержания.Подразделение КАК Подразделение,
		|	РегламентированныеУдержания.Сумма КАК Сумма,
		|	РегламентированныеУдержания.НачислениеУдержание КАК НачислениеУдержание,
		|	РегламентированныеУдержания.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
		|	РегламентированныеУдержания.Сотрудник КАК Сотрудник,
		|	РегламентированныеУдержания.СтатьяРасходов КАК СтатьяРасходов,
		|	РегламентированныеУдержания.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
		|	РегламентированныеУдержания.Ссылка КАК ДокументОснование
		|ИЗ
		|	ВТРегламентированныеУдержания КАК РегламентированныеУдержания";
	
	ДанныеДляПроведения.Вставить("РегламентированныеУдержания", Запрос.Выполнить().Выгрузить());
	
	ДанныеДляПроведения.Вставить("НалогиВзносыОтчисления");
	ДанныеДляПроведения.Вставить("ДоходыНеПодлежащиеНалогообложению");
	ДанныеДляПроведения.Вставить("ВычетыИПН");
	УчетНалоговВзносовОтчислений.ЗаполнитьДанныеДляПроведенияПоНалогамВзносамОтчислениям(ДанныеДляПроведения, Ссылка, "Ссылка.ПериодРегистрации");
	УчетНалоговВзносовОтчислений.ЗаполнитьДанныеДляПроведенияПоДоходамНеПодлежащимНалогообложению(ДанныеДляПроведения, Ссылка, "Ссылка.ПериодРегистрации");
	УчетНалоговВзносовОтчислений.ЗаполнитьДанныеДляПроведенияСведенияОбИсчисленииВычетовИПН(ДанныеДляПроведения, Ссылка, "Ссылка.ПериодРегистрации");
	
	Возврат ДанныеДляПроведения;
	
КонецФункции 

Процедура РассчитатьРегламентированныеУдержанияДокумента(СписокФизическихЛиц = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Записать(РежимЗаписиДокумента.Запись);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Документы.ДивидендыФизическимЛицам.СоздатьВТДанныеДокумента(Запрос.МенеджерВременныхТаблиц, Ссылка, СписокФизическихЛиц);
	Документы.ДивидендыФизическимЛицам.СоздатьВТНачисленияУдержанияДокумента(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект, Организация, ПериодРегистрации);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокумента.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛица
		|ИЗ
		|	ВТДанныеДокумента КАК ДанныеДокумента";
	
	Запрос.Выполнить();
	

	ВременнаяСсылка = Документы.ДивидендыФизическимЛицам.ПолучитьСсылку();
 	НаборыЗаписей = ЗарплатаКадры.НаборыЗаписейРегистратора(Метаданные.Документы.ДивидендыФизическимЛицам, ВременнаяСсылка);
	
	УчетНалоговВзносовОтчислений.СформироватьСведенияОДоходахПоНачислениям(
			НаборыЗаписей, Ложь, Организация, Запрос.МенеджерВременныхТаблиц, ПериодРегистрации, Ложь, Ложь, "ВТНачисленияДокумента",,,Истина);
	
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(Запрос.МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОДоходахФизическихЛиц, Истина);
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(Запрос.МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОбИсчисленииВычетовИПН,, "ВТ_ВычетыДокументаИсправления");
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(Запрос.МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОбИсчисленииНалоговВзносовОтчислений,, "ВТ_СведенияОбИсчисленииНалоговВзносовОтчисленийДокументаИсправления");
	
	УчетНалоговВзносовОтчислений.ПодготовитьДанныеДляРасчетаНалоговВзносов(Организация, Ссылка, Запрос.МенеджерВременныхТаблиц, ПериодРегистрации, Ложь);
	НеоблагаемыеДоходы = УчетНалоговВзносовОтчислений.РассчитатьНеоблагаемыеДоходы(Организация, Ссылка, Запрос.МенеджерВременныхТаблиц, ПериодРегистрации, Ложь);
	
	РезультатРасчетаИПН = УчетНалоговВзносовОтчислений.РезультатРасчетаИПН(Организация, Ссылка, Запрос.МенеджерВременныхТаблиц, ПериодРегистрации, Ложь);
	
	ОтменитьТранзакцию();
	
	ЗаполнитьВычеты = Ложь;
	Если РезультатРасчетаИПН.ВычетыИПН.Колонки.Найти("ИдентификаторСтрокиНалогиВзносыОтчисления") <> Неопределено Тогда
		ЗаполнитьВычеты = Истина;
	КонецЕсли;

	Если НЕ СписокФизическихЛиц = Неопределено Тогда
		Для Каждого УдаляемоеФизическоеЛицо Из СписокФизическихЛиц Цикл
				
			УдаляемыеСтроки = НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ФизическоеЛицо", УдаляемоеФизическоеЛицо));
			
			Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				
				УдаляемыеСтрокиВычеты = ВычетыИПН.НайтиСтроки(Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", УдаляемаяСтрока.ИдентификаторСтрокиНалогиВзносыОтчисления));
				
				Для Каждого УдаляемаяСтрокаВычет Из УдаляемыеСтрокиВычеты Цикл
					ВычетыИПН.Удалить(УдаляемаяСтрокаВычет);
				КонецЦикла;
				
				НалогиВзносыОтчисления.Удалить(УдаляемаяСтрока);
				
			КонецЦикла;
			
			УдаляемыеСтроки = ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(Новый Структура("ФизическоеЛицо", УдаляемоеФизическоеЛицо));
			
			Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				ДоходыНеПодлежащиеНалогообложению.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;

	// Перенос в документ результатов расчета
	
	ФизическиеЛицаПоКоторымОчищалисьДанные = Новый Соответствие;
	МаксимальныйИдентификатор = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(НалогиВзносыОтчисления);
	Для Каждого СтрокаРезультатаРасчетаИПН Из РезультатРасчетаИПН.ИПН Цикл
		
		Если ФизическиеЛицаПоКоторымОчищалисьДанные.Получить(СтрокаРезультатаРасчетаИПН.ФизическоеЛицо) = Неопределено Тогда
			УчетНалоговВзносовОтчисленийРасширенный.УдалитьДанныеПоНалогамВзносамОтчислениямФизическоголица(ЭтотОбъект, СтрокаРезультатаРасчетаИПН.ФизическоеЛицо);
			
			УдаляемыеСтроки = ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(Новый Структура("ФизическоеЛицо", СтрокаРезультатаРасчетаИПН.ФизическоеЛицо));
			
			Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				ДоходыНеПодлежащиеНалогообложению.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			
			ФизическиеЛицаПоКоторымОчищалисьДанные.Вставить(СтрокаРезультатаРасчетаИПН.ФизическоеЛицо, Истина);
		КонецЕсли; 
		
		МаксимальныйИдентификатор = МаксимальныйИдентификатор + 1;
		
		НоваяСтрокаНалогиВзносыОтчисления = НалогиВзносыОтчисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНалогиВзносыОтчисления, СтрокаРезультатаРасчетаИПН);
		НоваяСтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификатор;
		
		Если НЕ ЗаполнитьВычеты Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиВычетов = РезультатРасчетаИПН.ВычетыИПН.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаРезультатаРасчетаИПН.ИдентификаторСтрокиНалогиВзносыОтчисления));
			
		Для Каждого СтрокаВычетов Из СтрокиВычетов Цикл
			НоваяСтрокаВычетов = ВычетыИПН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВычетов, СтрокаВычетов);
			НоваяСтрокаВычетов.ИдентификаторСтрокиНалогиВзносыОтчисления = НоваяСтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаНеоблагаемыеДоходы Из НеоблагаемыеДоходы Цикл
		
		УдаляемыеСтрокиНеоблагаемыеДоходы = ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(Новый Структура("ФизическоеЛицо, ВидНалогаВзносаОтчисления, МесяцНалоговогоПериода", 
																							СтрокаНеоблагаемыеДоходы.ФизическоеЛицо,
																							СтрокаНеоблагаемыеДоходы.ВидНалогаВзносаОтчисления,
																							СтрокаНеоблагаемыеДоходы.МесяцНалоговогоПериода));
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтрокиНеоблагаемыеДоходы Цикл
			ДоходыНеПодлежащиеНалогообложению.Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
		НоваяСтрока = ДоходыНеПодлежащиеНалогообложению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНеоблагаемыеДоходы);
	КонецЦикла;
	
КонецПроцедуры

#Область ОбменДанными

Функция СовместноРегистрируемыеОбъекты() Экспорт
	Возврат Начисления.ВыгрузитьКолонку("Акционер");
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли