#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПрежнийНаборЗаписей();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрежнийНаборЗаписей()
	
	Если Отбор["ЛичныеДанныеКандидата"].Использование = Ложь Или Не ЗначениеЗаполнено(Отбор.ЛичныеДанныеКандидата.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидата", Отбор.ЛичныеДанныеКандидата.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНабора.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ДанныеНабора.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ФизическиеЛицаКандидатов КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.ЛичныеДанныеКандидата = &ЛичныеДанныеКандидата";
	
	ДополнительныеСвойства.Вставить("ПрежнийНабор", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли