#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Сохранение старого состояния.
	СтарыеНастройки = РегистрыСведений.НастройкиСамообслуживанияСотрудников.СоздатьНаборЗаписей();
	СтарыеНастройки.Прочитать();
	Если СтарыеНастройки.Количество() = 0 Тогда
		СтароеСостояние = СтарыеНастройки.Добавить();
	Иначе	
		СтароеСостояние = СтарыеНастройки[0];
	КонецЕсли;	
	ДополнительныеСвойства.Вставить("СтароеСостояние", СтароеСостояние);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КабинетСотрудникаРасширенный.НастройкиСамообслуживанияСотрудниковПриЗаписи(ЭтотОбъект[0], ДополнительныеСвойства.СтароеСостояние);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли