
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	АдресХранилища = Параметры.АдресХранилища;
	
	ОшибкиПоСотруднику = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ОшибкиФормированияДокументов.Загрузить(ОшибкиПоСотруднику); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(АдресХранилища);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОшибкиФормированияДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОшибкиФормированияДокументовКонфликтующийРегистратор" Тогда
		ТекущиеДанные = Элементы.ОшибкиФормированияДокументов.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.КонфликтующийРегистратор) Тогда
			ПоказатьЗначение(, ТекущиеДанные.КонфликтующийРегистратор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

