#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьФайлВФорматеМТ(НастройкиВыгрузки, УникальныйИдентификатор) Экспорт 
	
	ПараметрыВыгрузки = ЗаполнитьСтруктуруПараметрыВыгрузки(НастройкиВыгрузки);
	СтруктураПередаваемыхФайлов = Новый Соответствие();
	ДанныеДокумента = ЗаполнитьДанныеДокумента(ПараметрыВыгрузки.ДанныеДокумента);
	
	Если ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
        ИЛИ ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПеречислением" Тогда
		СформироватьФайлЗачисленияЗарплаты(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	ИначеЕсли ДанныеДокумента.ВидОперации = "ПеречислениеВзносов"
		ИЛИ ДанныеДокумента.ВидОперации = "ПеречислениеПрочихВыплат" Тогда
		СформироватьФайлОтчислений(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	ИначеЕсли ДанныеДокумента.ВидОперации = "ПеречислениеДенежныхСредствПодотчетникам" Тогда
		СформироватьФайлЗачисленияЗарплаты(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	ИначеЕсли ДанныеДокумента.ВидОперации = "ВедомостьПрочихДоходовВБанк"
		ИЛИ ДанныеДокумента.ВидОперации = "ВедомостьПрочихДоходовПеречислением" Тогда
		СформироватьФайлЗачисленияЗарплаты(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьСтруктуруПараметрыВыгрузки(НастройкиВыгрузки)
	Возврат Новый Структура(
		"КаталогВыгрузки, Кодировка, ДанныеДокумента, ФормироватьОтдельныефайлы,
		|ВключатьПолеFT, ВключатьПолеPRT, ВключатьПолеPSO, ПолеPERIODВЗаголовке, РазделятьСуммыПоПериодуЗадолженности,
		|ПриоритетСообщения, НомерФайла, ВключатьПоляФорматаMX",
		КаталогВыгрузки,
		Кодировка,
		НастройкиВыгрузки.ДанныеДокумента,
		НастройкиВыгрузки.ФормироватьОтдельныеФайлы,
		НастройкиВыгрузки.ВключатьПолеFT,
		НастройкиВыгрузки.ВключатьПолеPRT,
		НастройкиВыгрузки.ВключатьПолеPSO,
		НастройкиВыгрузки.ПолеPERIODВЗаголовке,
		НастройкиВыгрузки.РазделятьСуммыПоПериодуЗадолженности,
		НастройкиВыгрузки.ПриоритетСообщения,
		1,
		НастройкиВыгрузки.ВключатьПоляФорматаMX);
КонецФункции

Функция ЗаполнитьДанныеДокумента(ПараметрыВыгрузки)
	
	ДанныеДокумента = Новый Структура("ВидОперации, ВидНалогаВзносаОтчисления, Дата, Номер, КодНазначенияПлатежа, НазначениеПлатежа, Ведомости, БуквенныйКодВалюты,
									|Организация, БанковскийСчет, ОрганизацияНаименованиеСокращенное, ОрганизацияИдентификационныйНомер, ОрганизацияКодСтраныРегистрации,
									|ОрганизацияНомерСчета, ОрганизацияБИК, ОрганизацияПризнакРезидентства, ОрганизацияСекторЭкономики,
									|Получатель, БанковскийСчетПолучателя, ПолучательНаименованиеПолное, ПолучательИдентификационныйНомер, ПолучательКодСтраныРегистрации,
									|ПолучательПризнакРезидентства, ПолучательСекторЭкономики, ПолучательНомерСчета, ПолучательБИК,
									|ФИОРуководителя, ДолжностьРуководителя, ФИОГлавногоБухгалтера, 
									|СтруктурноеПодразделение, СтруктурноеПодразделениеИдентификационныйНомер, СтруктурноеПодразделениеНаименование, 
									|ФактическийПлательщик, ФактическийПлательщикНаименованиеСокращенное, ФактическийПлательщикИдентификационныйНомер");
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, ПараметрыВыгрузки);
	
	СтруктураРеквизитовОрганизации                     = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.Организация, "ИНН, НаименованиеСокращенное, КБЕ, СтранаРегистрации, ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель");
	ДанныеДокумента.ОрганизацияИдентификационныйНомер  = СтруктураРеквизитовОрганизации.ИНН;
	ДанныеДокумента.ОрганизацияНаименованиеСокращенное = СтруктураРеквизитовОрганизации.НаименованиеСокращенное;
	ДанныеДокумента.ОрганизацияПризнакРезидентства     = Лев(СтруктураРеквизитовОрганизации.КБЕ, 1);
	ДанныеДокумента.ОрганизацияСекторЭкономики         = Прав(СтруктураРеквизитовОрганизации.КБЕ, 1);
	
	Если СтруктураРеквизитовОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		ГражданствоФизическихЛиц = РегистрыСведений.ГражданствоФизическихЛиц.СрезПоследних(ПараметрыВыгрузки.Дата, Новый Структура("ФизическоеЛицо", СтруктураРеквизитовОрганизации.ИндивидуальныйПредприниматель));
		
		Если ГражданствоФизическихЛиц.Количество() > 0 Тогда
			
			СтранаРегистрации = ГражданствоФизическихЛиц[0].Страна;
			ДанныеДокумента.ОрганизацияКодСтраныРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтранаРегистрации, "КодАльфа2");
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.СтранаРегистрации) Тогда
		
		ДанныеДокумента.ОрганизацияКодСтраныРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовОрганизации.СтранаРегистрации, "КодАльфа2");
		
	Иначе
		
		ДанныеДокумента.ОрганизацияКодСтраныРегистрации = "KZ";
		
	КонецЕсли;
	
	СтруктураРеквизитовПолучателя                      = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.Получатель, "ИНН, НаименованиеПолное, КБЕ, СтранаРегистрации");
	ДанныеДокумента.ПолучательНаименованиеПолное       = СтруктураРеквизитовПолучателя.НаименованиеПолное;
	ДанныеДокумента.ПолучательИдентификационныйНомер   = СтруктураРеквизитовПолучателя.ИНН;
	ДанныеДокумента.ПолучательПризнакРезидентства      = Лев(СтруктураРеквизитовПолучателя.КБЕ, 1);
	ДанныеДокумента.ПолучательСекторЭкономики          = Прав(СтруктураРеквизитовПолучателя.КБЕ, 1);
	Если ЗначениеЗаполнено(СтруктураРеквизитовПолучателя.СтранаРегистрации) Тогда
		
		ДанныеДокумента.ПолучательКодСтраныРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовПолучателя.СтранаРегистрации, "КодАльфа2");
		
	Иначе
		
		ДанныеДокумента.ПолучательКодСтраныРегистрации = "KZ";

	КонецЕсли;
	
    Если ЗначениеЗаполнено(ДанныеДокумента.СтруктурноеПодразделение) Тогда
		
		Регистрация = ЗарплатаКадры.РегистрацияВНалоговомОргане(ДанныеДокумента.СтруктурноеПодразделение, ПараметрыВыгрузки.Дата);
		ДанныеДокумента.СтруктурноеПодразделениеИдентификационныйНомер  = Регистрация.ИНН;
		ДанныеДокумента.СтруктурноеПодразделениеНаименование = Регистрация.НаименованиеОбособленногоПодразделения;
		
	КонецЕсли;
	
    Если ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
		
		Если ТипЗнч(ДанныеДокумента.ФактическийПлательщик) = Тип("СправочникСсылка.ПодразделенияОрганизаций") 
			И ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
			
			Регистрация = ЗарплатаКадры.РегистрацияВНалоговомОргане(ДанныеДокумента.ФактическийПлательщик, ПараметрыВыгрузки.Дата);
			ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер  = Регистрация.ИНН;
			ДанныеДокумента.ФактическийПлательщикНаименованиеСокращенное = Регистрация.НаименованиеОбособленногоПодразделения;
			
		Иначе
			
			СтруктураРеквизитовОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.ФактическийПлательщик, "ИНН, НаименованиеСокращенное");
			ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер  = СтруктураРеквизитовОрганизации.ИНН;
			ДанныеДокумента.ФактическийПлательщикНаименованиеСокращенное = СтруктураРеквизитовОрганизации.НаименованиеСокращенное;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы") Тогда
		МодульЗарплатаКадры                            = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадры");
		ДанныеДокумента.БуквенныйКодВалюты             = МодульЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
		МодульЗарплатаКадрыПереопределяемый            = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыПереопределяемый");
		СтруктураОтветственных                         = МодульЗарплатаКадрыПереопределяемый.СведенияОбОтветственныхЛицах(
			ДанныеДокумента.Организация,"Руководитель, ДолжностьРуководителя, ГлавныйБухгалтер", ДанныеДокумента.Дата);
		ДанныеДокумента.ФИОРуководителя                = СтруктураОтветственных.Руководитель;
		ДанныеДокумента.ДолжностьРуководителя          = СтруктураОтветственных.ДолжностьРуководителя;
		ДанныеДокумента.ФИОГлавногоБухгалтера          = СтруктураОтветственных.ГлавныйБухгалтер;
	Иначе
		МодульЗначениеНастроекПовтИсп = ОбщегоНазначения.ОбщийМодуль("ЗначениеНастроекПовтИсп");
		ДанныеДокумента.БуквенныйКодВалюты             = МодульЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
		МодульОтветственныеЛицаСервер = ОбщегоНазначения.ОбщийМодуль("ОтветственныеЛицаСервер");
		СтруктураОтветственных                         = МодульОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
		ДанныеДокумента.ФИОРуководителя                = СтруктураОтветственных.РуководительНаименование;
		ДанныеДокумента.ДолжностьРуководителя          = СтруктураОтветственных.РуководительДолжность;
		ДанныеДокумента.ФИОГлавногоБухгалтера          = СтруктураОтветственных.ГлавныйБухгалтерНаименование;
	КонецЕсли;
	
	СтруктураРеквизитовБанкаОрганизации                = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(ДанныеДокумента.БанковскийСчет);
	ДанныеДокумента.ОрганизацияНомерСчета              = СтруктураРеквизитовБанкаОрганизации.НомерСчета;
	ДанныеДокумента.ОрганизацияБИК                     = СтруктураРеквизитовБанкаОрганизации.БИК;
	
	СтруктураРеквизитовБанкаКонтрагента                = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(ДанныеДокумента.БанковскийСчетПолучателя);
	ДанныеДокумента.ПолучательНомерСчета               = СтруктураРеквизитовБанкаКонтрагента.НомерСчета;
	ДанныеДокумента.ПолучательБИК                      = СтруктураРеквизитовБанкаКонтрагента.БИК;
	
	Возврат ДанныеДокумента;

КонецФункции

Функция ВыбратьСписокРаботников(ДанныеДокумента, ПараметрыВыгрузки)
	
	ДатаДокумента = ДанныеДокумента.Дата;
	ВидОперации = ДанныеДокумента.ВидОперации;
	Ведомости = ДанныеДокумента.Ведомости;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВидыПлатежейПени", Перечисления.ВидыПлатежейВГосБюджет.ВидыПениПлатежей());
	Запрос.УстановитьПараметр("ВключатьПоляФорматаMX", ПараметрыВыгрузки.ВключатьПоляФорматаMX);
	
	РазделятьСуммыПоПериодуЗадолженности = ПараметрыВыгрузки.РазделятьСуммыПоПериодуЗадолженности;
	
	Если ДанныеДокумента.ВидНалогаВзносаОтчисления = "ЕП" Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(СписокКПеречислению.МесяцНалоговогоПериода) КАК НачалоПериода,
		|	МАКСИМУМ(СписокКПеречислению.МесяцНалоговогоПериода) КАК КонецПериода
		|ИЗ
		|	Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК СписокКПеречислению
		|ГДЕ
		|	СписокКПеречислению.Ссылка В(&Ведомости)
		|";
		
		Если НЕ РазделятьСуммыПоПериодуЗадолженности Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "МАКСИМУМ", "МИНИМУМ");
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
			
		Если Выборка.Следующий() Тогда			
			
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Выборка.НачалоПериода));
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Выборка.КонецПериода));
			
		Иначе
			
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ДанныеДокумента.Дата));
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ДанныеДокумента.Дата));
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ведомости", Ведомости);
		
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ПолеФизическоеЛицо,
		|	&ПолеФизическоеЛицоНаименование,
		|	""9"" КАК ФизЛицоСекторЭкономики,
		|	&ПолеИИН,
		|	СУММА(ВЫБОР
		|			КОГДА СписокКПеречислению.КВыплате ЕСТЬ NULL 
		|				ТОГДА 0
		|			ИНАЧЕ СписокКПеречислению.КВыплате
		|		КОНЕЦ) КАК СуммаКПеречислению,
		|	&ПоляВыборки,
		|	&ПоляФИО,
		|	&ПоляДанныеФИО
		|
		|ИЗ
		|	&Источник КАК СписокКПеречислению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛиц
		|		ПО ФИОФизЛиц.ФизическоеЛицо = СписокКПеречислению.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ГражданствоФизическихЛиц
		|		ПО ГражданствоФизическихЛиц.ФизическоеЛицо = СписокКПеречислению.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаФизическогоЛица
		|		ПО ГражданствоФизическихЛиц.Страна = СтранаФизическогоЛица.Ссылка
		|		&ПрисоединяемыеТаблицы
		|ГДЕ
		|	СписокКПеречислению.Ссылка В(&Ведомости)
		|
		|СГРУППИРОВАТЬ ПО
		|	&ГруппировкаФизическоеЛицо,
		|	&ГруппировкаФизическоеЛицоНаименование,
		|	&ГруппировкаИИН,
		|	&ГруппировкиФИО,
		|	&ГруппировкиДанныеФИО,
		|	&ПоляГруппировки
		|";
	
	ПолеФизическоеЛицо = "СписокКПеречислению.ФизическоеЛицо";
	ПолеФизическоеЛицоНаименование = "СписокКПеречислению.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование";
	ПолеИИН = "СписокКПеречислению.ФизическоеЛицо.ИНН КАК ИИН";
	ПоляФИО = 
	"ФИОФизЛиц.Фамилия КАК Фамилия,
	|	ФИОФизЛиц.Имя КАК Имя,
	|	ФИОФизЛиц.Отчество КАК Отчество";
	ПоляДанныеФИО = 
	"ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """") КАК ФизЛицоКодСтраны,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ КАК ФизЛицоПризнакРезидентства";
	ПрисоединяемыеТаблицы = "";
	ГруппировкаФизическоеЛицо = "СписокКПеречислению.ФизическоеЛицо";
	ГруппировкаФизическоеЛицоНаименование = "СписокКПеречислению.ФизическоеЛицо.Наименование";
	ГруппировкаИИН = "СписокКПеречислению.ФизическоеЛицо.ИНН";
	ГруппировкиФИО = 
	"ФИОФизЛиц.Фамилия,
	|	ФИОФизЛиц.Имя,
	|	ФИОФизЛиц.Отчество";
	ГруппировкиДанныеФИО = 
	"ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """"),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан))= ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ";
	ПоляУпорядочивания = ГруппировкиФИО;
	
	Если ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
		ИЛИ ВидОперации = "ВедомостьПрочихДоходовВБанк" Тогда
		Источник1 = "Документ.ВедомостьНаВыплатуЗарплатыВБанк.Зарплата";
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВзаиморасчетыПоПрочимДоходам") Тогда
			Источник2 = "Документ.ВедомостьПрочихДоходовВБанк.Выплаты";
		КонецЕсли;
		ПоляВыборки = "СписокКПеречислению.НомерЛицевогоСчета КАК НомерЛицевогоСчета";
		ПоляГруппировки = "СписокКПеречислению.НомерЛицевогоСчета";
		
	ИначеЕсли ВидОперации = "ВыплатаЗарплатыПеречислением"
		ИЛИ ВидОперации = "ВедомостьПрочихДоходовПеречислением" Тогда
		Источник1 = "Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата";
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВзаиморасчетыПоПрочимДоходам") Тогда
			Источник2 = "Документ.ВедомостьПрочихДоходовПеречислением.Выплаты";
		КонецЕсли;
		ПоляВыборки = "СписокКПеречислению.БанковскийСчет.НомерСчета КАК НомерЛицевогоСчета";
		ПоляГруппировки = "СписокКПеречислению.БанковскийСчет.НомерСчета";
		ПолеФизическоеЛицо = 
		"ВЫБОР
		|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо
		|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо
		|	КОНЕЦ КАК ФизическоеЛицо";
		ПолеФизическоеЛицоНаименование = 
		"ВЫБОР
		|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.Наименование
		|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.Наименование
		|	КОНЕЦ КАК ФизическоеЛицоНаименование";
		ПолеИИН = 
		"ВЫБОР
		|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.ИНН
		|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.ИНН
		|	КОНЕЦ КАК ИИН";
		ПоляФИО = 
		"ВЫБОР
		|		КОГДА НЕ ФИОТретьегоЛица.Фамилия ЕСТЬ NULL
		|			ТОГДА ФИОТретьегоЛица.Фамилия
		|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Фамилия, """")
		|	КОНЕЦ КАК Фамилия,
		|	ВЫБОР
		|		КОГДА НЕ ФИОТретьегоЛица.Имя ЕСТЬ NULL
		|			ТОГДА ФИОТретьегоЛица.Имя
		|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Имя, """")
		|	КОНЕЦ КАК Имя,
		|	ВЫБОР
		|		КОГДА НЕ ФИОТретьегоЛица.Отчество ЕСТЬ NULL
		|			ТОГДА ФИОТретьегоЛица.Отчество
		|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Отчество, """")
		|	КОНЕЦ КАК Отчество";
		ПоляДанныеФИО = 
		"ЕСТЬNULL(СтранаТретьегоЛица.КодАльфа2, ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """")) КАК ФизЛицоКодСтраны,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ГражданствоТретьегоЛица.Страна, ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан))) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
		|			ТОГДА ""1""
		|		ИНАЧЕ ""2""
		|	КОНЕЦ КАК ФизЛицоПризнакРезидентства";
		ПрисоединяемыеТаблицы = 
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестаВыплатыЗарплатыСотрудников КАК МестаВыплатыЗарплатыСотрудников
		|		ПО (МестаВыплатыЗарплатыСотрудников.Сотрудник = СписокКПеречислению.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОТретьегоЛица
		|		ПО (ФИОТретьегоЛица.ФизическоеЛицо = МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ГражданствоТретьегоЛица
		|		ПО (ФИОТретьегоЛица.ФизическоеЛицо = ГражданствоТретьегоЛица.ФизическоеЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаТретьегоЛица
		|		ПО ГражданствоТретьегоЛица.Страна = СтранаТретьегоЛица.Ссылка";
		ГруппировкаФизическоеЛицо = 
		"ВЫБОР
		|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо
		|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо
		|	КОНЕЦ";
		ГруппировкаФизическоеЛицоНаименование = 
		"ВЫБОР
		|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.Наименование
		|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.Наименование
		|	КОНЕЦ";
		ГруппировкаИИН = 
		"ВЫБОР
		|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.ИНН
		|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.ИНН
		|	КОНЕЦ";
		ГруппировкиФИО = 
		"ВЫБОР
		|		КОГДА НЕ ФИОТретьегоЛица.Фамилия ЕСТЬ NULL
		|			ТОГДА ФИОТретьегоЛица.Фамилия
		|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Фамилия, """")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ФИОТретьегоЛица.Имя ЕСТЬ NULL
		|			ТОГДА ФИОТретьегоЛица.Имя
		|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Имя, """")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ ФИОТретьегоЛица.Отчество ЕСТЬ NULL
		|			ТОГДА ФИОТретьегоЛица.Отчество
		|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Отчество, """")
		|	КОНЕЦ";
		ГруппировкиДанныеФИО = 
		"ЕСТЬNULL(СтранаТретьегоЛица.КодАльфа2, ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """")),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ГражданствоТретьегоЛица.Страна, ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан))) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
		|			ТОГДА ""1""
		|		ИНАЧЕ ""2""
		|	КОНЕЦ";
		ПоляУпорядочивания = ГруппировкиФИО;
   
    ИначеЕсли ВидОперации = "ПеречислениеВзносов" Тогда
		Источник1 = "Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления";
		ПоляВыборки = "
			|	СписокКПеречислению.Ссылка.ВидНалогаВзносаОтчисления КАК ВидОперации,
			|	СписокКПеречислению.Ссылка.ВидПлатежа КАК ВидПлатежа,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,";
		
		Если РазделятьСуммыПоПериодуЗадолженности ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ЕП"
			ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ООСМС" Тогда

			
			Если ДанныеДокумента.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
				
				ПоляВыборки = ПоляВыборки + "
				|	ВЫБОР КОГДА СписокКПеречислению.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА СписокКПеречислению.МесяцНалоговогоПериода ИНАЧЕ СписокКПеречислению.МесяцПериода КОНЕЦ КАК ПериодПлатежаТЧ";
				
			Иначе
				
				ПоляВыборки = ПоляВыборки + "
				|	СписокКПеречислению.МесяцНалоговогоПериода КАК ПериодПлатежаТЧ";

			КонецЕсли;	
				
		Иначе
			ПоляВыборки = ПоляВыборки + "
			|	МИНИМУМ(СписокКПеречислению.МесяцНалоговогоПериода) КАК ПериодПлатежаТЧ";
		КонецЕсли;
		
		Если ДанныеДокумента.ВидНалогаВзносаОтчисления = "ЕП" Тогда
			
			ПоляВыборки = ПоляВыборки + ",
			|	МАКСИМУМ(СписокКПеречислению.ВключаетОПВ) КАК ОПВ,
			|	МАКСИМУМ(СписокКПеречислению.ВключаетВОСМС) КАК ВОСМС,
			|	МАКСИМУМ(СписокКПеречислению.ВключаетИПН) КАК ИПН,
			|	МАКСИМУМ(СписокКПеречислению.ВключаетСО) КАК СО,
			|	МАКСИМУМ(СписокКПеречислению.ВключаетООСМС) КАК ООСМС,
			|	МАКСИМУМ(СписокКПеречислению.ВключаетОПВР) КАК ОПВР,
			|	СУММА(ВЫБОР КОГДА СписокКПеречислению.Ссылка.ВидПлатежа В (&ВидыПлатежейПени) ТОГДА СписокКПеречислению.НалогВзнос ИНАЧЕ СписокКПеречислению.СуммаПлатежа КОНЕЦ) КАК СуммаПлатежа";
			
		КонецЕсли;

		ПоляГруппировки = "
			|	СписокКПеречислению.Ссылка.ВидНалогаВзносаОтчисления,
			|	СписокКПеречислению.Ссылка.ВидПлатежа,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения";
		
		Если РазделятьСуммыПоПериодуЗадолженности ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ЕП"
			ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
			
			Если ДанныеДокумента.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
				
				ПоляГруппировки = ПоляГруппировки + ",
				|	ВЫБОР КОГДА СписокКПеречислению.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА СписокКПеречислению.МесяцНалоговогоПериода ИНАЧЕ СписокКПеречислению.МесяцПериода КОНЕЦ";
				
			Иначе
				
				ПоляГруппировки = ПоляГруппировки + ",
				|	СписокКПеречислению.МесяцНалоговогоПериода";

			КонецЕсли;	

		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КВыплате", "НалогВзнос");
		
		Если ДанныеДокумента.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
			
			ПоляУпорядочивания = ПоляУпорядочивания + ", ВЫБОР КОГДА СписокКПеречислению.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА СписокКПеречислению.МесяцНалоговогоПериода ИНАЧЕ СписокКПеречислению.МесяцПериода КОНЕЦ";
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = "ПеречислениеДенежныхСредствПодотчетникам" Тогда
		Источник1 = "Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа";
		ПоляВыборки = "
			|	СписокКПеречислению.БанковскийСчетПодотчетногоЛица.НомерСчета КАК НомерЛицевогоСчета";

		ПоляГруппировки = "
			|	СписокКПеречислению.БанковскийСчетПодотчетногоЛица.НомерСчета";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СписокКПеречислению.ФизическоеЛицо", "СписокКПеречислению.ПодотчетноеЛицо");
		
	ИначеЕсли ВидОперации = "ПеречислениеПрочихВыплат" Тогда
		Источник1 = "Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты";
		ПоляВыборки = "
			|	СписокКПеречислению.Ссылка.ВидПрочихВыплат КАК ВидОперации,
			|	""ПеречислениеПрочихВыплат"" КАК ВидПлатежа,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,";
		
		Если РазделятьСуммыПоПериодуЗадолженности Тогда
			ПоляВыборки = ПоляВыборки + "
			|	СписокКПеречислению.ПериодВзаиморасчетов КАК ПериодПлатежаТЧ";
			
		Иначе
			ПоляВыборки = ПоляВыборки + "
			|	МИНИМУМ(СписокКПеречислению.ПериодВзаиморасчетов) КАК ПериодПлатежаТЧ";
		КонецЕсли;

		ПоляГруппировки = "
			|	СписокКПеречислению.Ссылка.ВидПрочихВыплат,
			|	""ПеречислениеПрочихВыплат"",
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения";
		
		Если РазделятьСуммыПоПериодуЗадолженности Тогда
			ПоляГруппировки = ПоляГруппировки + ",
			|	СписокКПеречислению.ПериодВзаиморасчетов";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КВыплате", "Сумма");
	КонецЕсли;
	
	ТекстЗапросаДопДанные = ТекстЗапроса;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Источник", Источник1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки", ПоляВыборки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляГруппировки", ПоляГруппировки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеФизическоеЛицоНаименование", ПолеФизическоеЛицоНаименование);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеФизическоеЛицо", ПолеФизическоеЛицо);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеИИН", ПолеИИН);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляФИО", ПоляФИО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДанныеФИО", ПоляДанныеФИО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПрисоединяемыеТаблицы", ПрисоединяемыеТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаФизическоеЛицоНаименование", ГруппировкаФизическоеЛицоНаименование);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаФизическоеЛицо", ГруппировкаФизическоеЛицо);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаИИН", ГруппировкаИИН);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкиФИО", ГруппировкиФИО);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкиДанныеФИО", ГруппировкиДанныеФИО);
	
	// дополним ВедомостьПрочихДоходовВБанк
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВзаиморасчетыПоПрочимДоходам") 
		И (ВидОперации = "ВедомостьПрочихДоходовВБанк"
			ИЛИ ВидОперации = "ВедомостьПрочихДоходовПеречислением") Тогда
		
		Если ВидОперации = "ВедомостьПрочихДоходовПеречислением" Тогда
			ПрисоединяемыеТаблицы = 
			"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестаВыплатыЗарплатыСотрудников КАК МестаВыплатыЗарплатыСотрудников
			|		ПО ЛОЖЬ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОТретьегоЛица
			|		ПО ЛОЖЬ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ГражданствоТретьегоЛица
			|		ПО ЛОЖЬ
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаТретьегоЛица
			|		ПО ЛОЖЬ"; // перечисление третьему лицу для доходов ГПХ не поддерживается
		КонецЕсли;
		
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&Источник", Источник2);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "РАЗРЕШЕННЫЕ", "");
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляВыборки", ПоляВыборки);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляГруппировки", ПоляГруппировки);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПолеФизическоеЛицоНаименование", ПолеФизическоеЛицоНаименование);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПолеФизическоеЛицо", ПолеФизическоеЛицо);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПолеИИН", ПолеИИН);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляФИО", ПоляФИО);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляДанныеФИО", ПоляДанныеФИО);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПрисоединяемыеТаблицы", ПрисоединяемыеТаблицы);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкаФизическоеЛицоНаименование", ГруппировкаФизическоеЛицоНаименование);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкаФизическоеЛицо", ГруппировкаФизическоеЛицо);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкаИИН", ГруппировкаИИН);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкиФИО", ГруппировкиФИО);
		ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкиДанныеФИО", ГруппировкиДанныеФИО);
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|"
		+ ТекстЗапросаДопДанные + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	&ПоляУпорядочивания";
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	&ПоляУпорядочивания";
		
	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляУпорядочивания", ПоляУпорядочивания);
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать();
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитовПлатежногоПоручения(ДанныеДокумента, Отказ, ВключатьПоляФорматаMX)
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.Организация) Тогда
		ТекстОшибки = НСтр("ru = 'В документе не указана организация, по которой формируется Swift-файл'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияНаименованиеСокращенное) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'У организации %1 не заполнено поле ""Сокращенное наименование""'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияИдентификационныйНомер) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'У организации %1 не заполнено поле ""БИН/ИИН""'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	ИначеЕсли СтрДлина(СокрЛП(ДанныеДокумента.ОрганизацияИдентификационныйНомер)) < 12 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Длина БИН/ИИН организации %1 меньше 12 знаков'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияПризнакРезидентства) ИЛИ
		НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияСекторЭкономики) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'У организации %1 заполнено некорректно поле ""КБе"". КБе должен содержать 2 цифры'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если ВключатьПоляФорматаMX Тогда
		Если ДанныеДокумента.ОрганизацияПризнакРезидентства = "2" 
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияКодСтраныРегистрации) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для организации %1 с признаком резидентства ""2"" (нерезидент) в поле ""КБе"", не заполнена страна регистрации/гражданства.'"),
				ДанныеДокумента.Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
		КонецЕсли;
		
		Если ДанныеДокумента.ОрганизацияПризнакРезидентства = "2" 
			И ДанныеДокумента.ОрганизацияКодСтраныРегистрации = "KZ" Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У организации %1 в поле ""КБе"" указан признак резиденства ""2"" (нерезидент) и страна регистрации/гражданства Казахстан.'"),
				ДанныеДокумента.Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
		КонецЕсли;
		
		Если ДанныеДокумента.ОрганизацияПризнакРезидентства = "1" 
			И НЕ ДанныеДокумента.ОрганизацияКодСтраныРегистрации = "KZ" Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для организации %1 с признаком ""1"" (резидент) в поле ""КБе"", страна регистрации/гражданства должна быть пустой.'"),
				ДанныеДокумента.Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.БанковскийСчет) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе не указан банковский счет организации'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияНомерСчета) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В банковском счете %1 не указан номер счета'"),
				ДанныеДокумента.БанковскийСчет);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияБИК) Тогда
			ТекстОшибки = НСтр("ru='Не указан БИК банка, в котором открыт банковский счет организации'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключатьПоляФорматаMX Тогда
		Если ДанныеДокумента.ПолучательПризнакРезидентства = "2" 
			И НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательКодСтраныРегистрации) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для получателя %1 с признаком резидентства ""2"" (нерезидент) в поле ""КБе"", не заполнена страна регистрации.'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
		Если ДанныеДокумента.ПолучательПризнакРезидентства = "2" 
			И ДанныеДокумента.ПолучательКодСтраныРегистрации = "KZ" Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У получателя %1 в поле ""КБе"" указан признак резиденства ""2"" (нерезидент) и страна регистрации Казахстан.'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
		Если ДанныеДокумента.ПолучательПризнакРезидентства = "1" 
			И НЕ ДанныеДокумента.ПолучательКодСтраныРегистрации = "KZ" Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для получателя %1 с признаком ""1"" (резидент) в поле ""КБе"", страна регистрации должна быть пустой.'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ФИОРуководителя) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='У организации %1 не указан руководитель'"),
			ДанныеДокумента.Организация);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Организация, , , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.Получатель) Тогда
		ТекстОшибки = НСтр("ru='В документе не указан получатель платежа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательНаименованиеПолное) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='У контрагента %1 не заполнено поле ""Полное наименование""'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательИдентификационныйНомер) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У контрагента %1 не заполнено поле ""БИН/ИИН""'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		ИначеЕсли СтрДлина(СокрЛП(ДанныеДокумента.ПолучательИдентификационныйНомер)) < 12 Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Длина БИН/ИИН контрагента %1 меньше 12 знаков'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательПризнакРезидентства) ИЛИ
			НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательСекторЭкономики) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У контрагента %1 заполнено некорректно поле ""КБе"". КБе должен содержать 2 цифры'"),
				ДанныеДокумента.Получатель);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.Получатель, , , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.БанковскийСчетПолучателя) Тогда
		ТекстОшибки = НСтр("ru='В документе не указан банковский счет получателя платежа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательНомерСчета) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В банковском счете %1 не указан номер счета'"),
				ДанныеДокумента.БанковскийСчетПолучателя);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательБИК) Тогда
			ТекстОшибки = НСтр("ru='Не указан БИК банка, в котором открыт счет получателя'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		КонецЕсли;
	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.КодНазначенияПлатежа) Тогда
		ТекстОшибки = НСтр("ru='Не указан ""Код назначения платежа"" в выгружаемом документе.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщикНаименованиеСокращенное) Тогда
			Если ТипЗнч(ДанныеДокумента.ФактическийПлательщик) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				ТекстМестаУказания = НСтр("ru = '""Полное наименование подразделения"" в данных регистрации в налоговом органе'");		
			Иначе
				ТекстМестаУказания = НСтр("ru = '""Сокращенное наименование"" в данных организации'");		
			КонецЕсли;
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У фактического плательщика %1 не заполнено поле %2'"),
				ДанныеДокумента.ФактическийПлательщик, ТекстМестаУказания);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.ФактическийПлательщик, , , Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У фактического плательщика %1 не заполнено поле ""БИН/ИИН""'"),
				ДанныеДокумента.ФактическийПлательщик);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.ФактическийПлательщик, , , Отказ);
		ИначеЕсли СтрДлина(СокрЛП(ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер)) < 12 Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Длина БИН/ИИН фактического плательщика %1 меньше 12 знаков'"),
				ДанныеДокумента.ФактическийПлательщик);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеДокумента.ФактическийПлательщик, , , Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитовСтрокиСпискаРаботников(ДанныеДокумента, ВыборкаПоСпискуРаботников, Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.ИИН) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не указан ИИН физ.лица %1'"),
			ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВыборкаПоСпискуРаботников.ФизическоеЛицо, , , Отказ);
	ИначеЕсли СтрДлина(СокрЛП(ВыборкаПоСпискуРаботников.ИИН)) < 12 Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Длина ИИН физ. лица %1 меньше 12 знаков'"),
			ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВыборкаПоСпискуРаботников.ФизическоеЛицо, , , Отказ);
	КонецЕсли;
	
	Если ДанныеДокумента.ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
		ИЛИ ДанныеДокумента.ВидОперации = "ВедомостьПрочихДоходовВБанк" Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.НомерЛицевогоСчета) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не указан номер счета физ. лица %1'"),
				ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВыборкаПоСпискуРаботников.ФизическоеЛицо, , , Отказ);
		КонецЕсли;
	ИначеЕсли ДанныеДокумента.ВидНалогаВзносаОтчисления = "ЕП"
		ИЛИ ДанныеДокумента.ВидОперации = "ПеречислениеПрочихВыплат" Тогда
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.ДатаРождения) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не указана дата рождения физ. лица %1'"),
				ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ВыборкаПоСпискуРаботников.ФизическоеЛицо, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ПроцедурыИФункцииФормированияТранспортныхФайлов

Процедура СформироватьФайлЗачисленияЗарплаты(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор)
	
	Отказ = Ложь;
	КоличествоРаботниковВФайле = 500;
	
	ПроверитьЗаполнениеРеквизитовПлатежногоПоручения(ДанныеДокумента, Отказ, ПараметрыВыгрузки.ВключатьПоляФорматаMX);
	ВыборкаПоСпискуРаботников = ВыбратьСписокРаботников(ДанныеДокумента, ПараметрыВыгрузки);
	
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		ПроверитьЗаполнениеРеквизитовСтрокиСпискаРаботников(ДанныеДокумента, ВыборкаПоСпискуРаботников, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru='Произошли ошибки при выгрузке. Выгрузка не выполнена.'");
	КонецЕсли;
	
	// Транспортный файл в формате МТ-102
	ФайлМТ102 = Новый ТекстовыйДокумент;
	
	СформироватьЗаголовокТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
	
	НомерСтроки = 1; ОбщаяСумма = 0; 
	ПараметрыВыгрузки.НомерФайла = 1;
	
	ВыборкаПоСпискуРаботников.Сбросить();
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		
		Если ВыборкаПоСпискуРаботников.СуммаКПеречислению <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НомерСтроки > КоличествоРаботниковВФайле) И (ПараметрыВыгрузки.ФормироватьОтдельныеФайлы) Тогда
			
			СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
			
			СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
			
			СформироватьЗаголовокТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
			
			НомерСтроки = 1; ОбщаяСумма  = 0;
			ПараметрыВыгрузки.НомерФайла = ПараметрыВыгрузки.НомерФайла + 1;
			
		КонецЕсли;
		
		СформироватьСтрокуРаботникаТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки);
		ОбщаяСумма  = ОбщаяСумма + ВыборкаПоСпискуРаботников.СуммаКПеречислению;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
	СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	
	ВыборкаПоСпискуРаботников.Сбросить();
	
КонецПроцедуры

Процедура СформироватьФайлОтчислений(ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор)
	
	Отказ = Ложь;
	КоличествоРаботниковВФайле = 500;
	
	ПроверитьЗаполнениеРеквизитовПлатежногоПоручения(ДанныеДокумента, Отказ, ПараметрыВыгрузки.ВключатьПоляФорматаMX);
	ВыборкаПоСпискуРаботников = ВыбратьСписокРаботников(ДанныеДокумента, ПараметрыВыгрузки);
	
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		ПроверитьЗаполнениеРеквизитовСтрокиСпискаРаботников(ДанныеДокумента, ВыборкаПоСпискуРаботников, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		ВызватьИсключение НСтр("ru='Произошли ошибки при выгрузке. Выгрузка не выполнена.'");
	КонецЕсли;
	
	// Транспортный файл в формате МТ-102
	ФайлМТ102 = Новый ТекстовыйДокумент;
	
	СформироватьЗаголовокФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
	
	НомерСтроки = 1; ОбщаяСумма = 0; 
	ПараметрыВыгрузки.НомерФайла = 1;
	
	Если ПараметрыВыгрузки.РазделятьСуммыПоПериодуЗадолженности
		ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ООСМС"
		ИЛИ ДанныеДокумента.ВидНалогаВзносаОтчисления = "ВОСМС" Тогда
		УведомлятьОбОтрицательнойСумме = Истина;
	Иначе
		УведомлятьОбОтрицательнойСумме = Ложь;
	КонецЕсли;
	
	ВыборкаПоСпискуРаботников.Сбросить();
	Пока ВыборкаПоСпискуРаботников.Следующий() Цикл
		
		Если ВыборкаПоСпискуРаботников.СуммаКПеречислению <= 0 Тогда
			Если УведомлятьОбОтрицательнойСумме Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'По физическому лицу %1 в ведомости присутствует отрицательная сумма %2 за период %3 (сумма не включена в Swift). Чтобы устранить отрицательные суммы в определенном месяце, необходимо проверить и устранить ошибки ведения учета.'"),
					ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование,
					ВыборкаПоСпискуРаботников.СуммаКПеречислению,
					Формат(ВыборкаПоСпискуРаботников.ПериодПлатежаТЧ, "ДФ='ММММ гггг'"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если (НомерСтроки > КоличествоРаботниковВФайле) И (ПараметрыВыгрузки.ФормироватьОтдельныеФайлы) Тогда
			
			СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
			
			СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
			
			СформироватьЗаголовокФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки);
			
			НомерСтроки = 1; ОбщаяСумма  = 0;
			ПараметрыВыгрузки.НомерФайла = ПараметрыВыгрузки.НомерФайла + 1;
			
		КонецЕсли;
		
		СформироватьСтрокуРаботникаФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки);
		ОбщаяСумма  = ОбщаяСумма + ВыборкаПоСпискуРаботников.СуммаКПеречислению;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки);
	СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор);
	
	ВыборкаПоСпискуРаботников.Сбросить();

КонецПроцедуры

Процедура СформироватьЗаголовокТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки)
	
	// Паспорт банка.
	ПаспортБанка = ?(СокрЛП(ДанныеДокумента.ОрганизацияБИК) = "", "F01K059560000000001000001", "F01" + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "00000001000001");
	
	// Номер платежного поручения без префикса и ведущих нулей.
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СокрЛП(ДанныеДокумента.Номер), Истина, Истина);
	
	ВключатьПоляФорматаMX = ПараметрыВыгрузки.ВключатьПоляФорматаMX;
	
	// Заголовок транспортного сообщения.
	ЗаголовокФайла = 
	"{1:"      + ПаспортБанка + "}
	|{2:I102SGROSS000000"+?(ПараметрыВыгрузки.ПриоритетСообщения, "U", "")+"3003}
	|{4:
	|:20:REFERENCE
	|:50:/D/"  + СокрЛП(ДанныеДокумента.ОрганизацияНомерСчета) + "
	|/NAME/"   + СокрЛП(ВРег(ДанныеДокумента.ОрганизацияНаименованиеСокращенное)) + "
	|/IDN/"    + ДанныеДокумента.ОрганизацияИдентификационныйНомер + "
	|/CHIEF/"  + СокрЛП(ВРег(ДанныеДокумента.ФИОРуководителя)) + "
	|/MAINBK/" + СокрЛП(ВРег(?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ФИОГлавногоБухгалтера), НСтр("ru = 'Не предусмотрен'"), ДанныеДокумента.ФИОГлавногоБухгалтера))) + "
	|/IRS/"    + ДанныеДокумента.ОрганизацияПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ОрганизацияСекторЭкономики;
	
	Если ВключатьПоляФорматаMX И ДанныеДокумента.ОрганизацияПризнакРезидентства = "2" И ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияКодСтраныРегистрации) Тогда
		ЗаголовокФайла = ЗаголовокФайла + " 
		|/CTRYOFRES/" + ДанныеДокумента.ОрганизацияКодСтраныРегистрации; 
	КонецЕсли; 

	Если ВключатьПоляФорматаMX И ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
				
		Если ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
			ЗаголовокФайла = ЗаголовокФайла + " 
			|:80:" + " 
			|/NAME/" + ДанныеДокумента.ФактическийПлательщикНаименованиеСокращенное + "
			|/IDN/" + ?(НЕ ПустаяСтрока(ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер), ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер,  "000000000000");	
		КонецЕсли;
		
	КонецЕсли;	 
	
	ЗаголовокФайла = ЗаголовокФайла + "
	|:52B:"    + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "
	|:57B:"    + СокрЛП(ДанныеДокумента.ПолучательБИК) + "
	|:59:"     + СокрЛП(ДанныеДокумента.ПолучательНомерСчета) + "
	|/NAME/"   + СокрЛП(ДанныеДокумента.ПолучательНаименованиеПолное) + "
	|/IDN/"    + ДанныеДокумента.ПолучательИдентификационныйНомер + "
	|/IRS/"    + ДанныеДокумента.ПолучательПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ПолучательСекторЭкономики;
	
	Если ВключатьПоляФорматаMX И ДанныеДокумента.ПолучательПризнакРезидентства = "2" И ЗначениеЗаполнено(ДанныеДокумента.ПолучательКодСтраныРегистрации) Тогда
		ЗаголовокФайла = ЗаголовокФайла + " 
		|/CTRYOFRES/" + ДанныеДокумента.ПолучательКодСтраныРегистрации; 
	КонецЕсли; 

	ЗаголовокФайла = ЗаголовокФайла + "
	|:70:
	|/NUM/"    + СокрЛП(НомерДокумента) + "
	|/DATE/"   + Формат(ДанныеДокумента.Дата, "ДФ=""ггММдд""") + "
	|/VO/01
	|/SEND/07
	|/KNP/"    + ДанныеДокумента.КодНазначенияПлатежа;
	
	ФайлМТ102.ДобавитьСтроку(ЗаголовокФайла);
	
	ТекстНазначенияПлатежа = "/ASSIGN/" + СокрЛП(ДанныеДокумента.НазначениеПлатежа);
	Пока СтрДлина(ТекстНазначенияПлатежа) > 0 Цикл
		ФайлМТ102.ДобавитьСтроку(Сред(ТекстНазначенияПлатежа, 1, 60));
		ТекстНазначенияПлатежа = СокрЛП(Сред(ТекстНазначенияПлатежа, 61));
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьСтрокуРаботникаТранспортногоФайла(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки)
	
	ВключатьПоляФорматаMX = ПараметрыВыгрузки.ВключатьПоляФорматаMX;

	Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Фамилия) Тогда
		
		ФИОРаботника = Новый Массив;
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Фамилия);
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Имя);
		
		Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Отчество) Тогда
			ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Отчество);
		КонецЕсли;
			
	Иначе
		
		ФИОРаботника = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование, " ");
		
	КонецЕсли;
	
	СтрокаФайла = 
	":21:"  + Формат(НомерСтроки, "ЧГ=") + "
	|:32B:" + СокрЛП(ДанныеДокумента.БуквенныйКодВалюты) + Формат(ВыборкаПоСпискуРаботников.СуммаКПеречислению, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧГ=0,0") + "
	|:70:
	|/FM/"  + СокрЛП(ВРег(ФИОРаботника[0])) + "
	|/NM/"  + СокрЛП(ВРег(ФИОРаботника[1]));
	
	Если ФИОРаботника.Количество()>2 Тогда
		СтрокаФайла = СтрокаФайла + "
		|/FT/" + СокрЛП(ВРег(ФИОРаботника[2]));
	Иначе
		Если ПараметрыВыгрузки.ВключатьПолеFT Тогда
			СтрокаФайла = СтрокаФайла + "
			|/FT/";
		КонецЕсли;
	КонецЕсли;
	
	СтрокаФайла = СтрокаФайла + "
	|/IDN/" + ВыборкаПоСпискуРаботников.ИИН + "
	|/LA/"  + СокрЛП(ВыборкаПоСпискуРаботников.НомерЛицевогоСчета);
	
	Если ВключатьПоляФорматаMX Тогда
		Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.ФизЛицоПризнакРезидентства) Тогда
			СтрокаФайла = СтрокаФайла + "
			|/IRS/" + ВыборкаПоСпискуРаботников.ФизЛицоПризнакРезидентства;                
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.ФизЛицоСекторЭкономики) Тогда
			СтрокаФайла = СтрокаФайла + "
			|/SECO/" + ВыборкаПоСпискуРаботников.ФизЛицоСекторЭкономики;              
		КонецЕсли;

		Если ВыборкаПоСпискуРаботников.ФизЛицоПризнакРезидентства = "2" И ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.ФизЛицоКодСтраны) Тогда
			СтрокаФайла = СтрокаФайла + "
			|/CTRYOFRES/" + ВыборкаПоСпискуРаботников.ФизЛицоКодСтраны; 				
		КонецЕсли;      
	КонецЕсли;
	
	ФайлМТ102.ДобавитьСтроку(СтрокаФайла);
	
КонецПроцедуры

Процедура СформироватьКонецТранспортногоФайла(ФайлМТ102, ДанныеДокумента, НомерСтроки, ОбщаяСумма, ПараметрыВыгрузки)

	СтрокаКонцаФайла = 
	":32A:" + Формат(ДанныеДокумента.Дата, "ДФ=""ггММдд""") + СокрЛП(ДанныеДокумента.БуквенныйКодВалюты) + Формат(ОбщаяСумма, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧГ=0,0") + "
	|-}";
	
	ФайлМТ102.ДобавитьСтроку(СтрокаКонцаФайла);
	
КонецПроцедуры

Процедура СформироватьЗаголовокФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки)
	
	// Паспорт банка.
	ПаспортБанка = ?(СокрЛП(ДанныеДокумента.ОрганизацияБИК) = "", "F01K059560000000001000001", "F01" + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "00000001000001");
	
	// Номер платежного поручения без префикса и ведущих нулей.
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СокрЛП(ДанныеДокумента.Номер), Истина, Истина);
	
	ВключатьПоляФорматаMX = ПараметрыВыгрузки.ВключатьПоляФорматаMX;
	
	// Заголовок транспортного сообщения.
	ЗаголовокФайла = 
	"{1:"      + ПаспортБанка + "}
	|{2:I102SGROSS000000"+?(ПараметрыВыгрузки.ПриоритетСообщения, "U", "")+"3003}
	|{4:
	|:20:REFERENCE
	|:50:/D/"  + СокрЛП(ДанныеДокумента.ОрганизацияНомерСчета) + "
	|/NAME/"   + СокрЛП(ВРег(ДанныеДокумента.ОрганизацияНаименованиеСокращенное)) + "
	|/IDN/"    + ДанныеДокумента.ОрганизацияИдентификационныйНомер + "
	|/CHIEF/"  + СокрЛП(ВРег(ДанныеДокумента.ФИОРуководителя)) + "
	|/MAINBK/" + СокрЛП(ВРег(?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ФИОГлавногоБухгалтера), НСтр("ru = 'Не предусмотрен'"), ДанныеДокумента.ФИОГлавногоБухгалтера))) + "
	|/IRS/"    + ДанныеДокумента.ОрганизацияПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ОрганизацияСекторЭкономики;
	
	Если ВключатьПоляФорматаMX И ДанныеДокумента.ОрганизацияПризнакРезидентства = "2" И ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияКодСтраныРегистрации) Тогда
		ЗаголовокФайла = ЗаголовокФайла + " 
		|/CTRYOFRES/" + ДанныеДокумента.ОрганизацияКодСтраныРегистрации; 
	КонецЕсли; 

	Если ВключатьПоляФорматаMX И ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
				
		Если ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
			ЗаголовокФайла = ЗаголовокФайла + " 
			|:80:" + " 
			|/NAME/" + ДанныеДокумента.ФактическийПлательщикНаименованиеСокращенное + "
			|/IDN/" + ?(НЕ ПустаяСтрока(ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер), ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер,  "000000000000");	
		КонецЕсли;
		
	КонецЕсли;	 
	
	ЗаголовокФайла = ЗаголовокФайла + "
	|:52B:"    + СокрЛП(ДанныеДокумента.ОрганизацияБИК) + "
	|:57B:"    + СокрЛП(ДанныеДокумента.ПолучательБИК) + "
	|:59:"     + СокрЛП(ДанныеДокумента.ПолучательНомерСчета) + "
	|/NAME/"   + СокрЛП(ДанныеДокумента.ПолучательНаименованиеПолное) + "
	|/IDN/"    + ДанныеДокумента.ПолучательИдентификационныйНомер + "
	|/IRS/"    + ДанныеДокумента.ПолучательПризнакРезидентства + "
	|/SECO/"   + ДанныеДокумента.ПолучательСекторЭкономики;
	
	Если ВключатьПоляФорматаMX И ДанныеДокумента.ПолучательПризнакРезидентства = "2" И ЗначениеЗаполнено(ДанныеДокумента.ПолучательКодСтраныРегистрации) Тогда
		ЗаголовокФайла = ЗаголовокФайла + " 
		|/CTRYOFRES/" + ДанныеДокумента.ПолучательКодСтраныРегистрации; 
	КонецЕсли; 

	ЗаголовокФайла = ЗаголовокФайла + "
	|:70:
	|/NUM/"    + СокрЛП(НомерДокумента) + "
	|/DATE/"   + Формат(ДанныеДокумента.Дата, "ДФ=""ггММдд""") + "
	|/VO/01
	|/SEND/07
	|/KNP/"    + ДанныеДокумента.КодНазначенияПлатежа;
	
	Если ПараметрыВыгрузки.ВключатьПолеPSO Тогда
		ЗаголовокФайла = ЗаголовокФайла + "
		|/PSO/01";
	КонецЕсли;
	
	Если ПараметрыВыгрузки.ВключатьПолеPRT Тогда
		ЗаголовокФайла = ЗаголовокФайла + "
		|/PRT/05";
	КонецЕсли;

	Ведомости = ДанныеДокумента.Ведомости;
	Если Ведомости.Количество() > 0 И ТипЗнч(Ведомости[0]) = Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомости[0], "ВидПрочихВыплат"); 
		ПериодПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомости[0], "ДатаПлатежа");
	ИначеЕсли Ведомости.Количество() > 0 Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомости[0], "ВидНалогаВзносаОтчисления"); 
		ПериодПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомости[0], "ПериодРегистрации"); 
	КонецЕсли;
	
	Если ВидОперации <> Неопределено 
	 	И (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Справочник.ВидыПрочихВыплат.ПрофессиональнаяВыплатаЗаСчетРаботодателя"))
		И ПараметрыВыгрузки.ПолеPERIODвЗаголовке = 1 Тогда
		ЗаголовокФайла = ЗаголовокФайла + "
		|/PERIOD/" + Формат(ПериодПлатежа, "ДФ=""ММгггг""");
	КонецЕсли;

	ФайлМТ102.ДобавитьСтроку(ЗаголовокФайла);
	
	ТекстНазначенияПлатежа = "/ASSIGN/" + СокрЛП(ДанныеДокумента.НазначениеПлатежа);
	Пока СтрДлина(ТекстНазначенияПлатежа) > 0 Цикл
		ФайлМТ102.ДобавитьСтроку(Сред(ТекстНазначенияПлатежа, 1, 60));
		ТекстНазначенияПлатежа = СокрЛП(Сред(ТекстНазначенияПлатежа, 61));
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьСтрокуРаботникаФайлаОтчислений(ФайлМТ102, ДанныеДокумента, ВыборкаПоСпискуРаботников, НомерСтроки, ПараметрыВыгрузки)
	
	ДобавитьКлючевоеСловоOPV = Истина;
	
	ВключатьПоляФорматаMX = ПараметрыВыгрузки.ВключатьПоляФорматаMX;
	
	Если ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
		ПрефиксПоля =  "S";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ") Тогда
		ПрефиксПоля =  "C";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ") Тогда
		ПрефиксПоля =  "P";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС") Тогда
		ПрефиксПоля =  "M";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС") Тогда
		ПрефиксПоля =  "R";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
		ПрефиксПоля =  "H";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР") Тогда
		ПрефиксПоля =  "E";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыПрочихВыплат.ПрофессиональнаяВыплатаЗаСчетРаботодателя") Тогда
		ПрефиксПоля =  "D";
	ИначеЕсли ВыборкаПоСпискуРаботников.ВидПлатежа = "ПеречислениеПрочихВыплат" Тогда
		ДобавитьКлючевоеСловоOPV = Ложь;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Фамилия) Тогда
		
		ФИОРаботника = Новый Массив;
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Фамилия);
		ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Имя);
		
		Если ЗначениеЗаполнено(ВыборкаПоСпискуРаботников.Отчество) Тогда
			ФИОРаботника.Добавить(ВыборкаПоСпискуРаботников.Отчество);
		КонецЕсли;
		
	Иначе
		
		ФИОРаботника = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыборкаПоСпискуРаботников.ФизическоеЛицоНаименование, " ");
		
	КонецЕсли;
	СтрокаФайла = 
	":21:"  + Формат(НомерСтроки, "ЧГ=") + "
	|:32B:" + СокрЛП(ДанныеДокумента.БуквенныйКодВалюты) + Формат(ВыборкаПоСпискуРаботников.СуммаКПеречислению, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=; ЧГ=0,0") + "
	|:70:" + ?(ДобавитьКлючевоеСловоOPV, "
	|/OPV/" + ПрефиксПоля
	, "") + "
	|/FM/"  + СокрЛП(ВРег(ФИОРаботника[0])) + "
	|/NM/"  + СокрЛП(ВРег(ФИОРаботника[1]));
	
	Если ФИОРаботника.Количество()>2 Тогда
		СтрокаФайла = СтрокаФайла + "
		|/FT/" + СокрЛП(ВРег(ФИОРаботника[2]));
	Иначе
		Если ПараметрыВыгрузки.ВключатьПолеFT Тогда
			СтрокаФайла = СтрокаФайла + "
			|/FT/";
		КонецЕсли;
	КонецЕсли;
	
	СтрокаФайла = СтрокаФайла + "
	|/DT/"  + Формат(ВыборкаПоСпискуРаботников.ДатаРождения, "ДФ=""ггггММдд""") + "
	|/IDN/" + ВыборкаПоСпискуРаботников.ИИН;
	
	ВидОперации = ВыборкаПоСпискуРаботников.ВидОперации;
	ВидПлатежа = ВыборкаПоСпискуРаботников.ВидПлатежа; 
	
	Если ВидОперации <> Неопределено 
		И (ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВ")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Справочник.ВидыПрочихВыплат.ПрофессиональнаяВыплатаЗаСчетРаботодателя"))
		И ПараметрыВыгрузки.ПолеPERIODвЗаголовке = 0 Тогда
		СтрокаФайла = СтрокаФайла + "
		|/PERIOD/" + Формат(ВыборкаПоСпискуРаботников.ПериодПлатежаТЧ, "ДФ=""ММгггг""");
	КонецЕсли;
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
		
		ДанныеКНПЕП = УчетНалоговВзносовОтчисленийРасширенныйКлиентСервер.ПолучитьТекстКНППлатежейДляЕП(ВыборкаПоСпискуРаботников, ВидПлатежа);
		
		СтрокаФайла = СтрокаФайла + ДанныеКНПЕП.ТекстAssign;
		
	КонецЕсли;
	
	ФайлМТ102.ДобавитьСтроку(СтрокаФайла);
	
КонецПроцедуры

Процедура СохранитьТранспортныйФайл(ФайлМТ102, ДанныеДокумента, ПараметрыВыгрузки, СтруктураПередаваемыхФайлов, УникальныйИдентификатор)
	
	ПолныйКаталогВыгрузки = ПараметрыВыгрузки.КаталогВыгрузки + Формат(ТекущаяДатаСеанса(), "ДФ=""дд-ММ-гг""") + "." + ПараметрыВыгрузки.НомерФайла + "\";
	
	// Номер платежного поручения без префикса и ведущих нулей.
	НомерДокумента = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СокрЛП(ДанныеДокумента.Номер), Истина, Истина);
	
	Если ДанныеДокумента.ВидОперации = "ПеречислениеВзносов" Тогда
		ВидПеречисления = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1_%2'"), НСтр("ru = 'Перечисление'"), ДанныеДокумента.ВидНалогаВзносаОтчисления);
	Иначе
		ВидПеречисления = ДанныеДокумента.ВидОперации;
	КонецЕсли;
	
	ИмяТранспортногоФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1_%2_%3.txt'"), ВидПеречисления, НомерДокумента, "Swift");
	
	ИмяФайла = ПолныйКаталогВыгрузки + ИмяТранспортногоФайла;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	
	ЗаписатьДанныеВФайл(ФайлМТ102, ВременныйФайл, ПараметрыВыгрузки);
	
	СтруктураПередаваемыхФайлов.Вставить(ИмяФайла, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременныйФайл), УникальныйИдентификатор));
	
	ФайлМТ102.Очистить();
	
	Попытка
		УдалитьФайлы(ВременныйФайл);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка данных в МТ-102'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение,,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось удалить временный файл
			|%1
			|по причине: %2'"), ВременныйФайл, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьДанныеВФайл(СохраняемыйТекстовыйДокумент, ПолноеИмяФайла, ПараметрыВыгрузки)
	
	Если ПараметрыВыгрузки.Кодировка = "Windows" Тогда
		ЗаписатьФайлЧерезКомпоненту(СохраняемыйТекстовыйДокумент.ПолучитьТекст(), ПолноеИмяФайла);
	ИначеЕсли ПараметрыВыгрузки.Кодировка = "DOS" Тогда
		СохраняемыйТекстовыйДокумент.Записать(ПолноеИмяФайла, КодировкаТекста.OEM);
	ИначеЕсли ПараметрыВыгрузки.Кодировка = "UTF8" Тогда
		СохраняемыйТекстовыйДокумент.Записать(ПолноеИмяФайла, КодировкаТекста.UTF8);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьФайлЧерезКомпоненту(СохраняемыйТекст, ПолноеИмяФайла)
	
	// Обеспечить возможность подключения TextWriter1048KZ из внешних обработок, заменив:
	// - "ВнешняяОбработкаОбъект.<Имя>" на "ВнешняяОбработка.<Имя>"
	// - "ОбработкаОбъект.<Имя>" на "Обработка.<Имя>"
	ИмяОбъекта = Строка(ЭтотОбъект);		
	ИмяОбъекта = СтрЗаменить(ИмяОбъекта, "ОбработкаОбъект.", "Обработка.");
	ИмяМакета = ИмяОбъекта + ".Макет.TextWriter1048KZ_dll";
	
	УдалосьЗаписатьФайл = Ложь;
	ТекстОшибки = "";
	
	Попытка
		
		Если ПодключитьВнешнююКомпоненту(ИмяМакета, "TextWriter1048KZ_dll", ТипВнешнейКомпоненты.Native, ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
			
			TextWriter1048KZ_dll = Новый("AddIn.TextWriter1048KZ_dll.TextWriter1048KZ");
			ТекстДляКонвертирования = СохраняемыйТекст;
			TextWriter1048KZ_dll = TextWriter1048KZ_dll.Конвертировать(ТекстДляКонвертирования);
			TextWriter1048KZ_dll.Записать(ПолноеИмяФайла);
			
			УдалосьЗаписатьФайл = Истина;
			
		Иначе	
			
			УдалосьЗаписатьФайл = Ложь;
			ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту TextWriter1048KZ.'");
			
		КонецЕсли;	
		
	Исключение
		
		УдалосьЗаписатьФайл = Ложь;
		ТекстОшибки = ОписаниеОшибки();
		
	КонецПопытки;
		
	Если НЕ УдалосьЗаписатьФайл Тогда
		
		ТекстСообщения = НСтр(
		"ru = 'Не удалось сохранить файл в кодировке Windows по причине:
		|[ТекстОшибки]
		|Попробуйте сохранить файл в другой кодировке.'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "[ТекстОшибки]", СокрЛП(ТекстОшибки));
		
		Сообщить(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
