////////////////////////////////////////////////////////////////////////////////
// Подсистема "Охрана труда"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОбработками.
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	Разделы.Добавить(Метаданные.Подсистемы.ОхранаТруда);
КонецПроцедуры

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОтчетами.
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	Разделы.Добавить(Метаданные.Подсистемы.ОхранаТруда);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "8178f1be-da85-47e0-9ee0-0dda89fc9fc2", Метаданные.Справочники.РабочиеМестаОхраныТруда);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "cc4ef09c-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.НазначениеРабочихМестСотрудникам);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.Инструктажи") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf93-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ИнструктажПоОхранеТруда);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dc002-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ВидыИнструктажейПоОхранеТруда);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.НесчастныеСлучаи") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf64-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.НесчастныйСлучайНаПроизводстве);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf9a-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПоследствияНесчастногоСлучая);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf84-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПротоколОпросаУчастникаНесчастногоСлучая);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4f0-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ВидыПроисшествий);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4ea-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ПоследствияНесчастныхСлучаев);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf46-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ПричиныПроисшествий);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.СпециальнаяОценкаУсловийТруда") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfe9-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ДекларацияСоответствияУсловийТруда);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfbe-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПодготовкаСпецоценкиУсловийТруда);
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf36-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РезультатыСпецоценкиУсловийТруда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РабочиеМестаСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РабочиеМестаСотрудниковИнтервальный, Истина);
	Списки.Вставить(Метаданные.Документы.НазначениеРабочихМестСотрудникам, Истина);
	Списки.Вставить(Метаданные.Справочники.НазначениеРабочихМестСотрудникамПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РабочиеМестаОхраныТруда, Истина);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.Инструктажи") Тогда
		Списки.Вставить(Метаданные.Документы.ИнструктажПоОхранеТруда, Истина);
		Списки.Вставить(Метаданные.Справочники.ИнструктажПоОхранеТрудаПрисоединенныеФайлы, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.ИнструктажиПоОхранеТруда, Истина);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.НесчастныеСлучаи") Тогда
		Списки.Вставить(Метаданные.Документы.НесчастныйСлучайНаПроизводстве, Истина);
		Списки.Вставить(Метаданные.Документы.ПоследствияНесчастногоСлучая, Истина);
		Списки.Вставить(Метаданные.Документы.ПротоколОпросаУчастникаНесчастногоСлучая, Истина);
		Списки.Вставить(Метаданные.Справочники.НесчастныйСлучайНаПроизводствеПрисоединенныеФайлы, Истина);
		Списки.Вставить(Метаданные.Справочники.ПоследствияНесчастногоСлучаяПрисоединенныеФайлы, Истина);
		Списки.Вставить(Метаданные.Справочники.ПротоколОпросаУчастникаНесчастногоСлучаяПрисоединенныеФайлы, Истина);
		Списки.Вставить(Метаданные.ЖурналыДокументов.НесчастныеСлучаи, Истина);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.СпециальнаяОценкаУсловийТруда") Тогда
		Списки.Вставить(Метаданные.Документы.ДекларацияСоответствияУсловийТруда, Истина);
		Списки.Вставить(Метаданные.Документы.ПодготовкаСпецоценкиУсловийТруда, Истина);
		Списки.Вставить(Метаданные.Документы.РезультатыСпецоценкиУсловийТруда, Истина);
		Списки.Вставить(Метаданные.Справочники.ДекларацияСоответствияУсловийТрудаПрисоединенныеФайлы, Истина);
		Списки.Вставить(Метаданные.Справочники.ПодготовкаСпецоценкиУсловийТрудаПрисоединенныеФайлы, Истина);
		Списки.Вставить(Метаданные.Справочники.РезультатыСпецоценкиУсловийТрудаПрисоединенныеФайлы, Истина);
		Списки.Вставить(Метаданные.ЖурналыДокументов.СпецоценкаУсловийТруда, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда, Истина);
		Списки.Вставить(Метаданные.РегистрыСведений.РезультатыСпециальнойОценкиУсловийТруда, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает дату вступления в силу приказа Министерства труда и социальной защиты РФ от 14.11.2016 № 642н.
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаВступленияВСилуФормыДекларации2017Года() Экспорт
	Возврат '20170201';
КонецФункции

// Возвращает дату вступления в силу приказа Министерства труда и социальной защиты РФ от 17 июня 2021 № 406н.
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаВступленияВСилуФормыДекларации2022Года() Экспорт
	Возврат '20220301';
КонецФункции

// Возвращает дату вступления в силу приказа Министерства труда и социальной защиты РФ от 20 апреля 2022 г. N 223н.
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаВступленияВСилуПриказа223Н() Экспорт
	Возврат '20220901';
КонецФункции

Функция КодГруппыУстаревшихЭлементов() Экспорт
	Возврат "9999";
КонецФункции

Функция ОхранаТрудаИспользуется() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьИнструктажиПоОхранеТруда")
		Или ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры");
	
КонецФункции

Функция ОхранаТрудаДоступнаПользователю() Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат Ложь;
	Иначе
		Возврат ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест)
			Или ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ИнструктажиПоОхранеТруда)
			Или ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда);
	КонецЕсли;
	
КонецФункции

Функция ЗначенияВзносовВредностиПФР(ОбъектДанных, ДополнительныеРеквизиты = "", ЭтоОбновление = Ложь) Экспорт
	
	ИменаРеквизитов = "ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,
					  |ОснованиеДосрочногоНазначенияПенсии,
					  |ОсобыеУсловияТрудаПФР,
					  |ПроцентНадбавкиЗаВредность,
					  |ВыплачиваетсяНадбавкаЗаВредность,
					  |КодПозицииСпискаПФР";
	
	Если Не ПустаяСтрока(ДополнительныеРеквизиты) Тогда
		ИменаРеквизитов = ИменаРеквизитов + "," + ДополнительныеРеквизиты;
	КонецЕсли;
	
	Если Не ТипЗнч(ОбъектДанных) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		ИменаРеквизитов = ИменаРеквизитов + ",КоличествоДнейДополнительногоОтпускаВГод";
	КонецЕсли;
	
	Если Не ТипЗнч(ОбъектДанных) = Тип("СправочникСсылка.УсловияТруда") И Не ЭтоОбновление Тогда
		ИменаРеквизитов = ИменаРеквизитов + ",ХарактерВыполняемыхРаботПФР,ПервичныеДокументыПФР";
	КонецЕсли;
	
	Если ТипЗнч(ОбъектДанных) = Тип("ДанныеФормыСтруктура") Тогда
		СведенияОбъектаДанных = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(СведенияОбъектаДанных, ОбъектДанных);
	Иначе
		СведенияОбъектаДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектДанных, ИменаРеквизитов);
	КонецЕсли;
	
	Если ТипЗнч(ОбъектДанных) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		Если СведенияОбъектаДанных.ВыплачиваетсяНадбавкаЗаВредность Тогда
			ОтпускЗаВредность = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускЗаВредность");
			Если НЕ ЗначениеЗаполнено(ОтпускЗаВредность) Тогда
				Возврат СведенияОбъектаДанных;
			КонецЕсли;
			
			РеквизитыОтпуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтпускЗаВредность, "ПометкаУдаления,Недействителен");
			Если РеквизитыОтпуска.ПометкаУдаления ИЛИ РеквизитыОтпуска.Недействителен Тогда
				Возврат СведенияОбъектаДанных;
			КонецЕсли;
			СтрокиВредногоОтпуска = ОбъектДанных.ЕжегодныеОтпуска.НайтиСтроки(Новый Структура("ВидЕжегодногоОтпуска", ОтпускЗаВредность));
			Если СтрокиВредногоОтпуска.Количество() > 0 Тогда
				СведенияОбъектаДанных.Вставить("КоличествоДнейДополнительногоОтпускаВГод", СтрокиВредногоОтпуска[0].КоличествоДнейВГод);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СведенияОбъектаДанных;
	
КонецФункции

Функция ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапросаКомпоновки, ТолькоРазрешенные) Экспорт
	
	Запрос = Неопределено;
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат Запрос;
	КонецЕсли;
	
	Если ВРег(ИмяПредставления) = ВРег("РабочиеМестаОхраныТруда") Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто,
		|	РабочиеМестаОхраныТруда.Номер,
		|	РабочиеМестаОхраныТруда.Владелец КАК Организация,
		|	РабочиеМестаОхраныТруда.Подразделение,
		|	РабочиеМестаОхраныТруда.Должность,
		|	РабочиеМестаОхраныТруда.ВАрхиве,
		|	РабочиеМестаОхраныТруда.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	РабочиеМестаОхраныТруда.ОснованиеДосрочногоНазначенияПенсии,
		|	РабочиеМестаОхраныТруда.ОсобыеУсловияТрудаПФР,
		|	РабочиеМестаОхраныТруда.КодПозицииСпискаПФР,
		|	РабочиеМестаОхраныТруда.ВыплачиваетсяНадбавкаЗаВредность,
		|	РабочиеМестаОхраныТруда.ПроцентНадбавкиЗаВредность,
		|	РабочиеМестаОхраныТруда.КоличествоДнейДополнительногоОтпускаВГод
		|ПОМЕСТИТЬ Представления_РабочиеМестаОхраныТруда
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|ГДЕ
		|	НЕ РабочиеМестаОхраныТруда.ЭтоГруппа";
		
		Если ТипЗнч(ПараметрыЗапросаКомпоновки.ДатаАктуальности) = Тип("Строка") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", ПараметрыЗапросаКомпоновки.ДатаАктуальности);
		Иначе
			Запрос.УстановитьПараметр("ДатаАктуальности", ПараметрыЗапросаКомпоновки.ДатаАктуальности);
		КонецЕсли;
		ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция НаборЗаписейРегистраСведенийИзВыборки(Выборка, ИмяРегистра) Экспорт

	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат НаборЗаписей;

КонецФункции

Процедура ОбработатьРегистрСведенийПодчиненныйРегистратору(ВыборкаРегистратор, ИмяРегистра) Экспорт

	Пока ВыборкаРегистратор.Следующий() Цикл
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		
		Выборка = ВыборкаРегистратор.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;

КонецПроцедуры

Функция ДанныеПоРабочимМестам(Организация, ДатаНачала, ДатаОкончания, Подразделение = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.Организация = Организация;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода = ДатаНачала;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода = ДатаОкончания;
	
	Если Не Подразделение = Неопределено Тогда
		ПараметрыПолученияСотрудниковОрганизаций.Подразделение = Подразделение;
	КонецЕсли;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций);
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОрганизации");
	КадровыеДанные = "РабочееМестоОхраныТруда, Подразделение, Должность, Пол, ДатаРождения, Инвалидность, СтраховойНомерПФР";
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто, КадровыеДанныеСотрудников.РабочееМестоОхраныТруда) КАК РабочееМесто,
	|	ЕСТЬNULL(АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.АналогичноеРабочееМесто, НЕОПРЕДЕЛЕНО) КАК АналогичноеМесто,
	|	КадровыеДанныеСотрудников.Должность КАК Должность,
	|	КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
	|	КлассыУсловийТрудаПоДолжностямСрезПоследних.КлассУсловийТруда КАК КлассУсловийТруда,
	|	КлассыУсловийТрудаПоДолжностямСрезПоследних.ДатаРегистрацииИзменений КАК ДатаПредыдущейОценки
	|ПОМЕСТИТЬ ВТРабочиеМеста
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
	|		ПО КадровыеДанныеСотрудников.РабочееМестоОхраныТруда = АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.АналогичноеРабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям.СрезПоследних(&ДатаНачала, ) КАК КлассыУсловийТрудаПоДолжностямСрезПоследних
	|		ПО КадровыеДанныеСотрудников.РабочееМестоОхраныТруда = КлассыУсловийТрудаПоДолжностямСрезПоследних.Должность
	|ГДЕ
	|	КадровыеДанныеСотрудников.РабочееМестоОхраныТруда ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДокументыСКомиссией.Документ) КАК Документ
	|ПОМЕСТИТЬ ВТДокументыСКомиссией
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПодготовкаСпецоценкиУсловийТруда.Ссылка) КАК Документ
	|	ИЗ
	|		Документ.ПодготовкаСпецоценкиУсловийТруда КАК ПодготовкаСпецоценкиУсловийТруда
	|	ГДЕ
	|		ПодготовкаСпецоценкиУсловийТруда.Организация = &Организация
	|		И ПодготовкаСпецоценкиУсловийТруда.ДатаНачала < &ДатаНачала
	|		И ПодготовкаСпецоценкиУсловийТруда.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МАКСИМУМ(РезультатыСпецоценкиУсловийТруда.Ссылка)
	|	ИЗ
	|		Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
	|	ГДЕ
	|		РезультатыСпецоценкиУсловийТруда.Организация = &Организация
	|		И РезультатыСпецоценкиУсловийТруда.ДатаНачала < &ДатаНачала
	|		И РезультатыСпецоценкиУсловийТруда.Проведен) КАК ДокументыСКомиссией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПодготовкаСпецоценкиУсловийТрудаКомиссия.ЧленКомиссии, РезультатыСпецоценкиУсловийТрудаКомиссия.ЧленКомиссии) КАК ЧленКомиссии,
	|	ЕСТЬNULL(ПодготовкаСпецоценкиУсловийТрудаКомиссия.Должность, РезультатыСпецоценкиУсловийТрудаКомиссия.Должность) КАК Должность,
	|	ЕСТЬNULL(ПодготовкаСпецоценкиУсловийТрудаКомиссия.РольВКомиссии, РезультатыСпецоценкиУсловийТрудаКомиссия.РольВКомиссии) КАК РольВКомиссии
	|ИЗ
	|	ВТДокументыСКомиссией КАК ДокументыСКомиссией
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПодготовкаСпецоценкиУсловийТруда.Комиссия КАК ПодготовкаСпецоценкиУсловийТрудаКомиссия
	|		ПО ДокументыСКомиссией.Документ = ПодготовкаСпецоценкиУсловийТрудаКомиссия.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.Комиссия КАК РезультатыСпецоценкиУсловийТрудаКомиссия
	|		ПО ДокументыСКомиссией.Документ = РезультатыСпецоценкиУсловийТрудаКомиссия.Ссылка
	|ГДЕ
	|	(ПодготовкаСпецоценкиУсловийТрудаКомиссия.ЧленКомиссии ЕСТЬ НЕ NULL 
	|			ИЛИ РезультатыСпецоценкиУсловийТрудаКомиссия.ЧленКомиссии ЕСТЬ НЕ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	РабочиеМеста.Подразделение КАК Подразделение,
	|	РабочиеМеста.Должность КАК Должность,
	|	РабочиеМеста.АналогичноеМесто КАК АналогичноеМесто,
	|	РабочиеМеста.КлассУсловийТруда КАК КлассУсловийТрудаПоРезультатамПредыдущейОценки,
	|	РабочиеМеста.ДатаПредыдущейОценки КАК ДатаПредыдущейОценки
	|ИЗ
	|	ВТРабочиеМеста КАК РабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.Подразделение,
	|	РабочиеМеста.Должность,
	|	РабочиеМеста.ДатаПредыдущейОценки,
	|	РабочиеМеста.АналогичноеМесто,
	|	РабочиеМеста.КлассУсловийТруда
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМеста.РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	КадровыеДанныеСотрудников.РабочееМестоОхраныТруда КАК РабочееМесто,
	|	КадровыеДанныеСотрудников.Пол КАК Пол,
	|	КадровыеДанныеСотрудников.ДатаРождения КАК ДатаРождения,
	|	КадровыеДанныеСотрудников.Инвалидность КАК Инвалидность,
	|	КадровыеДанныеСотрудников.СтраховойНомерПФР КАК СтраховойНомерПФР
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|ГДЕ
	|	КадровыеДанныеСотрудников.РабочееМестоОхраныТруда ЕСТЬ НЕ NULL ";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#Область КадровыеДанныеСотрудников

Функция ДобавитьПолеСведенийОРабочихМестахСотрудников(ИмяПоля, ТекстыОписанияПолей, ИсточникиДанных) Экспорт
	
	ДобавленоПолеСведений = Ложь;
	Если НеобходимыСведенияОРабочихМестахСотрудников(ИмяПоля) Тогда
		ДобавленоПолеСведений = Истина;
		ИсточникиДанных.Вставить("СведенияОРабочихМестахСотрудников", Истина);
		
		ПутьКДанным = ПутьКДаннымСведенийОРабочихМестахСотрудников(ИмяПоля);
		ТекстыОписанияПолей.Добавить(ПутьКДанным + " КАК " + ИмяПоля);
	ИначеЕсли НеобходимИсточникДанныхОРабочихМестахСотрудников(ИмяПоля) Тогда
		ИсточникиДанных.Вставить("СведенияОРабочихМестахСотрудников", Истина);
	КонецЕсли;
	
	Возврат ДобавленоПолеСведений;
	
КонецФункции

Функция ДобавитьКритерийПоискаПоСведениямОРабочихМестахСотрудников(КритерииПоиска, УсловиеПоиска) Экспорт
	
	КритерийДобавлен = Ложь;
	Если НеобходимыСведенияОРабочихМестахСотрудников(УсловиеПоиска.ЛевоеЗначение) Тогда
		
		ИмяПоля = ВРег(УсловиеПоиска.ЛевоеЗначение);
		Если ИмяПоля = ВРег("РабочееМестоОхраныТрудаПериодРегистрации") Тогда
			УсловиеПоиска.ЛевоеЗначение = "Период";
		ИначеЕсли ИмяПоля = ВРег("РабочееМестоОхраныТрудаРегистратор") Тогда
			УсловиеПоиска.ЛевоеЗначение = "Регистратор";
		ИначеЕсли ИмяПоля = ВРег("РабочееМестоОхраныТруда") Тогда
			УсловиеПоиска.ЛевоеЗначение = "РабочееМесто";
		КонецЕсли;
		
		КадровыйУчет.ДобавитьКритерийПоискаСотрудников(КритерииПоиска, "РегистрСведений.РабочиеМестаСотрудников", УсловиеПоиска);
		КритерийДобавлен = Истина;
		
	КонецЕсли; 
	
	Возврат КритерийДобавлен;
	
КонецФункции

Процедура ЗаполнитьПоляПредставленийКадровыхДанныхСотрудников(ДополнительныеПоляПредставлений, ПутьКПолямСотрудника) Экспорт
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РабочееМестоОхраныТруда";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РабочееМестоОхраныТруда";
	
	ОписаниеПоля = ДополнительныеПоляПредставлений.Добавить();
	ОписаниеПоля.ИмяПоля = "РабочееМестоОхраныТрудаПериодРегистрации";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ДАТАВРЕМЯ(1, 1, 1)";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".РабочееМестоОхраныТрудаДатаРегистрации";
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВТСведенийОРабочихМестахСотрудников(Запрос, ТолькоРазрешенные,
			ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИсточникиДанных) Экспорт

	Если ИсточникиДанных.Получить("СведенияОРабочихМестахСотрудников") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗапросВТ = ЗапросВТСведенияОРабочихМестахСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов,
		ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень);

	ЗарплатаКадрыОбщиеНаборыДанных.СкопироватьПараметрыЗапроса(Запрос, ЗапросВТ);
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(ЗапросВТ.Текст);
	ЧастиЗапроса.Добавить(ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов());
	ЧастиЗапроса.Добавить(Запрос.Текст);
	
	ДобавитьСоединениеВТСведенияОРабочихМестахСотрудников(ЧастиЗапроса, ОписательВременнойТаблицыОтборов);
	
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	
	КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "ВТКУничтожению", "ВТСведенияОРабочихМестахСотрудников");
	
КонецПроцедуры

Функция ИсточникИнформацииОКлассахУсловийТруда() Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "РабочееМесто";
	
КонецФункции

Функция ИмяИсточникаДанныхКадровойИсторииСотрудников(ИсточникиДанных) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "ВТСведенияОРабочихМестахСотрудников";
	
КонецФункции

Процедура ДобавитьСоединениеСКадровымиДанными(ОписательВременнойТаблицыОтборов, ЧастиЗапроса, ИмяПоляДолжность) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСоединениеВТСведенияОРабочихМестахСотрудников(ЧастиЗапроса, ОписательВременнойТаблицыОтборов);
	
	ЧастиЗапроса.Добавить(
		"		{ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОКлассахУсловийТруда КАК КлассыУсловийТрудаПоДолжностям
		|		ПО СведенияОРабочихМестахСотрудников." + ИмяПоляДолжность + " = КлассыУсловийТрудаПоДолжностям.Должность
		|			И ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляПериод + " = КлассыУсловийТрудаПоДолжностям.Период}");
	
КонецПроцедуры

Процедура ДополнитьИменаКадровыхДанных(КадровыеДанные, ПредставлениеВместоИмени = Ложь) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПредставлениеВместоИмени Тогда
		ИмяКадровыхДанных = "РабочееМесто";
	Иначе
		ИмяКадровыхДанных = "РабочееМестоОхраныТруда";
	КонецЕсли;
	
	КадровыеДанные = ?(ПустаяСтрока(КадровыеДанные), "", КадровыеДанные + ",") + ИмяКадровыхДанных;
	
КонецПроцедуры

#КонецОбласти

#Область ДвиженияПоРабочимМестамСотрудников

Процедура СформироватьДвиженияПоРабочимМестам(Движения, ДанныеДляПроведения) Экспорт
	
	Если Не ДанныеДляПроведения.Свойство("РабочиеМестаСотрудников")
		Или Не ЗначениеЗаполнено(ДанныеДляПроведения.РабочиеМестаСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДанныхДляПроведения Из ДанныеДляПроведения.РабочиеМестаСотрудников Цикл
		СтрокаДвижений = Движения.РабочиеМестаСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаДанныхДляПроведения);
	КонецЦикла;
	
	Если Движения.РабочиеМестаСотрудников.Количество() > 0 Тогда
		Движения.РабочиеМестаСотрудников.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриемНаРаботуСведенияОРабочихМестахСотрудников(ДанныеДляПроведения, Запрос, ИмяПериода = "") Экспорт
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.ДатаПриема КАК Период,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.РабочееМесто КАК РабочееМесто
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)";
	
	Если Не ПустаяСтрока(ИмяПериода) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДатаПриема", ИмяПериода);
	КонецЕсли;
	
	// Набор сведений для проведения по рабочим местам сотрудников
	СведенияОРабочихМестахСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("РабочиеМестаСотрудников", СведенияОРабочихМестахСотрудников);
	
КонецПроцедуры

Процедура КадровыйПереводСведенияОРабочихМестахСотрудников(ДанныеДляПроведения, Запрос) Экспорт
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.ДатаНачала КАК Период,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.РабочееМесто КАК РабочееМесто,
		|	ВЫБОР
		|		КОГДА Сотрудники.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(Сотрудники.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ Сотрудники.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо
		|ИЗ
		|	ВТСотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИзменитьРабочееМесто";		
	
	// Набор сведений для проведения по рабочим местам сотрудников
	СведенияОРабочихМестахСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("РабочиеМестаСотрудников", СведенияОРабочихМестахСотрудников);
	
КонецПроцедуры

Процедура ПеремещениеВДругоеПодразделениеСведенияОРабочихМестахСотрудников(ДанныеДляПроведения, Запрос) Экспорт
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПеремещениеВДругоеПодразделениеСотрудники.Ссылка.ДатаПеремещения КАК Период,
		|	ПеремещениеВДругоеПодразделениеСотрудники.Сотрудник КАК Сотрудник,
		|	ПеремещениеВДругоеПодразделениеСотрудники.Сотрудник.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ПеремещениеВДругоеПодразделениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПеремещениеВДругоеПодразделениеСотрудники.РабочееМесто КАК РабочееМесто
		|ИЗ
		|	Документ.ПеремещениеВДругоеПодразделение.Сотрудники КАК ПеремещениеВДругоеПодразделениеСотрудники
		|ГДЕ
		|	ПеремещениеВДругоеПодразделениеСотрудники.Ссылка = &Ссылка
		|	И ПеремещениеВДругоеПодразделениеСотрудники.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)";
	
	// Набор сведений для проведения по рабочим местам сотрудников
	СведенияОРабочихМестахСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("РабочиеМестаСотрудников", СведенияОРабочихМестахСотрудников);
	
КонецПроцедуры

Процедура НазначениеПодработкиСведенияОРабочихМестахСотрудников(ДанныеДляПроведения, Запрос) Экспорт
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НазначениеПодработки.ДатаНачала КАК Период,
		|	ВЫБОР
		|		КОГДА НазначениеПодработки.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(НазначениеПодработки.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ НазначениеПодработки.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо,
		|	НазначениеПодработки.СовмещающийСотрудник КАК Сотрудник,
		|	НазначениеПодработки.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	НазначениеПодработки.СовмещающийСотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НазначениеПодработки.РабочееМесто КАК РабочееМесто
		|ИЗ
		|	Документ.НазначениеПодработки КАК НазначениеПодработки
		|ГДЕ
		|	НазначениеПодработки.Ссылка = &Ссылка
		|	И НазначениеПодработки.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)";
	
	// Набор сведений для проведения по рабочим местам сотрудников
	СведенияОРабочихМестахСотрудников = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("РабочиеМестаСотрудников", СведенияОРабочихМестахСотрудников);
	
КонецПроцедуры

Процедура ДополнитьСписокКонкурирующихПоПериодуРегистраторовНачислений(КонкурирующиеРегистраторы) Экспорт 
	
	КонкурирующиеРегистраторы.Добавить(Тип("ДокументСсылка.НазначениеРабочихМестСотрудникам"));
	
КонецПроцедуры

#КонецОбласти

#Область СпециальнаяОценкаУсловийТруда

// Возвращает представление класса условий труда в соответствии с классификацией,
// установленной в статье 14 закона № 426-ФЗ "О специальной оценке условий труда" от 28.12.2013.
// 
// Параметры:
//  КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки - Класс условий труда
// 
// Возвращаемое значение:
//  Строка - Представление класса условий труда
Функция ПредставлениеКлассаУсловийТруда(КлассУсловийТруда) Экспорт
	
	Если Не ЗначениеЗаполнено(КлассУсловийТруда) Тогда
		Возврат "";
	КонецЕсли;
	
	КлассификацияУсловийТруда = КлассификацияУсловийТруда();
	ПредставлениеКлассаУсловийТруда = КлассификацияУсловийТруда.Получить(КлассУсловийТруда);
	
	Если ПредставлениеКлассаУсловийТруда = Неопределено Тогда
		ПредставлениеКлассаУсловийТруда = Строка(КлассУсловийТруда);
	КонецЕсли;
	
	Возврат ПредставлениеКлассаУсловийТруда;
	
КонецФункции

// Процедура переопределяет обработчик подписки на событие "ЗаписьОбъектовРегламентированнойОтчетности*".
//
// Параметры: - (см. РегламентированнаяОтчетностьПереопределяемый.ЗаписьОбъектовРегламентированнойОтчетности).
//
Процедура ЗаписьОбъектовРегламентированнойОтчетности(Ссылка, Отказ, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ДекларацияСоответствияУсловийТруда") Тогда
		СтандартнаяОбработка = Ложь;
		ОтчетныйПериод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ДатаПодачи");
		ПараметрыОтчета = РегламентированнаяОтчетность.СвойстваПрочихОтчетов(Ссылка);
		УстановитьПривилегированныйРежим(Истина);
		РегламентированнаяОтчетностьВызовСервера.ОтразитьВЖурналеОтчетов(ПараметрыОтчета);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура переопределяет свойства объекта, с которыми он будет отображен в форме Отчетность.
// Параметры:
//  СвойстваОбъектов  - ТаблицаЗначений - (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность).
Процедура ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов) Экспорт
	
	ДокументДекларацияСоответствия = Новый Массив;
	СоответствиеСсылокСвойствам = Новый Соответствие;
	Для Каждого ЗапрашиваемыеДанные Из СвойстваОбъектов Цикл
		Если ТипЗнч(ЗапрашиваемыеДанные.Ссылка) = Тип("ДокументСсылка.ДекларацияСоответствияУсловийТруда") Тогда
			ДокументДекларацияСоответствия.Добавить(ЗапрашиваемыеДанные.Ссылка);
			СоответствиеСсылокСвойствам.Вставить(ЗапрашиваемыеДанные.Ссылка, ЗапрашиваемыеДанные);
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументДекларацияСоответствия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументДекларацияСоответствия", ДокументДекларацияСоответствия);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДекларацияСоответствияУсловийТруда.Ссылка,
	|	ДекларацияСоответствияУсловийТруда.Дата КАК ДатаСоздания,
	|	ДекларацияСоответствияУсловийТруда.Организация,
	|	ДекларацияСоответствияУсловийТруда.Организация.КодПодчиненностиФСС КАК КодКонтролирующегоОргана,
	|	ДекларацияСоответствияУсловийТруда.ПометкаУдаления,
	|	НАЧАЛОПЕРИОДА(ДекларацияСоответствияУсловийТруда.ДатаПодачи, МЕСЯЦ) КАК ДатаНачала,
	|	КОНЕЦПЕРИОДА(ДекларацияСоответствияУсловийТруда.ДатаПодачи, МЕСЯЦ) КАК ДатаОкончания,
	|	ДекларацияСоответствияУсловийТруда.Комментарий,
	|	ДекларацияСоответствияУсловийТруда.НомерКорректировки
	|ИЗ
	|	Документ.ДекларацияСоответствияУсловийТруда КАК ДекларацияСоответствияУсловийТруда
	|ГДЕ
	|	ДекларацияСоответствияУсловийТруда.Ссылка В(&ДокументДекларацияСоответствия)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗапрашиваемыеДанные = СоответствиеСсылокСвойствам[Выборка.Ссылка];
		ЗаполнитьЗначенияСвойств(ЗапрашиваемыеДанные, Выборка);
		ЗапрашиваемыеДанные.ВариантОтчета = ?(Выборка.НомерКорректировки = 0, "П", "К/" + Строка(Выборка.НомерКорректировки));
	КонецЦикла;
	
КонецПроцедуры

// Определяет свойства, касающиеся общих свойств объектов конфигураций-потребителей для отображения в форме Отчетность
// и возможности создания новый объектов из формы Отчетность.
//
// Параметры:
//  ТаблицаОписания  - ТаблицаЗначений -  (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности).
//		
Процедура ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания) Экспорт
	
	ОписаниеДокументаОтчетности = ТаблицаОписания.Добавить();
	
	ОписаниеДокументаОтчетности.ТипОбъекта = Тип("ДокументСсылка.ДекларацияСоответствияУсловийТруда");
	ОписаниеДокументаОтчетности.ВидКонтролирующегоОргана = Перечисления.ТипыКонтролирующихОрганов.ФНС;
	ОписаниеДокументаОтчетности.ГруппаВДереве = НСтр("ru = 'Отчетность в фонды'");
	ОписаниеДокументаОтчетности.ВидДокумента = Перечисления.СтраницыЖурналаОтчетность.Отчеты;
	ОписаниеДокументаОтчетности.НеОтправляетсяВКонтролирующийОрган = Ложь;
	ОписаниеДокументаОтчетности.ЯвляетсяАктуальным = Истина;
	ОписаниеДокументаОтчетности.ИмяОсновногоМакетаДляПечати = "ДекларацияСоответствияУсловийТруда";
	ОписаниеДокументаОтчетности.ВидЭлектронногоПредставления = Справочники.ВидыОтправляемыхДокументов.СтатистикаФорма1Туст;
	
КонецПроцедуры

// Процедура заполняет список используемых регламентированных отчетов.
//
Процедура ЗаполнитьСписокРегламентированныхОтчетов(СписокРегламентированныхОтчетов) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		ЭлементСписка = СписокРегламентированныхОтчетов.НайтиПоЗначению("РегламентированныйОтчетСоответствиеУсловийТруда");
		Если ЭлементСписка <> Неопределено Тогда
			СписокРегламентированныхОтчетов.Удалить(ЭлементСписка);
		КонецЕсли;
		СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистикаФорма1Туст");
	КонецЕсли;
	
КонецПроцедуры

#Область ЗаполнениеРеглотчетности

// См. РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОПоказателяхОтчета.
Процедура ПриПолученииСведенийОПоказателяхОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета) Экспорт
	
	Если ИДОтчета = "РегламентированныйОтчет4ФСС" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2014Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2015Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2016Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2016Кв3" Тогда
			ОписаниеПоказателей_4ФСС_2014Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Тогда
			ОписаниеПоказателей_4ФСС_2017Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2022Кв2" Тогда
			ОписаниеПоказателей_4ФСС_2022Кв2(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетЕФС1ОСС" Тогда
		ОписаниеПоказателей_ЕФС1ОСС_2023Кв1(ПоказателиОтчета);
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСтатистикаФорма1Туст" Тогда
		ОписаниеПоказателей_1Туст_2014Кв1(ПоказателиОтчета);
	КонецЕсли;
	
КонецПроцедуры

// См. РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет.
Процедура ПриЗаполненииРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	Если ИДОтчета = "РегламентированныйОтчет4ФСС" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2014Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2015Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2016Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2016Кв3" Тогда
			ЗначенияПоказателей_4ФСС_2014Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Тогда
			ЗначенияПоказателей_4ФСС_2017Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2022Кв2" Тогда
			ЗначенияПоказателей_4ФСС_2022Кв2(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетЕФС1ОСС" Тогда
		ЗначенияПоказателей_ЕФС1ОСС_2023Кв1(ПараметрыОтчета, Контейнер);
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСтатистикаФорма1Туст" Тогда
		ЗначенияПоказателей_1Туст_2014Кв1(ПараметрыОтчета, Контейнер);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УсловноВызываемыеПроцедурыИзПодписейДокументовИСведенийОбОтветственныхЛицах

// Дополняет соответствие идентификаторов описаний подписей описанием реквизитов подписи ответственного за охрану труда.
//
// Параметры:
//   РолиПодписантов - Массив - Элементы создаются методом ПодписиДокументов.ИменаРеквизитовРолиПодписанта().
//
Процедура ДобавитьРольОтветственногоЗаОхрануТруда(РолиПодписантов) Экспорт
	
	ОписаниеРеквизитов = ОписаниеРеквизитовРолиОтветственныйЗаОхрануТруда();
	РольОтветственныйЗаОхрануТруда = ПодписиДокументов.ИменаРеквизитовРолиПодписанта(ОписаниеРеквизитов.ФизическоеЛицо, ОписаниеРеквизитов.Должность, ОписаниеРеквизитов.ОснованиеПодписи);
	РолиПодписантов.Добавить(РольОтветственныйЗаОхрануТруда);
	
КонецПроцедуры

// Дополняет таблицу описания ответственных лиц организаций.
//
// Параметры:
//   ТаблицаОтветственных - ТаблицаЗначений - см. СведенияОбОтветственныхЛицах.ТаблицаОтветственныхЛицОрганизаций()
//
Процедура ДополнитьТаблицуОтветственныхЛицОтветственнымЗаОхрануТруда(ТаблицаОтветственных) Экспорт
	
	ОписаниеРеквизитов = ОписаниеРеквизитовРолиОтветственныйЗаОхрануТруда();
	
	НоваяСтрока = ТаблицаОтветственных.Добавить();
	
	НоваяСтрока.Ключ = ОписаниеРеквизитов.ФизическоеЛицо;
	НоваяСтрока.Должность = ОписаниеРеквизитов.Должность;
	НоваяСтрока.НаименованиеДолжности = ОписаниеРеквизитов.Должность + "Строкой";
	НоваяСтрока.ОснованиеПодписи = ОписаниеРеквизитов.ОснованиеПодписи;
	
КонецПроцедуры

// Дополняет временную таблицу сведениями об ответственном за охрану труда.
//
// Параметры:
//		МенеджерВременныхТаблиц	 - МенеджерВременныхТаблиц - менеджер временных таблиц.
//		СписокФизическихЛиц		 - Массив -  список физических лиц, для которых необходимо получить ответственных.
//		ИмяСоздаваемойВТ		 - Строка - имя создаваемой ВТ.
//
Процедура ДополнитьВТОтветственныхЛицОтветственнымиЗаОхрануТруда(МенеджерВременныхТаблиц, СписокФизическихЛиц, ИмяСоздаваемойВТ = "ВТОтветственныеЛица") Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("РольОтветственныйЗаОхрануТруда", НСтр("ru='Ответственный за охрану труда'"));
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияОбОтветственныхЛицахСрезПоследних.Организация КАК Организация,
	|	СведенияОбОтветственныхЛицахСрезПоследних.ОтветственныйЗаОхрануТруда КАК ФизическоеЛицо,
	|	&РольОтветственныйЗаОхрануТруда КАК РольОтветственногоЛица
	|ПОМЕСТИТЬ ВТОтветственныеЗаОхрануТрудаВнутренний
	|ИЗ
	|	РегистрСведений.СведенияОбОтветственныхЛицах.СрезПоследних(&ТекущийПериод, ) КАК СведенияОбОтветственныхЛицахСрезПоследних
	|ГДЕ
	|	СведенияОбОтветственныхЛицахСрезПоследних.ОтветственныйЗаОхрануТруда В(&СписокФизическихЛиц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеЛица.Организация КАК Организация,
	|	ОтветственныеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтветственныеЛица.РольОтветственногоЛица КАК РольОтветственногоЛица
	|ПОМЕСТИТЬ ВТОтветственныеЛицаПромежуточный
	|ИЗ
	|	#ВТОтветственныеЛица КАК ОтветственныеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ #ВТОтветственныеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеЛицаПромежуточный.Организация КАК Организация,
	|	ОтветственныеЛицаПромежуточный.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтветственныеЛицаПромежуточный.РольОтветственногоЛица КАК РольОтветственногоЛица
	|ПОМЕСТИТЬ #ВТОтветственныеЛица
	|ИЗ
	|	ВТОтветственныеЛицаПромежуточный КАК ОтветственныеЛицаПромежуточный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтветственныеЗаОхрануТруда.Организация,
	|	ОтветственныеЗаОхрануТруда.ФизическоеЛицо,
	|	ОтветственныеЗаОхрануТруда.РольОтветственногоЛица
	|ИЗ
	|	ВТОтветственныеЗаОхрануТрудаВнутренний КАК ОтветственныеЗаОхрануТруда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтветственныеЛицаПромежуточный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтветственныеЗаОхрануТрудаВнутренний";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТОтветственныеЛица", ИмяСоздаваемойВТ);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ЗащитаПерсональныхДанных

// Процедура обеспечивает сбор сведений о хранении данных, 
// относящихся к персональным.
//
// Параметры:
//		ТаблицаСведений - таблица значений с полями:
//			Объект 			- строка, содержащая полное имя объекта метаданных,
//			ПоляРегистрации - строка, в которой перечислены имена полей регистрации, 
//								отдельные поля регистрации отделяются запятой,
//								альтернативные - символом "|",
//			ПоляДоступа		- строка, в которой перечислены через запятую имена полей доступа.
//			ОбластьДанных	- строка с идентификатором области данных, необязательно для заполнения.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	// Специальная оценка условий труда
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПодготовкаСпецоценкиУсловийТруда";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.Пол,Сотрудники.ДатаРождения,Сотрудники.СтраховойНомерПФР,Сотрудники.Инвалидность";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	// Несчастные случаи
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НесчастныйСлучайНаПроизводстве";
	НовыеСведения.ПоляРегистрации	= "Пострадавшие.Пострадавший";
	НовыеСведения.ПоляДоступа		= "Пострадавшие.СтажОбщийВид,Пострадавшие.СтажОбщийДатаОтсчета,Пострадавшие.СтажОбщийРазмерМесяцев,Пострадавшие.СтажОбщийРазмерДней,Пострадавшие.СтажОбщийИсчисляетсяСДатыПриема,Пострадавшие.СтажОбщийПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НесчастныйСлучайНаПроизводстве";
	НовыеСведения.ПоляРегистрации	= "Пострадавшие.Пострадавший";
	НовыеСведения.ПоляДоступа		= "Пострадавшие.СтажРаботыНаПредприятииЛет,Пострадавшие.СтажРаботыНаПредприятииМесяцев,Пострадавшие.СтажРаботыНаПредприятииДней,Пострадавшие.СтажВОрганизацииПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НесчастныйСлучайНаПроизводстве";
	НовыеСведения.ПоляРегистрации	= "Очевидцы.Очевидец";
	НовыеСведения.ПоляДоступа		= "Очевидцы.Адрес,Очевидцы.АдресПредставление,Очевидцы.КонтактныйТелефон,Очевидцы.КонтактныйТелефонПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НесчастныйСлучайНаПроизводстве";
	НовыеСведения.ПоляРегистрации	= "Инструктажи.Пострадавший";
	НовыеСведения.ПоляДоступа		= "Инструктажи.ВидИнструктажа,Инструктажи.ДатаПрохождения";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПоследствияНесчастногоСлучая";
	НовыеСведения.ПоляРегистрации	= "Пострадавшие.Пострадавший";
	НовыеСведения.ПоляДоступа		= "РешениеПрокуратуры,Пострадавшие.ОкончательныйДиагноз";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПоследствияНесчастногоСлучая";
	НовыеСведения.ПоляРегистрации	= "Пострадавшие.Пострадавший";
	НовыеСведения.ПоляДоступа		= "СтоимостьИспорченногоОборудования,СтоимостьРазрушенныхЗданий,ПрочиеРасходы,СуммарныйМатериальныйУщерб,Пострадавшие.РазмерЕжемесячнойВыплаты";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт

	Раздел = Разделы.Добавить();
	Раздел.Имя  = "ОхранаТруда";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("333c9370-3da2-4347-ae9d-84e3c314d942");
	Раздел.Представление = НСтр("ru = 'Охрана труда'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));

КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Охрана труда
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НазначениеРабочихМестСотрудникам",					"НачалоПериода",		"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РабочиеМестаСотрудников",						"Период",				"ОхранаТруда", "ГоловнаяОрганизация");
	
	// Специальная оценка условий труда
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ДекларацияСоответствияУсловийТруда",					"ДатаПодачи",			"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПодготовкаСпецоценкиУсловийТруда",					"ДатаНачала",			"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РезультатыСпецоценкиУсловийТруда",					"ДатаРезультатов",		"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда",		"Период",				"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда",	"Период",				"ОхранаТруда", "Организация");
	
	// Несчастные случаи
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НесчастныйСлучайНаПроизводстве",						"ДатаПроисшествия",		"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоследствияНесчастногоСлучая",						"ДатаПроисшествия",		"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПротоколОпросаУчастникаНесчастногоСлучая",			"ДатаПроисшествия",		"ОхранаТруда", "Организация");
	
	// Инструктажи
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнструктажПоОхранеТруда",							"ДатаПроведения",		"ОхранаТруда", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИнструктажиПоОхранеТруда",					"Период",				"ОхранаТруда", "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Если Разделы.НайтиПоЗначению(Метаданные.Подсистемы.ОхранаТруда) = Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы.ОхранаТруда, НСтр("ru = 'Отчеты по охране труда'"));
	КонецЕсли;
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РабочиеМестаПодлежащиеСпециальнойОценкеУсловийТруда);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РезультатыСпециальнойОценкиУсловийТруда);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.НесчастныеСлучаиНаПроизводстве);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ИнструктажиПоОхранеТруда);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ЖурналРегистрацииИнструктажа);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РабочиеМестаОхраныТрудаСотрудников);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РабочиеМестаПодлежащиеСпециальнойОценкеУсловийТруда, "РабочиеМестаПодлежащиеСпециальнойОценкеУсловийТруда");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьСпециальнуюОценкуУсловийТруда");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РезультатыСпециальнойОценкиУсловийТруда, "РезультатыСпециальнойОценкиУсловийТруда");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьСпециальнуюОценкуУсловийТруда");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НесчастныеСлучаиНаПроизводстве, "СведенияОНесчастныхСлучаях");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьНесчастныеСлучаиНаПроизводстве");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НесчастныеСлучаиНаПроизводстве, "ПричиныНесчастныхСлучаев");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьНесчастныеСлучаиНаПроизводстве");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НесчастныеСлучаиНаПроизводстве, "СведенияОПострадавших");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьНесчастныеСлучаиНаПроизводстве");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.НесчастныеСлучаиНаПроизводстве, "УщербОтНесчастныхСлучаев");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьНесчастныеСлучаиНаПроизводстве");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИнструктажиПоОхранеТруда, "КонтролируемыеИнструктажи");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьИнструктажиПоОхранеТруда");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИнструктажиПоОхранеТруда, "ПросроченныеИнструктажи");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьИнструктажиПоОхранеТруда");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЖурналРегистрацииИнструктажа, "ЖурналРегистрацииВводногоИнструктажа");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьИнструктажиПоОхранеТруда");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ЖурналРегистрацииИнструктажа, "ЖурналРегистрацииИнструктажаНаРабочемМесте");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьИнструктажиПоОхранеТруда");
	
КонецПроцедуры

#КонецОбласти

// Возвращает сведения специальной оценки условий труда по рабочим местам
//
// Параметры:
//		РабочиеМеста - Массив рабочих мест, по которым требуется вернуть сведения о спецоценке
//		ДатаСведений - Дата, на которую требуется получить сведения о спецоценке.
//
// Возвращаемое значение:
//		СведенияСпецоценкиУсловийТруда - Соответствие
//				Ключ - Ссылка на рабочее место
//				Значение - Структура
//					СведенияСОУТ - Строка - Сведения спецоценки по рабочему месту
//					СведенияОПСОУТ - Строка - Сведения об организации, проводившей спецоценку рабочего места.
//
Функция СведенияСпецоценкиУсловийТрудаПоРабочимМестам(РабочиеМеста, ДатаСведений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста);
	Запрос.УстановитьПараметр("ДатаСведений", ДатаСведений);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РезультатыСпециальнойОценкиУсловийТруда.Период КАК ДатаСОУТ,
	|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто КАК РабочееМесто,
	|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда КАК КлассУсловийТруда,
	|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто.Номер КАК НомерРабочегоМеста,
	|	ЕСТЬNULL(Контрагенты.ИНН, """") КАК ИННОПСОУТ,
	|	ЕСТЬNULL(Контрагенты.НаименованиеПолное, """") КАК НаименованиеОПСОУТ
	|ПОМЕСТИТЬ ВТРабочиеМеста
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&ДатаСведений, РабочееМесто В (&РабочиеМеста)) КАК РезультатыСпециальнойОценкиУсловийТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
	|		ПО РезультатыСпециальнойОценкиУсловийТруда.Регистратор = РезультатыСпецоценкиУсловийТруда.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (РезультатыСпецоценкиУсловийТруда.Исполнитель = Контрагенты.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	NULL КАК ДатаСОУТ,
	|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто,
	|	"""" КАК КлассУсловийТруда,
	|	"""" КАК НомерРабочегоМеста,
	|	"""" КАК ИННОПСОУТ,
	|	"""" КАК НаименованиеОПСОУТ
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|ГДЕ
	|	РабочиеМестаОхраныТруда.Ссылка В(&РабочиеМеста)
	|	И НЕ РабочиеМестаОхраныТруда.Ссылка В
	|				(ВЫБРАТЬ
	|					РабочиеМеста.РабочееМесто
	|				ИЗ
	|					ВТРабочиеМеста КАК РабочиеМеста)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеМеста.ДатаСОУТ,
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.КлассУсловийТруда,
	|	РабочиеМеста.НомерРабочегоМеста,
	|	РабочиеМеста.ИННОПСОУТ,
	|	РабочиеМеста.НаименованиеОПСОУТ
	|ИЗ
	|	ВТРабочиеМеста КАК РабочиеМеста";
	
	СведенияСпецоценкиУсловийТруда = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СведенияСОУТ = Новый Структура;
		Если ЗначениеЗаполнено(Выборка.КлассУсловийТруда) Тогда
			СведенияСОУТ.Вставить("СведенияСОУТ",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Специальная оценка условий труда проведена %1 Индивидуальный номер рабочего места %2. Класс условий труда - %3'"),
					Формат(Выборка.ДатаСОУТ, "ДЛФ=ДД"),
					?(ПустаяСтрока(Выборка.НомерРабочегоМеста), НСтр("ru = 'не указан'"), Выборка.НомерРабочегоМеста),
					ПредставлениеКлассаУсловийТруда(Выборка.КлассУсловийТруда)));
			СведенияСОУТ.Вставить("СведенияОПСОУТ",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1, ИНН %2'"),
					Выборка.НаименованиеОПСОУТ,
					Выборка.ИННОПСОУТ));
		Иначе
			СведенияСОУТ.Вставить("СведенияСОУТ", НСтр("ru = 'Не проводилась'"));
			СведенияСОУТ.Вставить("СведенияОПСОУТ", "");
		КонецЕсли;
		СведенияСпецоценкиУсловийТруда.Вставить(Выборка.РабочееМесто, СведенияСОУТ);
	КонецЦикла;
	
	Возврат СведенияСпецоценкиУсловийТруда;
	
КонецФункции

// Возвращает сведения специальной оценки условий труда по рабочему месту
// см. описание ОхранаТруда.СведенияСпецоценкиУсловийТрудаПоРабочимМестам.
//
Функция СведенияСпецоценкиУсловийТрудаПоРабочемуМесту(РабочееМесто, ДатаСведений) Экспорт
	
	Сведения = СведенияСпецоценкиУсловийТрудаПоРабочимМестам(РабочееМесто, ДатаСведений);
	Возврат Сведения.Получить(РабочееМесто);
	
КонецФункции

#КонецОбласти

#Область Инструктажи

Функция ИнструктажиСотрудниковПоОхранеТруда(Сотрудники) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнструктажиПоОхранеТруда.Регистратор КАК Документ,
	|	ИнструктажиПоОхранеТруда.ВидИнструктажа КАК ВидИнструктажа,
	|	ИнструктажиПоОхранеТруда.Период КАК ДатаПроведения,
	|	ИнструктажиПоОхранеТруда.Сотрудник КАК Сотрудник,
	|	ИнструктажиПоОхранеТруда.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ИнструктажиПоОхранеТруда.СрезПоследних(, Сотрудник В (&Сотрудники)) КАК ИнструктажиПоОхранеТруда";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СписокВыбораПериодаПроведенияИнструктажей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК КоличествоРаз,
	|	1 КАК КоличествоПериодов,
	|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц) КАК Периодичность,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТПредопределенныеЗначения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал),
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие),
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Год),
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	2,
	|	ЗНАЧЕНИЕ(Перечисление.Периодичность.Год),
	|	5
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыИнструктажейПоОхранеТруда.КоличествоРаз КАК КоличествоРаз,
	|	ВидыИнструктажейПоОхранеТруда.КоличествоПериодов КАК КоличествоПериодов,
	|	ВидыИнструктажейПоОхранеТруда.Периодичность КАК Периодичность,
	|	КОЛИЧЕСТВО(ВидыИнструктажейПоОхранеТруда.Периодичность) КАК КоличествоПериода
	|ПОМЕСТИТЬ ВТВыбранныеЗначения
	|ИЗ
	|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
	|ГДЕ
	|	ВидыИнструктажейПоОхранеТруда.КоличествоРаз <> 0
	|	И ВидыИнструктажейПоОхранеТруда.КоличествоПериодов <> 0
	|	И ВидыИнструктажейПоОхранеТруда.Периодичность <> ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыИнструктажейПоОхранеТруда.КоличествоРаз,
	|	ВидыИнструктажейПоОхранеТруда.КоличествоПериодов,
	|	ВидыИнструктажейПоОхранеТруда.Периодичность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыбранныеЗначения.КоличествоРаз КАК КоличествоРаз,
	|	ВыбранныеЗначения.КоличествоПериодов КАК КоличествоПериодов,
	|	ВыбранныеЗначения.Периодичность КАК Периодичность,
	|	ВыбранныеЗначения.КоличествоПериода КАК КоличествоИспользованияПериода,
	|	0 КАК Приоритет
	|ИЗ
	|	ВТВыбранныеЗначения КАК ВыбранныеЗначения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредопределенныеЗначения.КоличествоРаз,
	|	ПредопределенныеЗначения.КоличествоПериодов,
	|	ПредопределенныеЗначения.Периодичность,
	|	1,
	|	ПредопределенныеЗначения.Приоритет
	|ИЗ
	|	ВТПредопределенныеЗначения КАК ПредопределенныеЗначения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыбранныеЗначения КАК ВыбранныеЗначения
	|		ПО (ВыбранныеЗначения.КоличествоРаз = ПредопределенныеЗначения.КоличествоРаз)
	|			И (ВыбранныеЗначения.КоличествоПериодов = ПредопределенныеЗначения.КоличествоПериодов)
	|			И (ВыбранныеЗначения.Периодичность = ПредопределенныеЗначения.Периодичность)
	|ГДЕ
	|	ВыбранныеЗначения.Периодичность ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоИспользованияПериода УБЫВ,
	|	Приоритет";
	
	СписокВыбораПериода = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПериода = Новый Структура("КоличествоРаз, КоличествоПериодов, Периодичность",
			Выборка.КоличествоРаз, Выборка.КоличествоПериодов, Выборка.Периодичность);
		СписокВыбораПериода.Добавить(СтруктураПериода, ПредставлениеПериодаПоСтруктуре(СтруктураПериода));
	КонецЦикла;
	
	СписокВыбораПериода.Добавить(ПроизвольноеЗначениеСпискаВыбораПроведенияИнструктажей());
	
	Возврат СписокВыбораПериода;
	
КонецФункции

Функция ПроизвольноеЗначениеСпискаВыбораПроведенияИнструктажей() Экспорт
	Возврат "Произвольно";
КонецФункции

#КонецОбласти

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.НазначениеРабочихМестСотрудникам);
	
	// Специальная оценка условий труда
	СписокОбъектов.Добавить(Документы.ДекларацияСоответствияУсловийТруда); 
	СписокОбъектов.Добавить(Документы.ПодготовкаСпецоценкиУсловийТруда);
	СписокОбъектов.Добавить(Документы.РезультатыСпецоценкиУсловийТруда);
	
	// Несчастные случаи
	СписокОбъектов.Добавить(Документы.НесчастныйСлучайНаПроизводстве);
	СписокОбъектов.Добавить(Документы.ПоследствияНесчастногоСлучая);
	СписокОбъектов.Добавить(Документы.ПротоколОпросаУчастникаНесчастногоСлучая);
	
	// Инструктажи
	СписокОбъектов.Добавить(Документы.ИнструктажПоОхранеТруда);
	
КонецПроцедуры

// Разбивает текст на строки определенной длины, с переносом по словам, для вывода в печатные формы.
//
// Параметры:
//		ВходнойТекст - Строка - Текст, который требуется разбить на строки
//		СтрокаДлинСтрок - Строка - Значения длин строк по порядку, разделенные запятыми, например:
//				"10, 20, 40" - Первая строка будет длиной 10 символов, 2-я - 20 символов, 3-я - 40 символов и т.д.
// Возвращаемое значение:
//		ВозвращаемыйМассив - массив строк.
//
Функция СтрокиДляПечатнойФормы(Знач ВходнойТекст, СтрокаДлинСтрок) Экспорт
	
	МассивДлинСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаДлинСтрок, ",");
	
	ВозвращаемыйМассив = Новый Массив;
	
	ВходнойТекст = СтрЗаменить(ВходнойТекст, Символы.ПС, " ");
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ВходнойТекст, " ");
	
	ИндексСледующейФормируемойСтроки = 0;
	ДопустимаяДлинаФормируемойСтроки = Число(МассивДлинСтрок[0]);
	ВременнаяСтрока = "";
	ПредВременнаяСтрока = "";
	Для Каждого ТекущееСлово Из МассивСлов Цикл
		ВременнаяСтрока = ВременнаяСтрока + ТекущееСлово + " ";
		
		Если СтрДлина(ВременнаяСтрока) >= ДопустимаяДлинаФормируемойСтроки Тогда
			ВозвращаемыйМассив.Добавить(ПредВременнаяСтрока);
			ИндексСледующейФормируемойСтроки = ВозвращаемыйМассив.Количество();
			Если МассивДлинСтрок.Количество() > ИндексСледующейФормируемойСтроки Тогда
				ДопустимаяДлинаФормируемойСтроки = Число(МассивДлинСтрок[ИндексСледующейФормируемойСтроки]);
			Иначе
				ДопустимаяДлинаФормируемойСтроки = Число(МассивДлинСтрок[МассивДлинСтрок.Количество()-1]);
			КонецЕсли;
			ВременнаяСтрока = ТекущееСлово + " ";
		КонецЕсли;
		ПредВременнаяСтрока = ВременнаяСтрока;
	КонецЦикла;
	ВозвращаемыйМассив.Добавить(ВременнаяСтрока);
	
	Пока ВозвращаемыйМассив.Количество() < МассивДлинСтрок.Количество() Цикл
		ВозвращаемыйМассив.Добавить("");
	КонецЦикла;
	
	Возврат ВозвращаемыйМассив;
	
КонецФункции

Функция ГородИзСведенийОбОрганизации(Сведения) Экспорт
	
	Город = "";
	
	Если Сведения.Свойство("ОргГород") И Не ПустаяСтрока(Сведения.ОргГород) Тогда
		Город = Сведения.ОргГород;
	ИначеЕсли Сведения.Свойство("ОргНПункт") И Не ПустаяСтрока(Сведения.ОргНПункт) Тогда
		Город = Сведения.ОргНПункт;
	ИначеЕсли Сведения.Свойство("ОргСубъект") И Не ПустаяСтрока(Сведения.ОргСубъект) Тогда
		Город = Сведения.ОргСубъект;
	КонецЕсли;
	
	Возврат Город;
	
КонецФункции

Процедура ВывестиСтрокиМассива(ДокументРезультат, ДопОбласть, МассивСтрок, ИндексПервойСтроки) Экспорт
	
	Для Шаг = ИндексПервойСтроки По МассивСтрок.Количество()-1 Цикл
		ДопОбласть.Параметры.ТекстСтроки = МассивСтрок[Шаг];
		ДокументРезультат.Вывести(ДопОбласть);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереопределитьПутьКДаннымСведенийЗависящихОтФункциональныхОпций(ПутьКДанным) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьКДанным) Тогда
		ПутьКДанным =
			"	ВЫБОР 
			|		КОГДА ФункциональныеОпции.ИспользуютсяРаботыСДосрочнойПенсией 
			|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(СведенияОРабочихМестахСотрудников.РабочееМесто КАК Справочник.РабочиеМестаОхраныТруда).ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией, ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)) 
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка) 
			|	КОНЕЦ";
	Иначе
		ПутьКДанным = СтрЗаменить(ПутьКДанным,
			"	ВЫБОР 
			|		КОГДА ФункциональныеОпции.ИспользуютсяРаботыСДосрочнойПенсией 
			|			ТОГДА",
			"	ВЫБОР 
			|		КОГДА ФункциональныеОпции.ИспользуютсяРаботыСДосрочнойПенсией 
			|			ТОГДА ВЫБОР 
			|					КОГДА СведенияОРабочихМестахСотрудников.РабочееМесто ЕСТЬ НЕ NULL И НЕ СведенияОРабочихМестахСотрудников.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка) 
			|						ТОГДА ВЫРАЗИТЬ(СведенияОРабочихМестахСотрудников.РабочееМесто КАК Справочник.РабочиеМестаОхраныТруда).ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией 
			|					ИНАЧЕ");
		ПутьКДанным = СтрЗаменить(ПутьКДанным,
			"ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка) 
			|	КОНЕЦ", 
			"		КОНЕЦ 
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка) 
			|	КОНЕЦ");
	КонецЕсли;
			
КонецПроцедуры

Процедура ДобавитьВКоллекциюКадровыеДанныеДляСведенийОКлассахУсловийТруда(ИсточникиДанных) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "РабочиеМестаСотрудников", "Организация");
	КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "РабочиеМестаСотрудников", "РабочееМесто");
	
КонецПроцедуры

Процедура ДополнитьПоляЗапросаВТКадровыхДанных(Запрос) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Запрос.Текст, "ВТКадровыхДанных") > 0 Тогда
		Если СтрНайти(Запрос.Текст, "ВТКоэффициентыПоДолжностям") > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"КОНЕЦ КАК Должность,", 
				"КОНЕЦ КАК Должность,
				|	ВЫБОР
				|		КОГДА СписокНачислений.УсловияТруда.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией ЕСТЬ НЕ NULL 
				|			ТОГДА СписокНачислений.УсловияТруда
				|		КОГДА ДанныеПоДням.НеРаботает
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
				|		КОГДА РаспределяемыеСтроки.РаспределятьСтроку
				|				И КоэффициентыПоДолжностям.Сотрудник ЕСТЬ НЕ NULL 
				|			ТОГДА КоэффициентыПоДолжностям.РабочееМесто
				|		ИНАЧЕ ДанныеОСотруднике.РабочееМестоОхраныТруда
				|	КОНЕЦ КАК РабочееМесто,");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"ДанныеОСотруднике.Должность КАК Должность,", 
				"ДанныеОСотруднике.Должность КАК Должность,
				|	ДанныеОСотруднике.РабочееМестоОхраныТруда КАК РабочееМесто,");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст,
				"ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,", 
				"ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
				|	ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка) КАК РабочееМесто,");
		КонецЕсли;
	Иначе			
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"КОНЕЦ КАК Должность,", 
			"КОНЕЦ КАК Должность,
			|	ДанныеОСотруднике.РабочееМестоОхраныТруда КАК РабочееМесто,");
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
		ТаблицаДобавлена = Ложь;
		Для Каждого ЗапросПакета Из ПакетЗапросов Цикл
			Если ТипЗнч(ЗапросПакета) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
				Продолжить;
			КонецЕсли;
			Если ЗапросПакета.ТаблицаДляПомещения = "ВТПараметрыМаксимальногоКоэффициента" И Не ТаблицаДобавлена Тогда
				ТаблицаДобавлена = Истина;
				ИндексЗапросаПакета = ПакетЗапросов.Индекс(ЗапросПакета);
				НовыйЗапросПакета = ПакетЗапросов.ДобавитьКопию(ИндексЗапросаПакета);
				НовыйЗапросПакета.ТаблицаДляПомещения = "ВТПараметрыМаксимальногоКоэффициентаБезРабочегоМеста";
				ПакетЗапросов.Переместить(НовыйЗапросПакета, ИндексЗапросаПакета);
				
				ТекстЗапросаВТ = 
					"ВЫБРАТЬ
					|	МаксимальныйКоэффициент.Сотрудник,
					|	МаксимальныйКоэффициент.КоэффициентЧасов,
					|	МаксимальныйКоэффициент.Должность,
					|	МаксимальныйКоэффициент.ЯвляетсяРаботникомСДосрочнойПенсией,
					|	МАКСИМУМ(КоэффициентыПоЧасам.РабочееМесто) КАК РабочееМесто
					|ПОМЕСТИТЬ ВТПараметрыМаксимальногоКоэффициента 
					|ИЗ
					|	ВТПараметрыМаксимальногоКоэффициентаБезРабочегоМеста КАК МаксимальныйКоэффициент
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыПоЧасам КАК КоэффициентыПоЧасам
					|		ПО МаксимальныйКоэффициент.Сотрудник = КоэффициентыПоЧасам.Сотрудник
					|			И МаксимальныйКоэффициент.КоэффициентЧасов = КоэффициентыПоЧасам.КоэффициентЧасов
					|			И МаксимальныйКоэффициент.Должность = КоэффициентыПоЧасам.Должность
					|			И МаксимальныйКоэффициент.ЯвляетсяРаботникомСДосрочнойПенсией = КоэффициентыПоЧасам.ЯвляетсяРаботникомСДосрочнойПенсией
					|
					|СГРУППИРОВАТЬ ПО
					|	МаксимальныйКоэффициент.Сотрудник,
					|	МаксимальныйКоэффициент.КоэффициентЧасов,
					|	МаксимальныйКоэффициент.Должность,
					|	МаксимальныйКоэффициент.ЯвляетсяРаботникомСДосрочнойПенсией";
				
				ЗапросПакета.УстановитьТекстЗапроса(ТекстЗапросаВТ);
				
				ЗапросУничтоженияВТ = ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
				ЗапросУничтоженияВТ.ИмяТаблицы = "ВТПараметрыМаксимальногоКоэффициентаБезРабочегоМеста";
				ПакетЗапросов.Переместить(ЗапросУничтоженияВТ, ПакетЗапросов.Индекс(ЗапросПакета) + 1);
			ИначеЕсли ЗапросПакета.ТаблицаДляПомещения = "ВТКоэффициентыПоЧасам" Тогда
				ЗапросПакета.Операторы[0].ВыбираемыеПоля.Добавить("ВремяПоДням.РабочееМесто");
				ЗапросПакета.Операторы[0].Группировка.Добавить("ВремяПоДням.РабочееМесто");
			ИначеЕсли ЗапросПакета.ТаблицаДляПомещения = "ВТПрочиеКоэффициенты" Тогда
				ЗапросПакета.Операторы[0].ВыбираемыеПоля.Добавить("КоэффициентыПоЧасам.РабочееМесто");
			ИначеЕсли ЗапросПакета.ТаблицаДляПомещения = "ВТКоэффициентыПоДолжностям" Тогда
				ЗапросПакета.Операторы[0].ВыбираемыеПоля.Добавить("ПрочиеКоэффициенты.РабочееМесто");
				ЗапросПакета.Операторы[1].ВыбираемыеПоля.Добавить("ПараметрыМаксимальногоКоэффициента.РабочееМесто");
			КонецЕсли;
		КонецЦикла;
				
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"КоэффициентыПоЧасам.Должность = ПараметрыМаксимальногоКоэффициента.Должность", 
			"КоэффициентыПоЧасам.Должность = ПараметрыМаксимальногоКоэффициента.Должность
			|	И КоэффициентыПоЧасам.РабочееМесто = ПараметрыМаксимальногоКоэффициента.РабочееМесто");		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьЗапросПараметрыПериодовСтажаПФР(Запрос, ПриЗаписи) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьПоляЗапросаРабочимМестом(Запрос, "ПараметрыПериодовСтажаПФР");
	
	Если Не ПриЗаписи Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьПоляЗапросаРабочимМестом(Запрос, "СравнениеСПредыдущимНабором");
	ДополнитьПоляЗапросаРабочимМестом(Запрос, "ПредыдущиеДанныеРегистра", Истина);
	
КонецПроцедуры

Процедура СоздатьВТКадроваяИсторияРабочиеМеста(Запрос, ИмяПериода = "Период") Экспорт
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыКадровойИстории.Период КАК Период,
		|	ПериодыКадровойИстории.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПериодыОбъединенные
		|ИЗ
		|	ВТПериодыКадровойИстории КАК ПериодыКадровойИстории
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаСотрудников.Период,
		|	РабочиеМестаСотрудников.Сотрудник
		|ИЗ
		|	ВТРабочиеМестаСотрудников КАК РабочиеМестаСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	Периоды.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(РабочиеМестаСотрудников.Период) КАК ПериодРабочиеМеста,
		|	МАКСИМУМ(ПериодыКадровойИстории.Период) КАК ПериодКадроваяИстория
		|ПОМЕСТИТЬ ВТПериодыИстории
		|ИЗ
		|	ВТПериодыОбъединенные КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыКадровойИстории КАК ПериодыКадровойИстории
		|		ПО Периоды.Сотрудник = ПериодыКадровойИстории.Сотрудник
		|			И Периоды.Период >= ПериодыКадровойИстории.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМестаСотрудников КАК РабочиеМестаСотрудников
		|		ПО Периоды.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|			И Периоды.Период >= РабочиеМестаСотрудников.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Периоды.Период,
		|	Периоды.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыИстории.Период КАК Период,
		|	ПериодыИстории.Сотрудник КАК Сотрудник,
		|	ПериодыИстории.ПериодКадроваяИстория КАК ПериодКадроваяИстория,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	ВЫБОР
		|		КОГДА ПериодыИстории.Период = РабочиеМестаСотрудников.Период
		|			ТОГДА РабочиеМестаСотрудников.Регистратор
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК РегистраторРабочиеМеста
		|ПОМЕСТИТЬ ВТКадроваяИсторияРабочиеМеста
		|ИЗ
		|	ВТПериодыИстории КАК ПериодыИстории
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМестаСотрудников КАК РабочиеМестаСотрудников
		|		ПО ПериодыИстории.Сотрудник = РабочиеМестаСотрудников.Сотрудник
		|			И ПериодыИстории.ПериодРабочиеМеста = РабочиеМестаСотрудников.Период
		|ГДЕ
		|	НЕ ПериодыИстории.ПериодКадроваяИстория ЕСТЬ NULL";
	
	// АПК:96 -вкл
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РабочиеМестаСотрудников.Период", "РабочиеМестаСотрудников." + ИмяПериода);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьКадровуюИсториюРабочимиМестами(Запрос) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросРабочихМест = Новый Запрос;
	ЗапросРабочихМест.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросРабочихМест.Текст =
		"ВЫБРАТЬ
		|	ПериодыКадровойИстории.Период КАК Период,
		|	ПериодыКадровойИстории.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПериодыКадровойИстории
		|ИЗ
		|	ВТКадроваяИсторияСотрудниковДляДанныхДляПодбораСотрудников КАК ПериодыКадровойИстории";
	ЗапросРабочихМест.Выполнить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		"РабочиеМестаСотрудников",
		ЗапросРабочихМест.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСотрудники",
			"Сотрудник"));
		
	СоздатьВТКадроваяИсторияРабочиеМеста(ЗапросРабочихМест);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.Период КАК Период", "КадроваяИсторияРабочиеМеста.Период КАК Период");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕОПРЕДЕЛЕНО КАК РабочееМесто",
		"ЕСТЬNULL(КадроваяИсторияРабочиеМеста.РабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)) КАК РабочееМесто");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТКадроваяИсторияСотрудниковДляДанныхДляПодбораСотрудников КАК РегистрСведений",
		"ВТКадроваяИсторияСотрудниковДляДанныхДляПодбораСотрудников КАК РегистрСведений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадроваяИсторияРабочиеМеста КАК КадроваяИсторияРабочиеМеста
		|		ПО РегистрСведений.Сотрудник = КадроваяИсторияРабочиеМеста.Сотрудник
		|			И РегистрСведений.Период = КадроваяИсторияРабочиеМеста.ПериодКадроваяИстория");
	
КонецПроцедуры

Процедура ДополнитьТаблицуКадровойИсторииРабочимиМестами(КадроваяИстория, МенеджерВременныхТаблиц, ОписаниеФильтра, ПараметрыПостроения) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьКолонкиТаблицыРабочимМестом(КадроваяИстория);
	РабочиеМестаИнтервалы = ЗарплатаКадрыПериодическиеРегистры.ТаблицаВТИмяРегистра(
		"РабочиеМестаСотрудников", МенеджерВременныхТаблиц, Истина, ОписаниеФильтра, ПараметрыПостроения);
	Если РабочиеМестаИнтервалы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	РабочиеМестаИнтервалы.Индексы.Добавить("Сотрудник");
	
	КоличествоСтрок = КадроваяИстория.Количество();
	Для Сч = 1 По КоличествоСтрок Цикл
		СтрокаКадроваяИстория = КадроваяИстория[Сч - 1];
		СтруктураПоиска = Новый Структура("Сотрудник", СтрокаКадроваяИстория.Сотрудник);
		НайденныеСтроки = РабочиеМестаИнтервалы.НайтиСтроки(СтруктураПоиска);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если НайденнаяСтрока.Период = СтрокаКадроваяИстория.Период Тогда
				СтрокаКадроваяИстория.РабочееМесто = НайденнаяСтрока.РабочееМесто;
			ИначеЕсли НайденнаяСтрока.РабочееМесто <> СтрокаКадроваяИстория.РабочееМесто
				И НайденнаяСтрока.ПериодЗаписи > СтрокаКадроваяИстория.ПериодЗаписи
				И НайденнаяСтрока.ПериодЗаписи < НачалоДня(СтрокаКадроваяИстория.ДатаОкончания + 1) Тогда
				
				НоваяСтрока = КадроваяИстория.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКадроваяИстория);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
				СтрокаКадроваяИстория.ДатаОкончания = НоваяСтрока.ДатаНачала - 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначениеРегистрируемогоРабочегоМеста(РегистрируемыйПериод, ДанныеСотрудника, ЭтоПеревод = Ложь) Экспорт
	
	Если ЭтоПеревод И Не ДанныеСотрудника["ИзменитьРабочееМесто"] Тогда
		Возврат;
	КонецЕсли;
	
	УчетСтажаПФР.УстановитьЗначениеРегистрируемогоРесурса(РегистрируемыйПериод, "РабочееМесто", ДанныеСотрудника.РабочееМесто);
	
КонецПроцедуры

Процедура ДополнитьПоляЗапросаРабочимМестом(Запрос, ИмяТаблицы, ДобавлятьПредставление = Ложь, ДобавлятьИспользованиеРесурса = Истина, ЗамещатьДолжность = Ложь) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ПоляЗапроса = Новый Массив;
	
	ПолеДолжность = ИмяТаблицы + ".Должность" + ?(ДобавлятьПредставление, " КАК Должность", "");
	ПолеРабочееМесто = ИмяТаблицы + ".РабочееМесто" + ?(ДобавлятьПредставление, " КАК РабочееМесто", "");
	
	Если Не ЗамещатьДолжность Тогда
		ПоляЗапроса.Добавить(ПолеДолжность);
	ИначеЕсли Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		ПолеРабочееМесто = СтрЗаменить(
			ПолеРабочееМесто,
			ИмяТаблицы + ".РабочееМесто",
			"ВЫБОР 
			|	КОГДА #ИмяТаблицы.РабочееМесто = НЕОПРЕДЕЛЕНО ИЛИ #ИмяТаблицы.РабочееМесто ЕСТЬ NULL
			|			ИЛИ #ИмяТаблицы.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка) ТОГДА
			|		#ИмяТаблицы.Должность
			|	ИНАЧЕ
			|		#ИмяТаблицы.РабочееМесто
			|КОНЕЦ");
		ПолеРабочееМесто = СтрЗаменить(ПолеРабочееМесто, "#ИмяТаблицы", ИмяТаблицы);
	КонецЕсли;
	
	ПоляЗапроса.Добавить(ПолеРабочееМесто);
	
	Если ДобавлятьИспользованиеРесурса Тогда
		ПолеИспользованиеРесурсаРабочееМесто = ИмяТаблицы + ".ИспользованиеРесурсаРабочееМесто" + ?(ДобавлятьПредставление, " КАК ИспользованиеРесурсаРабочееМесто", "");
		ПоляЗапроса.Добавить(ПолеИспользованиеРесурсаРабочееМесто);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ПолеДолжность, СтрСоединить(ПоляЗапроса, "," + Символы.ПС));
	
КонецПроцедуры

Процедура ДополнитьПоляРабочимМестом(Поля) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Поля.Вставить("РабочееМесто");
	
КонецПроцедуры

Процедура ДополнитьКолонкиТаблицыРабочимМестом(ТаблицаИзменений, ТаблицаФильтра = Неопределено) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИзменений.Колонки.Добавить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	
	Если ТаблицаФильтра = Неопределено Или ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФильтра.Колонки.Добавить("ВременноеРабочееМесто",
		Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда,СправочникСсылка.ШтатноеРасписание"));
	
	Для Каждого СтрокаФильтра Из ТаблицаФильтра Цикл
		Если ЗначениеЗаполнено(СтрокаФильтра.РабочееМесто) Тогда
			СтрокаФильтра.ВременноеРабочееМесто = СтрокаФильтра.РабочееМесто;
		Иначе
			СтрокаФильтра.ВременноеРабочееМесто = СтрокаФильтра.ДолжностьПоШтатномуРасписанию;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаФильтра.Колонки.Удалить("РабочееМесто");
	ТаблицаФильтра.Колонки.ВременноеРабочееМесто.Имя = "РабочееМесто";
	
КонецПроцедуры

Процедура ДополнитьОписаниеПолейРабочимМестом(ОписаниеПолей, ПоляОписания) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПолей.Вставить("РабочееМесто", Новый Структура(ПоляОписания, Истина, Истина, "ДанныеДляПодбора"));
	
КонецПроцедуры

Процедура СоздатьВТДосрочноеНазначениеПенсии(Запрос, Организация, СтандартнаяОбработка) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Запрос.УстановитьПараметр("ОрганизацияРабочихМест", Организация);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеМеста.Ссылка КАК РабочееМесто,
		|	РабочиеМеста.Подразделение КАК Подразделение,
		|	РабочиеМеста.Должность КАК Должность,
		|	РабочиеМеста.ОсобыеУсловияТрудаПФР КАК ОсобыеУсловияТруда,
		|	РабочиеМеста.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
		|	РабочиеМеста.КодПозицииСпискаПФР КАК КодПозицииСписка,
		|	РабочиеМеста.ХарактерВыполняемыхРаботПФР КАК ХарактерВыполняемыхРабот,
		|	РабочиеМеста.ПервичныеДокументыПФР КАК ПервичныеДокументы
		|ПОМЕСТИТЬ ВТДанныеРабочихМестПредварительно
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
		|ГДЕ
		|	(РабочиеМеста.ОсобыеУсловияТрудаПФР <> ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТрудаПФР.ПустаяСсылка)
		|	ИЛИ
		|		РабочиеМеста.ОснованиеДосрочногоНазначенияПенсии <> ЗНАЧЕНИЕ(Справочник.ОснованияДосрочногоНазначенияПенсии.ПустаяСсылка))
		|	И РабочиеМеста.Владелец = &ОрганизацияРабочихМест
		|	И НЕ РабочиеМеста.ПометкаУдаления
		|	И НЕ РабочиеМеста.ВАрхиве
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.Подразделение КАК Подразделение,
		|	ПозицииШтатногоРасписания.Должность КАК Должность,
		|	ПозицииШтатногоРасписания.КоличествоСтавок КАК КоличествоСтавок,
		|	ПозицииШтатногоРасписания.ОсобыеУсловияТрудаПФР КАК ОсобыеУсловияТруда,
		|	ПозицииШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
		|	ПозицииШтатногоРасписания.КодПозицииСпискаПФР КАК КодПозицииСписка,
		|	ПозицииШтатногоРасписания.ХарактерВыполняемыхРаботПФР КАК ХарактерВыполняемыхРабот,
		|	ПозицииШтатногоРасписания.ПервичныеДокументыПФР КАК ПервичныеДокументы
		|ПОМЕСТИТЬ ВТДанныеШтатногоРасписанияБезРабочихМестПредварительно
		|ИЗ
		|	ВТШтатноеРасписание КАК ПозицииШтатногоРасписания
		|ГДЕ
		|	(ПозицииШтатногоРасписания.ОсобыеУсловияТрудаПФР <> ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТрудаПФР.ПустаяСсылка)
		|	ИЛИ
		|		ПозицииШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии <> ЗНАЧЕНИЕ(Справочник.ОснованияДосрочногоНазначенияПенсии.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РабочиеМеста.Подразделение,
		|	РабочиеМеста.Должность,
		|	-1,
		|	РабочиеМеста.ОсобыеУсловияТруда,
		|	РабочиеМеста.ОснованиеДосрочногоНазначенияПенсии,
		|	РабочиеМеста.КодПозицииСписка,
		|	РабочиеМеста.ХарактерВыполняемыхРабот,
		|	РабочиеМеста.ПервичныеДокументы
		|ИЗ
		|	ВТДанныеРабочихМестПредварительно КАК РабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.Подразделение КАК Подразделение,
		|	ПозицииШтатногоРасписания.Должность КАК Должность,
		|	СУММА(ПозицииШтатногоРасписания.КоличествоСтавок) КАК КоличествоРабочихМест,
		|	ПозицииШтатногоРасписания.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
		|	ПозицииШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
		|	ПозицииШтатногоРасписания.КодПозицииСписка КАК КодПозицииСписка,
		|	ПозицииШтатногоРасписания.ХарактерВыполняемыхРабот КАК ХарактерВыполняемыхРабот,
		|	ПозицииШтатногоРасписания.ПервичныеДокументы КАК ПервичныеДокументы
		|ПОМЕСТИТЬ ВТДанныеШтатногоРасписанияБезРабочихМест
		|ИЗ
		|	ВТДанныеШтатногоРасписанияБезРабочихМестПредварительно КАК ПозицииШтатногоРасписания
		|СГРУППИРОВАТЬ ПО
		|	ПозицииШтатногоРасписания.Подразделение,
		|	ПозицииШтатногоРасписания.Должность,
		|	ПозицииШтатногоРасписания.ОсобыеУсловияТруда,
		|	ПозицииШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии,
		|	ПозицииШтатногоРасписания.КодПозицииСписка,
		|	ПозицииШтатногоРасписания.ХарактерВыполняемыхРабот,
		|	ПозицииШтатногоРасписания.ПервичныеДокументы
		|ИМЕЮЩИЕ
		|	СУММА(ПозицииШтатногоРасписания.КоличествоСтавок) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО КАК РабочееМесто,
		|	ПозицииШтатногоРасписания.Подразделение КАК Подразделение,
		|	ПозицииШтатногоРасписания.Должность КАК Должность,
		|	ПозицииШтатногоРасписания.КоличествоРабочихМест КАК КоличествоРабочихМест,
		|	ПозицииШтатногоРасписания.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
		|	ПозицииШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
		|	ПозицииШтатногоРасписания.КодПозицииСписка КАК КодПозицииСписка,
		|	ПозицииШтатногоРасписания.ХарактерВыполняемыхРабот КАК ХарактерВыполняемыхРабот,
		|	ПозицииШтатногоРасписания.ПервичныеДокументы КАК ПервичныеДокументы
		|ПОМЕСТИТЬ ВТДанныеШтатногоРасписанияРабочихМестПредварительно
		|ИЗ
		|	ВТДанныеШтатногоРасписанияБезРабочихМест КАК ПозицииШтатногоРасписания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РабочиеМеста.РабочееМесто,
		|	РабочиеМеста.Подразделение,
		|	РабочиеМеста.Должность,
		|	1,
		|	РабочиеМеста.ОсобыеУсловияТруда,
		|	РабочиеМеста.ОснованиеДосрочногоНазначенияПенсии,
		|	РабочиеМеста.КодПозицииСписка,
		|	РабочиеМеста.ХарактерВыполняемыхРабот,
		|	РабочиеМеста.ПервичныеДокументы
		|ИЗ
		|	ВТДанныеРабочихМестПредварительно КАК РабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеМеста.РабочееМесто КАК РабочееМесто,
		|	РабочиеМеста.Подразделение КАК Подразделение,
		|	РабочиеМеста.Должность КАК Должность,
		|	СУММА(РабочиеМеста.КоличествоРабочихМест) КАК КоличествоРабочихМест,
		|	РабочиеМеста.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
		|	РабочиеМеста.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
		|	РабочиеМеста.КодПозицииСписка КАК КодПозицииСписка,
		|	РабочиеМеста.ХарактерВыполняемыхРабот КАК ХарактерВыполняемыхРабот,
		|	РабочиеМеста.ПервичныеДокументы КАК ПервичныеДокументы
		|ПОМЕСТИТЬ ВТДанныеШтатногоРасписанияРабочихМест
		|ИЗ
		|	ВТДанныеШтатногоРасписанияРабочихМестПредварительно КАК РабочиеМеста
		|СГРУППИРОВАТЬ ПО
		|	РабочиеМеста.РабочееМесто,
		|	РабочиеМеста.Подразделение,
		|	РабочиеМеста.Должность,
		|	РабочиеМеста.ОсобыеУсловияТруда,
		|	РабочиеМеста.ОснованиеДосрочногоНазначенияПенсии,
		|	РабочиеМеста.КодПозицииСписка,
		|	РабочиеМеста.ХарактерВыполняемыхРабот,
		|	РабочиеМеста.ПервичныеДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК РабочееМесто,
		|	СотрудникиОрганизации.Должность КАК Должность,
		|	СотрудникиОрганизации.Подразделение КАК Подразделение,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СотрудникиОрганизации.ФизическоеЛицо) КАК КоличествоРаботающих,
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда.ОсобыеУсловияТрудаПФР
		|		ИНАЧЕ СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию.ОсобыеУсловияТрудаПФР
		|	КОНЕЦ КАК ОсобыеУсловияТруда,
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда.ОснованиеДосрочногоНазначенияПенсии
		|		ИНАЧЕ СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию.ОснованиеДосрочногоНазначенияПенсии
		|	КОНЕЦ КАК ОснованиеДосрочногоНазначенияПенсии,
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда.КодПозицииСпискаПФР
		|		ИНАЧЕ СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию.КодПозицииСпискаПФР
		|	КОНЕЦ КАК КодПозицииСписка
		|ПОМЕСТИТЬ ВТДанныеСотрудников
		|ИЗ
		|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	СотрудникиОрганизации.Должность,
		|	СотрудникиОрганизации.Подразделение,
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда.ОсобыеУсловияТрудаПФР
		|		ИНАЧЕ СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию.ОсобыеУсловияТрудаПФР
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда.ОснованиеДосрочногоНазначенияПенсии
		|		ИНАЧЕ СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию.ОснованиеДосрочногоНазначенияПенсии
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (СотрудникиОрганизации.РабочееМестоОхраныТруда ЕСТЬ NULL
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|		ИЛИ СотрудникиОрганизации.РабочееМестоОхраныТруда = НЕОПРЕДЕЛЕНО)
		|			ТОГДА СотрудникиОрганизации.РабочееМестоОхраныТруда.КодПозицииСпискаПФР
		|		ИНАЧЕ СотрудникиОрганизации.ДолжностьПоШтатномуРасписанию.КодПозицииСпискаПФР
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеШтатногоРасписания.РабочееМесто КАК РабочееМесто,
		|	ДанныеШтатногоРасписания.Подразделение КАК Подразделение,
		|	ДанныеШтатногоРасписания.Должность КАК Должность,
		|	СУММА(ЕСТЬNULL(ДанныеСотрудников.КоличествоРаботающих, 0)) КАК КоличествоРаботающих,
		|	ДанныеШтатногоРасписания.КоличествоРабочихМест КАК КоличествоРабочихМест,
		|	ДанныеШтатногоРасписания.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
		|	ДанныеШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
		|	ДанныеШтатногоРасписания.КодПозицииСписка КАК КодПозицииСписка,
		|	ДанныеШтатногоРасписания.ХарактерВыполняемыхРабот КАК ХарактерВыполняемыхРабот,
		|	ДанныеШтатногоРасписания.ПервичныеДокументы КАК ПервичныеДокументы
		|ПОМЕСТИТЬ ВТДосрочноеНазначениеПенсииПредварительно
		|ИЗ
		|	ВТДанныеШтатногоРасписанияРабочихМест КАК ДанныеШтатногоРасписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеСотрудников КАК ДанныеСотрудников
		|		ПО ДанныеШтатногоРасписания.РабочееМесто = ДанныеСотрудников.РабочееМесто
		|		И ДанныеШтатногоРасписания.Подразделение = ДанныеСотрудников.Подразделение
		|		И ДанныеШтатногоРасписания.Должность = ДанныеСотрудников.Должность
		|		И ДанныеШтатногоРасписания.ОсобыеУсловияТруда = ДанныеСотрудников.ОсобыеУсловияТруда
		|		И
		|			ДанныеШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии = ДанныеСотрудников.ОснованиеДосрочногоНазначенияПенсии
		|		И ДанныеШтатногоРасписания.КодПозицииСписка = ДанныеСотрудников.КодПозицииСписка
		|СГРУППИРОВАТЬ ПО
		|	ДанныеШтатногоРасписания.РабочееМесто,
		|	ДанныеШтатногоРасписания.Подразделение,
		|	ДанныеШтатногоРасписания.Должность,
		|	ДанныеШтатногоРасписания.КоличествоРабочихМест,
		|	ДанныеШтатногоРасписания.ОсобыеУсловияТруда,
		|	ДанныеШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии,
		|	ДанныеШтатногоРасписания.КодПозицииСписка,
		|	ДанныеШтатногоРасписания.ХарактерВыполняемыхРабот,
		|	ДанныеШтатногоРасписания.ПервичныеДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеШтатногоРасписания.Подразделение КАК Подразделение,
		|	ДанныеШтатногоРасписания.Должность КАК Должность,
		|	СУММА(ДанныеШтатногоРасписания.КоличествоРаботающих) КАК КоличествоРаботающих,
		|	СУММА(ДанныеШтатногоРасписания.КоличествоРабочихМест) КАК КоличествоРабочихМест,
		|	ДанныеШтатногоРасписания.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
		|	ДанныеШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии КАК ОснованиеДосрочногоНазначенияПенсии,
		|	ДанныеШтатногоРасписания.КодПозицииСписка КАК КодПозицииСписка,
		|	ДанныеШтатногоРасписания.ХарактерВыполняемыхРабот КАК ХарактерВыполняемыхРабот,
		|	ДанныеШтатногоРасписания.ПервичныеДокументы КАК ПервичныеДокументы
		|ПОМЕСТИТЬ ВТДосрочноеНазначениеПенсии
		|ИЗ
		|	ВТДосрочноеНазначениеПенсииПредварительно КАК ДанныеШтатногоРасписания
		|СГРУППИРОВАТЬ ПО
		|	ДанныеШтатногоРасписания.Подразделение,
		|	ДанныеШтатногоРасписания.Должность,
		|	ДанныеШтатногоРасписания.ОсобыеУсловияТруда,
		|	ДанныеШтатногоРасписания.ОснованиеДосрочногоНазначенияПенсии,
		|	ДанныеШтатногоРасписания.КодПозицииСписка,
		|	ДанныеШтатногоРасписания.ХарактерВыполняемыхРабот,
		|	ДанныеШтатногоРасписания.ПервичныеДокументы
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеШтатногоРасписания.КоличествоРаботающих) > 0";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьТекстДополнительныхПолейЗапросаВТДанныеУчетаСтажаПФР(ТекстыПолейЗапроса) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПоля = "ВЫБОР
	|		КОГДА ПериодыСтажаПФР.ЗарегистрированоЗначениеОснованиеВыслугиЛет
	|			ТОГДА ПериодыСтажаПФР.ОснованиеВыслугиЛет
	|		КОГДА ПериодыСтажаПФР.УсловияТруда <> ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка)
	|			ТОГДА ПериодыСтажаПФР.УсловияТруда.ОснованиеДосрочногоНазначенияПенсии
	|		КОГДА ПериодыСтажаПФР.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
	|			ТОГДА ПериодыСтажаПФР.РабочееМесто.ОснованиеДосрочногоНазначенияПенсии
	|		КОГДА ПериодыСтажаПФР.ДолжностьПоШтатномуРасписанию <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
	|			ТОГДА ПериодыСтажаПФР.ДолжностьПоШтатномуРасписанию.ОснованиеДосрочногоНазначенияПенсии
	|		ИНАЧЕ ПериодыСтажаПФР.Должность.ОснованиеДосрочногоНазначенияПенсии
	|	КОНЕЦ";
	ТекстыПолейЗапроса.Вставить("ОснованиеДосрочногоНазначенияПенсии", ТекстПоля);
	
	ТекстПоля = "ВЫБОР
	|		КОГДА ПериодыСтажаПФР.УсловияТруда <> ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка)
	|			ТОГДА ПериодыСтажаПФР.УсловияТруда.КодПозицииСпискаПФР
	|		КОГДА ПериодыСтажаПФР.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
	|			ТОГДА ПериодыСтажаПФР.РабочееМесто.КодПозицииСпискаПФР
	|		КОГДА ПериодыСтажаПФР.ДолжностьПоШтатномуРасписанию <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
	|			ТОГДА ПериодыСтажаПФР.ДолжностьПоШтатномуРасписанию.КодПозицииСпискаПФР
	|		ИНАЧЕ ПериодыСтажаПФР.Должность.КодПозицииСпискаПФР
	|	КОНЕЦ";
	ТекстыПолейЗапроса.Вставить("КодПозицииСписка", ТекстПоля);
	
	ТекстПоля = "ВЫБОР
	|				КОГДА ПериодыСтажаПФР.ЗарегистрированоЗначениеОсобыеУсловияТруда
	|					ТОГДА ПериодыСтажаПФР.ОсобыеУсловияТруда
	|				КОГДА ПериодыСтажаПФР.УсловияТруда <> ЗНАЧЕНИЕ(Справочник.УсловияТруда.ПустаяСсылка)
	|					ТОГДА ПериодыСтажаПФР.УсловияТруда.ОсобыеУсловияТрудаПФР
	|				КОГДА ПериодыСтажаПФР.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
	|					ТОГДА ПериодыСтажаПФР.РабочееМесто.ОсобыеУсловияТрудаПФР
	|				КОГДА ПериодыСтажаПФР.ДолжностьПоШтатномуРасписанию <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
	|					ТОГДА ПериодыСтажаПФР.ДолжностьПоШтатномуРасписанию.ОсобыеУсловияТрудаПФР
	|				ИНАЧЕ ПериодыСтажаПФР.Должность.ОсобыеУсловияТрудаПФР
	|			КОНЕЦ";
	ТекстыПолейЗапроса.Вставить("ОсобыеУсловияТруда", ТекстПоля);
		
КонецПроцедуры

Процедура ДополнитьЗапросВТКлассыУсловийТруда(Запрос) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлассыПоДолжностям.Период,
		|	КлассыПоДолжностям.КлассУсловийТруда,
		|	РабочиеМестаОхраныТруда.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	РабочиеМестаОхраныТруда.Владелец
		|ИЗ
		|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыПоДолжностям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО КлассыПоДолжностям.Должность = РабочиеМестаОхраныТруда.Ссылка";
	
	// АПК:96 -вкл
	
КонецПроцедуры

// Получает из параметра Ссылка ссылку на организацию и помещает в массив
//
//	Параметры:
//		ОтборПоОрганизациям - тип Неопределено, в этот параметр помещается массив организаций
//								полученный их параметра Ссылка
//		Ссылка - ссылка на объект из которого можно получить организацию
//
Процедура ЗаполнитьОтборПоОрганизацииПриУстановкеИспользованияСтраховыхВзносовПоКлассамУсловийТруда(ОтборПоОрганизациям, Ссылка) Экспорт

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.РабочиеМестаОхраныТруда") Тогда
		ОтборПоОрганизациям = Новый Массив;
		ОтборПоОрганизациям.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Владелец"));
	КонецЕсли;
	
КонецПроцедуры

// Заполняет описателей профилей групп доступа, предназначенных для 
// работы с зарплатным и кадровым функционалом
// см. УправлениеДоступомПереопределяемый.ЗаполнитьПоставляемыеПрофилиГруппДоступа.
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступаПодсистемыОхранаТруда(ОписанияПрофилей, ПараметрыОбновления) Экспорт 
	
	ОписаниеПрофиля = ОписаниеПрофиляСпециалистПоОхранеТруда();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = ОписаниеПрофиляСтаршийСпециалистПоОхранеТруда();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОбновитьДанныеРабочихМестПоУсловиямТруда(УсловияТруда) Экспорт
	
	Если Не ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	// Обновляем все рабочие места, описание которых соответствует условиям труда.
	Справочники.РабочиеМестаОхраныТруда.ОбновитьДанныеРабочихМестПоУсловиямТруда(
		УсловияТруда, ЗначенияВзносовВредностиПФР(УсловияТруда));
	
КонецПроцедуры

Процедура ОбновитьНаименованияРабочихМест(НаборЗаписей) Экспорт
	
	Если Не НаборЗаписей.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = НаборЗаписей.ДополнительныеСвойства["ПрежнийНабор"];
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ПрежнийНабор, НаборЗаписей) Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМеста = НаборЗаписей.ВыгрузитьКолонку("РабочееМесто");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, НаборЗаписей.ВыгрузитьКолонку("АналогичноеРабочееМесто"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, ПрежнийНабор.ВыгрузитьКолонку("РабочееМесто"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, ПрежнийНабор.ВыгрузитьКолонку("АналогичноеРабочееМесто"), Истина);

	УстановитьПривилегированныйРежим(Истина);
	ИзменитьНаименованияРабочихМест(РабочиеМеста, НаборЗаписей.Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция НаименованиеРабочегоМеста(Подразделение, Должность, Номер, НомерОсновногоРабочегоМеста = "") Экспорт
	
	НомерРабочегоМеста = ?(ЗначениеЗаполнено(Номер), Номер, "") + ?(ЗначениеЗаполнено(НомерОсновногоРабочегоМеста), "А (" + НомерОсновногоРабочегоМеста + ")", "");
	
	НомерРабочегоМеста = ?(ЗначениеЗаполнено(НомерРабочегоМеста), "№ " + НомерРабочегоМеста + " ", "");
	
	НаименованиеРабочегоМеста = ?(ЗначениеЗаполнено(НомерРабочегоМеста), НомерРабочегоМеста, "");
		
	НаименованиеРабочегоМеста = НаименованиеРабочегоМеста + СокрЛП(Строка(Должность)) + ?(ЗначениеЗаполнено(Подразделение), " /" + СокрЛП(Строка(Подразделение)) + "/", "");
		
	Возврат НаименованиеРабочегоМеста;
	
КонецФункции

// Возвращает список рабочих мест по подразделению и должности.
// 
// Параметры:
//  Подразделение - СправочникСсылка.ПодразделенияОрганизаций - ссылка на подразделение.
//  Должность - СправочникСсылка.Должности - ссылка на должность.
//  Владелец - СправочникСсылка.Организации - ссылка на организацию.
// 
// Возвращаемое значение:
//  СписокЗначений - Рабочие места по подразделению и должности
Функция РабочиеМестаПоПодразделениюИДолжности(Подразделение, Должность, Владелец = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Подразделение", Подразделение);
	Отбор.Вставить("Должность", Должность);
	Отбор.Вставить("ВАрхиве", Ложь);
	
	Если Владелец <> Неопределено Тогда
		Отбор.Вставить("Владелец", Владелец);
	КонецЕсли;
	
	РабочиеМеста = Справочники.РабочиеМестаОхраныТруда.ПолучитьДанныеВыбора(Новый Структура("Отбор", Отбор));
	
	Возврат РабочиеМеста;
	
КонецФункции

Процедура ДобавитьПодменюПоНазначениюРабочихМестСотрудникам(ОписаниеМеню) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры")
	   И Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.Документы.НазначениеРабочихМестСотрудникам) Тогда
		Возврат;
	КонецЕсли;
	
	ПунктыМеню = Новый Массив;
	
	ПунктыМеню.Добавить("Документы.НазначениеРабочихМестСотрудникам");
	
	ОписаниеМеню.Пункты.Добавить(
	СотрудникиФормы.РазделМеню(НСтр("ru='Охрана труда'"), ПунктыМеню));
	
КонецПроцедуры

Функция РезультатыСпециальнойОценкиУсловийТрудаЕФС1(МенеджерВременныхТаблиц, Организация, ОтчетныйПериод, СписокФизическихЛиц) Экспорт 
	
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛиц(МенеджерВременныхТаблиц, Истина, СписокФизическихЛиц, Организация, ОтчетныйПериод, КонецГода(ОтчетныйПериод));
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОсновныеСотрудники.Сотрудник КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(ДанныеСтажаСотрудников.ДатаОкончанияПериода, ГОД) КАК ДатаНачала,
		|	КОНЕЦПЕРИОДА(ДанныеСтажаСотрудников.ДатаОкончанияПериода, ГОД) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	ВТДанныеСтажаСотрудников КАК ДанныеСтажаСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеСотрудникиФизическихЛиц КАК ОсновныеСотрудники
		|		ПО ДанныеСтажаСотрудников.ФизическоеЛицо = ОсновныеСотрудники.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РабочиеМестаСотрудниковИнтервальный.Сотрудник КАК Сотрудник,
		|	РабочиеМестаСотрудниковИнтервальный.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РабочиеМестаСотрудниковИнтервальный.ДатаНачала КАК ДатаНачала,
		|	РабочиеМестаСотрудниковИнтервальный.ДатаОкончания КАК ДатаОкончания,
		|	РабочиеМестаСотрудниковИнтервальный.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТРабочиеМестаСотрудниковИнтервальный
		|ИЗ
		|	РегистрСведений.РабочиеМестаСотрудниковИнтервальный КАК РабочиеМестаСотрудниковИнтервальный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиПериоды КАК СотрудникиПериоды
		|		ПО РабочиеМестаСотрудниковИнтервальный.Сотрудник = СотрудникиПериоды.Сотрудник
		|			И РабочиеМестаСотрудниковИнтервальный.ДатаНачала <= СотрудникиПериоды.ДатаОкончания
		|			И РабочиеМестаСотрудниковИнтервальный.ДатаОкончания >= СотрудникиПериоды.ДатаНачала";
	
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ОтчетныйПериод));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	&ОтчетныйПериод КАК ДатаНачала,
		|	&ОкончаниеПериода КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТРабочиеМеста
		|ИЗ
		|	ВТРабочиеМестаСотрудниковИнтервальный КАК РабочиеМестаСотрудников
		|ГДЕ
		|	РабочиеМестаСотрудников.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)";
	
	Запрос.Выполнить();
	
	ПараметрыПолученияДанных = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	ПараметрыПолученияДанных.ВключатьЗаписиНаНачалоПериода = Истина;
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТРабочиеМеста", "РабочееМесто");
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		"РезультатыСпециальнойОценкиУсловийТруда",
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ОписаниеФильтра,
		ПараметрыПолученияДанных);
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТРабочиеМестаОтборФизическихЛиц
		|ИЗ
		|	ВТРабочиеМестаСотрудниковИнтервальный КАК РабочиеМестаСотрудников
		|ГДЕ
		|	РабочиеМестаСотрудников.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеМестаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА &ОтчетныйПериод > РабочиеМестаСотрудников.ДатаНачала
		|			ТОГДА НАЧАЛОПЕРИОДА(&ОтчетныйПериод, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(РабочиеМестаСотрудников.ДатаНачала, ДЕНЬ)
		|	КОНЕЦ КАК Начало,
		|	ВЫБОР
		|		КОГДА &ОкончаниеПериода < РабочиеМестаСотрудников.ДатаОкончания
		|			ТОГДА НАЧАЛОПЕРИОДА(&ОкончаниеПериода, ДЕНЬ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(РабочиеМестаСотрудников.ДатаОкончания, ДЕНЬ)
		|	КОНЕЦ КАК Окончание,
		|	РабочиеМестаСотрудников.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаСотрудников.РабочееМесто.Номер КАК НомерРабочегоМеста
		|ИЗ
		|	ВТРабочиеМестаСотрудниковИнтервальный КАК РабочиеМестаСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРабочиеМестаОтборФизическихЛиц КАК ОтборФизическихЛиц
		|		ПО РабочиеМестаСотрудников.ФизическоеЛицо = ОтборФизическихЛиц.ФизическоеЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочееМесто,
		|	Начало";
	
	РабочиеМестаПериоды = Запрос.Выполнить().Выгрузить();
	РабочиеМестаПериоды.Колонки.Добавить("КлассПодклассУсловийТруда", Новый ОписаниеТипов("ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки"));
	
	ДополнительныеСтроки = РабочиеМестаПериоды.СкопироватьКолонки();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто КАК РабочееМесто,
		|	РезультатыСпециальнойОценкиУсловийТруда.Период КАК Период,
		|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда КАК КлассУсловийТруда
		|ИЗ
		|	ВТРезультатыСпециальнойОценкиУсловийТруда КАК РезультатыСпециальнойОценкиУсловийТруда
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочееМесто,
		|	Период";
	
	КлассыУсловийТруда = Запрос.Выполнить().Выгрузить();
	КлассыУсловийТруда.Индексы.Добавить("РабочееМесто");
	
	КонечноеЗначение = РабочиеМестаПериоды.Количество() - 1;
	КлассыУсловийТрудаРабочегоМеста = Новый Массив;
	ТекущаяСтрока = Неопределено;
	ТекущееРабочееМесто = Неопределено;
	
	Для Индекс = 0 По КонечноеЗначение Цикл
		ТекущаяСтрока = РабочиеМестаПериоды[Индекс];
		Если ТекущаяСтрока.РабочееМесто <> ТекущееРабочееМесто Тогда 
			ТекущееРабочееМесто = ТекущаяСтрока.РабочееМесто;
			Отбор = Новый Структура("РабочееМесто", ТекущееРабочееМесто);
			КлассыУсловийТрудаРабочегоМеста = КлассыУсловийТруда.НайтиСтроки(Отбор);
		КонецЕсли;
		Для Каждого ДанныеРабочегоМеста Из КлассыУсловийТрудаРабочегоМеста Цикл 
			Если ДанныеРабочегоМеста.Период <= ТекущаяСтрока.Начало Тогда 
				ТекущаяСтрока.КлассПодклассУсловийТруда = ДанныеРабочегоМеста.КлассУсловийТруда;
			ИначеЕсли ДанныеРабочегоМеста.Период < ТекущаяСтрока.Окончание Тогда 
				ДанныеСтроки = ТекущаяСтрока;
				ТекущаяСтрока = ДополнительныеСтроки.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДанныеСтроки);
				ТекущаяСтрока.Начало = НачалоДня(ДанныеРабочегоМеста.Период);
				ТекущаяСтрока.КлассПодклассУсловийТруда = ДанныеРабочегоМеста.КлассУсловийТруда;
				ДанныеСтроки.Окончание = НачалоДня(ДанныеРабочегоМеста.Период) - 86400;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеСтроки, РабочиеМестаПериоды);
	
	ИменаВТ = Новый Массив;
	ИменаВТ.Добавить("ВТОсновныеСотрудникиФизическихЛиц");
	ИменаВТ.Добавить("ВТСотрудникиПериоды");
	ИменаВТ.Добавить("ВТРабочиеМестаСотрудниковИнтервальный");
	ИменаВТ.Добавить("ВТРабочиеМеста");
	ИменаВТ.Добавить("ВТРезультатыСпециальнойОценкиУсловийТруда");
	ИменаВТ.Добавить("ВТРабочиеМестаОтборФизическихЛиц");
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, ИменаВТ);
	
	Возврат РабочиеМестаПериоды;
	
КонецФункции

#Область Периодичность

Функция ПредставлениеПериодаПоСтруктуре(СтруктураПериода) Экспорт
	
	Если СтруктураПериода.КоличествоРаз = 1 И СтруктураПериода.КоличествоПериодов = 1 Тогда
		Если СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
			Возврат "ежегодно";
		ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
			Возврат "ежедекадно";
		ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
			Возврат "ежедневно";
		ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
			Возврат "ежеквартально";
		ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
			Возврат "ежемесячно";
		ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
			Возврат "еженедельно";
		КонецЕсли;
	КонецЕсли;
	
	ПредставлениеРаз = "раз";
	ПоследнееЧисло = Число(Прав(СтруктураПериода.КоличествоРаз, 1));
	Последние2Числа = Число(Прав(СтруктураПериода.КоличествоРаз, 2));
	Если ПоследнееЧисло > 1 И ПоследнееЧисло < 5 И Последние2Числа <> 12 И Последние2Числа <> 13 И Последние2Числа <> 14 Тогда
		ПредставлениеРаз = "раза";
	КонецЕсли;
	
	// АПК:1297-выкл "Л = ru_RU" не локализуется, т.к. является форматной строкой.
	
	ПредставлениеКоличестваРаз = СокрЛП(НРег(ЧислоПрописью(СтруктураПериода.КоличествоРаз, "Л = ru_RU", НСтр("ru = ',,,,,,,,0'"))));
	
	ПредставлениеПериодичности = НРег(СтруктураПериода.Периодичность);
	Если СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ПредставлениеПериодичности = НРег(ЧислоПрописью(СтруктураПериода.КоличествоПериодов, "Л = ru_RU", НСтр("ru = 'год,года,лет,м,,,,,0'")));
	ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
		ПредставлениеПериодичности = НРег(ЧислоПрописью(СтруктураПериода.КоличествоПериодов, "Л = ru_RU", НСтр("ru = 'декаду,декады,декад,ж,,,,,0'")));
	ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		ПредставлениеПериодичности = НРег(ЧислоПрописью(СтруктураПериода.КоличествоПериодов, "Л = ru_RU", НСтр("ru = 'день,дня,дней,м,,,,,0'")));
	ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ПредставлениеПериодичности = НРег(ЧислоПрописью(СтруктураПериода.КоличествоПериодов, "Л = ru_RU", НСтр("ru = 'квартал,квартала,кварталов,м,,,,,0'")));
	ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ПредставлениеПериодичности = НРег(ЧислоПрописью(СтруктураПериода.КоличествоПериодов, "Л = ru_RU", НСтр("ru = 'месяц,месяца,месяцев,м,,,,,0'")));
	ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		ПредставлениеПериодичности = НРег(ЧислоПрописью(СтруктураПериода.КоличествоПериодов, "Л = ru_RU", НСтр("ru = 'неделю,недели,недель,ж,,,,,0'")));
	ИначеЕсли СтруктураПериода.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		ПредставлениеПериодичности = НРег(ЧислоПрописью(СтруктураПериода.КоличествоПериодов, "Л = ru_RU", НСтр("ru = 'полугодие,полугодия,полугодий,с,,,,,0'")));
	КонецЕсли;
	
	// АПК:1297-вкл
	
	Если СтруктураПериода.КоличествоПериодов = 1 Тогда
		ПредставлениеПериодичности = СтрЗаменить(ПредставлениеПериодичности, "один ", "");
		ПредставлениеПериодичности = СтрЗаменить(ПредставлениеПериодичности, "одно ", "");
		ПредставлениеПериодичности = СтрЗаменить(ПредставлениеПериодичности, "одна ", "");
	КонецЕсли;
	
	ШаблонПредставления = НСтр("ru = '%1 %2 в %3'");
	ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонПредставления, ПредставлениеКоличестваРаз, ПредставлениеРаз, ПредставлениеПериодичности);
	
	Возврат ПредставлениеПериода;
	
КонецФункции

Процедура СоздатьВТСрокиДействияПоПериоду(МенеджерВременныхТаблиц, ИмяВТПериода, ИмяДатыПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*,
	|	ВЫБОР
	|		КОГДА ТаблицаПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, ДЕНЬ, ТаблицаПериодов.КоличествоПериодов)
	|		КОГДА ТаблицаПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, НЕДЕЛЯ, ТаблицаПериодов.КоличествоПериодов)
	|		КОГДА ТаблицаПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, МЕСЯЦ, ТаблицаПериодов.КоличествоПериодов)
	|		КОГДА ТаблицаПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, КВАРТАЛ, ТаблицаПериодов.КоличествоПериодов)
	|		КОГДА ТаблицаПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, ГОД, ТаблицаПериодов.КоличествоПериодов)
	|		КОГДА ТаблицаПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, ДЕКАДА, ТаблицаПериодов.КоличествоПериодов)
	|		КОГДА ТаблицаПериодов.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, ПОЛУГОДИЕ, ТаблицаПериодов.КоличествоПериодов)
	|	КОНЕЦ КАК СрокОкончанияПериода
	|ПОМЕСТИТЬ ВТСрокиОкончанияПоПериоду
	|ИЗ
	|	&ТаблицаПериодов КАК ТаблицаПериодов";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПериодов.ДатаПериода", "ТаблицаПериодов." + ИмяДатыПериода);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаПериодов", ИмяВТПериода);
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*,
	|	ВЫБОР
	|		КОГДА ТаблицаПериодов.КоличествоРаз = 0
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ТаблицаПериодов.ДатаПериода, ДЕНЬ, РАЗНОСТЬДАТ(ТаблицаПериодов.ДатаПериода, ТаблицаПериодов.СрокОкончанияПериода, ДЕНЬ) / ТаблицаПериодов.КоличествоРаз)
	|	КОНЕЦ КАК СрокДействия
	|ПОМЕСТИТЬ ВТСрокиДействияПоПериоду
	|ИЗ
	|	ВТСрокиОкончанияПоПериоду КАК ТаблицаПериодов";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаПериодов.ДатаПериода", "ТаблицаПериодов." + ИмяДатыПериода);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.РабочиеМестаСотрудников
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.РабочиеМестаСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.РабочиеМестаСотрудниковИнтервальный;
	
КонецПроцедуры

#КонецОбласти

#Область РазделыДанных

// Добавляет разделы в таблицу разделов данных.
// 
// Параметры:
//  РазделыДанных - ТаблицаЗначений - см. СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.ТаблицаВсехРазделовДанных
Процедура ПриДобавленииРазделовДанных(РазделыДанных) Экспорт
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьРазделДанныхВТаблицу(РазделыДанных, "ОхранаТруда", "Охрана труда",
		"УправленческиеДанные", БиблиотекаКартинок.ОхранаТруда, "ОхранаТруда.ПриДобавленииРазделовДанных");
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьРазделДанныхВТаблицу(РазделыДанных, "Инструктажи", "Инструктажи",
		"ОхранаТруда", , "ОхранаТруда.ПриДобавленииРазделовДанных");
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьРазделДанныхВТаблицу(РазделыДанных, "НесчастныеСлучаи",
		"Несчастные случаи", "ОхранаТруда", , "ОхранаТруда.ПриДобавленииРазделовДанных");
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьРазделДанныхВТаблицу(РазделыДанных, "СпециальнаяОценкаУсловийТруда",
		"Специальная оценка условий труда", "ОхранаТруда", , "ОхранаТруда.ПриДобавленииРазделовДанных");
	
КонецПроцедуры

#КонецОбласти

#Область ПереносДанныхИзПрежнихПрограмм

Процедура ВидыИнструктажейПоОхранеТрудаПослеЗагрузки(Объект, ОбъектНайден, ПараметрыОбъекта, Отказ) Экспорт
	
	Если Отказ Или ПараметрыОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Должности", ПараметрыОбъекта.Получить("Должности"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	ШтатноеРасписание.Должность В(&Должности)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.РабочиеМеста.Добавить();
		НоваяСтрока.РабочееМесто = Выборка.Ссылка;
	КонецЦикла;
	
	Если Объект.РабочиеМеста.Количество() = 0 Тогда
		Объект.ИспользоватьДляВсехРабочихМест = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура НаправлениеНаМедицинскийОсмотрПослеЗагрузки(Объект, ОбъектНайден, ПараметрыОбъекта, Отказ) Экспорт
	
	Если Отказ Или ПараметрыОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОбъекта.Получить("Сотрудник"));
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивСотрудников,
		"Должность, Подразделение, РабочееМестоОхраныТруда", Объект.ДатаОсмотра);
	
	Для Каждого СтрокаКадровыхДанных Из КадровыеДанныеСотрудников Цикл
		Объект.Должность = СтрокаКадровыхДанных.Должность;
		Объект.Подразделение = СтрокаКадровыхДанных.Подразделение;
		Объект.РабочееМесто = СтрокаКадровыхДанных.РабочееМестоОхраныТруда;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаключениеМедицинскогоОсмотраПослеЗагрузки(Объект, ОбъектНайден, ПараметрыОбъекта, Отказ) Экспорт
	
	Если Отказ Или ПараметрыОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОбъекта.Получить("Сотрудник"));
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивСотрудников,
		"РабочееМестоОхраныТруда", Объект.ДатаОсмотра);
	
	Для Каждого СтрокаКадровыхДанных Из КадровыеДанныеСотрудников Цикл
		Если ЗначениеЗаполнено(СтрокаКадровыхДанных.РабочееМестоОхраныТруда) Тогда
			Объект.РабочееМесто = СтрокаКадровыхДанных.РабочееМестоОхраныТруда;
			СоздатьЗаписьВредныеФакторыИВидыРабот(Объект.РабочееМесто, Объект.ВредныеФакторыИВидыРабот[0].ВредныйФактор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура НазначениеРабочихМестСотрудникамПослеЗагрузки(Объект, Отказ) Экспорт

	МассивСотрудников = Объект.Сотрудники.ВыгрузитьКолонку("Сотрудник");
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, МассивСотрудников,
		"Должность, Подразделение, РабочееМестоОхраныТруда", Объект.НачалоПериода);

	Для Каждого СтрокаСотрудники Из Объект.Сотрудники Цикл
		
		НайденнаяСтрока = КадровыеДанныеСотрудников.Найти(СтрокаСотрудники.Сотрудник, "Сотрудник");
		
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РабочееМесто = Неопределено;
		Если ЗначениеЗаполнено(НайденнаяСтрока.РабочееМестоОхраныТруда) Тогда
			РабочееМесто = НайденнаяСтрока.РабочееМестоОхраныТруда;
		ИначеЕсли ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(НайденнаяСтрока.Подразделение)
			И ЗначениеЗаполнено(НайденнаяСтрока.Должность) Тогда
			РабочееМесто = ПолучитьСоздатьРабочееМестоОхраныТруда(Объект.Организация, НайденнаяСтрока.Подразделение,
				НайденнаяСтрока.Должность);
		КонецЕсли;
		
		Если РабочееМесто <> Неопределено Тогда
			НоваяСтрока = Объект.РабочиеМеста.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаСотрудники.ИдентификаторСтрокиРабочегоМеста;
			НоваяСтрока.РабочееМесто = РабочееМесто;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСоздатьРабочееМестоОхраныТруда(Организация, Подразделение, Должность);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РабочиеМестаОхраныТруда.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|ГДЕ
		|	РабочиеМестаОхраныТруда.Владелец = &Владелец
		|	И РабочиеМестаОхраныТруда.Подразделение = &Подразделение
		|	И РабочиеМестаОхраныТруда.Должность = &Должность
		|	И НЕ РабочиеМестаОхраныТруда.ВАрхиве
		|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		РабочееМестоОбъект = Справочники.РабочиеМестаОхраныТруда.СоздатьЭлемент();
		РабочееМестоОбъект.Владелец = Организация;
		РабочееМестоОбъект.Подразделение = Подразделение;
		РабочееМестоОбъект.Должность = Должность;
		РабочееМестоОбъект.ПорядковыйНомер =
			Справочники.РабочиеМестаОхраныТруда.МаксимальныйНомерРабочегоМеста(Организация, Подразделение) + 1;
		РабочееМестоОбъект.Номер = Строка(РабочееМестоОбъект.ПорядковыйНомер);
		РабочееМестоОбъект.Наименование = ОхранаТруда.НаименованиеРабочегоМеста(
			РабочееМестоОбъект.Подразделение,
			РабочееМестоОбъект.Должность, 
			РабочееМестоОбъект.Номер);
		РабочееМестоОбъект.Записать();
		Результат = РабочееМестоОбъект.Ссылка;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьЗаписьВредныеФакторыИВидыРабот(РабочееМесто, ВредныйФактор)

	Запись = РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста.СоздатьМенеджерЗаписи();
	Запись.РабочееМесто = РабочееМесто;
	Запись.ВредныйФактор = ВредныйФактор;
	Запись.ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		Запись.РабочееМесто = РабочееМесто;
		Запись.ВредныйФактор = ВредныйФактор;
		Запись.ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
		Запись.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура НесчастныйСлучайНаПроизводствеПослеЗагрузки(Объект, ПараметрыОбъекта, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПрилагаемыеДокументы = НСтр("ru = 'Нет документов'");
	Если Не ЗначениеЗаполнено(Объект.ВидПроисшествия) И ПараметрыОбъекта <> Неопределено И Не ПустаяСтрока(ПараметрыОбъекта.Получить("ВидПроисшествияСтрокаПоиска")) Тогда
		
		// Попробуем найти нечетким поиском, с постепенным повышением чувствительности
		СравнениеСтрокНаПодобие = Новый Структура;
		СравнениеСтрокНаПодобие.Вставить("ПроцентСовпаденияСтрок", 90);
		СравнениеСтрокНаПодобие.Вставить("ПроцентСовпаденияНебольшихСтрок", 50);
		СравнениеСтрокНаПодобие.Вставить("ДлинаНебольшихСтрок", 10);
		
		НечеткийПоиск = ОбщегоНазначения.ПодключитьКомпонентуИзМакета("FuzzyStringMatchExtension", "ОбщийМакет.КомпонентаПоискаСтрок");
		Если НечеткийПоиск <> Неопределено Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ВидыПроисшествий.ПолноеНаименование КАК ПолноеНаименование
			|ИЗ
			|	Справочник.ВидыПроисшествий КАК ВидыПроисшествий";
			
			МассивВсехСтрок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПолноеНаименование");
			ИскомыеСтроки = СтрСоединить(МассивВсехСтрок, "~");
			СтрокаДляПоиска = ПараметрыОбъекта.Получить("ВидПроисшествияСтрокаПоиска");
			ИндексыСтрок = НечеткийПоиск.StringSearch(НРег(СтрокаДляПоиска), НРег(ИскомыеСтроки), "~",
				СравнениеСтрокНаПодобие.ДлинаНебольшихСтрок,
				СравнениеСтрокНаПодобие.ПроцентСовпаденияСтрок,
				СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок);
				
			Если Не ПустаяСтрока(ИндексыСтрок) Тогда
				
				ПредыдущийМассив = Новый Массив;
				МассивНайденныхСтрок = СтрРазделить(ИндексыСтрок, ",");
				Пока МассивНайденныхСтрок.Количество() > 1 Цикл
					
					ПредыдущийМассив = МассивНайденныхСтрок;
					
					// Повышаем порог чувствительности
					СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок = СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок + 1;
					НовыйМассивВсехСтрок = Новый Массив;
					Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл
						НовыйМассивВсехСтрок.Добавить(МассивВсехСтрок.Получить(НайденнаяСтрока));
					КонецЦикла;
					ИскомыеСтроки = СтрСоединить(НовыйМассивВсехСтрок, "~");
					
					ИндексыСтрок = НечеткийПоиск.StringSearch(НРег(СтрокаДляПоиска), НРег(ИскомыеСтроки), "~",
						СравнениеСтрокНаПодобие.ДлинаНебольшихСтрок,
						СравнениеСтрокНаПодобие.ПроцентСовпаденияСтрок,
						СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок);
					
					МассивНайденныхСтрок = СтрРазделить(ИндексыСтрок, ",");
					МассивВсехСтрок = НовыйМассивВсехСтрок;
					
				КонецЦикла;
				Если МассивНайденныхСтрок.Количество() = 0 Тогда
					МассивНайденныхСтрок = ПредыдущийМассив;
				КонецЕсли;
				
				Для Каждого ИндексСтроки Из МассивНайденныхСтрок Цикл
					Если ПустаяСтрока(ИндексСтроки) Тогда
						Продолжить;
					КонецЕсли;
					
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ПолноеНаименование", МассивВсехСтрок.Получить(ИндексСтроки));
					
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ВидыПроисшествий.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.ВидыПроисшествий КАК ВидыПроисшествий
					|ГДЕ
					|	ВидыПроисшествий.ПолноеНаименование ПОДОБНО &ПолноеНаименование";
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Объект.ВидПроисшествия = Выборка.Ссылка;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого СтрокаПричиныПроисшествий Из Объект.ПричиныПроисшествия Цикл
		Если Не ЗначениеЗаполнено(СтрокаПричиныПроисшествий.Причина) И ПараметрыОбъекта <> Неопределено
			И ПараметрыОбъекта.Получить("ПричиныПроисшествияТабличнаяЧасть") <> Неопределено
			И ПараметрыОбъекта.Получить("ПричиныПроисшествияТабличнаяЧасть").Получить(СтрокаПричиныПроисшествий.НомерСтроки-1).ПричинаСтрокаПоиска <> Неопределено Тогда
			
			// Попробуем найти нечетким поиском, с постепенным повышением чувствительности
			СравнениеСтрокНаПодобие = Новый Структура;
			СравнениеСтрокНаПодобие.Вставить("ПроцентСовпаденияСтрок", 90);
			СравнениеСтрокНаПодобие.Вставить("ПроцентСовпаденияНебольшихСтрок", 50);
			СравнениеСтрокНаПодобие.Вставить("ДлинаНебольшихСтрок", 10);
			
			НечеткийПоиск = ОбщегоНазначения.ПодключитьКомпонентуИзМакета("FuzzyStringMatchExtension", "ОбщийМакет.КомпонентаПоискаСтрок");
			Если НечеткийПоиск <> Неопределено Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ПричиныПроисшествий.ПолноеНаименование КАК ПолноеНаименование
				|ИЗ
				|	Справочник.ПричиныПроисшествий КАК ПричиныПроисшествий";
				
				МассивВсехСтрок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПолноеНаименование");
				ИскомыеСтроки = СтрСоединить(МассивВсехСтрок, "~");
				СтрокаДляПоиска = ПараметрыОбъекта.Получить("ПричиныПроисшествияТабличнаяЧасть").Получить(СтрокаПричиныПроисшествий.НомерСтроки-1).ПричинаСтрокаПоиска;
				ИндексыСтрок = НечеткийПоиск.StringSearch(НРег(СтрокаДляПоиска), НРег(ИскомыеСтроки), "~",
					СравнениеСтрокНаПодобие.ДлинаНебольшихСтрок,
					СравнениеСтрокНаПодобие.ПроцентСовпаденияСтрок,
					СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок);
					
				Если Не ПустаяСтрока(ИндексыСтрок) Тогда
					
					ПредыдущийМассив = Новый Массив;
					МассивНайденныхСтрок = СтрРазделить(ИндексыСтрок, ",");
					Пока МассивНайденныхСтрок.Количество() > 1 Цикл
						
						ПредыдущийМассив = МассивНайденныхСтрок;
						
						// Повышаем порог чувствительности
						СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок = СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок + 1;
						НовыйМассивВсехСтрок = Новый Массив;
						Для Каждого НайденнаяСтрока Из МассивНайденныхСтрок Цикл
							НовыйМассивВсехСтрок.Добавить(МассивВсехСтрок.Получить(НайденнаяСтрока));
						КонецЦикла;
						ИскомыеСтроки = СтрСоединить(НовыйМассивВсехСтрок, "~");
						
						ИндексыСтрок = НечеткийПоиск.StringSearch(НРег(СтрокаДляПоиска), НРег(ИскомыеСтроки), "~",
							СравнениеСтрокНаПодобие.ДлинаНебольшихСтрок,
							СравнениеСтрокНаПодобие.ПроцентСовпаденияСтрок,
							СравнениеСтрокНаПодобие.ПроцентСовпаденияНебольшихСтрок);
						
						МассивНайденныхСтрок = СтрРазделить(ИндексыСтрок, ",");
						МассивВсехСтрок = НовыйМассивВсехСтрок;
						
					КонецЦикла;
					Если МассивНайденныхСтрок.Количество() = 0 Тогда
						МассивНайденныхСтрок = ПредыдущийМассив;
					КонецЕсли;
					
					Для Каждого ИндексСтроки Из МассивНайденныхСтрок Цикл
						Если ПустаяСтрока(ИндексСтроки) Тогда
							Продолжить;
						КонецЕсли;
						
						Запрос = Новый Запрос;
						Запрос.УстановитьПараметр("ПолноеНаименование", МассивВсехСтрок.Получить(ИндексСтроки));
						
						Запрос.Текст =
						"ВЫБРАТЬ
						|	ПричиныПроисшествий.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.ПричиныПроисшествий КАК ПричиныПроисшествий
						|ГДЕ
						|	ПричиныПроисшествий.ПолноеНаименование ПОДОБНО &ПолноеНаименование";
						
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							СтрокаПричиныПроисшествий.Причина = Выборка.Ссылка;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполняемыеЗначения = Новый Структура;
	
	ЗаполняемыеЗначения.Вставить("Организация",									Объект.Организация);
	ЗаполняемыеЗначения.Вставить("Руководитель",								Неопределено);
	ЗаполняемыеЗначения.Вставить("ДолжностьРуководителя",						Неопределено);
	ЗаполняемыеЗначения.Вставить("ОснованиеПодписиРуководителя",				Неопределено);
	ЗаполняемыеЗначения.Вставить("ОтветственныйЗаОхрануТруда",					Неопределено);
	ЗаполняемыеЗначения.Вставить("ДолжностьОтветственногоЗаОхрануТруда",		Неопределено);
	ЗаполняемыеЗначения.Вставить("ОснованиеПодписиОтветственногоЗаОхрануТруда",	Неопределено);
	
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
	
	Объект.Руководитель = ЗаполняемыеЗначения.Руководитель;
	Объект.ДолжностьРуководителя = ЗаполняемыеЗначения.ДолжностьРуководителя;
	Объект.ОснованиеПодписиРуководителя = ЗаполняемыеЗначения.ОснованиеПодписиРуководителя;
	Объект.ОтветственныйЗаОхрануТруда = ЗаполняемыеЗначения.ОтветственныйЗаОхрануТруда;
	Объект.ДолжностьОтветственногоЗаОхрануТруда = ЗаполняемыеЗначения.ДолжностьОтветственногоЗаОхрануТруда;
	Объект.ОснованиеПодписиОтветственногоЗаОхрануТруда = ЗаполняемыеЗначения.ОснованиеПодписиОтветственногоЗаОхрануТруда;
	
	Для каждого СтрокаПострадавшие Из Объект.Пострадавшие Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПострадавшие.СтажОбщийДатаОтсчета) И СтрокаПострадавшие.СтажОбщийРазмерМесяцев = 0
			И СтрокаПострадавшие.СтажОбщийРазмерДней = 0 Тогда
			СтрокаПострадавшие.СтажОбщийПредставление = НСтр("ru = 'Стаж не задан'");
		Иначе
			СведенияОСтаже = ЗарплатаКадрыРасширенныйКлиентСервер.СведенияОСтаже();
			СведенияОСтаже.ДатаОтсчета = СтрокаПострадавшие.СтажОбщийДатаОтсчета;
			СведенияОСтаже.Лет = Цел(СтрокаПострадавшие.СтажОбщийРазмерМесяцев / 12);
			СведенияОСтаже.Месяцев = СтрокаПострадавшие.СтажОбщийРазмерМесяцев - СведенияОСтаже.Лет * 12;
			СведенияОСтаже.Дней = СтрокаПострадавшие.СтажОбщийРазмерДней;
			
			ПродолжительностьСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.ПродолжительностьСтажа(СведенияОСтаже, Объект.ДатаПроисшествия);
			
			Если ПродолжительностьСтажа.Лет + ПродолжительностьСтажа.Месяцев + ПродолжительностьСтажа.Дней = 0 Тогда
				СтрокаПострадавшие.СтажОбщийПредставление = НСтр("ru = 'Стаж не задан'");
			Иначе
				СтрокаПострадавшие.СтажОбщийПредставление = ЗарплатаКадрыРасширенныйКлиентСервер.ПредставлениеСтажа(
					ПродолжительностьСтажа.Лет, ПродолжительностьСтажа.Месяцев,ПродолжительностьСтажа.Дней);
			КонецЕсли;
		КонецЕсли;
		
		СтрокаПострадавшие.СтажВОрганизацииПредставление = ЗарплатаКадрыРасширенныйКлиентСервер.ПредставлениеСтажа(
			СтрокаПострадавшие.СтажРаботыНаПредприятииЛет, СтрокаПострадавшие.СтажРаботыНаПредприятииМесяцев, СтрокаПострадавшие.СтажРаботыНаПредприятииДней);
		
		// ЗУПК
		ПострадавшийСотрудник = КадровыйУчет.ОсновнойСотрудникФизическогоЛица(СтрокаПострадавшие.Пострадавший, Объект.Организация, Объект.Дата);
		КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, ПострадавшийСотрудник, "РабочееМестоОхраныТруда", Объект.Дата);
		
		СтрокаПострадавшие.РабочееМесто = КадровыеДанныеСотрудника.РабочееМестоОхраныТруда;
		// ЗУПК
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНеобходимостьОбновленияСтруктурыРабочихМест(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьОбновлениеСтруктурыРабочихМест") Тогда
		Возврат;
	КонецЕсли;
	
	// Не обрабатываются группы-подразделения рабочих мест
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.РабочиеМестаОхраныТруда")
		И Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Не обрабатываются новые подразделения
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ПодразделенияОрганизаций")
		И Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.РабочиеМестаОхраныТруда") Тогда
		ИменаКонтролируемыхПолей =
			"Подразделение,
			|ВАрхиве,
			|ПометкаУдаления";
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.ПодразделенияОрганизаций") Тогда
		ИменаКонтролируемыхПолей =
			"Наименование,
			|Родитель";
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		// Для новых р формируется структура с пустыми значениями ключей
		ПрежниеДанныеОбъекта = Новый Структура(ИменаКонтролируемыхПолей);
	Иначе
		ПрежниеДанныеОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, ИменаКонтролируемыхПолей);
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ПрежниеДанныеОбъекта", ПрежниеДанныеОбъекта);
	
КонецПроцедуры

// Обработчик события ПриЗаписи, инициирует обновление структуры списка справочника РабочиеМестаОхраныТруда.
//
Процедура ОбновитьСтруктуруРабочихМестПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьОбновлениеСтруктурыРабочихМест") Тогда
		Возврат;
	КонецЕсли;
	
	ПрежниеДанныеОбъекта = Неопределено;
	Источник.ДополнительныеСвойства.Свойство("ПрежниеДанныеОбъекта", ПрежниеДанныеОбъекта);
	Если ПрежниеДанныеОбъекта <> Неопределено Тогда
		ОбновитьСтруктуруРабочихМест = Ложь;
		Для Каждого КлючиЗначение Из ПрежниеДанныеОбъекта Цикл
			Если КлючиЗначение.Значение <> Источник[КлючиЗначение.Ключ] Тогда
				ОбновитьСтруктуруРабочихМест = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ОбновитьСтруктуруРабочихМест Тогда
			ПодразделенияРабочихМест = Новый Массив;
			ОбновитьСтруктуруПоДаннымПодразделений = Ложь;
			ОбновитьСтруктуруПоДаннымРабочихМест = Ложь;
			
			Если ТипЗнч(Источник) = Тип("СправочникОбъект.РабочиеМестаОхраныТруда") Тогда
				Если ЗначениеЗаполнено(ПрежниеДанныеОбъекта.Подразделение) Тогда
					ПодразделенияРабочихМест.Добавить(ПрежниеДанныеОбъекта.Подразделение);
				КонецЕсли;
				
				Если ПрежниеДанныеОбъекта.Подразделение <> Источник.Подразделение Тогда
					ПодразделенияРабочихМест.Добавить(Источник.Подразделение);
					ОбновитьСтруктуруПоДаннымПодразделений = Истина;
				КонецЕсли;
				
				ОбновитьСтруктуруПоДаннымРабочихМест = Истина;
			Иначе
				Если ЗначениеЗаполнено(ПрежниеДанныеОбъекта.Родитель) И ПрежниеДанныеОбъекта.Родитель <> Источник.Родитель Тогда
					ПодразделенияРабочихМест.Добавить(ПрежниеДанныеОбъекта.Родитель);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Источник.Родитель) Тогда
					ПодразделенияРабочихМест.Добавить(Источник.Родитель);
				КонецЕсли;
				
				ПодразделенияРабочихМест.Добавить(Источник.Ссылка);
				ОбновитьСтруктуруПоДаннымПодразделений = Истина;
			КонецЕсли;
			
			Если ОбновитьСтруктуруПоДаннымПодразделений Тогда
				Справочники.РабочиеМестаОхраныТруда.ОбновитьСтруктуруРабочихМестПоДаннымПодразделений(Источник.Владелец, ПодразделенияРабочихМест);
			КонецЕсли;
			
			Если ОбновитьСтруктуруПоДаннымРабочихМест Тогда
				Справочники.РабочиеМестаОхраныТруда.ОбновитьСтруктуруРабочихМестПоДаннымРабочихМест(Источник.Владелец, ПодразделенияРабочихМест, Источник.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеДляПодбораСотрудниковПриИзмененииРабочихМест(НаборЗаписейРабочихМест, Отказ, Замещение) Экспорт
	
	ИзменившиесяДанныеРабочихМест = НаборЗаписейРабочихМест.ТаблицаИзменившихсяДанныхНабора();
	
	Если ИзменившиесяДанныеРабочихМест = Неопределено
		Или ИзменившиесяДанныеРабочихМест.Количество() = 0 Тогда
		
		Возврат;
	КонецЕсли;
	
	Сотрудники = ИзменившиесяДанныеРабочихМест.ВыгрузитьКолонку("Сотрудник");
	Если Сотрудники.Количество() > 0 Тогда
		РегистрыСведений.ДанныеДляПодбораСотрудников.ОбновитьДанныеДляПодбораСотрудников(Сотрудники);
	КонецЕсли;
		
КонецПроцедуры

#Область КадровыеДанныеСотрудников

Функция НеобходимыСведенияОРабочихМестахСотрудников(Знач ИмяПоля)
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("РабочееМестоОхраныТрудаПериодРегистрации")
		Или ИмяПоля = ВРег("РабочееМестоОхраныТрудаРегистратор")
		Или ИмяПоля = ВРег("РабочееМестоОхраныТруда");
		
КонецФункции

Функция НеобходимИсточникДанныхОРабочихМестахСотрудников(Знач ИмяПоля)
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("ЯвляетсяРаботникомСДосрочнойПенсией")
		Или ИмяПоля = ВРег("КлассУсловийТруда");
		
КонецФункции

Функция ПутьКДаннымСведенийОРабочихМестахСотрудников(Знач ИмяПоля)
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	
	ПутьКДанным = "";
	
	Если ИмяПоляВВерхнемРегистре = ВРег("РабочееМестоОхраныТрудаПериодРегистрации") Тогда
		ПутьКДанным = "	СведенияОРабочихМестахСотрудников.ПериодЗаписи";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РабочееМестоОхраныТрудаРегистратор") Тогда
		ПутьКДанным = "	СведенияОРабочихМестахСотрудников.Регистратор";
	ИначеЕсли ИмяПоляВВерхнемРегистре = ВРег("РабочееМестоОхраныТруда") Тогда
		ПутьКДанным = "	СведенияОРабочихМестахСотрудников.РабочееМесто";
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

Функция ЗапросВТСведенияОРабочихМестахСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов,
			ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень,
			ИмяВТСведенияОРабочихМестахСотрудников = "ВТСведенияОРабочихМестахСотрудников")

	ПоляОтбора = Неопределено;
	Если ПоляОтбораПериодическихДанных <> Неопределено Тогда
		ПоляОтбораПериодическихДанных.Свойство("РабочиеМестаСотрудников", ПоляОтбора);
	КонецЕсли;

	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		ОписательВременнойТаблицыОтборов.ИмяВременнойТаблицыОтборовСотрудников, "Сотрудник");

	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период",
		ОписательВременнойТаблицыОтборов.ИмяПоляПериод);
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Сотрудник",
		ОписательВременнойТаблицыОтборов.ИмяПоляСотрудник);

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.Отборы = ПоляОтбора;
	ПараметрыПостроения.ФормироватьСПериодичностьДень = ФормироватьСПериодичностьДень;

	ЗапросВТИмяРегистраСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез("РабочиеМестаСотрудников",
		ТолькоРазрешенные, ОписаниеФильтра, ПараметрыПостроения, Истина, ИмяВТСведенияОРабочихМестахСотрудников);
		
	Возврат ЗапросВТИмяРегистраСрез;

КонецФункции

Процедура ДобавитьСоединениеВТСведенияОРабочихМестахСотрудников(ЧастиЗапроса, ОписательВременнойТаблицыОтборов)
	
	ТекстЗапроса = ЧастиЗапроса.Получить(ЧастиЗапроса.ВГраница());
	
	Если СтрНайти(ТекстЗапроса, "ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОРабочихМестахСотрудников КАК") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиЗапроса.Добавить(
		"		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОРабочихМестахСотрудников КАК СведенияОРабочихМестахСотрудников
		|		ПО ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляСотрудник + " = СведенияОРабочихМестахСотрудников.Сотрудник
		|			И ТаблицаОтборов." + ОписательВременнойТаблицыОтборов.ИмяПоляПериод + " = СведенияОРабочихМестахСотрудников.Период");
	
КонецПроцедуры

#КонецОбласти

#Область СпециальнаяОценкаУсловийТруда

Процедура ОбновитьВредныеФакторыРабочихМестОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМеста = Неопределено;
	Если Источник.ДополнительныеСвойства.Свойство("ПрежниеРабочиеМеста") Тогда
		РабочиеМеста = Источник.ДополнительныеСвойства["ПрежниеРабочиеМеста"];
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ОбновитьВредныеФакторыРабочихМест(Источник.Ссылка, РабочиеМеста);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьВредныеФакторыРабочихМестОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМеста = Источник.РабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
	АналогичныеМеста = Источник.АналогичныеМеста.ВыгрузитьКолонку("АналогичноеМесто");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, АналогичныеМеста, Истина);

	Если Источник.ДополнительныеСвойства.Свойство("ПрежниеРабочиеМеста") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, Источник.ДополнительныеСвойства["ПрежниеРабочиеМеста"], Истина);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ОбновитьВредныеФакторыРабочихМест(, РабочиеМеста);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьАналогичныеРабочиеМестаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьАналогичныеРабочиеМеста(Источник.Ссылка);
	
КонецПроцедуры

Процедура ОбновитьАналогичныеРабочиеМестаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьАналогичныеРабочиеМеста();
	
КонецПроцедуры

Процедура ОбновитьАналогичныеРабочиеМеста(ИсточникСсылка = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Исключим документ при отмене проведения
	Запрос.УстановитьПараметр("Ссылка", ИсточникСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто,
	|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.Ссылка КАК Документ,
	|	НЕОПРЕДЕЛЕНО КАК ОсновноеРабочееМесто,
	|	ПодготовкаСпецоценкиУсловийТруда.Организация КАК Организация
	|ПОМЕСТИТЬ ВТВсеРабочиеМеста
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПодготовкаСпецоценкиУсловийТруда.РабочиеМеста КАК ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодготовкаСпецоценкиУсловийТруда КАК ПодготовкаСпецоценкиУсловийТруда
	|			ПО ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.Ссылка = ПодготовкаСпецоценкиУсловийТруда.Ссылка
	|		ПО РабочиеМестаОхраныТруда.Ссылка = ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто
	|ГДЕ
	|	ПодготовкаСпецоценкиУсловийТруда.Проведен
	|	И ПодготовкаСпецоценкиУсловийТруда.Ссылка <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеМестаОхраныТруда.Ссылка,
	|	ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка,
	|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто,
	|	ПодготовкаСпецоценкиУсловийТруда.Организация
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПодготовкаСпецоценкиУсловийТруда.АналогичныеМеста КАК ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодготовкаСпецоценкиУсловийТруда КАК ПодготовкаСпецоценкиУсловийТруда
	|			ПО ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка = ПодготовкаСпецоценкиУсловийТруда.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодготовкаСпецоценкиУсловийТруда.РабочиеМеста КАК ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
	|			ПО ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка = ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.Ссылка
	|			И ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.ИдентификаторСтрокиРабочегоМеста = ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста
	|		ПО РабочиеМестаОхраныТруда.Ссылка = ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто
	|ГДЕ
	|	ПодготовкаСпецоценкиУсловийТруда.Проведен
	|	И ПодготовкаСпецоценкиУсловийТруда.Ссылка <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеМестаОхраныТруда.Ссылка,
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	РезультатыСпецоценкиУсловийТруда.Организация
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
	|			ПО РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка = РезультатыСпецоценкиУсловийТруда.Ссылка
	|		ПО РабочиеМестаОхраныТруда.Ссылка = РезультатыСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто
	|ГДЕ
	|	РезультатыСпецоценкиУсловийТруда.Проведен
	|	И РезультатыСпецоценкиУсловийТруда.Ссылка <> &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеМестаОхраныТруда.Ссылка,
	|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка,
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто,
	|	РезультатыСпецоценкиУсловийТруда.Организация
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
	|			ПО РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка = РезультатыСпецоценкиУсловийТруда.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
	|			ПО РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка = РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка
	|			И РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.ИдентификаторСтрокиРабочегоМеста = РезультатыСпецоценкиУсловийТрудаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста
	|		ПО РабочиеМестаОхраныТруда.Ссылка = РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто
	|ГДЕ
	|	РезультатыСпецоценкиУсловийТруда.Проведен
	|	И РезультатыСпецоценкиУсловийТруда.Ссылка <> &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	МАКСИМУМ(ВсеРабочиеМеста.Документ) КАК Документ
	|ПОМЕСТИТЬ ВТМаксимальныеРабочиеМеста
	|ИЗ
	|	ВТВсеРабочиеМеста КАК ВсеРабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеРабочиеМеста.РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРабочиеМеста.РабочееМесто КАК АналогичноеРабочееМесто,
	|	ВсеРабочиеМеста.ОсновноеРабочееМесто КАК РабочееМесто,
	|	ВсеРабочиеМеста.Организация КАК Организация
	|ИЗ
	|	ВТМаксимальныеРабочиеМеста КАК МаксимальныеРабочиеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсеРабочиеМеста КАК ВсеРабочиеМеста
	|		ПО МаксимальныеРабочиеМеста.РабочееМесто = ВсеРабочиеМеста.РабочееМесто
	|			И МаксимальныеРабочиеМеста.Документ = ВсеРабочиеМеста.Документ
	|ГДЕ
	|	ВсеРабочиеМеста.ОсновноеРабочееМесто <> НЕОПРЕДЕЛЕНО";
	
	НаборЗаписей = РегистрыСведений.АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ОписаниеПрофиляСпециалистПоОхранеТруда()

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляСпециалистПоОхранеТруда();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Специалист по охране труда'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаОхранаТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	
	// Рабочие места
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРабочихМестСотрудников");
	
	// Спецоценка
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСпециальнойОценкиУсловийТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСпециальнойОценкиУсловийТруда");
	
	// Несчастные случаи
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеНесчастныхСлучаев");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНесчастныхСлучаев");
	
	// Инструктажи
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеИнструктажейПоОхранеТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеИнструктажейПоОхранеТруда");
	
	// Медицинские осмотры.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЗаключенийМедицинскогоОсмотра");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеНаправленийНаМедицинскийОсмотр");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеМедицинскиеОсмотры");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВредныхФакторовВидовРаботРабочихМест");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРезультатовМедицинскихОсмотров");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеМедицинскихОрганизаций");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРешенийПоКадровымИзменениям");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКадровыхДокументовПоРешениям");
	
	// Текущие дела.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеОбработкиТекущиеДела");
	
	// Штатное расписание
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеШтатногоРасписания"); // Справочник
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИзменениеШтатногоРасписанияПоОхранеТруда"); // Изменение в части охраны труда
	
	// Физические лица
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадры"); // Справочник
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная"); // Форма стажа
	
	// Сотрудники
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудников"); // Справочник
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеАрхиваФизическихЛиц", "ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц"); // Справочник
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеИспытательногоСрокаСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.ИспытательныйСрокСотрудников"); // Справочник
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудниковРасширенная"); // Данные для подбора
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСостоянийСотрудников"); // Сведения о состояниях сотрудника
	
	// Кадровая история
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКадровогоСостоянияРасширенная"); // Регистр сведений КадроваяИсторияСотрудников
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБольничныхЛистов"); // заполнение БЛ в документе
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеМедицинскихОрганизаций"); // заполнение БЛ в документе
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЭЛН"); // заполнение БЛ в документе
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраНачисленияУдержанияПоказатели"); // Формирование отчетов
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхОбОбразованииФизическихЛиц"); // Формирование отчетов
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПродолжительностиДоговоров");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеОбученияРазвития"); // Получение стажировки
	
	// Кандидаты
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЛичныхДанныхКандидатов");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияОрганизаций");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц");
	
	// КонфигурацииЗарплатаКадрыРасширенный
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		Модуль.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	// Конец КонфигурацииЗарплатаКадрыРасширенный
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		МодульПоискФизическихЛиц.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ИдентификаторПрофиляСпециалистПоОхранеТруда()
	
	Возврат "b8a947b9-83fb-4cb5-8df1-b89d1314c563";
	
КонецФункции

Функция ОписаниеПрофиляСтаршийСпециалистПоОхранеТруда()

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляСтаршийСпециалистПоОхранеТруда();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Старший специалист по охране труда'");
	
	ЗарплатаКадрыРасширенный.ДополнитьПрофиль(ОписаниеПрофиля, ОписаниеПрофиляСпециалистПоОхранеТруда());
	
	// Медицинские осмотры.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "НастройкаКлассификаторовВредныхФакторовВидовРабот");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВредныхФакторовВидовРаботРабочихМест");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеМедицинскихОрганизаций");
	
	// Рабочие места
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеРабочихМестСотрудников");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ИдентификаторПрофиляСтаршийСпециалистПоОхранеТруда() 
	
	Возврат "6be5d0fd-de2a-4adc-bc3b-8ab3a7f9ef9d";
	
КонецФункции

Процедура ИзменитьНаименованияРабочихМест(РабочиеМеста, ТаблицаАналогичныхМест)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТАналогичныеРабочиеМеста.АналогичноеРабочееМесто КАК АналогичноеРабочееМесто,
		|	ВТАналогичныеРабочиеМеста.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТАналогичныеРабочиеМеста
		|ИЗ
		|	&АналогичныеРабочиеМеста КАК ВТАналогичныеРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеМестаОхраныТруда.Ссылка КАК Ссылка,
		|	РабочиеМестаОхраныТруда.Наименование КАК Наименование,
		|	РабочиеМестаОхраныТруда.Подразделение КАК Подразделение,
		|	РабочиеМестаОхраныТруда.Должность КАК Должность,
		|	РабочиеМестаОхраныТруда.Номер КАК Номер
		|ПОМЕСТИТЬ ВТРабочиеМеста
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|ГДЕ
		|	РабочиеМестаОхраныТруда.Ссылка В(&РабочиеМеста)
		|	И НЕ РабочиеМестаОхраныТруда.НомерВручную
		|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРабочиеМеста.Ссылка КАК Ссылка,
		|	ВТРабочиеМеста.Наименование КАК Наименование,
		|	ВТРабочиеМеста.Подразделение КАК Подразделение,
		|	ВТРабочиеМеста.Должность КАК Должность,
		|	ВТРабочиеМеста.Номер КАК Номер,
		|	ЕСТЬNULL(ВТАналогичныеРабочиеМеста.РабочееМесто.Номер, """") КАК НомерОсновногоРабочегоМеста
		|ИЗ
		|	ВТРабочиеМеста КАК ВТРабочиеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАналогичныеРабочиеМеста КАК ВТАналогичныеРабочиеМеста
		|		ПО ВТРабочиеМеста.Ссылка = ВТАналогичныеРабочиеМеста.АналогичноеРабочееМесто";
	
	Запрос.УстановитьПараметр("АналогичныеРабочиеМеста", ТаблицаАналогичныхМест);
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ДанныеНаименования = РезультатЗапроса.Выбрать();
	
	Пока ДанныеНаименования.Следующий() Цикл
		НовоеНаименование = НаименованиеРабочегоМеста(
			ДанныеНаименования.Подразделение,
			ДанныеНаименования.Должность,
			ДанныеНаименования.Номер,
			ДанныеНаименования.НомерОсновногоРабочегоМеста);
	
		Если ДанныеНаименования.Наименование = НовоеНаименование Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ДанныеНаименования.Ссылка);
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось изменить наименование рабочего места ""%1"":
				|%2'"),
				ДанныеНаименования.Наименование,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецПопытки;
		
		РабочееМестоОбъект = ДанныеНаименования.Ссылка.ПолучитьОбъект();
		РабочееМестоОбъект.Наименование = НовоеНаименование;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РабочееМестоОбъект);
		РазблокироватьДанныеДляРедактирования(ДанныеНаименования.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Функция КлассификацияУсловийТруда()
	Возврат ОхранаТрудаПовтИсп.КлассификацияУсловийТруда();
КонецФункции

#КонецОбласти

#Область ЗаполнениеРеглотчетности

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета.
//
Процедура ОписаниеПоказателей_ЕФС1ОСС_2023Кв1(ПоказателиОтчета)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000103", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000104", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000105", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000106", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000107", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000108", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000109", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000110", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000230000111", Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗначенияПоказателей_ЕФС1ОСС_2023Кв1(ПараметрыОтчета, Контейнер)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") И Контейнер.Свойство("Раздел23") Тогда
		
		Организация = ПараметрыОтчета.Организация;
		НачалоПериода = НачалоГода(ПараметрыОтчета.ДатаКонцаПериодаОтчета);
		
		ОписаниеТаблиц = Новый Структура("Раздел23");
		РасчетПоказателей_ЕФС1ОСС_2023Кв1(НачалоПериода, ПараметрыОтчета.ДатаКонцаПериодаОтчета, Организация, ОписаниеТаблиц);
		
		Результат = ОписаниеТаблиц.Раздел23;
		Если Результат.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Контейнер.Раздел23.Строки[0].Данные, Результат[0]);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета.
//
Процедура ОписаниеПоказателей_4ФСС_2022Кв2(ПоказателиОтчета)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве") Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000030001003", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000030002003", Истина, Ложь);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000103", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000104", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000105", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000106", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000107", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000108", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000109", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000110", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040000111", Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗначенияПоказателей_4ФСС_2022Кв2(ПараметрыОтчета, Контейнер)
	
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	ОписаниеТаблиц = Новый Структура("Таблица3,Таблица4");
	РасчетПоказателей_4ФСС_2022Кв2(НачалоПериода, ПараметрыОтчета.ДатаКонцаПериодаОтчета, Организация, ОписаниеТаблиц);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве") И Контейнер.Свойство("Таблица3") Тогда
		Результат = ОписаниеТаблиц.Таблица3;
		Если Результат.Количество() > 0 Тогда
			СтрокаДанных = Результат[0];
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица3, СтрокаДанных);
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") И Контейнер.Свойство("Таблица4") Тогда
		Результат = ОписаниеТаблиц.Таблица4;
		Если Результат.Количество() > 0 Тогда
			СтрокаДанных = Результат[0];
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица4, СтрокаДанных);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета.
//
Процедура ОписаниеПоказателей_4ФСС_2017Кв1(ПоказателиОтчета)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве") Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040001003", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000040002003", Истина, Ложь);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000050000103", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000050000104", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000050000105", Истина, Ложь);
		ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000050000106", Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗначенияПоказателей_4ФСС_2017Кв1(ПараметрыОтчета, Контейнер)
	
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	ОписаниеТаблиц = Новый Структура("Таблица5,Таблица3_4");
	РасчетПоказателей_4ФСС_2017Кв1(НачалоПериода, ПараметрыОтчета.ДатаКонцаПериодаОтчета, Организация, ОписаниеТаблиц);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") И Контейнер.Свойство("Таблица5") Тогда
		Результат = ОписаниеТаблиц.Таблица5;
		Если Результат.Количество() > 0 Тогда
			СтрокаДанных = Результат[0];
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица5, СтрокаДанных);
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве") И Контейнер.Свойство("Таблица3_4") Тогда
		Результат = ОписаниеТаблиц.Таблица3_4;
		Если Результат.Количество() > 0 Тогда
			СтрокаДанных = Результат[0];
			ЗаполнитьЗначенияСвойств(Контейнер.Таблица3_4, СтрокаДанных);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета.
//
Процедура ОписаниеПоказателей_4ФСС_2014Кв1(ПоказателиОтчета)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000100000103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000100000104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000100000105", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П000100000106", Истина, Истина);
	
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗначенияПоказателей_4ФСС_2014Кв1(ПараметрыОтчета, Контейнер)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
	ОписаниеТаблиц = Новый Структура("Раздел2_10");
	РасчетПоказателей_4ФСС_2012Кв1(НачалоПериода, Организация, ОписаниеТаблиц);
	
	Если Контейнер.Свойство("Раздел2_10") Тогда
		Результат = ОписаниеТаблиц.Раздел2_10;
		Если Результат.Количество() > 0 Тогда
			СтрокаДанных = Результат[0];
			ЗаполнитьЗначенияСвойств(Контейнер.Раздел2_10, СтрокаДанных);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета.
//
Процедура ОписаниеПоказателей_1Туст_2014Кв1(ПоказателиОтчета)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П010103", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П010104", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П010105", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П010203", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П010204", Истина, Истина);
	ЗарплатаКадры.ДобавитьПоказательРегламентированнойОтчетности(ПоказателиОтчета, "П010205", Истина, Истина);
	
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗначенияПоказателей_1Туст_2014Кв1(ПараметрыОтчета, Контейнер)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ПараметрыОтчета.ДатаКонцаПериодаОтчета);
	
КонецПроцедуры

Процедура РасчетПоказателей_ЕФС1ОСС_2023Кв1(НачалоПериода, КонецПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") И ОписаниеТаблиц.Свойство("Раздел23") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто) КАК П000230000104,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000230000105,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000230000106,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000230000107,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000230000108,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000230000109,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000230000110,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000230000111
		|ПОМЕСТИТЬ ВТРезультаты
		|ИЗ
		|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	НЕ РабочиеМестаОхраныТруда.ВАрхиве
		|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РабочиеМестаОхраныТруда.Ссылка) КАК П000230000103,
		|	Результаты.П000230000104 КАК П000230000104,
		|	Результаты.П000230000105 КАК П000230000105,
		|	Результаты.П000230000106 КАК П000230000106,
		|	Результаты.П000230000107 КАК П000230000107,
		|	Результаты.П000230000108 КАК П000230000108,
		|	Результаты.П000230000109 КАК П000230000109,
		|	Результаты.П000230000110 КАК П000230000110,
		|	Результаты.П000230000111 КАК П000230000111
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультаты КАК Результаты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	РабочиеМестаОхраныТруда.Владелец = &Организация
		|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
		|	И НЕ РабочиеМестаОхраныТруда.ВАрхиве
		|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Результаты.П000230000104,
		|	Результаты.П000230000105,
		|	Результаты.П000230000106,
		|	Результаты.П000230000107,
		|	Результаты.П000230000108,
		|	Результаты.П000230000109,
		|	Результаты.П000230000110,
		|	Результаты.П000230000111";
		
		ОписаниеТаблиц.Раздел23 = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетПоказателей_4ФСС_2022Кв2(НачалоПериода, КонецПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") И ОписаниеТаблиц.Свойство("Таблица4") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто) КАК П000040000104,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000040000105,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000040000106,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000040000107,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000040000108,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000040000109,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000040000110,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000040000111
		|ПОМЕСТИТЬ ВТРезультаты
		|ИЗ
		|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	НЕ РабочиеМестаОхраныТруда.ВАрхиве
		|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РабочиеМестаОхраныТруда.Ссылка) КАК П000040000103,
		|	Результаты.П000040000104 КАК П000040000104,
		|	Результаты.П000040000105 КАК П000040000105,
		|	Результаты.П000040000106 КАК П000040000106,
		|	Результаты.П000040000107 КАК П000040000107,
		|	Результаты.П000040000108 КАК П000040000108,
		|	Результаты.П000040000109 КАК П000040000109,
		|	Результаты.П000040000110 КАК П000040000110,
		|	Результаты.П000040000111 КАК П000040000111
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультаты КАК Результаты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	РабочиеМестаОхраныТруда.Владелец = &Организация
		|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
		|	И НЕ РабочиеМестаОхраныТруда.ВАрхиве
		|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Результаты.П000040000104,
		|	Результаты.П000040000105,
		|	Результаты.П000040000106,
		|	Результаты.П000040000107,
		|	Результаты.П000040000108,
		|	Результаты.П000040000109,
		|	Результаты.П000040000110,
		|	Результаты.П000040000111";
		
		ОписаниеТаблиц.Таблица4 = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве") И ОписаниеТаблиц.Свойство("Таблица3") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший) КАК П000030001003,
		|	ВЫБОР
		|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.СоСмертельнымИсходом)
		|			ТОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший)
		|	КОНЕЦ КАК П000030002003
		|ИЗ
		|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
		|		ПО (НесчастныйСлучайНаПроизводстве.Ссылка = НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка)
		|ГДЕ
		|	НесчастныйСлучайНаПроизводстве.ДатаПроисшествия МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НесчастныйСлучайНаПроизводстве.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы";
		
		ОписаниеТаблиц.Таблица3 = Запрос.Выполнить().Выгрузить();	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетПоказателей_4ФСС_2017Кв1(НачалоПериода, КонецПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") И ОписаниеТаблиц.Свойство("Таблица5") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто) КАК П000050000104,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
		|					ИЛИ РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
		|					ИЛИ РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
		|					ИЛИ РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000050000105,
		|	КОЛИЧЕСТВО(ВЫБОР
		|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
		|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
		|		КОНЕЦ) КАК П000050000106
		|ПОМЕСТИТЬ ВТРезультаты
		|ИЗ
		|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ПО РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
		|ГДЕ
		|	НЕ РабочиеМестаОхраныТруда.ВАрхиве
		|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РабочиеМестаОхраныТруда.Ссылка) КАК П000050000103,
		|	Результаты.П000050000104 КАК П000050000104,
		|	Результаты.П000050000105 КАК П000050000105,
		|	Результаты.П000050000106 КАК П000050000106
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультаты КАК Результаты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	РабочиеМестаОхраныТруда.Владелец = &Организация
		|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
		|	И НЕ РабочиеМестаОхраныТруда.ВАрхиве
		|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	Результаты.П000050000104,
		|	Результаты.П000050000105,
		|	Результаты.П000050000106";
		
		ОписаниеТаблиц.Таблица5 = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве") И ОписаниеТаблиц.Свойство("Таблица3_4") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший) КАК П000040001003,
		|	ВЫБОР
		|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.СоСмертельнымИсходом)
		|			ТОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший)
		|	КОНЕЦ КАК П000040002003
		|ИЗ
		|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
		|		ПО (НесчастныйСлучайНаПроизводстве.Ссылка = НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка)
		|ГДЕ
		|	НесчастныйСлучайНаПроизводстве.ДатаПроисшествия МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НесчастныйСлучайНаПроизводстве.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы";
		
		ОписаниеТаблиц.Таблица3_4 = Запрос.Выполнить().Выгрузить();	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетПоказателей_4ФСС_2012Кв1(НачалоПериода, Организация, ОписаниеТаблиц, ПодробныеДанные = Ложь)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто) КАК П000100000104,
	|	КОЛИЧЕСТВО(ВЫБОР
	|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ИЛИ РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ИЛИ РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ИЛИ РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
	|		КОНЕЦ) КАК П000100000105,
	|	КОЛИЧЕСТВО(ВЫБОР
	|			КОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто
	|		КОНЕЦ) КАК П000100000106
	|ПОМЕСТИТЬ ВТРезультаты
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ПО РезультатыСпециальнойОценкиУсловийТрудаСрезПоследних.РабочееМесто = РабочиеМестаОхраныТруда.Ссылка
	|ГДЕ
	|	НЕ РабочиеМестаОхраныТруда.ВАрхиве
	|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РабочиеМестаОхраныТруда.Ссылка) КАК П000100000103,
	|	Результаты.П000100000104 КАК П000100000104,
	|	Результаты.П000100000105 КАК П000100000105,
	|	Результаты.П000100000106 КАК П000100000106
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультаты КАК Результаты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	РабочиеМестаОхраныТруда.Владелец = &Организация
	|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
	|	И НЕ РабочиеМестаОхраныТруда.ВАрхиве
	|	И НЕ РабочиеМестаОхраныТруда.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Результаты.П000100000104,
	|	Результаты.П000100000105,
	|	Результаты.П000100000106";
	
	ОписаниеТаблиц.Раздел2_10 = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

#КонецОбласти

#Область УсловноВызываемыеПроцедурыИзПодписейДокументовИСведенийОбОтветственныхЛицах

// Описание полей ответственного за охрану труда в документах и сведениях об ответственных лицах.
//
Функция ОписаниеРеквизитовРолиОтветственныйЗаОхрануТруда()
	ОписаниеРеквизитов = ПодписиДокументов.ОписаниеРеквизитовПодписанта();
	
	ОписаниеРеквизитов.ФизическоеЛицо = "ОтветственныйЗаОхрануТруда";
	ОписаниеРеквизитов.Должность = "ДолжностьОтветственногоЗаОхрануТруда";
	ОписаниеРеквизитов.ОснованиеПодписи = "ОснованиеПодписиОтветственногоЗаОхрануТруда";
	
	Возврат ОписаниеРеквизитов;
КонецФункции

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ЗначенияСохраняемыхРеквизитовФормыНачальнаяНастройкаПрограммы(Форма, СохраняемыеРеквизиты) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РаботаВКОРП Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыеРеквизиты.Вставить("ИспользоватьИнструктажиПоОхранеТруда", Форма.ИспользоватьИнструктажиПоОхранеТруда);
	СохраняемыеРеквизиты.Вставить("НастройкиСпециальнойОценкиУсловийТруда", ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
			Форма.НастройкиСпециальнойОценкиУсловийТруда, Метаданные.РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда));
	СохраняемыеРеквизиты.Вставить("НастройкиНесчастныхСлучаевНаПроизводстве", ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
			Форма.НастройкиНесчастныхСлучаевНаПроизводстве, Метаданные.РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве));
	
КонецПроцедуры

Процедура СохраненныеНастройкиВРеквизитыФормыНачальнаяНастройкаПрограммы(Форма, СохраненныеНастройки) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеНастройки.Свойство("ИспользоватьИнструктажиПоОхранеТруда") Тогда
		Форма["ИспользоватьИнструктажиПоОхранеТруда"] = СохраненныеНастройки["ИспользоватьИнструктажиПоОхранеТруда"];
	КонецЕсли;
	Если СохраненныеНастройки.Свойство("НастройкиСпециальнойОценкиУсловийТруда") Тогда
		ЗаполнитьЗначенияСвойств(Форма["НастройкиСпециальнойОценкиУсловийТруда"], СохраненныеНастройки["НастройкиСпециальнойОценкиУсловийТруда"]);
	КонецЕсли;
	Если СохраненныеНастройки.Свойство("НастройкиНесчастныхСлучаевНаПроизводстве") Тогда
		ЗаполнитьЗначенияСвойств(Форма["НастройкиНесчастныхСлучаевНаПроизводстве"], СохраненныеНастройки["НастройкиНесчастныхСлучаевНаПроизводстве"]);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИспользоватьИнструктажиПоОхранеТруда = Константы.ИспользоватьИнструктажиПоОхранеТруда.Получить();
	
	Настройки = РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда);
	ЗаполнитьЗначенияСвойств(Форма.НастройкиСпециальнойОценкиУсловийТруда, НастройкиСтруктура);
	
	Настройки = РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве);
	ЗаполнитьЗначенияСвойств(Форма.НастройкиНесчастныхСлучаевНаПроизводстве, НастройкиСтруктура);
	
КонецПроцедуры

Процедура ПолучитьНастройкиПрограммы(НастройкиПрограммы) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПрограммы.Вставить("ИспользоватьИнструктажиПоОхранеТруда", Константы.ИспользоватьИнструктажиПоОхранеТруда.Получить());
	
	Настройки = РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда);
	НастройкиПрограммы.Вставить("НастройкиСпециальнойОценкиУсловийТруда", НастройкиСтруктура);
	
	Настройки = РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве);
	НастройкиПрограммы.Вставить("НастройкиНесчастныхСлучаевНаПроизводстве", НастройкиСтруктура);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ИспользоватьИнструктажиПоОхранеТруда.Установить(Параметры.ИспользоватьИнструктажиПоОхранеТруда);
	
	Настройки = РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиСпециальнойОценкиУсловийТруда);
	Настройки.Записать();
	
	Настройки = РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиНесчастныхСлучаевНаПроизводстве);
	Настройки.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ВидыИнструктажейПоОхранеТруда.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ВидыПроисшествий) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.24.10";
		Обработчик.Процедура = "Справочники.ВидыПроисшествий.НачальноеЗаполнение";
		Обработчик.НачальноеЗаполнение = Истина;
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ПричиныПроисшествий) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.24.10";
		Обработчик.Процедура = "Справочники.ПричиныПроисшествий.НачальноеЗаполнение";
		Обработчик.НачальноеЗаполнение = Истина;
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.32";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f3de0d1f-5676-462f-9fb1-d8285f45530c");
	Обработчик.Процедура = "ОхранаТруда.ЗаполнитьОснованиеКлассовУсловийТрудаПоДолжностям";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение оснований изменений классов условий труда по документам охраны труда.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.47";
	Обработчик.Процедура = "ОхранаТруда.СоздатьРабочиеМестаНаОснованииПозицийШтатногоРасписания";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa69-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Создание рабочих мест на основании позиций штатного расписания'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.48";
	Обработчик.Процедура = "ОхранаТруда.ЗаполнитьРабочиеМестаВОбъектахПодсистемыСпецоценка";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa6a-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение объектов подсистемы «Спецоценка» рабочими местами'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.48";
	Обработчик.Процедура = "ОхранаТруда.УстановитьИспользованиеОсобыхУсловийТруда";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa6b-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Установка использования особых условий труда'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.49";
	Обработчик.Процедура = "ОхранаТруда.ЗаполнитьРабочиеМестаСотрудников";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa6c-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение рабочих мест сотрудников'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.49";
	Обработчик.Процедура = "ОхранаТруда.УстановитьИспользованиеКонтроляУникальностиНомеровРабочихМест";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa6d-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Установка использования контроля уникальности номеров рабочих мест'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.121";
	Обработчик.Процедура = "ОхранаТруда.ОбновитьДанныеДляПодбораСотрудников";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a4bd9c83-7755-11eb-82a8-aa7cbd1e9766");
	Обработчик.Комментарий = НСтр("ru = 'Обновление данных для подбора сотрудников'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.132";
	Обработчик.Процедура = "ОхранаТруда.ЗаполнитьРезультатыСпецоценкиНовымиВреднымиФакторами";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d93a7388-7cce-11eb-82af-f09a943f852e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение результатов спецоценки вредными факторами по приказу 29н.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.10";
	Обработчик.Процедура = "ОхранаТруда.ЗаполнитьТабличнуюЧастьМедосмотры";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("53e66c06-1e15-11ed-84cb-a601470809b6");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение несчастных случаев медосмотрами.'");
	
КонецПроцедуры

Процедура УстановитьИспользованиеОсобыхУсловийТруда(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Если ОхранаТрудаИспользуется() Тогда
		ЗаписатьИспользованиеОсобыхУсловийТруда(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	НаборНастроек = РегистрыСведений.НастройкиЗарплатаКадрыРасширенная.СоздатьНаборЗаписей();
	НаборНастроек.Прочитать();
	Для Каждого Настройка Из НаборНастроек Цикл
		Если Настройка.ИспользоватьОсобыеУсловияТруда Тогда
			ЗаписатьИспользованиеОсобыхУсловийТруда(ПараметрыОбновления);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
			
КонецПроцедуры

Процедура ЗаполнитьОснованиеКлассовУсловийТрудаПоДолжностям(ПараметрыОбновления = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассыУсловийТрудаПоДолжностям.Период КАК Период,
		|	КлассыУсловийТрудаПоДолжностям.Должность КАК Должность,
		|	КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда КАК КлассУсловийТруда,
		|	КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений КАК ДатаРегистрацииИзменений,
		|	РезультатыСпецоценкиУсловийТруда.Ссылка КАК Основание
		|ИЗ
		|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТруда
		|		ПО КлассыУсловийТрудаПоДолжностям.Должность = РезультатыСпецоценкиУсловийТруда.УдалитьРабочееМесто
		|			И КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда = РезультатыСпецоценкиУсловийТруда.КлассУсловийТруда
		|			И КлассыУсловийТрудаПоДолжностям.Период = РезультатыСпецоценкиУсловийТруда.Ссылка.ДатаРезультатов
		|ГДЕ
		|	КлассыУсловийТрудаПоДолжностям.Основание = НЕОПРЕДЕЛЕНО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КлассыУсловийТрудаПоДолжностям.Период,
		|	КлассыУсловийТрудаПоДолжностям.Должность,
		|	КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда,
		|	КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений,
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка
		|ИЗ
		|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|		ПО КлассыУсловийТрудаПоДолжностям.Должность = РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьАналогичноеМесто
		|			И КлассыУсловийТрудаПоДолжностям.Период = РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка.ДатаРезультатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|		ПО (РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьРабочееМесто = РезультатыСпецоценкиУсловийТрудаРабочиеМеста.УдалитьРабочееМесто)
		|			И КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда = РезультатыСпецоценкиУсловийТрудаРабочиеМеста.КлассУсловийТруда
		|			И (РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка = РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка)
		|ГДЕ
		|	КлассыУсловийТрудаПоДолжностям.Основание = НЕОПРЕДЕЛЕНО";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КлассыУсловийТрудаПоДолжностям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Должность.Установить(Выборка.Должность);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
	
КонецПроцедуры

Процедура СоздатьРабочиеМестаНаОснованииПозицийШтатногоРасписания(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПозицииТребующиеОбработки();
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	СоответствиеПозицийПоВредности = ОдинаковыеНаборыВзносовВредностиПФРПоПозициям(ОбновляемыеДанные);
	
	Для Каждого КлючИЗначение Из СоответствиеПозицийПоВредности Цикл
		УсловияТруда = УсловияТрудаПоНаборуВзносовВредностиПФР(КлючИЗначение.Значение);
		Для Каждого Позиция Из КлючИЗначение.Ключ Цикл
			ОбъектРабочееМесто = Справочники.РабочиеМестаОхраныТруда.СоздатьЭлемент();
			ОбъектРабочееМесто.Заполнить(Позиция);
			ОбъектРабочееМесто.УдалитьДолжностьПоШтатномуРасписанию = Позиция;//для определения уникальной связи при обновлении
			ОбъектРабочееМесто.УсловияТруда = УсловияТруда;
			ОбъектРабочееМесто.СоответствуетУсловиямТруда = Истина;
			ОбъектРабочееМесто.ВредныеФакторыСопоставлены = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Позиция, "ВредныеФакторыСопоставлены");
			
			ОтборНомера = Новый Структура("РабочееМесто", Позиция);
			ОбъектРабочееМесто.Номер =
				РегистрыСведений.УдалитьНомераРабочихМестСпециальнойОценкиУсловийТруда.Получить(ОтборНомера).Номер;
			ОбъектРабочееМесто.ПорядковыйНомер = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОбъектРабочееМесто.Номер);
			
			Если ОбъектРабочееМесто.ПорядковыйНомер = 0 Тогда
				ОбъектРабочееМесто.НомерВручную = Истина;
				ОбъектРабочееМесто.ПорядковыйНомер = 1 + Справочники.РабочиеМестаОхраныТруда.МаксимальныйНомерРабочегоМеста(
					ОбъектРабочееМесто.Владелец,
					ОбъектРабочееМесто.Подразделение);
			КонецЕсли;
			
			Если ПустаяСтрока(ОбъектРабочееМесто.Номер) Тогда
				ОбъектРабочееМесто.НомерВручную = Ложь;
				ОбъектРабочееМесто.Номер = Строка(ОбъектРабочееМесто.ПорядковыйНомер);
			КонецЕсли;
			
			ОбъектРабочееМесто.Наименование = НаименованиеРабочегоМеста(
				ОбъектРабочееМесто.Подразделение,
				ОбъектРабочееМесто.Должность, 
				ОбъектРабочееМесто.Номер);
			ОбъектРабочееМесто.СоздатьГруппуРабочегоМеста();
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектРабочееМесто);
		КонецЦикла;
	КонецЦикла;
	
	// Обновляется структура рабочих мест
	Справочники.РабочиеМестаОхраныТруда.ОбновитьСтруктуруРабочихМест();
	
КонецПроцедуры

Функция ТекстЗапросаПозицииТребующиеОбработки()
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Возврат "ВЫБРАТЬ
	|	ПериодичностьПозиций.Позиция КАК Позиция
	|ПОМЕСТИТЬ ВТПозиции
	|ИЗ
	|	РегистрСведений.УдалитьПериодичностьМедицинскихОсмотровПозицииШтатногоРасписания КАК ПериодичностьПозиций
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	МедицинскиеОсмотры.Позиция
	|ИЗ
	|	РегистрСведений.УдалитьМедицинскиеОсмотры КАК МедицинскиеОсмотры
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПериодическиеМедицинскиеОсмотры.Позиция
	|ИЗ
	|	РегистрСведений.УдалитьПериодическиеМедицинскиеОсмотры КАК ПериодическиеМедицинскиеОсмотры
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВыданныеНаправленияНаМедицинскийОсмотр.Позиция
	|ИЗ
	|	РегистрСведений.УдалитьВыданныеНаправленияНаМедицинскийОсмотр КАК ВыданныеНаправленияНаМедицинскийОсмотр
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВидыРаботМедицинскихОсмотровПозицииШтатногоРасписания.Позиция
	|ИЗ
	|	РегистрСведений.УдалитьВидыРаботМедицинскихОсмотровПозицииШтатногоРасписания КАК
	|		ВидыРаботМедицинскихОсмотровПозицииШтатногоРасписания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВредныеФакторыПозицииШтатногоРасписания.Позиция
	|ИЗ
	|	РегистрСведений.УдалитьВредныеФакторыПозицииШтатногоРасписания КАК ВредныеФакторыПозицииШтатногоРасписания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВредныеФакторыИВидыРаботПозицииШтатногоРасписания.РабочееМесто
	|ИЗ
	|	РегистрСведений.УдалитьВредныеФакторыИВидыРаботПозицииШтатногоРасписания КАК ВредныеФакторыИВидыРаботПозицииШтатногоРасписания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НаправлениеНаМедицинскийОсмотр.УдалитьПозиция
	|ИЗ
	|	Документ.НаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаключениеМедицинскогоОсмотра.УдалитьПозиция
	|ИЗ
	|	Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НомераРабочихМестСпециальнойОценкиУсловийТруда.РабочееМесто
	|ИЗ
	|	РегистрСведений.УдалитьНомераРабочихМестСпециальнойОценкиУсловийТруда КАК НомераРабочихМестСпециальнойОценкиУсловийТруда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПлановыеДатыСпециальнойОценкиУсловийТруда.РабочееМесто
	|ИЗ
	|	РегистрСведений.УдалитьПлановыеДатыСпециальнойОценкиУсловийТруда КАК ПлановыеДатыСпециальнойОценкиУсловийТруда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто
	|ИЗ
	|	РегистрСведений.УдалитьРезультатыСпециальнойОценкиУсловийТруда КАК РезультатыСпециальнойОценкиУсловийТруда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КлассыУсловийТрудаПоДолжностям.Должность
	|ИЗ
	|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
	|ГДЕ
	|	КлассыУсловийТрудаПоДолжностям.Должность ССЫЛКА Справочник.ШтатноеРасписание
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто
	|ИЗ
	|	РегистрСведений.УдалитьАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК
	|		АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.АналогичноеРабочееМесто
	|ИЗ
	|	РегистрСведений.УдалитьАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК
	|		АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
	|ИЗ
	|	Документ.ПодготовкаСпецоценкиУсловийТруда.РабочиеМеста КАК ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьАналогичноеМесто
	|ИЗ
	|	Документ.ПодготовкаСпецоценкиУсловийТруда.АналогичныеМеста КАК ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
	|ИЗ
	|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьАналогичноеМесто
	|ИЗ
	|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДекларацияСоответствияУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
	|ИЗ
	|	Документ.ДекларацияСоответствияУсловийТруда.РабочиеМеста КАК ДекларацияСоответствияУсловийТрудаРабочиеМеста
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеПострадавшие.УдалитьДолжностьПоШтатномуРасписанию
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	НЕ ШтатноеРасписание.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	НЕ ШтатноеРасписание.ОснованиеДосрочногоНазначенияПенсии = ЗНАЧЕНИЕ(Справочник.ОснованияДосрочногоНазначенияПенсии.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	НЕ ШтатноеРасписание.ОсобыеУсловияТрудаПФР = ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТрудаПФР.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	НЕ ШтатноеРасписание.КодПозицииСпискаПФР = ЗНАЧЕНИЕ(Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	ШтатноеРасписание.ВыплачиваетсяНадбавкаЗаВредность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеМестаОхраныТруда.УдалитьДолжностьПоШтатномуРасписанию КАК Позиция
	|ПОМЕСТИТЬ ВТОбработанныеПозицииВРабочихМестах
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|ГДЕ
	|	НЕ РабочиеМестаОхраныТруда.УдалитьДолжностьПоШтатномуРасписанию = ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Позиции.Позиция КАК Позиция
	|ПОМЕСТИТЬ ВТПодходящиеПозиции
	|ИЗ
	|	ВТПозиции КАК Позиции
	|ГДЕ
	|	НЕ Позиции.Позиция В
	|		(ВЫБРАТЬ
	|			ОбработанныеПозиции.Позиция
	|		ИЗ
	|			ВТОбработанныеПозицииВРабочихМестах КАК ОбработанныеПозиции)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка КАК Позиция
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодходящиеПозиции КАК ПодходящиеПозиции
	|		ПО ШтатноеРасписание.Ссылка = ПодходящиеПозиции.Позиция
	|		И НЕ ШтатноеРасписание.ГруппаПозицийПодразделения";
	
	// АПК:96 -вкл
	
КонецФункции

Функция ОдинаковыеНаборыВзносовВредностиПФРПоПозициям(ОбновляемыеДанные)
	
	НаборыВзносовВредностиПФРПоПозициям = Новый Соответствие();
	
	ВыборкаПозиция = ОбновляемыеДанные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйПроход = Истина;
	
	Пока ВыборкаПозиция.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаПозиция.Позиция) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияВзносовВредностиПФРПозиции = ЗначенияВзносовВредностиПФР(ВыборкаПозиция.Позиция,, Истина);
		
		Если ПервыйПроход Тогда
			НаборыВзносовВредностиПФРПоПозициям.Вставить(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПозиция.Позиция), ЗначенияВзносовВредностиПФРПозиции);
			ПервыйПроход = Ложь;
			Продолжить;
		КонецЕсли;
		
		СоответствиеНайдено = Ложь;
		
		Для Каждого КлючИЗначение Из НаборыВзносовВредностиПФРПоПозициям Цикл
			Если ОбщегоНазначения.ДанныеСовпадают(КлючИЗначение.Значение, ЗначенияВзносовВредностиПФРПозиции) Тогда
				КлючИЗначение.Ключ.Добавить(ВыборкаПозиция.Позиция);
				СоответствиеНайдено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СоответствиеНайдено Тогда
			Продолжить;
		КонецЕсли;
		
		НаборыВзносовВредностиПФРПоПозициям.Вставить(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыборкаПозиция.Позиция), ЗначенияВзносовВредностиПФРПозиции);
		
	КонецЦикла;
	
	Возврат НаборыВзносовВредностиПФРПоПозициям;
	
КонецФункции

Функция УсловияТрудаПоНаборуВзносовВредностиПФР(НаборДанных)
	
	НовоеНаименованиеУсловийТруда = ЗаголовокНаОснованииНабораДанных(НаборДанных);
	
	Если ПустаяСтрока(НовоеНаименованиеУсловийТруда) Тогда
		Возврат Справочники.УсловияТруда.НормальныеУсловия;
	КонецЕсли;
	
	НайденныеУсловияТруда = Справочники.УсловияТруда.НайтиПоНаименованию(НовоеНаименованиеУсловийТруда, Истина);
	
	Если ЗначениеЗаполнено(НайденныеУсловияТруда) Тогда
		Возврат НайденныеУсловияТруда;
	КонецЕсли;
	
	ОбъектУсловияТруда = Справочники.УсловияТруда.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектУсловияТруда, НаборДанных);
	ОбъектУсловияТруда.Наименование = НовоеНаименованиеУсловийТруда;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектУсловияТруда);	
	
	Возврат ОбъектУсловияТруда.Ссылка;

КонецФункции

Функция ЗаголовокНаОснованииНабораДанных(НаборДанных) Экспорт
	
	ЧастиСтроки = Новый Массив();
	
	ВидРаботСДосрочнойПенсией = НаборДанных.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией;
	
	Если ЗначениеЗаполнено(ВидРаботСДосрочнойПенсией) Тогда
		Если ВидРаботСДосрочнойПенсией = Перечисления.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы Тогда
			ЧастиСтроки.Добавить(НСтр("ru = 'Подпункт 1'"));
		ИначеЕсли ВидРаботСДосрочнойПенсией = Перечисления.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы Тогда
			ЧастиСтроки.Добавить(НСтр("ru = 'Подпункты 2 - 18'"));
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаборДанных.ОснованиеДосрочногоНазначенияПенсии) Тогда
		Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НаборДанных.ОснованиеДосрочногоНазначенияПенсии, "Код");
		ЧастиСтроки.Добавить(СокрЛП(Код));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаборДанных.ОсобыеУсловияТрудаПФР) Тогда
		Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НаборДанных.ОсобыеУсловияТрудаПФР, "Код");
		ЧастиСтроки.Добавить(СокрЛП(Код));
	КонецЕсли;

	Если НаборДанных.ВыплачиваетсяНадбавкаЗаВредность Тогда
		Если ЗначениеЗаполнено(НаборДанных.ПроцентНадбавкиЗаВредность) Тогда
			ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = 'Надбавка %1'"), НаборДанных.ПроцентНадбавкиЗаВредность) + "%");
		КонецЕсли;
		Если НаборДанных.Свойство("КоличествоДнейДополнительногоОтпускаВГод")
		 И ЗначениеЗаполнено(НаборДанных.КоличествоДнейДополнительногоОтпускаВГод) Тогда
			ЧастиСтроки.Добавить(СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';%1 день отпуска;;%1 дня отпуска;%1 дней отпуска;'"),
				НаборДанных.КоличествоДнейДополнительногоОтпускаВГод));
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(НаборДанных.КодПозицииСпискаПФР) Тогда
		Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НаборДанных.КодПозицииСпискаПФР, "Код");
		ЧастиСтроки.Добавить(СокрЛП(Код));
	КонецЕсли;
	
	Если ЧастиСтроки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиСтроки, "," + Символы.НПП);
	
КонецФункции

Процедура УстановитьИспользованиеКонтроляУникальностиНомеровРабочихМест(ПараметрыОбновления = Неопределено) Экспорт
	
	Если Константы.СпособКонтроляУникальностиНомеровРабочихМест.Получить() =
			Перечисления.СпособыКонтроляУникальностиНомеровРабочихМест.ПустаяСсылка() Тогда
		МенеджерЗначения = Константы.СпособКонтроляУникальностиНомеровРабочихМест.СоздатьМенеджерЗначения();
		МенеджерЗначения.Значение = Перечисления.СпособыКонтроляУникальностиНомеровРабочихМест.ВОрганизации;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначения);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	МенеджерЗначения = Константы.КонтролироватьУникальностьНомеровРабочихМест.СоздатьМенеджерЗначения();
	МенеджерЗначения.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначения);
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьРабочиеМестаВОбъектахПодсистемыСпецоценка(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ПредварительныйТекстЗапросаРабочиеМестаСпецоценкиТребующиеОбработки();
		
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, "ВТСвязиРабочихМестСПозициями", Неопределено);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Запрос.Текст = ОсновнойТекстЗапросаРабочиеМестаСпецоценкиТребующиеОбработки();
		
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаСвязейРабочихМестСПозициями = РезультатыЗапроса[РезультатыЗапроса.Количество() - 26].Выгрузить();
	
	ВыборкаАналогичные = РезультатыЗапроса[РезультатыЗапроса.Количество() - 25].Выбрать();
	ВыборкаРезультатыСпециальнойОценкиУсловийТруда = РезультатыЗапроса[РезультатыЗапроса.Количество() - 24].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПлановыеДатыСпециальнойОценкиУсловийТруда = РезультатыЗапроса[РезультатыЗапроса.Количество() - 23].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСпецоценкаДокументы = РезультатыЗапроса[РезультатыЗапроса.Количество() - 22].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Регистры
	НаборЗаписейАналогичные = 
		НаборЗаписейРегистраСведенийИзВыборки(ВыборкаАналогичные, "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда");
	
	НачатьТранзакцию();
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейАналогичные,,, Истина);
		
		ОбработатьДокументыСпецоценки(ВыборкаСпецоценкаДокументы, ТаблицаСвязейРабочихМестСПозициями);
		ОбработатьРегистрСведенийПодчиненныйРегистратору(ВыборкаРезультатыСпециальнойОценкиУсловийТруда, "РезультатыСпециальнойОценкиУсловийТруда");
		ОбработатьРегистрСведенийПодчиненныйРегистратору(ВыборкаПлановыеДатыСпециальнойОценкиУсловийТруда, "ПлановыеДатыСпециальнойОценкиУсловийТруда");
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения рабочих мест в объектах подсистемы «Спецоценка»'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьРабочиеМестаСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники";
	
	Запрос.Выполнить();
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПостроения.Отборы, "ВидДоговора", "В", Перечисления.ВидыДоговоровССотрудниками.ВидыДоговоровКромеВоеннойСлужбы());
	
	ВидыСобытий = Новый Массив;
	ВидыСобытий.Добавить(Перечисления.ВидыКадровыхСобытий.Прием);
	ВидыСобытий.Добавить(Перечисления.ВидыКадровыхСобытий.Перемещение);
	ВидыСобытий.Добавить(Перечисления.ВидыКадровыхСобытий.НачальныеДанные);
	ВидыСобытий.Добавить(Перечисления.ВидыКадровыхСобытий.ВосстановлениеВДолжности);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыПостроения.Отборы, "ВидСобытия", "В", ВидыСобытий);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		Метаданные.РегистрыСведений.КадроваяИсторияСотрудников.Имя,
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСотрудникиПериоды", "ФизическоеЛицо"),
		ПараметрыПостроения);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		Метаданные.РегистрыСведений.РабочиеМестаСотрудников.Имя,
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСотрудникиПериоды", "ФизическоеЛицо"));
	
	Запрос.Текст = ПредварительныйТекстЗапросаРабочиеМестаСотрудниковТребующиеОбработки();
		
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, "ВТСвязиРабочихМестСПозициями", Неопределено);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Запрос.Текст = ОсновнойТекстЗапросаРабочиеМестаСотрудниковТребующиеОбработки();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаКлассыУсловийТруда = РезультатыЗапроса[РезультатыЗапроса.Количество() - 9].Выбрать();
	ВыборкаРабочиеМестаСотрудников = РезультатыЗапроса[РезультатыЗапроса.Количество() - 8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Регистры
	НаборЗаписейКлассыУсловийТруда = 
		НаборЗаписейРегистраСведенийИзВыборки(ВыборкаКлассыУсловийТруда, "КлассыУсловийТрудаПоДолжностям");
	
	НачатьТранзакцию();
	Попытка
		Если НаборЗаписейКлассыУсловийТруда.Количество() > 0 Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейКлассыУсловийТруда, Ложь);
		КонецЕсли;
		
		ЗарегистрироватьРабочиеМестаСотрудников(ВыборкаРабочиеМестаСотрудников);
		РегистрыСведений.РабочиеМестаСотрудников.ЗаполнитьИнтервальныйРегистр(ПараметрыОбновления);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения рабочих мест сотрудников'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	КадровыйУчетРасширенный.ЗаполнитьДанныеДляПодбораСотрудников();
	
КонецПроцедуры

Процедура ОбновитьДанныеДляПодбораСотрудников(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаСотрудников.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.РабочиеМестаСотрудников КАК РабочиеМестаСотрудников
		|ГДЕ
		|	НЕ РабочиеМестаСотрудников.Сотрудник В (&Обработанные)";
	
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Сотрудники = ОбновляемыеДанные.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	КадровыйУчетРасширенный.ЗаполнитьДанныеДляПодбораСотрудников(Сотрудники, Истина);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, Сотрудники);
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
КонецПроцедуры

Функция ПредварительныйТекстЗапросаРабочиеМестаСотрудниковТребующиеОбработки()
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Возврат
		"ВЫБРАТЬ
		|	КлассыУсловийТрудаПоДолжностям.Период,
		|	КлассыУсловийТрудаПоДолжностям.Должность,
		|	КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда,
		|	КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений,
		|	КлассыУсловийТрудаПоДолжностям.Основание
		|ПОМЕСТИТЬ ВТКлассыУсловийТрудаПоДолжностям
		|ИЗ
		|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|ГДЕ
		|	КлассыУсловийТрудаПоДолжностям.Должность ССЫЛКА Справочник.ШтатноеРасписание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлассыУсловийТрудаПоДолжностям.Должность КАК РабочееМесто
		|ПОМЕСТИТЬ ВТОбработанныеКлассыУсловийТруда
		|ИЗ
		|	РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|ГДЕ
		|	КлассыУсловийТрудаПоДолжностям.Должность ССЫЛКА Справочник.РабочиеМестаОхраныТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто,
		|	ШтатноеРасписание.Ссылка КАК Позиция
		|ПОМЕСТИТЬ ВТСвязиРабочихМестСПозициямиНеОтобранные
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО РабочиеМестаОхраныТруда.УдалитьДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТСвязиРабочихМестСПозициями
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМестаСотрудников КАК РабочиеМестаСотрудников
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = РабочиеМестаСотрудников.РабочееМесто
		|ГДЕ
		|	РабочиеМестаСотрудников.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = КлассыУсловийТрудаПоДолжностям.Должность
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбработанныеКлассыУсловийТруда КАК ОбработанныеКлассыУсловийТруда
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ОбработанныеКлассыУсловийТруда.РабочееМесто
		|ГДЕ
		|	ОбработанныеКлассыУсловийТруда.РабочееМесто ЕСТЬ NULL";
	
	// АПК:96 -вкл
	
КонецФункции

Функция ОсновнойТекстЗапросаРабочиеМестаСотрудниковТребующиеОбработки()
	
	Возврат
		"ВЫБРАТЬ
		|	КлассыУсловийТрудаПоДолжностям.Период КАК Период,
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК Должность,
		|	КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда КАК КлассУсловийТруда,
		|	КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений КАК ДатаРегистрацииИзменений,
		|	КлассыУсловийТрудаПоДолжностям.Основание КАК Основание
		|ИЗ
		|	ВТКлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО КлассыУсловийТрудаПоДолжностям.Должность = СвязиРабочихМестСПозициями.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбработанныеКлассыУсловийТруда КАК ОбработанныеКлассыУсловийТруда
		|		ПО (СвязиРабочихМестСПозициями.РабочееМесто = ОбработанныеКлассыУсловийТруда.РабочееМесто)
		|ГДЕ
		|	ОбработанныеКлассыУсловийТруда.РабочееМесто ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	КлассыУсловийТрудаПоДолжностям.Период,
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда,
		|	КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений,
		|	КлассыУсловийТрудаПоДолжностям.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадроваяИсторияСотрудников.Период КАК Период,
		|	КадроваяИсторияСотрудников.РегистраторЗаписи КАК Регистратор,
		|	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	КадроваяИсторияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ЕСТЬNULL(СвязиРабочихМестСПозициями.РабочееМесто, ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка))) КАК РабочееМесто,
		|	КадроваяИсторияСотрудников.ПериодВозвратногоСобытия КАК ДействуетДо
		|ИЗ
		|	ВТКадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = СвязиРабочихМестСПозициями.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМестаСотрудников КАК РабочиеМестаСотрудников
		|		ПО (СвязиРабочихМестСПозициями.РабочееМесто = РабочиеМестаСотрудников.РабочееМесто)
		|ГДЕ
		|	РабочиеМестаСотрудников.РабочееМесто ЕСТЬ NULL
		|	И НЕ КадроваяИсторияСотрудников.РегистраторЗаписи ССЫЛКА Документ.Увольнение
		|	И НЕ КадроваяИсторияСотрудников.РегистраторЗаписи ССЫЛКА Документ.УвольнениеСписком
		|	И НЕ КадроваяИсторияСотрудников.РегистраторЗаписи ССЫЛКА Документ.ПрекращениеПодработки
		|	И ВЫБОР
		|			КОГДА КадроваяИсторияСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)
		|				ТОГДА НЕ СвязиРабочихМестСПозициями.РабочееМесто ЕСТЬ NULL
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	КадроваяИсторияСотрудников.ПериодВозвратногоСобытия,
		|	КадроваяИсторияСотрудников.РегистраторЗаписи,
		|	КадроваяИсторияСотрудников.ГоловнаяОрганизация,
		|	КадроваяИсторияСотрудников.ФизическоеЛицо,
		|	КадроваяИсторияСотрудников.Период,
		|	КадроваяИсторияСотрудников.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСотрудникиПериоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТКадроваяИсторияСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРабочиеМестаСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТКлассыУсловийТрудаПоДолжностям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОбработанныеКлассыУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСвязиРабочихМестСПозициямиНеОтобранные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСвязиРабочихМестСПозициями";
	
КонецФункции

Функция ПредварительныйТекстЗапросаРабочиеМестаСпецоценкиТребующиеОбработки()
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Возврат 
		"ВЫБРАТЬ
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные
		|ИЗ
		|	РегистрСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда КАК ПлановыеДатыСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто
		|ПОМЕСТИТЬ ВТРезультатыСпециальнойОценкиУсловийТрудаОбработанные
		|ИЗ
		|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда КАК РезультатыСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто,
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.АналогичноеРабочееМесто
		|ПОМЕСТИТЬ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные
		|ИЗ
		|	РегистрСведений.АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК
		|		АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто
		|ПОМЕСТИТЬ ВТПодготовкаСпецоценкиУсловийТрудаРабочиеМестаОбработанные
		|ИЗ
		|	Документ.ПодготовкаСпецоценкиУсловийТруда.РабочиеМеста КАК ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто
		|ПОМЕСТИТЬ ВТПодготовкаСпецоценкиУсловийТрудаАналогичныеМестаОбработанные
		|ИЗ
		|	Документ.ПодготовкаСпецоценкиУсловийТруда.АналогичныеМеста КАК ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто
		|ПОМЕСТИТЬ ВТРезультатыСпецоценкиУсловийТрудаРабочиеМестаОбработанные
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто
		|ПОМЕСТИТЬ ВТРезультатыСпецоценкиУсловийТрудаАналогичныеМестаОбработанные
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДекларацияСоответствияУсловийТрудаРабочиеМеста.РабочееМесто
		|ПОМЕСТИТЬ ВТДекларацияСоответствияУсловийТрудаОбработанные
		|ИЗ
		|	Документ.ДекларацияСоответствияУсловийТруда.РабочиеМеста КАК ДекларацияСоответствияУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто
		|ПОМЕСТИТЬ ВТНесчастныйСлучайНаПроизводствеОбработанные
		|ИЗ
		|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Период,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Регистратор,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.НомерСтроки,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Активность,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.РабочееМесто,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.ДатаБлижайшейОценки,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Организация
		|ПОМЕСТИТЬ ВТПлановыеДатыСпециальнойОценкиУсловийТруда
		|ИЗ
		|	РегистрСведений.УдалитьПлановыеДатыСпециальнойОценкиУсловийТруда КАК ПлановыеДатыСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыСпециальнойОценкиУсловийТруда.Период,
		|	РезультатыСпециальнойОценкиУсловийТруда.Регистратор,
		|	РезультатыСпециальнойОценкиУсловийТруда.НомерСтроки,
		|	РезультатыСпециальнойОценкиУсловийТруда.Активность,
		|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто,
		|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда,
		|	РезультатыСпециальнойОценкиУсловийТруда.Организация
		|ПОМЕСТИТЬ ВТРезультатыСпециальнойОценкиУсловийТруда
		|ИЗ
		|	РегистрСведений.УдалитьРезультатыСпециальнойОценкиУсловийТруда КАК РезультатыСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто,
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.АналогичноеРабочееМесто,
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.Организация
		|ПОМЕСТИТЬ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
		|ИЗ
		|	РегистрСведений.УдалитьАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК
		|		АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.Ссылка,
		|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.НомерСтроки,
		|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
		|ПОМЕСТИТЬ ВТПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
		|ИЗ
		|	Документ.ПодготовкаСпецоценкиУсловийТруда.РабочиеМеста КАК ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьАналогичноеМесто
		|ПОМЕСТИТЬ ВТПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста
		|ИЗ
		|	Документ.ПодготовкаСпецоценкиУсловийТруда.АналогичныеМеста КАК ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка,
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.НомерСтроки,
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
		|ПОМЕСТИТЬ ВТРезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьАналогичноеМесто
		|ПОМЕСТИТЬ ВТРезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДекларацияСоответствияУсловийТрудаРабочиеМеста.Ссылка,
		|	ДекларацияСоответствияУсловийТрудаРабочиеМеста.НомерСтроки,
		|	ДекларацияСоответствияУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
		|ПОМЕСТИТЬ ВТДекларацияСоответствияУсловийТруда
		|ИЗ
		|	Документ.ДекларацияСоответствияУсловийТруда.РабочиеМеста КАК ДекларацияСоответствияУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка,
		|	НесчастныйСлучайНаПроизводствеПострадавшие.НомерСтроки,
		|	НесчастныйСлучайНаПроизводствеПострадавшие.УдалитьДолжностьПоШтатномуРасписанию КАК УдалитьРабочееМесто
		|ПОМЕСТИТЬ ВТНесчастныйСлучайНаПроизводстве
		|ИЗ
		|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодготовкаСпецоценкиУсловийТруда.Ссылка КАК Ссылка,
		|	ПодготовкаСпецоценкиУсловийТруда.НомерСтроки КАК НомерСтроки,
		|	ПодготовкаСпецоценкиУсловийТруда.УдалитьРабочееМесто КАК УдалитьРабочееМесто,
		|	ПодготовкаСпецоценкиУсловийТруда.УдалитьРабочееМесто.Подразделение КАК Подразделение,
		|	ПодготовкаСпецоценкиУсловийТруда.УдалитьРабочееМесто.Должность КАК Должность
		|ПОМЕСТИТЬ ВТСпецоценкаДокументы
		|ИЗ
		|	ВТПодготовкаСпецоценкиУсловийТрудаРабочиеМеста КАК ПодготовкаСпецоценкиУсловийТруда
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РезультатыСпецоценкиУсловийТруда.Ссылка,
		|	РезультатыСпецоценкиУсловийТруда.НомерСтроки,
		|	РезультатыСпецоценкиУсловийТруда.УдалитьРабочееМесто,
		|	РезультатыСпецоценкиУсловийТруда.УдалитьРабочееМесто.Подразделение,
		|	РезультатыСпецоценкиУсловийТруда.УдалитьРабочееМесто.Должность
		|ИЗ
		|	ВТРезультатыСпецоценкиУсловийТрудаРабочиеМеста КАК РезультатыСпецоценкиУсловийТруда
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДекларацияСоответствияУсловийТруда.Ссылка,
		|	ДекларацияСоответствияУсловийТруда.НомерСтроки,
		|	ДекларацияСоответствияУсловийТруда.УдалитьРабочееМесто,
		|	ДекларацияСоответствияУсловийТруда.УдалитьРабочееМесто.Подразделение,
		|	ДекларацияСоответствияУсловийТруда.УдалитьРабочееМесто.Должность
		|ИЗ
		|	ВТДекларацияСоответствияУсловийТруда КАК ДекларацияСоответствияУсловийТруда
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НесчастныйСлучайНаПроизводстве.Ссылка,
		|	НесчастныйСлучайНаПроизводстве.НомерСтроки,
		|	НесчастныйСлучайНаПроизводстве.УдалитьРабочееМесто,
		|	НесчастныйСлучайНаПроизводстве.УдалитьРабочееМесто.Подразделение,
		|	НесчастныйСлучайНаПроизводстве.УдалитьРабочееМесто.Должность
		|ИЗ
		|	ВТНесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто,
		|	ШтатноеРасписание.Ссылка КАК Позиция
		|ПОМЕСТИТЬ ВТСвязиРабочихМестСПозициямиНеОтобранные
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО РабочиеМестаОхраныТруда.УдалитьДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТСвязиРабочихМестСПозициями
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПлановыеДатыСпециальнойОценкиУсловийТруда КАК ПлановыеДатыСпециальнойОценкиУсловийТруда
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ПлановыеДатыСпециальнойОценкиУсловийТруда.РабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные КАК
		|			ПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто
		|ГДЕ
		|	ПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция КАК Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРезультатыСпециальнойОценкиУсловийТруда КАК РезультатыСпециальнойОценкиУсловийТруда
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультатыСпециальнойОценкиУсловийТрудаОбработанные КАК
		|			РезультатыСпециальнойОценкиУсловийТрудаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = РезультатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто
		|ГДЕ
		|	РезультатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция КАК Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.АналогичноеРабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные КАК
		|			АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные.АналогичноеРабочееМесто
		|ГДЕ
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные.АналогичноеРабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция КАК Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные КАК
		|			АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто
		|ГДЕ
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодготовкаСпецоценкиУсловийТрудаРабочиеМеста КАК ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ПодготовкаСпецоценкиУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПодготовкаСпецоценкиУсловийТрудаРабочиеМестаОбработанные КАК ПодготовкаСпецоценкиУсловийТрудаРабочиеМестаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ПодготовкаСпецоценкиУсловийТрудаРабочиеМестаОбработанные.РабочееМесто
		|ГДЕ
		|	ПодготовкаСпецоценкиУсловийТрудаРабочиеМестаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста КАК ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьАналогичноеМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПодготовкаСпецоценкиУсловийТрудаАналогичныеМестаОбработанные КАК ПодготовкаСпецоценкиУсловийТрудаАналогичныеМестаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ПодготовкаСпецоценкиУсловийТрудаАналогичныеМестаОбработанные.АналогичноеМесто
		|ГДЕ
		|	ПодготовкаСпецоценкиУсловийТрудаАналогичныеМестаОбработанные.АналогичноеМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРезультатыСпецоценкиУсловийТрудаРабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = РезультатыСпецоценкиУсловийТрудаРабочиеМеста.УдалитьРабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультатыСпецоценкиУсловийТрудаРабочиеМестаОбработанные КАК РезультатыСпецоценкиУсловийТрудаРабочиеМестаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = РезультатыСпецоценкиУсловийТрудаРабочиеМестаОбработанные.РабочееМесто
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМестаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРезультатыСпецоценкиУсловийТрудаАналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.УдалитьАналогичноеМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультатыСпецоценкиУсловийТрудаАналогичныеМестаОбработанные КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМестаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = РезультатыСпецоценкиУсловийТрудаАналогичныеМестаОбработанные.АналогичноеМесто
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМестаОбработанные.АналогичноеМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДекларацияСоответствияУсловийТруда КАК ДекларацияСоответствияУсловийТруда
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ДекларацияСоответствияУсловийТруда.УдалитьРабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДекларацияСоответствияУсловийТрудаОбработанные КАК ДекларацияСоответствияУсловийТрудаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ДекларацияСоответствияУсловийТрудаОбработанные.РабочееМесто
		|ГДЕ
		|	ДекларацияСоответствияУсловийТрудаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = НесчастныйСлучайНаПроизводстве.УдалитьРабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНесчастныйСлучайНаПроизводствеОбработанные КАК НесчастныйСлучайНаПроизводствеОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = НесчастныйСлучайНаПроизводствеОбработанные.РабочееМесто
		|ГДЕ
		|	НесчастныйСлучайНаПроизводствеОбработанные.РабочееМесто ЕСТЬ NULL";
	
	// АПК:96 -вкл
	
КонецФункции

Функция ОсновнойТекстЗапросаРабочиеМестаСпецоценкиТребующиеОбработки()
	
	Возврат 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициями.Позиция КАК Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициямиАналог.РабочееМесто КАК АналогичноеРабочееМесто,
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.Организация КАК Организация
		|ИЗ
		|	ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда КАК АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто = СвязиРабочихМестСПозициями.Позиция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициямиАналог
		|		ПО АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.АналогичноеРабочееМесто = СвязиРабочихМестСПозициямиАналог.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные КАК АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные
		|		ПО (СвязиРабочихМестСПозициями.РабочееМесто = АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто)
		|ГДЕ
		|	АналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыСпециальнойОценкиУсловийТруда.Период КАК Период,
		|	РезультатыСпециальнойОценкиУсловийТруда.Регистратор КАК Регистратор,
		|	РезультатыСпециальнойОценкиУсловийТруда.НомерСтроки КАК НомерСтроки,
		|	РезультатыСпециальнойОценкиУсловийТруда.Активность КАК Активность,
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда КАК КлассУсловийТруда,
		|	РезультатыСпециальнойОценкиУсловийТруда.Организация КАК Организация
		|ИЗ
		|	ВТРезультатыСпециальнойОценкиУсловийТруда КАК РезультатыСпециальнойОценкиУсловийТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто = СвязиРабочихМестСПозициями.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультатыСпециальнойОценкиУсловийТрудаОбработанные КАК РезультатыСпециальнойОценкиУсловийТрудаОбработанные
		|		ПО (СвязиРабочихМестСПозициями.РабочееМесто = РезультатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто)
		|ГДЕ
		|	РезультатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	РезультатыСпециальнойОценкиУсловийТруда.Период,
		|	РезультатыСпециальнойОценкиУсловийТруда.Регистратор,
		|	РезультатыСпециальнойОценкиУсловийТруда.НомерСтроки,
		|	РезультатыСпециальнойОценкиУсловийТруда.Активность,
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда,
		|	РезультатыСпециальнойОценкиУсловийТруда.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	РезультатыСпециальнойОценкиУсловийТруда.Период
		|ИТОГИ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Период КАК Период,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Регистратор КАК Регистратор,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.НомерСтроки КАК НомерСтроки,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Активность КАК Активность,
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.ДатаБлижайшейОценки КАК ДатаБлижайшейОценки,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Организация КАК Организация
		|ИЗ
		|	ВТПлановыеДатыСпециальнойОценкиУсловийТруда КАК ПлановыеДатыСпециальнойОценкиУсловийТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО ПлановыеДатыСпециальнойОценкиУсловийТруда.РабочееМесто = СвязиРабочихМестСПозициями.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные КАК ПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные
		|		ПО (СвязиРабочихМестСПозициями.РабочееМесто = ПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто)
		|ГДЕ
		|	ПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Период,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Регистратор,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.НомерСтроки,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Активность,
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.ДатаБлижайшейОценки,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Период
		|ИТОГИ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпецоценкаДокументы.Ссылка КАК Ссылка,
		|	СпецоценкаДокументы.НомерСтроки КАК НомерСтроки,
		|	СпецоценкаДокументы.УдалитьРабочееМесто КАК УдалитьРабочееМесто,
		|	СпецоценкаДокументы.Подразделение КАК Подразделение,
		|	СпецоценкаДокументы.Должность КАК Должность,
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто
		|ИЗ
		|	ВТСпецоценкаДокументы КАК СпецоценкаДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО СпецоценкаДокументы.УдалитьРабочееМесто = СвязиРабочихМестСПозициями.Позиция
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецоценкаДокументы.Ссылка,
		|	СпецоценкаДокументы.НомерСтроки,
		|	СпецоценкаДокументы.УдалитьРабочееМесто,
		|	СпецоценкаДокументы.Подразделение,
		|	СпецоценкаДокументы.Должность,
		|	СвязиРабочихМестСПозициями.РабочееМесто
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПлановыеДатыСпециальнойОценкиУсловийТрудаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРезультатыСпециальнойОценкиУсловийТрудаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТрудаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодготовкаСпецоценкиУсловийТрудаРабочиеМестаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодготовкаСпецоценкиУсловийТрудаАналогичныеМестаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРезультатыСпецоценкиУсловийТрудаРабочиеМестаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРезультатыСпецоценкиУсловийТрудаАналогичныеМестаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТДекларацияСоответствияУсловийТрудаОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНесчастныйСлучайНаПроизводствеОбработанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПлановыеДатыСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРезультатыСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТАналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодготовкаСпецоценкиУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодготовкаСпецоценкиУсловийТрудаАналогичныеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТДекларацияСоответствияУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНесчастныйСлучайНаПроизводстве
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСпецоценкаДокументы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСвязиРабочихМестСПозициямиНеОтобранные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСвязиРабочихМестСПозициями";

КонецФункции

Процедура ОбработатьДокументыСпецоценки(ВыборкаРегистратор, ТаблицаСвязейРабочихМестСПозициями)
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		ЕстьСотрудники = Ложь;
		ЕстьТолькоРабочиеМеста = Ложь;
		ИмяТЧ = "РабочиеМеста";
		ИмяПоляПоиска = "УдалитьРабочееМесто";
		
		ДокументСсылка = ВыборкаРегистратор.Ссылка;
		ТипДокумента = ТипЗнч(ДокументСсылка);
		Если ТипДокумента = Тип("ДокументСсылка.ДекларацияСоответствияУсловийТруда") Тогда
			ЕстьТолькоРабочиеМеста = Истина;
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.НесчастныйСлучайНаПроизводстве") Тогда
			ЕстьТолькоРабочиеМеста = Истина;
			ИмяТЧ = "Пострадавшие";
			ИмяПоляПоиска = "УдалитьДолжностьПоШтатномуРасписанию";
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПодготовкаСпецоценкиУсловийТруда") Тогда
			ЕстьСотрудники = Истина;
		КонецЕсли;
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ДокументСсылка.Метаданные().ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		Блокировка.Заблокировать();
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(ДокументСсылка);
		
		ВыборкаРабочиеМеста = ВыборкаРегистратор.Выбрать();
		Пока ВыборкаРабочиеМеста.Следующий() Цикл
			СтруктураПоиска = Новый Структура(ИмяПоляПоиска + ", НомерСтроки");
			СтруктураПоиска[ИмяПоляПоиска] = ВыборкаРабочиеМеста.УдалитьРабочееМесто;
			СтруктураПоиска.НомерСтроки = ВыборкаРабочиеМеста.НомерСтроки;
			
			СтрокиТЧ = ДокументОбъект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
			
			Если СтрокиТЧ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЧ = СтрокиТЧ[0];
			СтрокаТЧ.РабочееМесто = ВыборкаРабочиеМеста.РабочееМесто;
			
			Если ЕстьТолькоРабочиеМеста Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЧ.ИдентификаторСтрокиРабочегоМеста = ВыборкаРабочиеМеста.НомерСтроки;
			СтрокаТЧ.Должность = ВыборкаРабочиеМеста.Должность;
			СтрокаТЧ.Подразделение = ВыборкаРабочиеМеста.Подразделение;
			
			СтруктураПоиска.Удалить("НомерСтроки");
			
			Если ЕстьСотрудники И ДокументОбъект.Сотрудники.Количество() > 0 Тогда
				СтрокиТЧСотрудники = ДокументОбъект.Сотрудники.НайтиСтроки(СтруктураПоиска);
				Для Каждого СтрокаСотрудника Из СтрокиТЧСотрудники Цикл
					СтрокаСотрудника.РабочееМесто = ВыборкаРабочиеМеста.РабочееМесто;
					СтрокаСотрудника.ИдентификаторСтрокиРабочегоМеста = ВыборкаРабочиеМеста.НомерСтроки;
				КонецЦикла;
			КонецЕсли;
			
			Если ДокументОбъект.АналогичныеМеста.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			МассивАналогичных = Новый Массив;
			МассивАналогичных.Добавить(СтрокаТЧ.РабочееМесто);
			
			СтрокиТЧАналогичные = ДокументОбъект.АналогичныеМеста.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаАналогичные Из СтрокиТЧАналогичные Цикл
				СтруктураПоискаАналога = Новый Структура("Позиция", СтрокаАналогичные.УдалитьАналогичноеМесто);
				СвязиАналогичных = ТаблицаСвязейРабочихМестСПозициями.НайтиСтроки(СтруктураПоискаАналога);
				Если СвязиАналогичных.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				Для Каждого АналогичноеМесто Из СвязиАналогичных Цикл
					Если МассивАналогичных.Найти(АналогичноеМесто.РабочееМесто) = Неопределено Тогда
						МассивАналогичных.Добавить(АналогичноеМесто.РабочееМесто);
						СтрокаАналогичные.АналогичноеМесто = АналогичноеМесто.РабочееМесто;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				СтрокаАналогичные.ИдентификаторСтрокиРабочегоМеста = ВыборкаРабочиеМеста.НомерСтроки;
			КонецЦикла;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗарегистрироватьРабочиеМестаСотрудников(ВыборкаРегистратор)
	
	Пока ВыборкаРегистратор.Следующий() Цикл
		ДокументСсылка = ВыборкаРегистратор.Регистратор;
		ТипДокумента = ТипЗнч(ДокументСсылка);
		ИмяДокумента = Метаданные.НайтиПоТипу(ТипДокумента).Имя;
		
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.РабочиеМестаСотрудников");
		ЭлементБлокировки = Блокировка.Добавить(ДокументСсылка.Метаданные().ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.РабочиеМестаСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(ДокументСсылка);
		
		СтруктураПоиска = Новый Структура("Сотрудник");
		ЗаписатьДокумент = Ложь;
		
		ВыборкаРабочихМест = ВыборкаРегистратор.Выбрать();
		Пока ВыборкаРабочихМест.Следующий() Цикл
			НовоеРабочееМестоСотрудника = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеРабочееМестоСотрудника, ВыборкаРабочихМест);
			Если ТипДокумента = Тип("ДокументСсылка.ВосстановлениеВДолжности")
			 Или ТипДокумента = Тип("ДокументСсылка.ПриемНаРаботу")
			 Или ТипДокумента = Тип("ДокументСсылка.НазначениеПодработки") Тогда
				ДокументОбъект.РабочееМесто = ВыборкаРабочихМест.РабочееМесто;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КадровыйПеревод") Тогда
				ДокументОбъект.РабочееМесто = ВыборкаРабочихМест.РабочееМесто;
				ДокументОбъект.ИзменитьРабочееМесто = Истина;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.НачальнаяШтатнаяРасстановка")
			 Или ТипДокумента = Тип("ДокументСсылка.ПеремещениеВДругоеПодразделение")
			 Или ТипДокумента = Тип("ДокументСсылка.ПриемНаРаботуСписком")
			 Или ТипДокумента = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаРабочихМест);
				СтрокиТЧ = ДокументОбъект.Сотрудники.НайтиСтроки(СтруктураПоиска);
				Если СтрокиТЧ.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаТЧ = СтрокиТЧ[0];
				СтрокаТЧ.РабочееМесто = ВыборкаРабочихМест.РабочееМесто;
				Если ТипДокумента = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
					СтрокаТЧ.ИзменитьРабочееМесто = Истина;
				КонецЕсли;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПереносДанных") Тогда
				НовыйРегистр = ДокументОбъект.ТаблицаРегистров.Добавить();
				НовыйРегистр.Имя = "РабочиеМестаСотрудников";
			Иначе
				Продолжить;
			КонецЕсли;
			ЗаписатьДокумент = Истина;			
		КонецЦикла;
		
		Если НаборЗаписей.Количество() > 0 И ЗначениеЗаполнено(НаборЗаписей[0].Регистратор) Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЕсли; 
		
		Если Не ЗаписатьДокумент Тогда
			Продолжить;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			
		Если ТипДокумента = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда			
			ДанныеДляРегистрацииВУчете = Документы.КадровыйПеревод.ДанныеДляРегистрацииВУчетаСтажаПФР(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка), Истина);
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриемНаРаботу")
			Или ТипДокумента = Тип("ДокументСсылка.ПриемНаРаботуСписком")
			Или ТипДокумента = Тип("ДокументСсылка.КадровыйПеревод")
			Или ТипДокумента = Тип("ДокументСсылка.ВосстановлениеВДолжности")
			Или ТипДокумента = Тип("ДокументСсылка.НачальнаяШтатнаяРасстановка") 
			Или ТипДокумента = Тип("ДокументСсылка.ПеремещениеВДругоеПодразделение") Тогда
				
			ДанныеДляРегистрацииВУчете = Документы[ИмяДокумента].ДанныеДляРегистрацииВУчетаСтажаПФР(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка));
		Иначе
			Продолжить;
		КонецЕсли;
		
		УчетСтажаПФР.ЗарегистрироватьПериодыВУчетеСтажаПФР(ДокументОбъект.Движения, ДанныеДляРегистрацииВУчете.Получить(ДокументСсылка));
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(ДокументОбъект.Движения.ПараметрыПериодовСтажаПФР);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьИспользованиеОсобыхУсловийТруда(ПараметрыОбновления)
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("Константа.ИспользоватьОсобыеУсловияТруда");
		Блокировка.Заблокировать();
	
		МенеджерКонстанты = Константы.ИспользоватьОсобыеУсловияТруда.СоздатьМенеджерЗначения();
		МенеджерКонстанты.Значение = Истина;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Не удалось установить использование особых условий труда'",
			ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьРезультатыСпецоценкиНовымиВреднымиФакторами(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
	Иначе
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыРезультатовСпецоценки.Ссылка КАК Документ
		|ПОМЕСТИТЬ ВТРезультатыСпецоценкиОбновленные
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.ВредныеФакторы КАК ВредныеФакторыРезультатовСпецоценки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыСпецоценкиУсловийТруда.Ссылка КАК Документ
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
		|ГДЕ
		|	НЕ РезультатыСпецоценкиУсловийТруда.Ссылка В (&Обработанные)
		|	И НЕ РезультатыСпецоценкиУсловийТруда.ПометкаУдаления
		|	И НЕ РезультатыСпецоценкиУсловийТруда.Ссылка В
		|		(ВЫБРАТЬ
		|			РезультатыСпецоценкиОбновленные.Документ
		|		ИЗ
		|			ВТРезультатыСпецоценкиОбновленные КАК РезультатыСпецоценкиОбновленные)";
	
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ДокументыКОбновлению = ОбновляемыеДанные.Выгрузить().ВыгрузитьКолонку("Документ");
	Запрос.УстановитьПараметр("ДокументыКОбновлению", ДокументыКОбновлению);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыРабочегоМеста
		|ИЗ
		|	РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеМестаРезультатаСпецоценки.Ссылка КАК Документ,
		|	РабочиеМестаРезультатаСпецоценки.ИдентификаторСтрокиРабочегоМеста КАК ИдентификаторСтрокиРабочегоМеста,
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор КАК ВредныйФактор,
		|	НЕ ВредныеФакторыРабочегоМеста.ВредныйФактор ЕСТЬ NULL КАК ЕстьСоответствие
		|ПОМЕСТИТЬ ВТДокументыСВреднымиФакторами
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РабочиеМестаРезультатаСпецоценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ПО РабочиеМестаРезультатаСпецоценки.РабочееМесто = ВредныеФакторыРабочегоМеста.РабочееМесто
		|ГДЕ
		|	РабочиеМестаРезультатаСпецоценки.Ссылка В(&ДокументыКОбновлению)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыСВреднымиФакторами.Документ КАК Документ,
		|	МАКСИМУМ(ДокументыСВреднымиФакторами.ЕстьСоответствие) КАК ЕстьСоответствие
		|ИЗ
		|	ВТДокументыСВреднымиФакторами КАК ДокументыСВреднымиФакторами
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыСВреднымиФакторами.Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыСВреднымиФакторами.Документ КАК Документ,
		|	ДокументыСВреднымиФакторами.ИдентификаторСтрокиРабочегоМеста КАК ИдентификаторСтрокиРабочегоМеста,
		|	ДокументыСВреднымиФакторами.ВредныйФактор КАК ВредныйФактор,
		|	ДокументыСВреднымиФакторами.ЕстьСоответствие КАК ЕстьСоответствие
		|ИЗ
		|	ВТДокументыСВреднымиФакторами КАК ДокументыСВреднымиФакторами
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументыСВреднымиФакторами.Документ,
		|	ДокументыСВреднымиФакторами.ИдентификаторСтрокиРабочегоМеста";
		
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументов = РезультатыЗапроса[2].Выбрать();
	ВыборкаФакторов = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		Если Не ВыборкаДокументов.ЕстьСоответствие Тогда
			Продолжить;
		КонецЕсли;
		ДокументОбъект = ВыборкаДокументов.Документ.ПолучитьОбъект();
		ВыборкаФакторов.СледующийПоЗначениюПоля("Документ");
		Пока ВыборкаФакторов.Следующий() Цикл
			Если ВыборкаФакторов.ЕстьСоответствие Тогда
				НоваяСтрока = ДокументОбъект.ВредныеФакторы.Добавить();
				НоваяСтрока.ВредныйФактор = ВыборкаФакторов.ВредныйФактор;
				НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = ВыборкаФакторов.ИдентификаторСтрокиРабочегоМеста;
			КонецЕсли;
		КонецЦикла;
		ЗаблокироватьДанныеДляРедактирования(ВыборкаДокументов.Документ);
		ДокументОбъект.ВредныеФакторы.Свернуть("ИдентификаторСтрокиРабочегоМеста, ВредныйФактор"); 
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, ДокументыКОбновлению);
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	МодульМедицинскиеОсмотры.ОбновитьВредныеФакторыРабочихМест();
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьМедосмотры(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесчастныеСлучаиНаПроизводстве") Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПриказа223Н", ДатаВступленияВСилуПриказа223Н());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка КАК Ссылка,
		|	НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто КАК РабочееМесто,
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший КАК Пострадавший,
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка.ДатаПроисшествия КАК ДатаПроисшествия
		|ПОМЕСТИТЬ ВТНесчастныеСлучаи
		|ИЗ
		|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве.МедицинскиеОсмотры КАК
		|			НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры
		|		ПО (НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Ссылка)
		|		И
		|			(НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший = НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Пострадавший)
		|ГДЕ
		|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка.ДатаПроисшествия >= &ДатаПриказа223Н
		|	И ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.ПериодическиеМедицинскиеОсмотры КАК ПериодическиеМедицинскиеОсмотры
		|			ГДЕ
		|				ПериодическиеМедицинскиеОсмотры.ФизическоеЛицо = НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший
		|				И ПериодическиеМедицинскиеОсмотры.РабочееМесто = НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто
		|				И
		|					ПериодическиеМедицинскиеОсмотры.ДатаПройденногоОсмотра <= НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка.ДатаПроисшествия)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.РезультатОсмотра ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НесчастныеСлучаи.Ссылка КАК Ссылка,
		|	ПериодическиеМедицинскиеОсмотры.ДатаПройденногоОсмотра КАК ДатаПройденногоОсмотра,
		|	ПериодическиеМедицинскиеОсмотры.ФизическоеЛицо КАК Пострадавший,
		|	ПериодическиеМедицинскиеОсмотры.ВидОсмотра КАК ВидОсмотра,
		|	ПериодическиеМедицинскиеОсмотры.РезультатОсмотра КАК РезультатОсмотра
		|ИЗ
		|	РегистрСведений.ПериодическиеМедицинскиеОсмотры КАК ПериодическиеМедицинскиеОсмотры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНесчастныеСлучаи КАК НесчастныеСлучаи
		|		ПО ПериодическиеМедицинскиеОсмотры.ФизическоеЛицо = НесчастныеСлучаи.Пострадавший
		|		И ПериодическиеМедицинскиеОсмотры.РабочееМесто = НесчастныеСлучаи.РабочееМесто
		|		И ПериодическиеМедицинскиеОсмотры.ДатаПройденногоОсмотра <= НесчастныеСлучаи.ДатаПроисшествия
		|ИТОГИ
		|ПО
		|	Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ВыборкаДокументов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументов.Следующий() Цикл
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.НесчастныйСлучайНаПроизводстве");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаДокументов.Ссылка);
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
			ДокументОбъект.МедицинскиеОсмотры.Очистить();
			Выборка = ВыборкаДокументов.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ДокументОбъект.МедицинскиеОсмотры.Добавить(), Выборка);
			КонецЦикла;
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Заполнение табличной части Медосмотры документа %1.Ошибка блокировки'",
				ОбщегоНазначения.КодОсновногоЯзыка()), ВыборкаДокументов.Ссылка);
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , ВыборкаДокументов.Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЗагрузкаДанных

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	// Здесь перечисляются неразделенные объекты метаданных ссылочного типа, имеющие непредопределенные элементы.
	// В модуле менеджера таких объектов должна быть определена функция ПоляЕстественногоКлюча, 
	// составляющая массив полей для однозначной идентификации элемента.
	
	Типы.Добавить(Метаданные.Справочники.ВидыПроисшествий);
	Типы.Добавить(Метаданные.Справочники.ПричиныПроисшествий);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти