
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НаДату >= '20150101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;
	Иначе
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  	20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 	5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 	5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2017Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 30 ноября 2016 г. № 282."; 
	НоваяФорма.ДатаНачалоДействия = '20161001';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20170930';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2018Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 14 ноября 2017 г. № 171."; 
	НоваяФорма.ДатаНачалоДействия = '20171001';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20180930';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2019Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 12 декабря 2018 года №4."; 
	НоваяФорма.ДатаНачалоДействия = '20181001';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20190930';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2020Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 5 февраля 2020 года №17."; 
	НоваяФорма.ДатаНачалоДействия = '20191001';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20200630';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2020Кв3";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 7 сентября 2020 года №34."; 
	НоваяФорма.ДатаНачалоДействия = '20200701';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20210930';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2021Кв4";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по статистике Министерства нац. экономики РК от 7 сентября 2020 года №34 (в редакции Приказа от 3 декабря 2021 №42)"; 
	НоваяФорма.ДатаНачалоДействия = '20211001';                                                                                         
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

	Возврат ТаблицаФормОтчета;
	
КонецФункции