#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИспользуютсяВзаиморасчетыПоПрочимДоходам = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.Выплаты.ВзаиморасчетыПоПрочимДоходам") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыПоПрочимДоходам");
		ИспользуютсяВзаиморасчетыПоПрочимДоходам = Модуль.ИспользуютсяВзаиморасчетыПоПрочимДоходам();
	КонецЕсли;
	
	ИспользоватьРегистрациюПрочихВыплат = ПолучитьФункциональнуюОпцию("ИспользоватьРегистрациюПрочихВыплат");
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты);
	
	Если ИспользуютсяВзаиморасчетыПоПрочимДоходам Тогда
		ДанныеВыбора.Добавить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов);
	КонецЕсли;
	
	Если ИспользоватьРегистрациюПрочихВыплат Тогда
		ДанныеВыбора.Добавить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
	
#КонецЕсли