
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВозобновитьНабор(ПараметрКоманды, НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()));
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВозобновитьНабор(Вакансии, ДатаВозобновления)
	Справочники.Вакансии.ВозобновитьНабор(Вакансии, ДатаВозобновления);
КонецПроцедуры

#КонецОбласти
