////////////////////////////////////////////////////////////////////////////////
// Описание формы
// Параметры фомры:
//  ИмяМакета - Строка - передается имя макета.
//  ИмяСекции - Строка - передается имя секции макета.
//  ПолучатьПолныеДанные - Булево - признак возврата полных данных. Если Истина то возвращается структура "Код" и "Наименование" если Ложь то возвращается только "Код".
//  ПолныйПоиск - Булево - признак поиска по коду и наименованию.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоГрупп = 2;
	
	Если НЕ ЗначениеЗаполнено(Параметры.ИмяМакета) ИЛИ НЕ ЗначениеЗаполнено(Параметры.ИмяСекции) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ИмяМакета = Параметры.ИмяМакета;
	ИмяСекции = Параметры.ИмяСекции;
	ТекущийКодСтроки = Параметры.ТекущийКодСтроки;
	
	ПолучатьПолныеДанные = Параметры.ПолучатьПолныеДанные;
	
	Если Параметры.Свойство("ПолныйПоиск") Тогда
		ПолныйПоиск = Параметры.ПолныйПоиск;
	КонецЕсли; 
	
	Дерево = РеквизитФормыВЗначение("Таблица");
	Дерево.Строки.Очистить();
	
	Если Не Параметры.Свойство("ИмяОтчета") Тогда
		Макет = ПолучитьОбщийМакет(СокрЛП(Параметры.ИмяМакета));
	Иначе
		Макет = Отчеты[Параметры.ИмяОтчета].ПолучитьМакет(СокрЛП(Параметры.ИмяМакета));
	КонецЕсли;
	
	ТекстШапки = Макет.ПолучитьОбласть("Шапка|Наименование").ТекущаяОбласть.Текст;
	
	Область = Макет.Области[Параметры.ИмяСекции];
	
	Для Ном = Область.Верх По Область.Низ Цикл
		Если НЕ СокрЛП(Макет.Область(Ном, 5).Текст) = "" Тогда
			Если НЕ СокрЛП(Макет.Область(Ном, 1).Текст) = "" Тогда
				НоваяСтрока = Дерево.Строки.Добавить();
				НоваяСтрока.КодСтроки    = СокрЛП(Макет.Область(Ном, 1).Текст);
				НоваяСтрока.Наименование = СокрЛП(Макет.Область(Ном, 5).Текст);
				НоваяСтрока.Группа = 0;
			ИначеЕсли НЕ СокрЛП(Макет.Область(Ном, 2).Текст) = "" Тогда
				Подстрока = НоваяСтрока.Строки.Добавить();
				Подстрока.КодСтроки    = СокрЛП(Макет.Область(Ном, 2).Текст);
				Подстрока.Наименование = СокрЛП(Макет.Область(Ном, 5).Текст);
				Подстрока.Группа = 1;
			ИначеЕсли НЕ СокрЛП(Макет.Область(Ном, 3).Текст) = "" Тогда
				ПодстрокаПодстроки = Подстрока.Строки.Добавить();
				ПодстрокаПодстроки.КодСтроки    = СокрЛП(Макет.Область(Ном, 3).Текст);
				ПодстрокаПодстроки.Наименование = СокрЛП(Макет.Область(Ном, 5).Текст);
				ПодстрокаПодстроки.Группа = 2;
			ИначеЕсли НЕ СокрЛП(Макет.Область(Ном, 4).Текст) = "" Тогда
				ПодстрокаПодстрокиСтроки = ПодстрокаПодстроки.Строки.Добавить();
				ПодстрокаПодстрокиСтроки.КодСтроки    = СокрЛП(Макет.Область(Ном, 4).Текст);
				ПодстрокаПодстрокиСтроки.Наименование = СокрЛП(Макет.Область(Ном, 5).Текст);
				ПодстрокаПодстрокиСтроки.Группа = 3;
				Группировать = Истина;
			КонецЕсли;
			КоличествоГрупп = 3;
			
		ИначеЕсли НЕ СокрЛП(Макет.Область(Ном, 4).Текст) = "" Тогда
			Если НЕ СокрЛП(Макет.Область(Ном, 1).Текст) = "" Тогда
				НоваяСтрока = Дерево.Строки.Добавить();
				НоваяСтрока.КодСтроки    = СокрЛП(Макет.Область(Ном, 1).Текст);
				НоваяСтрока.Наименование = СокрЛП(Макет.Область(Ном, 4).Текст);
				НоваяСтрока.Группа = 0;
			ИначеЕсли НЕ СокрЛП(Макет.Область(Ном, 2).Текст) = "" Тогда
				Подстрока = НоваяСтрока.Строки.Добавить();
				Подстрока.КодСтроки    = СокрЛП(Макет.Область(Ном, 2).Текст);
				Подстрока.Наименование = СокрЛП(Макет.Область(Ном, 4).Текст);
				Подстрока.Группа = 1;
			ИначеЕсли НЕ СокрЛП(Макет.Область(Ном, 3).Текст) = "" Тогда
				ПодстрокаПодстроки = Подстрока.Строки.Добавить();
				ПодстрокаПодстроки.КодСтроки    = СокрЛП(Макет.Область(Ном, 3).Текст);
				ПодстрокаПодстроки.Наименование = СокрЛП(Макет.Область(Ном, 4).Текст);
				ПодстрокаПодстроки.Группа = 2;
				Группировать = Истина;
			КонецЕсли;
			КоличествоГрупп = 2;
		Иначе 
			Строка = Дерево.Строки.Добавить();
			Строка.КодСтроки    = СокрЛП(Макет.Область(Ном, 1).Текст);
			Строка.Наименование = СокрЛП(Макет.Область(Ном, 2).Текст);
		КонецЕсли;
		
	КонецЦикла;
	
	//Инициализируемся на строке, если было уже выбрано значение из классификатора.
	Если ТекущийКодСтроки <> Неопределено И ТекущийКодСтроки <> "" Тогда
		ТекущийКодСтроки = ?(Прав(СокрЛП(ТекущийКодСтроки),1) = ".", Лев(ТекущийКодСтроки, СтрДлина(СокрЛП(ТекущийКодСтроки)) -1), СокрЛП(ТекущийКодСтроки));
		СтрокаПоиска = Дерево.Строки.Найти(СокрЛП(ТекущийКодСтроки), "КодСтроки", Истина);
		Если СтрокаПоиска <> Неопределено Тогда
			Элементы.Таблица.ТекущаяСтрока = Дерево.Строки.Индекс(СтрокаПоиска);
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево,"Таблица");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЗначениеВозврата = Неопределено;
	
	Выбор(Элемент.ТекущиеДанные.КодСтроки, Элемент.ТекущиеДанные.Наименование, ЗначениеВозврата);
	
	Если ЗначениеВозврата = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОповеститьОВыборе(ЗначениеВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ЗначениеВозврата = Неопределено;
	
	Выбор(Элемент.ТекущиеДанные.КодСтроки, Элемент.ТекущиеДанные.Наименование, ЗначениеВозврата);
	
	Если ЗначениеВозврата = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОповеститьОВыборе(ЗначениеВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура Выбор(КодСтроки, Наименование, ЗначениеВозврата)
	
	Дерево = РеквизитФормыВЗначение("Таблица");
	
	Если ПолныйПоиск Тогда
		МассивСтрок = Дерево.Строки.НайтиСтроки(Новый Структура("КодСтроки, Наименование", КодСтроки, Наименование));
		Если МассивСтрок.Количество() > 0 Тогда
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				Если Группировать = Истина Тогда
					Если Не СтрокаМассива.Родитель = Неопределено И СтрокаМассива.Группа = КоличествоГрупп Тогда
						Если ПолучатьПолныеДанные Тогда
							ЗначениеВозврата = Новый Структура("КодСтроки, Наименование", СтрокаМассива.КодСтроки, СтрокаМассива.Наименование);
						Иначе
							ЗначениеВозврата = СтрокаМассива.КодСтроки;
						КонецЕсли;
					Иначе
						Возврат;
					КонецЕсли;
				Иначе
					СтандартнаяОбработка = Ложь;
					Если ПолучатьПолныеДанные Тогда
						ЗначениеВозврата = Новый Структура("КодСтроки, Наименование", СтрокаМассива.КодСтроки, СтрокаМассива.Наименование);
					Иначе
						ЗначениеВозврата = СтрокаМассива.КодСтроки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе		
		ВыбраннаяСтрока = Дерево.Строки.Найти(КодСтроки, "КодСтроки", Истина);
		Если Группировать = Истина Тогда
			Если Не ВыбраннаяСтрока.Родитель = Неопределено И ВыбраннаяСтрока.Группа = КоличествоГрупп Тогда
				Если ПолучатьПолныеДанные Тогда
					ЗначениеВозврата = Новый Структура("КодСтроки, Наименование", ВыбраннаяСтрока.КодСтроки, ВыбраннаяСтрока.Наименование);
				Иначе
					ЗначениеВозврата = ВыбраннаяСтрока.КодСтроки;
				КонецЕсли;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			СтандартнаяОбработка = Ложь;
			Если ПолучатьПолныеДанные Тогда
				ЗначениеВозврата = Новый Структура("КодСтроки, Наименование", ВыбраннаяСтрока.КодСтроки, ВыбраннаяСтрока.Наименование);
			Иначе
				ЗначениеВозврата = ВыбраннаяСтрока.КодСтроки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти