#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеЗанятияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакета", "ПФ_MXL_КлассификаторЗанятий");
	ПараметрыФормы.Вставить("ИмяСекции", "Классификатор");
	ПараметрыФормы.Вставить("ПолучатьПолныеДанные", Истина);
	ПараметрыФормы.Вставить("ПолныйПоиск", Истина);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПрофессииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакета", "КлассификаторПрофессий");
	ПараметрыФормы.Вставить("ИмяСекции", "Классификатор");
	ПараметрыФормы.Вставить("ПолучатьПолныеДанные", Истина);
	ПараметрыФормы.Вставить("ПолныйПоиск", Истина);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура КодЗанятияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяМакета", "ПФ_MXL_КлассификаторЗанятий");
	ПараметрыФормы.Вставить("ИмяСекции", "Классификатор");
	ПараметрыФормы.Вставить("ПолучатьПолныеДанные", Истина);
	ПараметрыФормы.Вставить("ПолныйПоиск", Истина);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораИзКлассификатора", ПараметрыФормы, Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КодЗанятияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда 
		Запись.КодЗанятия = ВыбранноеЗначение;
	Иначе
		Запись.КодЗанятия = ВыбранноеЗначение.КодСтроки;
		Запись.НаименованиеЗанятия = ВыбранноеЗначение.Наименование;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПрофессииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Запись.НаименованиеПрофессии = ВыбранноеЗначение.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеЗанятияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда 
		Запись.КодЗанятия = ВыбранноеЗначение;
	Иначе
		Запись.КодЗанятия = ВыбранноеЗначение.КодСтроки;
		Запись.НаименованиеЗанятия = ВыбранноеЗначение.Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

