
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект Цикл
				
		// периодичность регистра месяца, согласно разъяснениям расчет можно было производить раньше вступления Единых правил, в связи с чем в месяце вступления целиком позволяем рассчитать по новому
		ДатаИзмененияЕдиныхПравил2024 = НачалоМесяца(УчетСреднегоЗаработкаРК.ДатаИзмененияЕдиныхПравил2024());
		Если Строка.Период < ДатаИзмененияЕдиныхПравил2024 И ЗначениеЗаполнено(Строка.УчетРабочегоВремениДляСуммированногоУчета) Тогда
			СообщениеОбОшибке = НСтр("ru = 'Настройку ""Порядок учета рабочего времени (в периоде события для суммированного учета)"" необходимо заполнять с %1""'");
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОбОшибке, Формат(НачалоМесяца(ДатаИзмененияЕдиныхПравил2024), "ДЛФ=DD"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		КонецЕсли;
		
		Если Строка.Период >= Дата('20240101') И НЕ Строка.Период = НачалоМесяца(Строка.Период) Тогда
			СообщениеОбОшибке = НСтр("ru = 'Настройки расчета среднего заработка по сотруднику необходимо задавать в рамках месяца на начало месяца'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли