#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ПорядокОбложенияДоходовРаботников = Новый Массив;
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ПорядокОбложенияДоходовРаботников Цикл
		
		ПорядокОбложенияДоходовРаботников.Добавить(ЗначениеПеречисления);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеВыбора, ПорядокОбложенияДоходовРаботников);
	
КонецПроцедуры

#КонецОбласти

	
#КонецЕсли