#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(НачисленияУдержанияВзносы.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.РегистрацияПрочихДоходов;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Функция СпособВыплатыПрочихДоходов() Экспорт
	Возврат Перечисления.СпособыВыплатыПрочихДоходов.ВыплатаПрочихДоходов;
КонецФункции

Процедура ПровестиПоУчетам(Объект, Отказ) Экспорт
	УчетПрочихДоходов.ПровестиПоУчетам(Объект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//	КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Справка о списании депонированной зарплаты.
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.РегистрацияПрочихДоходов";
	КомандаПечати.Идентификатор = "ПФ_MXL_СправкаОРегистрацииПрочихДоходов";
	КомандаПечати.Представление = НСтр("ru = 'Справка о регистрации прочих доходов'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//	МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//	ПараметрыПечати - Структура - дополнительные настройки печати;
//	КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы.
//	ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//	ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьСправку = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОРегистрацииПрочихДоходов");
	
	Если НужноПечататьСправку Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СправкаОРегистрацииПрочихДоходов",
			НСтр("ru = 'Справка о регистрации прочих доходов'"), ПечатьСправки(МассивОбъектов, ОбъектыПечати), ,
			"Документ.РегистрацияПрочихДоходов.ПФ_MXL_СправкаОРегистрацииПрочихДоходов");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьСправки(МассивОбъектов, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РегистрацияПрочихДоходов_СправкаОРегистрацииПрочихДоходов";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РегистрацияПрочихДоходов.ПФ_MXL_СправкаОРегистрацииПрочихДоходов");
		
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		ДанныеДокумента = ДанныеПечати.Значение;
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
		
		ОбластьМакетаШапка.Параметры.Заполнить(ДанныеДокумента);
		ДокументРезультат.Вывести(ОбластьМакетаШапка);
		// ЗУПК
		ВывестиКолонки(Макет, ДокументРезультат, "ШапкаТаблица", ДанныеДокумента);
		// ЗУПК
		
		Для каждого ДанныеСотрудника Из ДанныеДокумента.ТабличнаяЧастьДокумента Цикл
			
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьМакетаСтрока);
			МассивВыводимыхОбластей.Добавить(ОбластьМакетаПодвал);
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, МассивВыводимыхОбластей) Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				ДокументРезультат.Вывести(ОбластьМакетаШапка);
				ВывестиКолонки(Макет, ДокументРезультат, "ШапкаТаблица", ДанныеДокумента);
			КонецЕсли;
			
			// ЗУПК
			ВывестиКолонки(Макет,ДокументРезультат,"Строка",ДанныеДокумента,ДанныеСотрудника);
 			// ЗУПК
			
		КонецЦикла;
		
		ПодписиДокументовКлиентСервер.ДополнитьТекстОснованиемПодписи(
			ДанныеДокумента.ИсполнительРасшифровкаПодписи, ДанныеДокумента.ОснованиеПодписиИсполнителя);
		
		ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДокумента);
		ДокументРезультат.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Ссылка);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	ВалютаУчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
    // ЗУПК
	|ВЫБРАТЬ
	|	РегистрацияПрочихДоходов.Ссылка КАК Ссылка,
	|	РегистрацияПрочихДоходов.ВидПрочегоДохода КАК ВидПрочегоДохода,
	|	НалогообложениеНачислений.Период КАК Период
	|ПОМЕСТИТЬ НалогообложениеПоВидамПрочегоДохода
	|ИЗ
	|	Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеНачислений.Начисление
	|			И РегистрацияПрочихДоходов.ПериодРегистрации >= НалогообложениеНачислений.Период
	|ГДЕ
	|	РегистрацияПрочихДоходов.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияПрочихДоходов.Ссылка КАК СсылкаДоходСубъектаПредпринимательства
	|ПОМЕСТИТЬ ДокументыИсключения
	|ИЗ
	|	НалогообложениеПоВидамПрочегоДохода КАК РегистрацияПрочихДоходов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеНачислений.Начисление
	|			И РегистрацияПрочихДоходов.Период = НалогообложениеНачислений.Период
	|ГДЕ
	|	НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисления.Ссылка КАК Ссылка,
	|	СУММА(ВЫБОР	КОГДА
	|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
	|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК ИПН,
	|	СУММА(ВЫБОР	КОГДА
	|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВ)
	|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК ОПВ,
	|	СУММА(ВЫБОР	КОГДА
	|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС)
	|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК ВОСМС,
	|	СУММА(ВЫБОР	КОГДА
	|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СН)
	|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК СН,
	|	СУММА(ВЫБОР	КОГДА
	|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.СО)
	|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК СО,
	|	СУММА(ВЫБОР	КОГДА
	|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ОПВР)
	|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК ОПВР,
	|	СУММА(ВЫБОР	КОГДА
	|					НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ООСМС)
	|					ТОГДА НалогиВзносыОтчисления.НалогВзнос + НалогиВзносыОтчисления.НалогВзносСПревышения
	|			ИНАЧЕ 0
	|	КОНЕЦ) КАК ООСМС
	|ПОМЕСТИТЬ ВТ_НалогиВзносыОтчисления
	|ИЗ
	|	Документ.РегистрацияПрочихДоходов.НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|ГДЕ
	|	НалогиВзносыОтчисления.Ссылка В(&МассивОбъектов)
	|		И НЕ НалогиВзносыОтчисления.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыИсключения.СсылкаДоходСубъектаПредпринимательства
	|				ИЗ
	|					ДокументыИсключения)
	|		И НЕ НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления В (&ВидыНалоговВзносовОтчислений)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
    // ЗУПК
	|ВЫБРАТЬ
	|	РегистрацияПрочихДоходов.Ссылка.Организация.НаименованиеПолное КАК Организация,
	|	РегистрацияПрочихДоходов.Ссылка.Подразделение.Наименование КАК Подразделение,
	|	РегистрацияПрочихДоходов.Ссылка КАК Ссылка,
	|	РегистрацияПрочихДоходов.Ссылка.Номер КАК Номер,
	|	НАЧАЛОПЕРИОДА(РегистрацияПрочихДоходов.Ссылка.Дата, ДЕНЬ) КАК Дата,
	|	РегистрацияПрочихДоходов.Ссылка.ВидПрочегоДохода КАК ВидПрочегоДохода,
	|	РегистрацияПрочихДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрацияПрочихДоходов.НДФЛ КАК НДФЛ,
	|	РегистрацияПрочихДоходов.Начислено КАК СуммаДохода,
	|	РегистрацияПрочихДоходов.СуммаВычета КАК СуммаВычета,
	|	РегистрацияПрочихДоходов.Удержано КАК Удержано,
    // ЗУПК
	|	НалогиВзносыОтчисления.ИПН КАК ИПН,
	|	НалогиВзносыОтчисления.ОПВ КАК ОПВ,
	|	НалогиВзносыОтчисления.ВОСМС КАК ВОСМС,
	|	НалогиВзносыОтчисления.СН КАК СН,
	|	НалогиВзносыОтчисления.СО КАК СО,
	|	НалогиВзносыОтчисления.ОПВР КАК ОПВР,
	|	НалогиВзносыОтчисления.ООСМС КАК ООСМС,
    // ЗУПК
	|	РегистрацияПрочихДоходов.КВыплате КАК СуммаКВыплате,
	|	РегистрацияПрочихДоходов.Ссылка.Исполнитель.ФИО КАК Исполнитель,
	|	РегистрацияПрочихДоходов.Ссылка.ДолжностьИсполнителя КАК ДолжностьИсполнителя,
	|	РегистрацияПрочихДоходов.Ссылка.ОснованиеПодписиИсполнителя КАК ОснованиеПодписиИсполнителя
	|ИЗ
    // ЗУПК
	|	Документ.РегистрацияПрочихДоходов.НачисленияУдержанияВзносы КАК РегистрацияПрочихДоходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|		ПО РегистрацияПрочихДоходов.Ссылка = НалогиВзносыОтчисления.Ссылка
	|			И РегистрацияПрочихДоходов.ФизическоеЛицо = НалогиВзносыОтчисления.ФизическоеЛицо
    // ЗУПК
	|ГДЕ
	|	РегистрацияПрочихДоходов.Ссылка В(&МассивОбъектов)
    // ЗУПК
	|		И НЕ РегистрацияПрочихДоходов.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыИсключения.СсылкаДоходСубъектаПредпринимательства
	|				ИЗ
	|					ДокументыИсключения)
    // ЗУПК
	|ИТОГИ
	|	СУММА(СуммаДохода),
	|	СУММА(СуммаВычета),
    // ЗУПК
	|	СУММА(ИПН),
	|	СУММА(ОПВ),
	|	СУММА(ВОСМС),
	|	СУММА(СН),
	|	СУММА(СО),
	|	СУММА(ОПВР),
	|	СУММА(ООСМС),
    // ЗУПК
	|	СУММА(Удержано)
	|ПО
	|	Ссылка";
	
    // ЗУПК
	МассивНалоговВзносовОтчислений = Новый Массив;
	МассивНалоговВзносовОтчислений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ЕП);
	МассивНалоговВзносовОтчислений.Добавить(Перечисления.ВидыНалоговВзносовОтчислений.ОППВ);
	Запрос.УстановитьПараметр("ВидыНалоговВзносовОтчислений", МассивНалоговВзносовОтчислений);
    // ЗУПК
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	ГруппировкаПоДокументу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ГруппировкаПоДокументу.Следующий() Цикл
		
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("Ссылка", ГруппировкаПоДокументу.Ссылка);
		ДанныеПечати.Вставить("НазваниеОрганизации", ГруппировкаПоДокументу.Организация);
		ДанныеПечати.Вставить("НазваниеПодразделения", ГруппировкаПоДокументу.Подразделение);
		ДанныеПечати.Вставить("ЕдиницаИзмерения", ВалютаУчета.НаименованиеПолное);
		ДанныеПечати.Вставить("ВидПрочегоДохода", ГруппировкаПоДокументу.ВидПрочегоДохода);
		ДанныеПечати.Вставить("ДатаДокумента", Формат(ГруппировкаПоДокументу.Дата, "ДЛФ=D"));
		ДанныеПечати.Вставить("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ГруппировкаПоДокументу.Номер, Истина, Истина));
		ДанныеПечати.Вставить("ДолжностьИсполнителя", ГруппировкаПоДокументу.ДолжностьИсполнителя);
		ДанныеПечати.Вставить("ОснованиеПодписиИсполнителя", ГруппировкаПоДокументу.ОснованиеПодписиИсполнителя);
		ДанныеПечати.Вставить("ИсполнительРасшифровкаПодписи", ФизическиеЛицаЗарплатаКадры.РасшифровкаПодписи(Строка(ГруппировкаПоДокументу.Исполнитель)));
		ДанныеПечати.Вставить("ТабличнаяЧастьДокумента", Новый Массив);
    	// ЗУПК
		ДанныеПечати.Вставить("ЕстьИПН", Ложь);
		ДанныеПечати.Вставить("ЕстьОПВ", Ложь);
		ДанныеПечати.Вставить("ЕстьВОСМС", Ложь);
		ДанныеПечати.Вставить("ЕстьСН", Ложь);
		ДанныеПечати.Вставить("ЕстьСО", Ложь);
		ДанныеПечати.Вставить("ЕстьОПВР", Ложь);
		ДанныеПечати.Вставить("ЕстьООСМС", Ложь);
    	// ЗУПК
		
		ГруппировкаПоСотрудникам = ГруппировкаПоДокументу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ГруппировкаПоСотрудникам.Следующий() Цикл
			
			СтрокаДанныхПечати = Новый Структура;
			СтрокаДанныхПечати.Вставить("Получатель", "");
			СтрокаДанныхПечати.Вставить("СуммаДохода", ГруппировкаПоСотрудникам.СуммаДохода);
			СтрокаДанныхПечати.Вставить("СуммаВычета", ГруппировкаПоСотрудникам.СуммаВычета);
			СтрокаДанныхПечати.Вставить("СуммаКВыплате", ГруппировкаПоСотрудникам.СуммаКВыплате);
    		// ЗУПК
			СтрокаДанныхПечати.Вставить("ИПН", ГруппировкаПоСотрудникам.ИПН);
			СтрокаДанныхПечати.Вставить("ОПВ", ГруппировкаПоСотрудникам.ОПВ);
			СтрокаДанныхПечати.Вставить("ВОСМС", ГруппировкаПоСотрудникам.ВОСМС);
			СтрокаДанныхПечати.Вставить("СН", ГруппировкаПоСотрудникам.СН);
			СтрокаДанныхПечати.Вставить("СО", ГруппировкаПоСотрудникам.СО);
			СтрокаДанныхПечати.Вставить("ОПВР", ГруппировкаПоСотрудникам.ОПВР);
			СтрокаДанныхПечати.Вставить("ООСМС", ГруппировкаПоСотрудникам.ООСМС);
    		// ЗУПК
			СтрокаДанныхПечати.Вставить("НДФЛ", ГруппировкаПоСотрудникам.НДФЛ);
			СтрокаДанныхПечати.Вставить("Удержано", ГруппировкаПоСотрудникам.Удержано);
			
			ДанныеФизическогоЛица = КадровыйУчет.КадровыеДанныеФизическихЛиц(
				Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ГруппировкаПоСотрудникам.ФизическоеЛицо), 
				"ФИОПолные,Пол", ГруппировкаПоДокументу.Дата);
			
			Если ДанныеФизическогоЛица.Количество() > 0 Тогда
				СтрокаДанныхПечати.Получатель = ДанныеФизическогоЛица[0].ФИОПолные;
			КонецЕсли;
			
			ДанныеПечати.ТабличнаяЧастьДокумента.Добавить(СтрокаДанныхПечати);
			
    		// ЗУПК
			Если ГруппировкаПоСотрудникам.ИПН <> 0 И НЕ ДанныеПечати.ЕстьИПН Тогда
				ДанныеПечати.ЕстьИПН = Истина;
			КонецЕсли;
			Если ГруппировкаПоСотрудникам.ОПВ <> 0 И НЕ ДанныеПечати.ЕстьОПВ Тогда
				ДанныеПечати.ЕстьОПВ = Истина;
			КонецЕсли;
			Если ГруппировкаПоСотрудникам.ВОСМС <> 0 И НЕ ДанныеПечати.ЕстьВОСМС Тогда
				ДанныеПечати.ЕстьВОСМС = Истина;
			КонецЕсли;
			Если ГруппировкаПоСотрудникам.СН <> 0 И НЕ ДанныеПечати.ЕстьСН Тогда
				ДанныеПечати.ЕстьСН = Истина;
			КонецЕсли;
			Если ГруппировкаПоСотрудникам.СО <> 0 И НЕ ДанныеПечати.ЕстьСО Тогда
				ДанныеПечати.ЕстьСО = Истина;
			КонецЕсли;
			Если ГруппировкаПоСотрудникам.ОПВР <> 0 И НЕ ДанныеПечати.ЕстьОПВР Тогда
				ДанныеПечати.ЕстьОПВР = Истина;
			КонецЕсли;
			Если ГруппировкаПоСотрудникам.ООСМС <> 0 И НЕ ДанныеПечати.ЕстьООСМС Тогда
				ДанныеПечати.ЕстьООСМС = Истина;
			КонецЕсли;
    		// ЗУПК
			
		КонецЦикла;
		
		ДанныеПечатиОбъектов.Вставить(ГруппировкаПоДокументу.Ссылка, ДанныеПечати);
		
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

// ЗУПК
Процедура ВывестиКолонки(Макет, ДокументРезультат, ИмяОбласти, ДанныеДокумента, ДанныеСотрудника = Неопределено)
	
	ОбластьМакетПолучатель = Макет.ПолучитьОбласть(ИмяОбласти + "|Получатель");
	ОбластьМакетСуммаДохода = Макет.ПолучитьОбласть(ИмяОбласти + "|СуммаДохода");
	ОбластьМакетИПН = Макет.ПолучитьОбласть(ИмяОбласти + "|НалогВзнос");
	ОбластьМакетОПВ = Макет.ПолучитьОбласть(ИмяОбласти + "|НалогВзнос");
	ОбластьМакетВОСМС = Макет.ПолучитьОбласть(ИмяОбласти + "|НалогВзнос");
	ОбластьМакетСН = Макет.ПолучитьОбласть(ИмяОбласти + "|НалогВзнос");
	ОбластьМакетСО = Макет.ПолучитьОбласть(ИмяОбласти + "|НалогВзнос");
	ОбластьМакетОПВР = Макет.ПолучитьОбласть(ИмяОбласти + "|НалогВзнос");
	ОбластьМакетООСМС = Макет.ПолучитьОбласть(ИмяОбласти + "|НалогВзнос");
	ОбластьМакетУдержано = Макет.ПолучитьОбласть(ИмяОбласти + "|Удержано");
	ОбластьМакетКВыплате = Макет.ПолучитьОбласть(ИмяОбласти + "|КВыплате");
	
	Если ДанныеСотрудника = Неопределено Тогда
		НомерКолонки = 1;
		ОбластьМакетПолучатель.Параметры.ПолучательНомерКолонки = НомерКолонки;
		НомерКолонки = НомерКолонки + 1;
		ОбластьМакетСуммаДохода.Параметры.СуммаДоходаНомерКолонки = НомерКолонки;
		НомерКолонки = НомерКолонки + 1;
		Если ДанныеДокумента.ЕстьИПН Тогда
			ОбластьМакетИПН.Параметры.НалогВзносНаименование = НСтр("ru = 'ИПН'");
			ОбластьМакетИПН.Параметры.НалогВзносНомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьОПВ Тогда
			ОбластьМакетОПВ.Параметры.НалогВзносНаименование = НСтр("ru = 'ОПВ'");
			ОбластьМакетОПВ.Параметры.НалогВзносНомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьВОСМС Тогда
			ОбластьМакетВОСМС.Параметры.НалогВзносНаименование = НСтр("ru = 'ВОСМС'");
			ОбластьМакетВОСМС.Параметры.НалогВзносНомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьСН Тогда
			ОбластьМакетСН.Параметры.НалогВзносНаименование = НСтр("ru = 'СН'");
			ОбластьМакетСН.Параметры.НалогВзносНомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьСО Тогда
			ОбластьМакетСО.Параметры.НалогВзносНаименование = НСтр("ru = 'СО'");
			ОбластьМакетСО.Параметры.НалогВзносНомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьОПВР Тогда
			ОбластьМакетОПВР.Параметры.НалогВзносНаименование = НСтр("ru = 'ОПВР'");
			ОбластьМакетОПВР.Параметры.НалогВзносНомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьООСМС Тогда
			ОбластьМакетООСМС.Параметры.НалогВзносНаименование = НСтр("ru = 'ООСМС'");
			ОбластьМакетООСМС.Параметры.НалогВзносНомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		ОбластьМакетУдержано.Параметры.УдержаноНомерКолонки = НомерКолонки;
		НомерКолонки = НомерКолонки + 1;
		ОбластьМакетКВыплате.Параметры.КВыплатеНомерКолонки = НомерКолонки;
	Иначе
		ОбластьМакетПолучатель.Параметры.Заполнить(ДанныеСотрудника);
		ОбластьМакетСуммаДохода.Параметры.Заполнить(ДанныеСотрудника);
		Если ДанныеДокумента.ЕстьИПН Тогда
			ОбластьМакетИПН.Параметры.НалогВзнос = ДанныеСотрудника.ИПН;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьОПВ Тогда
			ОбластьМакетОПВ.Параметры.НалогВзнос = ДанныеСотрудника.ОПВ;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьВОСМС Тогда
			ОбластьМакетВОСМС.Параметры.НалогВзнос = ДанныеСотрудника.ВОСМС;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьСН Тогда
			ОбластьМакетСН.Параметры.НалогВзнос = ДанныеСотрудника.СН;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьСО Тогда
			ОбластьМакетСО.Параметры.НалогВзнос = ДанныеСотрудника.СО;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьОПВР Тогда
			ОбластьМакетОПВР.Параметры.НалогВзнос = ДанныеСотрудника.ОПВР;
		КонецЕсли;
		Если ДанныеДокумента.ЕстьООСМС Тогда
			ОбластьМакетООСМС.Параметры.НалогВзнос = ДанныеСотрудника.ООСМС;
		КонецЕсли;
		ОбластьМакетУдержано.Параметры.Заполнить(ДанныеСотрудника);
		ОбластьМакетКВыплате.Параметры.Заполнить(ДанныеСотрудника);
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьМакетПолучатель);
	ДокументРезультат.Присоединить(ОбластьМакетСуммаДохода);
	Если ДанныеДокумента.ЕстьИПН Тогда
		ДокументРезультат.Присоединить(ОбластьМакетИПН);
	КонецЕсли;
	Если ДанныеДокумента.ЕстьОПВ Тогда
		ДокументРезультат.Присоединить(ОбластьМакетОПВ);
	КонецЕсли;
	Если ДанныеДокумента.ЕстьВОСМС Тогда
		ДокументРезультат.Присоединить(ОбластьМакетВОСМС);
	КонецЕсли;
	Если ДанныеДокумента.ЕстьСН Тогда
		ДокументРезультат.Присоединить(ОбластьМакетСН);
	КонецЕсли;
	Если ДанныеДокумента.ЕстьСО Тогда
		ДокументРезультат.Присоединить(ОбластьМакетСО);
	КонецЕсли;
	Если ДанныеДокумента.ЕстьОПВР Тогда
		ДокументРезультат.Присоединить(ОбластьМакетОПВР);
	КонецЕсли;
	Если ДанныеДокумента.ЕстьООСМС Тогда
		ДокументРезультат.Присоединить(ОбластьМакетООСМС);
	КонецЕсли;
	ДокументРезультат.Присоединить(ОбластьМакетУдержано);
	ДокументРезультат.Присоединить(ОбластьМакетКВыплате);
	
КонецПроцедуры
// ЗУПК

#КонецОбласти

Функция ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект) Экспорт
	
	Возврат УчетПрочихДоходов.ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект);
	
КонецФункции

#КонецОбласти

#КонецЕсли