#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

// Начальное заполнение и обновление информационной базы.
Процедура НачальноеЗаполнение() Экспорт
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст());
КонецПроцедуры

// Заполняет ставки рефинансирования Центрального Банка Российской Федерации.
Процедура Обновить(ТекстXML) Экспорт
	ЗарплатаКадры.ОбновитьКлассификатор(ТекстXML);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать процедуру НачальноеЗаполнение.
Процедура ЗаполнитьЗначенияСтавкиРефинансированияЦБ() Экспорт
	НачальноеЗаполнение();
КонецПроцедуры

#КонецОбласти

#Область СервисКлассификаторов

Процедура ОбновитьИзСервиса(Идентификатор, ДанныеКлассификатора) Экспорт
	
	Если Идентификатор <> ИдентификаторКлассификатора() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбработанныеДанные = ОбработанныеДанные(ДанныеКлассификатора); 	
		РанняяДатаВКлассификаторе = РанняяДатаВКлассификаторе(ОбработанныеДанные); 
		СохраняемыйНабор = СохраняемыйНабор(РанняяДатаВКлассификаторе);
		
		НаборЗаписей = РегистрыСведений.СтавкаРефинансированияЦБ.СоздатьНаборЗаписей(); 	
		
		Для Каждого Элемент Из СохраняемыйНабор Цикл 
							
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Элемент);
								
		КонецЦикла;
		
		Для Каждого Элемент Из ОбработанныеДанные Цикл 
							
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Элемент);
								
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
						
		Обработан = Истина;
	Исключение
		Обработан = Ложь;
		
		ЗаписьЖурналаРегистрации("ЗагрузкаКлассификатора",
			УровеньЖурналаРегистрации.Ошибка, РегистрыСведений.СтавкаРефинансированияЦБ,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ИдентификаторКлассификатора() Экспорт
	
	Возврат "CentralBankRefinancingRateKz";
	
КонецФункции 

Функция ОбработанныеДанные(ДанныеИзСервиса)
	
	Данные = Новый Массив; 
	
	Для Каждого Элемент Из ДанныеИзСервиса Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Период", ПрочитатьДатуJSON(Элемент.refinanceDate, ФорматДатыJSON.ISO));
		СтруктураДанных.Вставить("Размер", Элемент.refinanceBasicRate); 
		
		Данные.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция РанняяДатаВКлассификаторе(Данные)
	
	МинимальнаяДата = Неопределено;
	Для Каждого Элемент Из Данные Цикл
		Если МинимальнаяДата = Неопределено Тогда
			МинимальнаяДата = Элемент.Период;
		КонецЕсли;
		Если Элемент.Период < МинимальнаяДата Тогда
			МинимальнаяДата = Элемент.Период;
		КонецЕсли;
	КонецЦикла;

	Возврат МинимальнаяДата;
	
КонецФункции  

Функция СохраняемыйНабор(Дата) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтавкаРефинансированияЦБ.Период КАК Период,
		|	СтавкаРефинансированияЦБ.Размер КАК Размер
		|ИЗ
		|	РегистрСведений.СтавкаРефинансированияЦБ КАК СтавкаРефинансированияЦБ
		|ГДЕ
		|	СтавкаРефинансированияЦБ.Период < &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();		
	УстановитьПривилегированныйРежим(Ложь); 
	
	СохраняемыйНабор = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДанныеНабора = Новый Структура; 
		ДанныеНабора.Вставить("Период", Выборка.Период);
		ДанныеНабора.Вставить("Размер", Выборка.Размер);
		
		СохраняемыйНабор.Добавить(ДанныеНабора);
	КонецЦикла;

	Возврат СохраняемыйНабор; 
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли