#Область ПрограммныйИнтерфейс

Функция АдресТестовогоСтенда() Экспорт
	
	Возврат "test-etd.1capp.kz";
	
КонецФункции

Функция АдресПродуктивногоСтенда() Экспорт
	
	Возврат "etd.1capp.kz";
	
КонецФункции

Функция ПроверкаСтатусаСервиса(Адрес, СтрокаЗапроса) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат ЭТДВызовСервера.ПроверкаСтатусаСервиса(Адрес, СтрокаЗапроса);
	#Иначе
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		
		Соединение = Новый HTTPСоединение(Адрес,443,,,,1,ЗащищенноеСоединение);
		
		Запрос = Новый HTTPЗапрос(СтрокаЗапроса);
		Запрос.Заголовки.Вставить("Content-type", "application/json");
		
		Попытка
			Ответ = Соединение.Получить(Запрос);
		Исключение
			Возврат Ложь;
		КонецПопытки;

		Если Ответ.КодСостояния = 200 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	#КонецЕсли
	
КонецФункции

Процедура ЗаполнитьУсловияТруда(УсловияТруда, УсловиеЗначение) Экспорт
	
	УсловияТруда.Очистить();
	
	СтрокаУсловийТруда = УсловияТруда.Добавить();
	СтрокаУсловийТруда.УсловиеТруда = УсловиеЗначение;
	
КонецПроцедуры

Функция ЭТД_ЗаписатьЗначениеJSON(Значение) Экспорт
	
	Результат = Неопределено;
	#Если ВебКлиент Тогда
		Результат = ЭТДВызовСервера.ЭТД_ЗаписатьЗначениеJSON(Значение);
	#Иначе
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, Значение);
		Результат = Запись.Закрыть();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

Функция ЭТД_ПрочитатьЗначениеJSON(Значение, СвойстваДаты = "") Экспорт
	
	Результат = Неопределено;
	#Если ВебКлиент Тогда
		Результат = ЭТДВызовСервера.ЭТД_ПрочитатьЗначениеJSON(Значение, СвойстваДаты);
	#Иначе
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Значение);
		Результат = ПрочитатьJSON(Чтение, Ложь, СвойстваДаты);
		Чтение.Закрыть();
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

#Область Криптобиблиотека

Функция ПодготовитьПараметрыКлючаДляПодписи(ДанныеКлючаЭЦП) Экспорт
	
	ПараметрыКлюча = Неопределено;
	Если ЭТДВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
		ПараметрыКлюча = Новый Структура;
		ПараметрыКлюча.Вставить("АдресКлюча" , ДанныеКлючаЭЦП.АдресКлюча);
		ПараметрыКлюча.Вставить("ПарольКлюча", ДанныеКлючаЭЦП.Пароль);
	Иначе
		ПараметрыКлюча = ЭТДВызовСервера.СохранитьКлючВФайл(ДанныеКлючаЭЦП);
	КонецЕсли;
	
	Возврат ПараметрыКлюча;
	
КонецФункции

Функция СохранитьКлючВФайл(ДанныеКлючаЭЦП) Экспорт
	
	ПараметрыКлюча = Неопределено;
	
	#Если Не ВебКлиент Тогда
		ДвоичныеДанныеКлюча = Base64Значение(ДанныеКлючаЭЦП.КлючBase64);
		ИмяФайлаКлюча = ПолучитьИмяВременногоФайла("p12");
		ДвоичныеДанныеКлюча.Записать(ИмяФайлаКлюча);
		ПараметрыКлюча = Новый Структура;
		ПараметрыКлюча.Вставить("АдресКлюча" , ИмяФайлаКлюча);
		ПараметрыКлюча.Вставить("ПарольКлюча", ДанныеКлючаЭЦП.Пароль);
	#КонецЕсли
	
	Возврат ПараметрыКлюча;
	
КонецФункции
 
Процедура УдалитьВременныйФайлКлюча(ДанныеКлючаЭЦП) Экспорт
	// временный файл только на сервере
	Если НЕ ЭТДВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте() Тогда
		ЭТДВызовСервера.УдалитьФайлКлюча(ДанныеКлючаЭЦП);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьФайлКлюча(ДанныеКлючаЭЦП) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеКлючаЭЦП) И ДанныеКлючаЭЦП.Свойство("АдресКлюча") Тогда
		УдалитьВременныеФайлы(ДанныеКлючаЭЦП.АдресКлюча);
	КонецЕсли;
	
КонецПроцедуры 

Процедура УдалитьВременныеФайлы(ПутьКФайлам) Экспорт
	
	Попытка
		УдалитьФайлы(ПутьКФайлам);
	Исключение
		ЗаписьЖурналаРегистрацииОшибкаУдаленияФайла(ПутьКФайлам, ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьПараметрыВзаимодействияКриптопровайдера(ИдентификаторКлиента, ДанныеXML, ПараметрыКлюча = Неопределено) Экспорт
	
	ПараметрыExtras = ЭлектронноеВзаимодействиеССервисамиВызовСервера.ПолучитьПараметрыКомпонентыЭТД(ИдентификаторКлиента, ДанныеXML, ПараметрыКлюча);
	
	ПараметрыВзаимодействия = КриптографияКлиентСервер.ПолучитьПараметрыВзаимодействияКриптопровайдера();
	ПараметрыВзаимодействия.ИдентификаторКлиента = ИдентификаторКлиента;
	ПараметрыВзаимодействия.ДополнительныеПараметры = ПараметрыExtras;
	
	Возврат ПараметрыВзаимодействия;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Криптобиблиотека

Процедура ЗаписьЖурналаРегистрацииОшибкаУдаленияФайла(ИмяФайла, ИнформацияОбОшибке)
	
	Комментарий = НСтр(
		"ru = 'Не удалось удалить файл %ИмяФайла% по причине:
		|
		|%ПодробноеПредставлениеОшибки%'");
		
	Комментарий = СтрЗаменить(Комментарий, "%ИмяФайла%", ИмяФайла);
	Комментарий = СтрЗаменить(Комментарий, "%ПодробноеПредставлениеОшибки%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	ЭТДВызовСервера.СоздатьЗаписьЖурналаРегистрации("ЭТДКлиентСервер.УдалитьВременныеФайлы", "Ошибка", , , Комментарий);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
