#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Работники.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.СведенияДляФРМР;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура ПодготовитьДанныеДляЗаполнения(Параметры, АдресХранилища) Экспорт	
		
	Организация 		= Параметры.Организация;
	ДатаАктуальности 	= Параметры.ДатаАктуальности;
	ДанныеДляЗаполнения = Параметры.ДанныеДляЗаполнения;
	СписокРаботников 	= Параметры.СписокРаботников;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	
	// Выявляем сотрудников, для которых будет выполняться заполнение документа.
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	Если СписокРаботников=Неопределено Или СписокРаботников.Количество()=0 Тогда
		ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц = Неопределено;
	Иначе 
		ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц = Новый ФиксированныйМассив(СписокРаботников);
	КонецЕсли;
	ПараметрыПолученияСотрудниковОрганизаций.Организация 					= Организация;
	ПараметрыПолученияСотрудниковОрганизаций.ОтбиратьПоГоловнойОрганизации 	= Ложь;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода				= ДатаАктуальности;
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоТрудовымДоговорам 	= Истина;
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоДоговорамГПХ 		= Неопределено;
	ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные = "ДатаУвольнения,Должность";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций, "ВТСотрудникиОрганизацииДляФильтра");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// Выбираем физические лица, которые ещё не уволены на дату выгрузки или уже выгружались раньше - чтобы выгрузить факт их увольнения.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиОрганизацииДляФильтра.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СотрудникиОрганизацииДляФильтра.Период КАК Период,
	|	МАКСИМУМ(СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью) КАК ЯвляетсяМедработником
	|ПОМЕСТИТЬ ВТРаботникиОрганизации
	|ИЗ
	|	ВТСотрудникиОрганизацииДляФильтра КАК СотрудникиОрганизацииДляФильтра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
	|		ПО СотрудникиОрганизацииДляФильтра.Должность = СвойстваДолжностейМедицинскихРаботников.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	|		ПО СотрудникиОрганизацииДляФильтра.ФизическоеЛицо = ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект
	|ГДЕ
	|	(СотрудникиОрганизацииДляФильтра.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ СотрудникиОрганизацииДляФильтра.ДатаУвольнения >= НАЧАЛОПЕРИОДА(СотрудникиОрганизацииДляФильтра.Период, МЕСЯЦ)
	|			ИЛИ ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиОрганизацииДляФильтра.ФизическоеЛицо,
	|	СотрудникиОрганизацииДляФильтра.Период";
	
	Запрос.Выполнить();
	
#Область ЛичноеДело

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	ВТСотрудникиОрганизацииДляФильтра КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаботникиОрганизации КАК РаботникиОрганизации
	|		ПО Сотрудники.Сотрудник.ФизическоеЛицо = РаботникиОрганизации.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
	ПараметрыРеестра = КадровыйУчетРасширенный.ПараметрыПостроенияВТРеестрКадровыхПриказовПоВременнойТаблице();
	ПараметрыРеестра.ИмяВТОтборовСотрудников = "ВТСотрудники";
	
	ПараметрыРеестра.ВключатьСобытияИзменениеОплатыТруда = Ложь;
	ПараметрыРеестра.ВключатьСобытияУвольнений = Истина;
	КадровыйУчетРасширенный.СоздатьВТРеестрКадровыхПриказов(МенеджерВременныхТаблиц, Истина, ПараметрыРеестра, "ВТДанныеИзРеестра");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(КадроваяИсторияСотрудников.Период) КАК Период,
	|	ДанныеИзРеестра.Сотрудник КАК Сотрудник,
	|	ДанныеИзРеестра.Период КАК Дата
	|ПОМЕСТИТЬ ВТМаксимальныеПериодыКадровойИстории
	|ИЗ
	|	ВТДанныеИзРеестра КАК ДанныеИзРеестра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
	|		ПО ДанныеИзРеестра.Период <= КадроваяИсторияСотрудников.Период
	|			И ДанныеИзРеестра.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеИзРеестра.Сотрудник,
	|	ДанныеИзРеестра.Период";
	
	Запрос.Выполнить();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"КадроваяИсторияСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТМаксимальныеПериодыКадровойИстории", "Сотрудник"));
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ВидыЗанятостиСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТМаксимальныеПериодыКадровойИстории", "Сотрудник"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудников.КоличествоСтавок КАК КоличествоСтавок,
	|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	ВТМаксимальныеПериодыКадровойИстории.Дата КАК Дата,
	|	ВидыЗанятостиСотрудников.ВидЗанятости КАК ВидЗанятости
	|ПОМЕСТИТЬ ВТДополнительныеДанныеИзКадровойИстории
	|ИЗ
	|	ВТМаксимальныеПериодыКадровойИстории КАК ВТМаксимальныеПериодыКадровойИстории
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадроваяИсторияСотрудниковСрезПоследних КАК КадроваяИсторияСотрудников
	|		ПО ВТМаксимальныеПериодыКадровойИстории.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
	|			И ВТМаксимальныеПериодыКадровойИстории.Период = КадроваяИсторияСотрудников.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыЗанятостиСотрудниковСрезПоследних КАК ВидыЗанятостиСотрудников
	|		ПО ВТМаксимальныеПериодыКадровойИстории.Сотрудник = ВидыЗанятостиСотрудников.Сотрудник
	|			И ВТМаксимальныеПериодыКадровойИстории.Период = ВидыЗанятостиСотрудников.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзРеестра.Сотрудник КАК Сотрудник,
	|	ВТДополнительныеДанныеИзКадровойИстории.ВидЗанятости КАК ВидЗанятости,
	|	ДанныеИзРеестра.ВидСобытия КАК ВидСобытия,
	|	ВТДополнительныеДанныеИзКадровойИстории.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеИзРеестра.Должность ССЫЛКА Справочник.Должности
	|			ТОГДА ЕСТЬNULL(Должности.Ссылка, ДанныеИзРеестра.Должность)
	|		ИНАЧЕ ДанныеИзРеестра.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА НЕ ДанныеИзРеестра.Подразделение ССЫЛКА Справочник.ПодразделенияОрганизаций
	|			ТОГДА ЕСТЬNULL(ПодразделенияОрганизаций.Ссылка, ДанныеИзРеестра.Подразделение)
	|		ИНАЧЕ ДанныеИзРеестра.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВТДополнительныеДанныеИзКадровойИстории.КоличествоСтавок КАК КоличествоСтавок,
	|	ДанныеИзРеестра.ДокументОснование КАК ДокументОснование,
	|	ДанныеИзРеестра.НомерПриказа КАК НомерПриказаНачалаЗаписи,
	|	ДанныеИзРеестра.Период КАК ПериодЗаписи
	|ИЗ
	|	ВТДанныеИзРеестра КАК ДанныеИзРеестра
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеДанныеИзКадровойИстории КАК ВТДополнительныеДанныеИзКадровойИстории
	|		ПО ДанныеИзРеестра.Сотрудник = ВТДополнительныеДанныеИзКадровойИстории.Сотрудник
	|			И ДанныеИзРеестра.Период = ВТДополнительныеДанныеИзКадровойИстории.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО ДанныеИзРеестра.Должность = Должности.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ПО ДанныеИзРеестра.Подразделение = ПодразделенияОрганизаций.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ПериодЗаписи";
	
	ТаблицаПериодов = Запрос.Выполнить().Выгрузить();
	
	МетаданныеДокумента = Параметры.Ссылка.Метаданные();
	РеквизитыТЧ = МетаданныеДокумента.ТабличныеЧасти.ЛичноеДело.Реквизиты;
	
	ТаблицаПериодов.Колонки.Добавить("ПериодОкончания", Новый ОписаниеТипов("Дата"));
	ТаблицаПериодов.Колонки.Добавить("ВидСобытияОкончания", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКадровыхСобытий"));
	
	ТекСотрудник = Неопределено;
	Для Каждого СтрокаТаблицыПериодов Из ТаблицаПериодов Цикл
		Если СтрокаТаблицыПериодов.Сотрудник <> ТекСотрудник Тогда
			ТекСотрудник = СтрокаТаблицыПериодов.Сотрудник;
		Иначе
			ПредыдущаяСтрока = ТаблицаПериодов[ТаблицаПериодов.Индекс(СтрокаТаблицыПериодов) - 1];
			Если СтрокаТаблицыПериодов.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
				ПредыдущаяСтрока.ПериодОкончания = СтрокаТаблицыПериодов.ПериодЗаписи;
			Иначе
				ПредыдущаяСтрока.ПериодОкончания = НачалоДня(СтрокаТаблицыПериодов.ПериодЗаписи) - 1;
			КонецЕсли;
			ПредыдущаяСтрока.ВидСобытияОкончания = СтрокаТаблицыПериодов.ВидСобытия;   				
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПериодов.Сотрудник КАК Сотрудник,
	               |	ТаблицаПериодов.ВидЗанятости КАК ВидЗанятости,
	               |	ТаблицаПериодов.ВидСобытия КАК ВидСобытия,
	               |	ТаблицаПериодов.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	               |	ТаблицаПериодов.Подразделение КАК Подразделение,
	               |	ТаблицаПериодов.Должность КАК Должность,
	               |	ТаблицаПериодов.КоличествоСтавок КАК КоличествоСтавок,
	               |	ТаблицаПериодов.ДокументОснование КАК ДокументОснование,
	               |	ТаблицаПериодов.НомерПриказаНачалаЗаписи КАК НомерПриказаНачалаЗаписи,
	               |	ТаблицаПериодов.ПериодЗаписи КАК ПериодЗаписи,
	               |	ТаблицаПериодов.ПериодОкончания КАК ПериодОкончания,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТаблицаПериодов.ПериодОкончания, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА &ДатаАктуальности
	               |		ИНАЧЕ ТаблицаПериодов.ПериодОкончания
	               |	КОНЕЦ КАК ПериодОкончанияЗаполненный,
	               |	ТаблицаПериодов.ВидСобытияОкончания КАК ВидСобытияОкончания
	               |ПОМЕСТИТЬ ВТКадровыеПериодыРаботы
	               |ИЗ
	               |	&ТаблицаПериодов КАК ТаблицаПериодов
	               |ГДЕ
	               |	ТаблицаПериодов.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("ТаблицаПериодов", ТаблицаПериодов);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТКадровыеПериодыРаботы.ПериодОкончания, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &ДатаАктуальности
	|		ИНАЧЕ ВТКадровыеПериодыРаботы.ПериодОкончания
	|	КОНЕЦ КАК Период,
	|	ВТКадровыеПериодыРаботы.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТОтборовСотрудников
	|ИЗ
	|	ВТКадровыеПериодыРаботы КАК ВТКадровыеПериодыРаботы
	|ГДЕ
	|	ВТКадровыеПериодыРаботы.ПериодЗаписи <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц,
			"ВТОтборовСотрудников",
			"Сотрудник,Период");
	
	ПереченьИнформацииОСотруднике = "Фамилия,ТабельныйНомер,Подразделение,Должность,ЯвляетсяМедицинскойДолжностью,Специальность,
	|ВидЗанятости,ВидСобытия,КоличествоСтавок,ВидДоговора,ДатаДоговораКонтракта,НомерДоговораКонтракта,ПриказОбУвольненииСтатьяТКРФ";

	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, ПереченьИнформацииОСотруднике);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадровыеДанныеСотрудников.Фамилия КАК Фамилия,
	|	ИдентификаторыПодразделений.Идентификатор КАК ИдентификаторПодразделения,
	|	ИдентификаторыПодразделений.Наименование КАК НаименованиеПодразделения,
	|	ХарактеристикиТипПодразделенияПоМедРегистру.Характеристика.Код КАК ТипПодразделенияКод,
	|	ИдентификаторыПодразделений.ДополнительныйИдентификатор КАК ИдентификаторОтделенияИлиКабинета,
	|	ИдентификаторыПодразделений.ДополнительноеНаименование КАК НаименованиеОтделенияИлиКабинета,
	|	КадровыеДанныеСотрудников.НомерДоговораКонтракта КАК ТрудовойДоговорНомер,
	|	КадровыеДанныеСотрудников.ДатаДоговораКонтракта КАК ТрудовойДоговорДата,
	|	КадровыеДанныеСотрудников.ТабельныйНомер КАК ТабельныйНомер,
	|	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика.Код КАК ДолжностьПоФедСправочникуКод,
	|	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика.НаименованиеПолное КАК ДолжностьПоФедСправочникуНаименование,
	|	ХарактеристикиТипЗанятияДолжностиПоМедРегистру.Характеристика.Код КАК ТипЗанятияДолжностиКод,
	|	ХарактеристикиТипЗанятияДолжностиПоМедРегистру.Характеристика.НаименованиеПолное КАК ТипЗанятияДолжностиНаименование,
	|	ХарактеристикиОказываемыеМедУслугиПоМедРегистру.Характеристика.Код КАК ОказываемыеМедУслугиКод,
	|	ХарактеристикиОказываемыеМедУслугиПоМедРегистру.Характеристика.НаименованиеПолное КАК ОказываемыеМедУслугиНаименование,
	|	ХарактеристикиДолжностьПоМедРегистру.Характеристика.Код КАК ДолжностьКод,
	|	ХарактеристикиДолжностьПоМедРегистру.Характеристика.НаименованиеПолное КАК ДолжностьНаименование,
	|	КадровыеДанныеСотрудников.КоличествоСтавок КАК КоличествоСтавок,
	|	КадровыеПериодыРаботы.ПериодЗаписи КАК ДатаНачалаЗаписи,
	|	КадровыеПериодыРаботы.ПериодОкончания КАК ДатаОкончанияЗаписи,
	|	КадровыеПериодыРаботы.ВидСобытияОкончания КАК ВидСобытияОкончания,
	|	ХарактеристикиОснованиеОкончанияПоМедРегистру.Характеристика.Код КАК ОснованиеОкончанияКод,
	|	ХарактеристикиОснованиеОкончанияПоМедРегистру.Характеристика.НаименованиеПолное КАК ОснованиеОкончанияНаименование,
	|	ХарактеристикиПричинаУвольненияПоМедРегистру.Характеристика.Код КАК ПричинаУвольненияКод,
	|	ХарактеристикиПричинаУвольненияПоМедРегистру.Характеристика.НаименованиеПолное КАК ПричинаУвольненияНаименование,
	|	ЛОЖЬ КАК ЦелеваяПодготовка
	|ИЗ
	|	ВТКадровыеПериодыРаботы КАК КадровыеПериодыРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО КадровыеПериодыРаботы.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|			И КадровыеПериодыРаботы.ПериодОкончанияЗаполненный = КадровыеДанныеСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыПодразделений
	|		ПО (КадровыеДанныеСотрудников.Подразделение = ИдентификаторыПодразделений.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипПодразделенияПоМедРегистру
	|		ПО (ХарактеристикиТипПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипПодразделения)
	|			И (КадровыеДанныеСотрудников.Подразделение = ХарактеристикиТипПодразделенияПоМедРегистру.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру
	|		ПО (ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжностьПоФедСправочнику)
	|			И (КадровыеДанныеСотрудников.Должность = ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОказываемыеМедУслугиПоМедРегистру
	|		ПО (ХарактеристикиОказываемыеМедУслугиПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторОказываемыеМедУслуги)
	|			И (КадровыеДанныеСотрудников.Должность = ХарактеристикиОказываемыеМедУслугиПоМедРегистру.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоМедРегистру
	|		ПО (ХарактеристикиДолжностьПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжность)
	|			И (КадровыеДанныеСотрудников.Должность = ХарактеристикиДолжностьПоМедРегистру.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипЗанятияДолжностиПоМедРегистру
	|		ПО (ХарактеристикиТипЗанятияДолжностиПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипЗанятияДолжности)
	|			И (КадровыеДанныеСотрудников.ВидЗанятости = ХарактеристикиТипЗанятияДолжностиПоМедРегистру.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОснованиеОкончанияПоМедРегистру
	|		ПО (ХарактеристикиОснованиеОкончанияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторОснованиеОкончания)
	|			И КадровыеПериодыРаботы.ВидСобытияОкончания = ХарактеристикиОснованиеОкончанияПоМедРегистру.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиПричинаУвольненияПоМедРегистру
	|		ПО (КадровыеДанныеСотрудников.ПриказОбУвольненииСтатьяТКРФ = ХарактеристикиПричинаУвольненияПоМедРегистру.Объект)
	|			И (ХарактеристикиПричинаУвольненияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторОснованияУвольнения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	ТабельныйНомер,
	|	ДатаНачалаЗаписи";
	
	Запрос.УстановитьПараметр("КлассификаторТипПодразделения", "1.2.643.5.1.13.13.99.2.299");
	Запрос.УстановитьПараметр("КлассификаторДолжностьПоФедСправочнику", "1.2.643.5.1.13.13.99.2.885");
	Запрос.УстановитьПараметр("КлассификаторДолжность", "1.2.643.5.1.13.13.99.2.181");
	Запрос.УстановитьПараметр("КлассификаторТипЗанятияДолжности", "1.2.643.5.1.13.13.99.2.357");
	Запрос.УстановитьПараметр("КлассификаторОснованиеОкончания", "1.2.643.5.1.13.13.99.2.282");
	Запрос.УстановитьПараметр("КлассификаторОснованияУвольнения", "1.2.643.5.1.13.13.99.2.196");
	Запрос.УстановитьПараметр("КлассификаторОказываемыеМедУслуги", "1.2.643.5.1.13.13.99.2.319");
	
	ДанныеДляЗаполнения.ЛичноеДело = Запрос.Выполнить().Выгрузить();

#КонецОбласти // ЛичноеДело

#Область ОбщиеДанныеРаботников
	
	ОписательВременныхТаблиц = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
			МенеджерВременныхТаблиц,
			"ВТРаботникиОрганизации");
	
	ПереченьИнформацииОРаботнике = "Фамилия,Имя,Отчество,ДатаРождения,
	|Страна,СтраховойНомерПФР,ИНН,Пол,ВоинскийУчетОтношениеКВоинскойОбязанности,
	|АдресПоПропискеПредставление,АдресПоПрописке,ДатаРегистрации,
	|АдресМестаПроживания,АдресМестаПроживанияПредставление,
	|EMail,EMailПредставление,
	|ТелефонДомашний,ТелефонДомашнийПредставление,ТелефонМобильный,ТелефонМобильныйПредставление";
	
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, ПереченьИнформацииОРаботнике);	
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадровыеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	КадровыеДанные.Фамилия КАК Фамилия,
	               |	КадровыеДанные.Имя КАК Имя,
	               |	КадровыеДанные.Отчество КАК Отчество,
	               |	КадровыеДанные.Пол КАК Пол,
	               |	КадровыеДанные.ДатаРождения КАК ДатаРождения,
	               |	КадровыеДанные.СтраховойНомерПФР КАК СтраховойНомерПФР,
	               |	КадровыеДанные.ИНН КАК ИНН,
	               |	ХарактеристикиОтношенияКВоеннойСлужбеПоМедРегистру.Характеристика.Код КАК ОтношениеКВоинскойОбязанностиКод,
	               |	ХарактеристикиОтношенияКВоеннойСлужбеПоМедРегистру.Характеристика.НаименованиеПолное КАК ОтношениеКВоинскойОбязанностиНаименование,
	               |	ЕСТЬNULL(КадровыеДанные.ТелефонМобильный, КадровыеДанные.ТелефонДомашний) КАК НомерТелефона,
	               |	ЕСТЬNULL(КадровыеДанные.ТелефонМобильныйПредставление, КадровыеДанные.ТелефонДомашнийПредставление) КАК НомерТелефонаПредставление,
	               |	КадровыеДанные.EMail КАК АдресЭлектроннойПочты,
	               |	КадровыеДанные.EMailПредставление КАК АдресЭлектроннойПочтыПредставление,
	               |	КадровыеДанные.АдресПоПрописке КАК АдресПостояннойРегистрации,
	               |	КадровыеДанные.АдресПоПропискеПредставление КАК АдресПостояннойРегистрацииПредставление,
	               |	КадровыеДанные.ДатаРегистрации КАК ДатаРегистрации,
	               |	КадровыеДанные.АдресМестаПроживания КАК АдресМестаПроживания,
	               |	КадровыеДанные.АдресМестаПроживанияПредставление КАК АдресМестаПроживанияПредставление,
	               |	ВЫБОР
	               |		КОГДА КадровыеДанные.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	               |			ТОГДА ""1""
	               |		КОГДА ЕСТЬNULL(КадровыеДанные.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	               |			ТОГДА ""4""
	               |		ИНАЧЕ ""3""
	               |	КОНЕЦ КАК ГражданствоКод,
	               |	ВЫБОР
	               |		КОГДА КадровыеДанные.Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	               |			ТОГДА &ГражданинРоссииВМедРегистре
	               |		КОГДА ЕСТЬNULL(КадровыеДанные.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	               |			ТОГДА &ЛицоБезГражданстваВМедРегистре
	               |		ИНАЧЕ &ИностранныйГражданинВМедРегистре
	               |	КОНЕЦ КАК ГражданствоНаименование,
	               |	ХарактеристикиСтраныПоМедРегистру.Характеристика.Код КАК СтранаКод,
	               |	ХарактеристикиСтраныПоМедРегистру.Характеристика.НаименованиеПолное КАК СтранаНаименование,
	               |	РаботникиОрганизации.ЯвляетсяМедработником КАК ЯвляетсяМедработником
	               |ИЗ
	               |	ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанные
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаботникиОрганизации КАК РаботникиОрганизации
	               |		ПО КадровыеДанные.ФизическоеЛицо = РаботникиОрганизации.ФизическоеЛицо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСтраныПоМедРегистру
	               |		ПО (ХарактеристикиСтраныПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторОКСМ)
	               |			И КадровыеДанные.Страна = ХарактеристикиСтраныПоМедРегистру.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОтношенияКВоеннойСлужбеПоМедРегистру
	               |		ПО (ХарактеристикиОтношенияКВоеннойСлужбеПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторОтношенияКВоеннойСлужбе)
	               |			И КадровыеДанные.ВоинскийУчетОтношениеКВоинскойОбязанности = ХарактеристикиОтношенияКВоеннойСлужбеПоМедРегистру.Объект";
	
	Запрос.УстановитьПараметр("КлассификаторОКСМ", "1.2.643.5.1.13.2.1.1.63");			   
	Запрос.УстановитьПараметр("КлассификаторОтношенияКВоеннойСлужбе", "1.2.643.5.1.13.2.1.1.203");			   
	
	// Гражданство
	ГражданствоМедРаботников = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НаименованияКатегорийГражданстваМедицинскихРаботников();
	Запрос.УстановитьПараметр("ГражданинРоссииВМедРегистре", ГражданствоМедРаботников.ГражданинРоссии);
	Запрос.УстановитьПараметр("ЛицоБезГражданстваВМедРегистре", ГражданствоМедРаботников.БезГражданства);
	Запрос.УстановитьПараметр("ИностранныйГражданинВМедРегистре", ГражданствоМедРаботников.ИностранныйГражданин);
	
	ДанныеДляЗаполнения.Работники = Запрос.Выполнить().Выгрузить();
	
	// Документы, удостоверяющие личность
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ФормироватьСПериодичностьДень = Ложь;
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТРаботникиОрганизации");
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"ДокументыФизическихЛиц", 
			Запрос.МенеджерВременныхТаблиц, 
			Истина, 
			ОписаниеФильтра, 
			ПараметрыПостроения, 
			"ВТУдостоверенияЛичности");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументыФизическихЛиц.Физлицо КАК ФизическоеЛицо,
	               |	ХарактеристикиВидовДокументовПоМедРегистру.Характеристика.Код КАК ВидДокументаКод,
	               |	ХарактеристикиВидовДокументовПоМедРегистру.Характеристика.НаименованиеПолное КАК ВидДокументаНаименование,
	               |	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК Серия,
	               |	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК Номер,
	               |	ЕСТЬNULL(ДокументыФизическихЛиц.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачи,
	               |	ЕСТЬNULL(ДокументыФизическихЛиц.КемВыдан, """") КАК КемВыдан,
	               |	ЕСТЬNULL(ДокументыФизическихЛиц.КодПодразделения, """") КАК КодПодразделения
	               |ИЗ
	               |	ВТУдостоверенияЛичности КАК ДокументыФизическихЛиц
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиВидовДокументовПоМедРегистру
	               |		ПО (ХарактеристикиВидовДокументовПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидовДокументов)
	               |			И ДокументыФизическихЛиц.ВидДокумента = ХарактеристикиВидовДокументовПоМедРегистру.Объект
	               |ГДЕ
	               |	ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТУдостоверенияЛичности";
	
	Запрос.УстановитьПараметр("КлассификаторВидовДокументов", "1.2.643.5.1.13.13.99.2.48");			   
	ДанныеДляЗаполнения.ДокументыУдостоверяющиеЛичность = Запрос.Выполнить().Выгрузить();
			
#КонецОбласти	

#Область ОбразованиеСертификатыНаградыРаботников
		
	ОписаниеВТОбразование = Новый Структура("ИмяВременнойТаблицыОтборовФизическихЛиц,ИмяПоляФизическоеЛицо", "ВТРаботникиОрганизации", "ФизическоеЛицо");
	Запрос = КадровыйУчетРасширенный.ЗапросВТОбразованияФизическихЛиц(Истина, ОписаниеВТОбразование);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	ОписаниеВТКатегории = Новый Структура("ИмяВременнойТаблицыОтборовФизическихЛиц,ИмяПоляПериод,ИмяПоляФизическоеЛицо", "ВТРаботникиОрганизации", "Период", "ФизическоеЛицо");
	Запрос = КадровыйУчетРасширенный.ЗапросВТСпециальностиФизическихЛиц(Истина, ОписаниеВТКатегории);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("ПустаяХарактеристика", Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.УстановитьПараметр("ПустоеЧисло", 0);
	
	ВидыОбразованияПоРазделамФРМР = МедицинскиеРегистры.ВидыОбразованияПоРазделамФРМР();
	Запрос.УстановитьПараметр("ВидыОбщегоОбразования", ВидыОбразованияПоРазделамФРМР.ВидыОбщегоОбразования);
	Запрос.УстановитьПараметр("ВидыОбразованияДающиеСпециальность", ВидыОбразованияПоРазделамФРМР.ВидыОбразованияДающиеСпециальность);
	Запрос.УстановитьПараметр("ВидыПослевузовскогоОбразования", ВидыОбразованияПоРазделамФРМР.ВидыПослевузовскогоОбразования);
	Запрос.УстановитьПараметр("ВидыДополнительногоОбразования", ВидыОбразованияПоРазделамФРМР.ВидыДополнительногоОбразования);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ФизическиеЛицаОбразование.Ссылка КАК ОбразованиеРаботника,
	|	ФизическиеЛицаОбразование.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ХарактеристикиВидаОбразованияПоМедРегистру.ХарактеристикаКод КАК ВидОбразованияКод,
	|	ХарактеристикиВидаОбразованияПоМедРегистру.ХарактеристикаНаименование КАК ВидОбразованияНаименование,
	|	ХарактеристикиВидаПослевузовскогоОбразованияПоМедРегистру.ХарактеристикаКод КАК ВидПослевузовскогоОбразованияКод,
	|	ХарактеристикиВидаПослевузовскогоОбразованияПоМедРегистру.ХарактеристикаНаименование КАК ВидПослевузовскогоОбразованияНаименование,
	|	ХарактеристикиВидаДополнительногоОбученияПоМедРегистру.ХарактеристикаКод КАК ВидДополнительногоОбученияКод,
	|	ХарактеристикиВидаДополнительногоОбученияПоМедРегистру.ХарактеристикаНаименование КАК ВидДополнительногоОбученияНаименование,
	|	ХарактеристикиУчебноеЗаведениеПоМедРегистру.ХарактеристикаКод КАК УчебноеЗаведениеКод,
	|	ХарактеристикиУчебноеЗаведениеПоМедРегистру.ХарактеристикаНаименование КАК УчебноеЗаведениеНаименование,
	|	ФизическиеЛицаОбразование.УчебноеЗаведение КАК УчебноеЗаведение,
	|	ФизическиеЛицаОбразование.Начало КАК Начало,
	|	ФизическиеЛицаОбразование.Окончание КАК Окончание,
	|	ФизическиеЛицаОбразование.ЗаПределамиРФ КАК ЗаПределамиРФ,
	|	ФизическиеЛицаОбразование.Специальность КАК Специальность,
	|	ХарактеристикиСпециальностиПоМедРегистру.ХарактеристикаКод КАК СпециальностьКод,
	|	ХарактеристикиСпециальностиПоМедРегистру.ХарактеристикаНаименование КАК СпециальностьНаименование,
	|	ФизическиеЛицаОбразование.Квалификация КАК Квалификация,
	|	ФизическиеЛицаОбразование.НаименованиеКурса КАК НаименованиеКурса,
	|	ФизическиеЛицаОбразование.КоличествоЧасов КАК КоличествоЧасов,
	|	ФизическиеЛицаОбразование.Серия КАК Серия,
	|	ФизическиеЛицаОбразование.Номер КАК Номер,
	|	ФизическиеЛицаОбразование.ДатаВыдачи КАК ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&ВидыОбщегоОбразования)
	|			ТОГДА 1
	|		КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&ВидыОбразованияДающиеСпециальность)
	|			ТОГДА 2
	|		КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&ВидыПослевузовскогоОбразования)
	|				И ФизическиеЛицаОбразование.ВидПослевузовскогоОбразования <> ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка)
	|			ТОГДА 3
	|		КОГДА ФизическиеЛицаОбразование.ВидОбразования В (&ВидыДополнительногоОбразования)
	|				И ФизическиеЛицаОбразование.ВидДополнительногоОбучения <> ЗНАЧЕНИЕ(Перечисление.ВидыПрофессиональнойПодготовки.ПустаяСсылка)
	|			ТОГДА 4
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВидОбразованияМедРаботника
	|ПОМЕСТИТЬ ВТОбразование
	|ИЗ
	|	ВТОбразованияФизическихЛиц КАК ФизическиеЛицаОбразование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиВидаОбразованияПоМедРегистру
	|		ПО ФизическиеЛицаОбразование.ВидОбразования = ХарактеристикиВидаОбразованияПоМедРегистру.Объект
	|			И (ХарактеристикиВидаОбразованияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидОбразования)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиВидаПослевузовскогоОбразованияПоМедРегистру
	|		ПО ФизическиеЛицаОбразование.ВидПослевузовскогоОбразования = ХарактеристикиВидаПослевузовскогоОбразованияПоМедРегистру.Объект
	|			И (ХарактеристикиВидаПослевузовскогоОбразованияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидПослевузовскогоОбразования)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиВидаДополнительногоОбученияПоМедРегистру
	|		ПО ФизическиеЛицаОбразование.ВидДополнительногоОбучения = ХарактеристикиВидаДополнительногоОбученияПоМедРегистру.Объект
	|			И (ХарактеристикиВидаДополнительногоОбученияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидДополнительногоОбучения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиУчебноеЗаведениеПоМедРегистру
	|		ПО ФизическиеЛицаОбразование.УчебноеЗаведение = ХарактеристикиУчебноеЗаведениеПоМедРегистру.Объект
	|			И (ХарактеристикиУчебноеЗаведениеПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторУчебноеЗаведение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСпециальностиПоМедРегистру
	|		ПО ФизическиеЛицаОбразование.Специальность = ХарактеристикиСпециальностиПоМедРегистру.Объект
	|			И (ХарактеристикиСпециальностиПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторСпециальность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Образование.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Образование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	|	Образование.УчебноеЗаведение КАК ОбразовательнаяОрганизация,
	|	Образование.Серия КАК СерияАттестата,
	|	Образование.Номер КАК НомерАттестата,
	|	Образование.ДатаВыдачи КАК ДатаВыдачиАттестата
	|ИЗ
	|	ВТОбразование КАК Образование
	|ГДЕ
	|	Образование.ВидОбразованияМедРаботника = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Образование.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Образование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	|	Образование.УчебноеЗаведение КАК ОбразовательнаяОрганизация,
	|	Образование.ВидОбразованияКод КАК ВидОбразованияКод,
	|	Образование.ВидОбразованияНаименование КАК ВидОбразованияНаименование,
	|	Образование.УчебноеЗаведениеКод КАК УчебноеЗаведениеКод,
	|	Образование.УчебноеЗаведениеНаименование КАК УчебноеЗаведениеНаименование,
	|	Образование.СпециальностьКод КАК СпециальностьКод,
	|	Образование.СпециальностьНаименование КАК СпециальностьНаименование,
	|	ХарактеристикиКвалификация.ХарактеристикаКод КАК КвалификацияКод,
	|	ХарактеристикиКвалификация.ХарактеристикаНаименование КАК КвалификацияНаименование,
	|	Образование.Начало КАК Начало,
	|	Образование.Окончание КАК Окончание,
	|	Образование.ЗаПределамиРФ КАК ЗаПределамиРФ,
	|	ХарактеристикиСтранаМираПоМедРегистру.ХарактеристикаКод КАК СтранаМираКод,
	|	ХарактеристикиСтранаМираПоМедРегистру.ХарактеристикаНаименование КАК СтранаМираНаименование,
	|	ХарактеристикиРеспубликаСССРПоМедРегистру.ХарактеристикаКод КАК РеспубликаСССРКод,
	|	ХарактеристикиРеспубликаСССРПоМедРегистру.ХарактеристикаНаименование КАК РеспубликаСССРНаименование,
	|	ХарактеристикиЗаказчикЦелевогоОбучения.ХарактеристикаКод КАК ЗаказчикЦелевогоОбученияКод,
	|	ХарактеристикиЗаказчикЦелевогоОбучения.ХарактеристикаНаименование КАК ЗаказчикЦелевогоОбученияНаименование,
	|	ХарактеристикиПричинаРасторжения.ХарактеристикаКод КАК ПричинаРасторженияКод,
	|	ХарактеристикиПричинаРасторжения.ХарактеристикаНаименование КАК ПричинаРасторженияНаименование,
	|	Образование.Серия КАК СерияДиплома,
	|	Образование.Номер КАК НомерДиплома,
	|	Образование.ДатаВыдачи КАК ДатаВыдачиДиплома
	|ИЗ
	|	ВТОбразование КАК Образование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСтранаМираПоМедРегистру
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиСтранаМираПоМедРегистру.Объект
	|			И (ХарактеристикиСтранаМираПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторСтранМира)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиРеспубликаСССРПоМедРегистру
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиРеспубликаСССРПоМедРегистру.Объект
	|			И (ХарактеристикиРеспубликаСССРПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторРеспубликСССР)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиКвалификация
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиКвалификация.Объект
	|			И (ХарактеристикиКвалификация.ИдентификаторКлассификатора = &КлассификаторКвалификаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиЗаказчикЦелевогоОбучения
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиЗаказчикЦелевогоОбучения.Объект
	|			И (ХарактеристикиЗаказчикЦелевогоОбучения.ИдентификаторКлассификатора = &КлассификаторСубъектовРФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиПричинаРасторжения
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиПричинаРасторжения.Объект
	|			И (ХарактеристикиПричинаРасторжения.ИдентификаторКлассификатора = &КлассификаторПричинРасторжения)
	|ГДЕ
	|	Образование.ВидОбразованияМедРаботника = 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Образование.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Образование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	|	Образование.УчебноеЗаведение КАК ОбразовательнаяОрганизация,
	|	Образование.ВидПослевузовскогоОбразованияКод КАК ТипОбразованияКод,
	|	Образование.ВидПослевузовскогоОбразованияНаименование КАК ТипОбразованияНаименование,
	|	Образование.УчебноеЗаведениеКод КАК УчебноеЗаведениеКод,
	|	Образование.УчебноеЗаведениеНаименование КАК УчебноеЗаведениеНаименование,
	|	ХарактеристикиУченаяСтепень.ХарактеристикаКод КАК УченаяСтепеньКод,
	|	ХарактеристикиУченаяСтепень.ХарактеристикаНаименование КАК УченаяСтепеньНаименование,
	|	ХарактеристикиОтрасльНауки.ХарактеристикаКод КАК ОтрасльНаукиКод,
	|	ХарактеристикиОтрасльНауки.ХарактеристикаНаименование КАК ОтрасльНаукиНаименование,
	|	ХарактеристикиСпециальностиОрдинатурыПоМедРегистру.ХарактеристикаКод КАК СпециальностьОрдинатурыКод,
	|	ХарактеристикиСпециальностиОрдинатурыПоМедРегистру.ХарактеристикаНаименование КАК СпециальностьОрдинатурыНаименование,
	|	ХарактеристикиСпециальностиДокторантурыПоМедРегистру.ХарактеристикаКод КАК СпециальностьДокторантурыКод,
	|	ХарактеристикиСпециальностиДокторантурыПоМедРегистру.ХарактеристикаНаименование КАК СпециальностьДокторантурыНаименование,
	|	Образование.Начало КАК Начало,
	|	Образование.Окончание КАК Окончание,
	|	Образование.ЗаПределамиРФ КАК ЗаПределамиРФ,
	|	ХарактеристикиСтранаМираПоМедРегистру.ХарактеристикаКод КАК СтранаМираКод,
	|	ХарактеристикиСтранаМираПоМедРегистру.ХарактеристикаНаименование КАК СтранаМираНаименование,
	|	ХарактеристикиРеспубликаСССРПоМедРегистру.ХарактеристикаКод КАК РеспубликаСССРКод,
	|	ХарактеристикиРеспубликаСССРПоМедРегистру.ХарактеристикаНаименование КАК РеспубликаСССРНаименование,
	|	ХарактеристикиЗаказчикЦелевогоОбучения.ХарактеристикаКод КАК ЗаказчикЦелевогоОбученияКод,
	|	ХарактеристикиЗаказчикЦелевогоОбучения.ХарактеристикаНаименование КАК ЗаказчикЦелевогоОбученияНаименование,
	|	ХарактеристикиПричинаРасторжения.ХарактеристикаКод КАК ПричинаРасторженияКод,
	|	ХарактеристикиПричинаРасторжения.ХарактеристикаНаименование КАК ПричинаРасторженияНаименование,
	|	Образование.Серия КАК СерияДиплома,
	|	Образование.Номер КАК НомерДиплома,
	|	Образование.ДатаВыдачи КАК ДатаВыдачиДиплома
	|ИЗ
	|	ВТОбразование КАК Образование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСтранаМираПоМедРегистру
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиСтранаМираПоМедРегистру.Объект
	|			И (ХарактеристикиСтранаМираПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторСтранМира)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиРеспубликаСССРПоМедРегистру
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиРеспубликаСССРПоМедРегистру.Объект
	|			И (ХарактеристикиРеспубликаСССРПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторРеспубликСССР)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСпециальностиОрдинатурыПоМедРегистру
	|		ПО Образование.Специальность = ХарактеристикиСпециальностиОрдинатурыПоМедРегистру.Объект
	|			И (ХарактеристикиСпециальностиОрдинатурыПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторСпециальностьОрдинатуры)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСпециальностиДокторантурыПоМедРегистру
	|		ПО Образование.Специальность = ХарактеристикиСпециальностиДокторантурыПоМедРегистру.Объект
	|			И (ХарактеристикиСпециальностиДокторантурыПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторСпециальностьДокторантуры)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиЗаказчикЦелевогоОбучения
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиЗаказчикЦелевогоОбучения.Объект
	|			И (ХарактеристикиЗаказчикЦелевогоОбучения.ИдентификаторКлассификатора = &КлассификаторСубъектовРФ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиПричинаРасторжения
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиПричинаРасторжения.Объект
	|			И (ХарактеристикиПричинаРасторжения.ИдентификаторКлассификатора = &КлассификаторПричинРасторжения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиУченаяСтепень
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиУченаяСтепень.Объект
	|			И (ХарактеристикиУченаяСтепень.ИдентификаторКлассификатора = &КлассификаторУченыхСтепеней)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОтрасльНауки
	|		ПО Образование.ОбразованиеРаботника = ХарактеристикиОтрасльНауки.Объект
	|			И (ХарактеристикиОтрасльНауки.ИдентификаторКлассификатора = &КлассификаторОтраслейНауки)
	|ГДЕ
	|	Образование.ВидОбразованияМедРаботника = 3
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Образование.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Образование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	|	Образование.УчебноеЗаведение КАК ОбразовательнаяОрганизация,
	|	Образование.ВидДополнительногоОбученияКод КАК ВидДополнительногоПрофессиональногоОбразованияКод,
	|	Образование.ВидДополнительногоОбученияНаименование КАК ВидДополнительногоПрофессиональногоОбразованияНаименование,
	|	Образование.УчебноеЗаведениеКод КАК УчебноеЗаведениеКод,
	|	Образование.УчебноеЗаведениеНаименование КАК УчебноеЗаведениеНаименование,
	|	Образование.КоличествоЧасов КАК КоличествоЧасов,
	|	Образование.НаименованиеКурса КАК Тематика,
	|	ХарактеристикиСпециальностиДПО.ХарактеристикаКод КАК СпециальностьКод,
	|	ХарактеристикиСпециальностиДПО.ХарактеристикаНаименование КАК СпециальностьНаименование,
	|	Образование.Серия КАК СерияДиплома,
	|	Образование.Номер КАК НомерДиплома,
	|	Образование.ДатаВыдачи КАК ДатаВыдачиДиплома
	|ИЗ
	|	ВТОбразование КАК Образование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСпециальностиДПО
	|		ПО Образование.Специальность = ХарактеристикиСпециальностиДПО.Объект
	|			И (ХарактеристикиСпециальностиДПО.ИдентификаторКлассификатора = &КлассификаторСпециальностьДПО)
	|ГДЕ
	|	Образование.ВидОбразованияМедРаботника = 4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СертификатыПоСпециальности.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СертификатыПоСпециальности.Специальность КАК Специальность,
	|	ХарактеристикиУчебноеЗаведениеПоМедРегистру.ХарактеристикаКод КАК УчебноеЗаведениеКод,
	|	ХарактеристикиУчебноеЗаведениеПоМедРегистру.ХарактеристикаНаименование КАК УчебноеЗаведениеНаименование,
	|	ХарактеристикиСпециальностиСертификатаПоМедРегистру.ХарактеристикаКод КАК СпециальностьКод,
	|	ХарактеристикиСпециальностиСертификатаПоМедРегистру.ХарактеристикаНаименование КАК СпециальностьНаименование,
	|	СертификатыПоСпециальности.Серия КАК Серия,
	|	СертификатыПоСпециальности.Номер КАК Номер,
	|	СертификатыПоСпециальности.ДатаПолучения КАК ДатаПолучения,
	|	СертификатыПоСпециальности.ДействуетПо КАК ДействуетПо
	|ИЗ
	|	РегистрСведений.СертификатыПоСпециальностиФизическихЛиц КАК СертификатыПоСпециальности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаботникиОрганизации КАК ОтборФизическихЛиц
	|		ПО СертификатыПоСпециальности.ФизическоеЛицо = ОтборФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСпециальностиСертификатаПоМедРегистру
	|		ПО СертификатыПоСпециальности.Специальность = ХарактеристикиСпециальностиСертификатаПоМедРегистру.Объект
	|			И (ХарактеристикиСпециальностиСертификатаПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторСпециальностьСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиУчебноеЗаведениеПоМедРегистру
	|		ПО (ХарактеристикиУчебноеЗаведениеПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторУчебноеЗаведениеСертификата)
	|			И ((ВЫРАЗИТЬ(СертификатыПоСпециальности.КемВыдан КАК СТРОКА(500))) = ХарактеристикиУчебноеЗаведениеПоМедРегистру.Характеристика.НаименованиеПолное
	|				ИЛИ (ВЫРАЗИТЬ(СертификатыПоСпециальности.КемВыдан КАК СТРОКА(500))) = ХарактеристикиУчебноеЗаведениеПоМедРегистру.Объект.Наименование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаградыФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НаградыФизическихЛиц.Награда КАК Награда,
	|	ХарактеристикиНаградПоМедРегистру.ХарактеристикаКод КАК НаградаКод,
	|	ХарактеристикиНаградПоМедРегистру.ХарактеристикаНаименование КАК НаградаНаименование,
	|	НаградыФизическихЛиц.НомерПриказа КАК НомерПриказа,
	|	НаградыФизическихЛиц.ДатаПриказа КАК ДатаПриказа
	|ИЗ
	|	РегистрСведений.НаградыФизическихЛиц КАК НаградыФизическихЛиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРаботникиОрганизации КАК ОтборФизическихЛиц
	|		ПО НаградыФизическихЛиц.ФизическоеЛицо = ОтборФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиНаградПоМедРегистру
	|		ПО НаградыФизическихЛиц.Награда = ХарактеристикиНаградПоМедРегистру.Объект
	|			И (ХарактеристикиНаградПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторНаград)";

	Запрос.УстановитьПараметр("КлассификаторУчебноеЗаведение", "1.2.643.5.1.13.13.11.1519");
	Запрос.УстановитьПараметр("КлассификаторУчебноеЗаведениеСертификата", "1.2.643.5.1.13.13.11.1519");
	Запрос.УстановитьПараметр("КлассификаторСпециальность", "1.2.643.5.1.13.13.99.2.170");
	Запрос.УстановитьПараметр("КлассификаторСпециальностьСертификата", "1.2.643.5.1.13.13.11.1066");
	Запрос.УстановитьПараметр("КлассификаторСпециальностьОрдинатуры", "1.2.643.5.1.13.13.11.1066");
	Запрос.УстановитьПараметр("КлассификаторСпециальностьДокторантуры", "1.2.643.5.1.13.13.99.2.220");
	Запрос.УстановитьПараметр("КлассификаторСпециальностьДПО", "1.2.643.5.1.13.13.11.1066");
	Запрос.УстановитьПараметр("КлассификаторСтранМира", "1.2.643.5.1.13.2.1.1.63");
	Запрос.УстановитьПараметр("КлассификаторРеспубликСССР", "1.2.643.5.1.13.2.1.1.779");
	Запрос.УстановитьПараметр("КлассификаторСубъектовРФ", "1.2.643.5.1.13.13.99.2.206");
	Запрос.УстановитьПараметр("КлассификаторПричинРасторжения", "1.2.643.5.1.13.13.99.2.353");
	Запрос.УстановитьПараметр("КлассификаторУченыхСтепеней", "1.2.643.5.1.13.13.11.1067");
	Запрос.УстановитьПараметр("КлассификаторОтраслейНауки", "1.2.643.5.1.13.13.11.1068");
	
	Запрос.УстановитьПараметр("КлассификаторВидОбразования", "1.2.643.5.1.13.13.99.2.193");
	Запрос.УстановитьПараметр("КлассификаторВидПослевузовскогоОбразования", "1.2.643.5.1.13.13.99.2.104");
	Запрос.УстановитьПараметр("КлассификаторВидДополнительногоОбучения", "1.2.643.5.1.13.13.99.2.297");
	Запрос.УстановитьПараметр("КлассификаторКвалификаций", "1.2.643.5.1.13.13.99.2.171");
	Запрос.УстановитьПараметр("КлассификаторНаград", "1.2.643.5.1.13.13.99.2.44");
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДанныеДляЗаполнения.ОбщееОбразование = Результаты[1].Выгрузить();
	ДанныеДляЗаполнения.ПрофессиональноеОбразование = Результаты[2].Выгрузить();
	ДанныеДляЗаполнения.ПослевузовскоеОбразование = Результаты[3].Выгрузить();
	ДанныеДляЗаполнения.ДополнительноеПрофессиональноеОбразование = Результаты[4].Выгрузить();
	ДанныеДляЗаполнения.Сертификаты = Результаты[5].Выгрузить();
	ДанныеДляЗаполнения.Награды = Результаты[6].Выгрузить();
	
#КонецОбласти	

#Область КвалификацияРаботников

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадровыеДанныеСотрудников.ЯвляетсяМедицинскойДолжностью КАК ЯвляетсяМедицинскойДолжностью,
	|	СпециальностиФизическихЛиц.Период КАК ДатаПрисвоения,
	|	СпециальностиФизическихЛиц.ДействуетПо КАК ДатаОкончания,
	|	СпециальностиФизическихЛиц.РазрядКатегория КАК РазрядКатегория,
	|	СпециальностиФизическихЛиц.Специальность КАК Специальность,
	|	ХарактеристикиКвалификационныеКатегорииПоМедРегистру.Характеристика.Код КАК КвалификационнаяКатегорияКод,
	|	ХарактеристикиКвалификационныеКатегорииПоМедРегистру.Характеристика.НаименованиеПолное КАК КвалификационнаяКатегорияНаименование,
	|	ХарактеристикиСпециальностиКвалификацииПоМедРегистру.Характеристика.Код КАК СпециальностьКод,
	|	ХарактеристикиСпециальностиКвалификацииПоМедРегистру.Характеристика.НаименованиеПолное КАК СпециальностьНаименование,
	|	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика.Код КАК ДолжностьПоФедСправочникуКод,
	|	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика.НаименованиеПолное КАК ДолжностьПоФедСправочникуНаименование,
	|	ХарактеристикиДолжностьПоМедРегистру.Характеристика.Код КАК ДолжностьКод,
	|	ХарактеристикиДолжностьПоМедРегистру.Характеристика.НаименованиеПолное КАК ДолжностьНаименование,
	|	КадровыеПериодыРаботы.ПериодЗаписи КАК ДатаНачалаЗаписи,
	|	КадровыеПериодыРаботы.ПериодОкончания КАК ДатаОкончанияЗаписи
	|ИЗ
	|	ВТКадровыеПериодыРаботы КАК КадровыеПериодыРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО КадровыеПериодыРаботы.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|			И КадровыеПериодыРаботы.ПериодОкончанияЗаполненный = КадровыеДанныеСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпециальностиФизическихЛиц КАК СпециальностиФизическихЛиц
	|		ПО (СпециальностиФизическихЛиц.ФизическоеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо)
	|			И (СпециальностиФизическихЛиц.Специальность = КадровыеДанныеСотрудников.Специальность)
	|			И (СпециальностиФизическихЛиц.Период < КадровыеПериодыРаботы.ПериодОкончания
	|				ИЛИ КадровыеПериодыРаботы.ПериодОкончания = &ПустаяДата)
	|			И (СпециальностиФизическихЛиц.ДействуетПо >= КадровыеПериодыРаботы.ПериодЗаписи)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиКвалификационныеКатегорииПоМедРегистру
	|		ПО (СпециальностиФизическихЛиц.РазрядКатегория = ХарактеристикиКвалификационныеКатегорииПоМедРегистру.Объект)
	|			И (ХарактеристикиКвалификационныеКатегорииПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторКвалификационныеКатегории)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиСпециальностиКвалификацииПоМедРегистру
	|		ПО (СпециальностиФизическихЛиц.Специальность = ХарактеристикиСпециальностиКвалификацииПоМедРегистру.Объект)
	|			И (ХарактеристикиСпециальностиКвалификацииПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторСпециальностьКвалификации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру
	|		ПО (ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжностьПоФедСправочнику)
	|			И (КадровыеДанныеСотрудников.Должность = ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоМедРегистру
	|		ПО (ХарактеристикиДолжностьПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжность)
	|			И (КадровыеДанныеСотрудников.Должность = ХарактеристикиДолжностьПоМедРегистру.Объект)
	|ГДЕ
	|	НЕ КадровыеДанныеСотрудников.Должность ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизическоеЛицо,
	|	ДатаПрисвоения";
	
	Запрос.УстановитьПараметр("КлассификаторКвалификационныеКатегории", "1.2.643.5.1.13.13.11.1494");
	Запрос.УстановитьПараметр("КлассификаторСпециальностьКвалификации", "1.2.643.5.1.13.13.11.1066");
	Запрос.УстановитьПараметр("КлассификаторДолжностьПоФедСправочнику", "1.2.643.5.1.13.13.99.2.885");
	Запрос.УстановитьПараметр("КлассификаторДолжность", "1.2.643.5.1.13.13.99.2.181");
	
	ДанныеДляЗаполнения.Квалификация = Запрос.Выполнить().Выгрузить();

#КонецОбласти	

	Параметры.ДанныеДляЗаполнения = ДанныеДляЗаполнения;
	ПоместитьВоВременноеХранилище(Параметры, АдресХранилища);
	
КонецПроцедуры	

#Область ОбязательныеПоля

Функция ОписаниеПоля(Имя, Представление, ЭтоСтрока = Ложь, БезусловнаяОтметкаНезаполненого = Истина)
	
	ОписаниеПоля = Новый Структура();
	ОписаниеПоля.Вставить("Имя",						Имя);
	ОписаниеПоля.Вставить("Представление",				Представление);
	ОписаниеПоля.Вставить("ОпределяющееПоле",			ОписаниеОпределяющегоПоля("", ));
	ОписаниеПоля.Вставить("ЭтоСтрока",					ЭтоСтрока);
	ОписаниеПоля.Вставить("ОтметкаНезаполненного",		БезусловнаяОтметкаНезаполненого);
	
	Возврат ОписаниеПоля;
	
КонецФункции

Функция ОписаниеОпределяющегоПоля(Имя, Знач Значения = Неопределено)
	
	Если ТипЗнч(Значения) <> Тип("Массив") Тогда
		Значения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Значения);
	КонецЕсли;
	
	Возврат Новый Структура("Имя, Значения", Имя, Значения)
	
КонецФункции

Функция ОписаниеПоляТипаСтрока(Имя, Представление)
	
	Возврат ОписаниеПоля(Имя, Представление, Истина)
	
КонецФункции

Функция ПоляПроверкиДокументов()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("ВидДокументаКод", "Код вида документа"));
	ПоляПроверки.Добавить(ОписаниеПоля("ВидДокументаНаименование", "Наименование вида документа"));
	ПоляПроверки.Добавить(ОписаниеПоля("Номер",	"Номер"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаВыдачи", "Дата выдачи"));
	ПоляПроверки.Добавить(ОписаниеПоля("КемВыдан",	"Кем выдан"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ПоляПроверкиОбщегоОбразования()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("ОбразовательнаяОрганизация","Образовательная организация"));
	ПоляПроверки.Добавить(ОписаниеПоля("НомерАттестата",	"Номер аттестата"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаВыдачиАттестата",	"Дата выдачи аттестата"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ПоляПроверкиПрофессиональногоОбразования()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("УчебноеЗаведениеКод","Код учебного заведения по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("НомерДиплома",	"Номер диплома"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаВыдачиДиплома",	"Дата выдачи диплома"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ПоляПроверкиПослевузовскогоОбразования()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("УчебноеЗаведениеКод","Код учебного заведения по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("НомерДиплома",	"Номер диплома"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаВыдачиДиплома",	"Дата выдачи диплома"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ПоляПроверкиДополнительногоПрофессиональногоОбразования()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("УчебноеЗаведениеКод","Код учебного заведения по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("НомерДиплома",	"Номер диплома"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаВыдачиДиплома",	"Дата выдачи диплома"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ПоляПроверкиСертификатов()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("СпециальностьКод", "Код специальности по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("СпециальностьНаименование", "Наименование специальности по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("УчебноеЗаведениеКод", "Код учебного заведения по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("УчебноеЗаведениеНаименование", "Наименование учебного заведения по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаПолучения", "Дата получения"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДействуетПо", "Дата окончания действия сертификата"));
	ПоляПроверки.Добавить(ОписаниеПоля("Серия", "Серия"));
	ПоляПроверки.Добавить(ОписаниеПоля("Номер", "Номер"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ПоляПроверкиНаград()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("НаградаКод", "Код награды по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаПриказа", "Дата приказа"));
	ПоляПроверки.Добавить(ОписаниеПоля("НомерПриказа", "Номер приказа"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ПоляПроверкиКвалификаций()
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("КвалификационнаяКатегорияКод", "Код квалификационной категории по классификатору НСИ Минздрава"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаПрисвоения", "Дата присвоения квалификационной категории"));

	Возврат ПоляПроверки;
	
КонецФункции

Функция ОписанияОбязательныхПолейТаблиц() Экспорт
	
	ОписанияПолейТаблиц = Новый Структура();
	
	ОписанияПолейТаблиц.Вставить("ДокументыУдостоверяющиеЛичность", ПоляПроверкиДокументов());
	ОписанияПолейТаблиц.Вставить("ОбщееОбразование", ПоляПроверкиОбщегоОбразования());
	ОписанияПолейТаблиц.Вставить("ПрофессиональноеОбразование", ПоляПроверкиПрофессиональногоОбразования());
	ОписанияПолейТаблиц.Вставить("ПослевузовскоеОбразование", ПоляПроверкиПослевузовскогоОбразования());
	ОписанияПолейТаблиц.Вставить("ДополнительноеПрофессиональноеОбразование", ПоляПроверкиДополнительногоПрофессиональногоОбразования());
	ОписанияПолейТаблиц.Вставить("Сертификаты", ПоляПроверкиСертификатов());
	ОписанияПолейТаблиц.Вставить("Награды", ПоляПроверкиНаград());
	ОписанияПолейТаблиц.Вставить("Квалификация", ПоляПроверкиКвалификаций());

	Возврат Новый ФиксированнаяСтруктура(ОписанияПолейТаблиц);
	
КонецФункции

Функция ОписанияОбязательныхПолей() Экспорт
	
	ПоляПроверки = Новый Массив();
	
	ПоляПроверки.Добавить(ОписаниеПоля("Пол", "Пол"));
	ПоляПроверки.Добавить(ОписаниеПоля("ДатаРождения", "ДатаРождения"));
	ПоляПроверки.Добавить(ОписаниеПоляТипаСтрока("СтраховойНомерПФР", "СНИЛС"));
	ПоляПроверки.Добавить(ОписаниеПоля("СтранаКод", "Код страны гражданства"));
	ПоляПроверки.Добавить(ОписаниеПоля("СтранаНаименование", "Наименование страны гражданства"));
	ПоляПроверки.Добавить(ОписаниеПоляТипаСтрока("АдресПостояннойРегистрацииПредставление", "Адрес постоянной регистрации"));
	ПоляПроверки.Добавить(ОписаниеПоляТипаСтрока("АдресМестаПроживанияПредставление", "Адрес места проживания"));
	
	Возврат Новый ФиксированныйМассив(ПоляПроверки);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли