#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОшибкиПользователю = Неопределено;

	Если ПустаяСтрока(УИНОрганизации) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			ОшибкиПользователю, "Объект.УИНОрганизации",
			НСтр("ru ='Идентификатор учреждения должен быть заполнен'"), "");
			
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "УИНОрганизации");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет документ данными из хранилища.
//  Параметры: АдресХранилища - адрес временного хранилища.
Процедура ЗаполнитьИзХранилища(АдресХранилища) Экспорт

	ПараметрыЗаполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	СписокРаботников = ПараметрыЗаполнения.СписокРаботников;
	ДанныеДляЗаполнения = ПараметрыЗаполнения.ДанныеДляЗаполнения;
	// 1 Скопом весь документ
	Если СписокРаботников = Неопределено Или СписокРаботников.Количество() = 0 Тогда 
		
		Для Каждого ТабличнаяЧасть Из Метаданные().ТабличныеЧасти Цикл
			
			ЭтотОбъект[ТабличнаяЧасть.Имя].Очистить();
			Если ДанныеДляЗаполнения.Свойство(ТабличнаяЧасть.Имя) И ДанныеДляЗаполнения[ТабличнаяЧасть.Имя]<>Неопределено Тогда
				ЭтотОбъект[ТабличнаяЧасть.Имя].Загрузить(ДанныеДляЗаполнения[ТабличнаяЧасть.Имя]);
			КонецЕсли;	
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	// 2 Выбранным списком физических лиц.
	ТабличныеЧасти = ТабличныеЧастиСФизическимЛицом();
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		Если ДанныеДляЗаполнения.Свойство(ТабличнаяЧасть) Тогда
			ЗагрузитьВТабличнуюЧастьДокумента(СписокРаботников, ТабличнаяЧасть, ДанныеДляЗаполнения[ТабличнаяЧасть])
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры

// Заполняет Табличную часть документа из коллекции данных.
// Параметры:
// - ИмяТабличнойЧасти -строка, Имя заполняемой табличной части.
// - ДанныеТабличнойЧасти - ТаблицаЗначений,Массив, Коллекция данных для заполнения.
Процедура ЗагрузитьВТабличнуюЧастьДокумента(СписокРаботников, ИмяТабличнойЧасти, ДанныеТабличнойЧасти)
	
	ТабличнаяЧастьДокумента = ЭтотОбъект[ИмяТабличнойЧасти];
	
	Если ТабличнаяЧастьДокумента.Количество() = 0 Тогда
		
		Если ТипЗнч(ДанныеТабличнойЧасти) = Тип("ТаблицаЗначений") Тогда
			ТабличнаяЧастьДокумента.Загрузить(ДанныеТабличнойЧасти);
		Иначе
			Для Каждого Данные Из ДанныеТабличнойЧасти Цикл
				ЗаполнитьЗначенияСвойств(ТабличнаяЧастьДокумента.Добавить(), Данные);
			КонецЦикла;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьМассивНедостающимиЗначениями(СписокРаботников, ДанныеТабличнойЧасти, "ФизическоеЛицо");
	
	Для Каждого ФизическоеЛицо Из СписокРаботников Цикл 
		
		УдаляемыеСтроки = ТабличнаяЧастьДокумента.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Для Каждого Строка Из УдаляемыеСтроки Цикл
			ТабличнаяЧастьДокумента.Удалить(Строка);
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДанныеТабличнойЧасти Цикл
		ЗаполнитьЗначенияСвойств(ТабличнаяЧастьДокумента.Добавить(), Строка);
	КонецЦикла;

КонецПроцедуры 

// Удаляет все строки Работника во всех табличных частях документа.
Процедура ОчиститьДанныеРаботника(ФизическоеЛицо) Экспорт

	СтрокиФизическогоЛица = Работники.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	
	Если СтрокиФизическогоЛица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицо = СтрокиФизическогоЛица[0].ФизическоеЛицо;
	ТабличныеЧасти = ТабличныеЧастиСФизическимЛицом();
	Отбор = Новый Структура("ФизическоеЛицо",ФизическоеЛицо);
	
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		УдаляемыеСтроки = ЭтотОбъект[ТабличнаяЧасть].НайтиСтроки(Отбор);
		
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			ЭтотОбъект[ТабличнаяЧасть].Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Функция ТабличныеЧастиСФизическимЛицом()
	
	ТабличныеЧасти = Новый Массив;
	Для Каждого ТабличнаяЧасть Из Метаданные().ТабличныеЧасти Цикл
		Если ТабличнаяЧасть.Реквизиты.Найти("ФизическоеЛицо") <> Неопределено Тогда 
			ТабличныеЧасти.Добавить(ТабличнаяЧасть.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныеЧасти;
	
КонецФункции

Процедура ЗаполнитьМассивНедостающимиЗначениями(МассивПриемник, Источник, ИмяПоля)
	
	СуществующиеЗначения = Новый Соответствие;
	
	Для Каждого Значение Из МассивПриемник Цикл
		СуществующиеЗначения.Вставить(Значение, Истина);
	КонецЦикла;
	
	Для Каждого Значение Из Источник Цикл
		Если СуществующиеЗначения[Значение[ИмяПоля]] = Неопределено Тогда
			МассивПриемник.Добавить(Значение[ИмяПоля]);
			СуществующиеЗначения.Вставить(Значение[ИмяПоля], Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли