#Область СлужебныйПрограммныйИнтерфейс

// Формирует движения по регистрам подсистемы.
//
// Параметры:
//		ДанныеДляПроведения - структура, см ОтражениеЗарплатыВУчете.ОписаниеДанныеДляПроведения().
//		Отказ - Булево.
//		Удержания
//		ЗаписыватьДвижения - (необязательный), булево, по умолчанию Ложь, 
//			если Истина - наборы записей будут записаны после заполнения.
//  ЗУПК Аналог процедуры УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьУдержания
Функция РаспределитьУдержанияНА(ДанныеДляПроведения, Отказ, Удержания, ЗаписыватьДвижения = Ложь) Экспорт

	Если Удержания = Неопределено Тогда
		Возврат Удержания;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
		Возврат Удержания;
	Иначе
		Возврат РезультатыРаспределенияУдержанийНА(ДанныеДляПроведения, Удержания);
	КонецЕсли;
	
КонецФункции

// ЗУПК Аналог процедуры УчетНачисленнойЗарплатыРасширенный.РезультатыРаспределенияУдержаний
Функция РезультатыРаспределенияУдержанийНА(ДанныеДляПроведения, УдержанияПоСотрудникам) Экспорт

	РаспределениеУдержаний 	= ОтражениеЗарплатыВУчете.НоваяТаблицаРаспределениеРезультатовУдержаний();
	
	Движения 				= ДанныеДляПроведения.Движения;
	Организация 			= ДанныеДляПроведения.Организация;
	ПериодРегистрации 		= ДанныеДляПроведения.ПериодРегистрации;
	Авансом					= ДанныеДляПроведения.Авансом;
	МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	ОкончательныйРасчет		= ДанныеДляПроведения.ОкончательныйРасчет;
	
	ДвиженияНачисленийУдержаний = Движения.НачисленияУдержанияПоКонтрагентамАкционерам;
	
	ИсключаемыйРегистратор = ДвиженияНачисленийУдержаний.Отбор.Регистратор.Значение;
	
	ТаблицаУдержаний = ОтражениеЗарплатыВУчете.НоваяТаблицаРезультатРасчетаУдержаний();
	
	СтрокиУдержаний = Новый Соответствие;
	НоваяКоллекцияРаспределениеУдержаний = Неопределено;
	Если УдержанияПоСотрудникам <> Неопределено Тогда
		НоваяКоллекцияРаспределениеУдержаний = УдержанияПоСотрудникам.СкопироватьКолонки();
		ИдентификаторСтроки = 1;
		Для каждого СтрокаТЗ Из УдержанияПоСотрудникам Цикл
			Если СтрокаТЗ.Сумма <> 0 Тогда
				СтрокиУдержаний.Вставить(ИдентификаторСтроки, СтрокаТЗ);
				НоваяСтрока = ТаблицаУдержаний.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
				НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
				НоваяСтрока.ВидУдержания 		= СтрокаТЗ.Удержание;
				ИдентификаторСтроки = ИдентификаторСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ФизическиеЛицаМассив = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаУдержаний, "ФизическоеЛицо", Истина);
	УдержанияМассив 	 = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаУдержаний, "ВидУдержания", Истина);
	
	УдалитьВТ = Новый Массив;
	
	ИмяВТРаспределениеНачислений = "ВТРаспределениеНачисленийНАТекущегоДокумента";
	Если Не ЗарплатаКадры.ВТСуществует(МенеджерВременныхТаблиц, ИмяВТРаспределениеНачислений) Тогда
		УчетНачисленнойЗарплатыРК.СоздатьПустуюВТРаспределениеНачисленийНАТекущегоДокумента(МенеджерВременныхТаблиц);
		УдалитьВТ.Добавить(ИмяВТРаспределениеНачислений);
	КонецЕсли;
	
	// Получение данных для распределения, ДанныеДляРаспределения - структура
	// БазаВсеНачисления - таблица значений с базовыми начислениями
	// УжеУдержано - таблица значений, содержит данные об уже выполненных удержаниях по физическому лиц.
	ПараметрыПолученияДанных = ОтражениеЗарплатыВУчете.НовоеОписаниеПараметровПолученияДанныхДляРаспределенияУдержаний();
	ЗаполнитьЗначенияСвойств(ПараметрыПолученияДанных , ДанныеДляПроведения, "МенеджерВременныхТаблиц,Организация,ПериодРегистрации,ОкончательныйРасчет");
	ПараметрыПолученияДанных.ИмяВТДанныеТекущегоДокумента = ИмяВТРаспределениеНачислений;
	ИсключаемыеРегистраторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИсключаемыйРегистратор);
	ДанныеДляРаспределения = ДанныеДляРаспределенияУдержанийНА(ФизическиеЛицаМассив, УдержанияМассив, ИсключаемыеРегистраторы, ПараметрыПолученияДанных);
	
	ДополнительныеПараметры = ОтражениеЗарплатыВУчетеРасширенный.ОписаниеИсходныхДанныхДляРаспределенияУдержаний();
	ДополнительныеПараметры.БазовыеНачисления = ДанныеДляРаспределения.БазовыеНачисления;
	ДополнительныеПараметры.СтрокиУжеУдержаноПоФизическимЛицам = ДанныеДляРаспределения.СтрокиУжеУдержано;
	ДополнительныеПараметры.ТаблицаУдержаний = ТаблицаУдержаний;
	ДополнительныеПараметры.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ДополнительныеПараметры.Организация = Организация;
	ДополнительныеПараметры.ПериодРегистрации = ПериодРегистрации;
	ДополнительныеПараметры.ВидыНачисленийДополненияРасчетнойБазы = Обработки.МенеджерРасчетаЗарплаты.ВидыНачисленийДополненияРасчетнойБазыУдержаний();
	ДополнительныеПараметры.ОкончательныйРасчет = ОкончательныйРасчет;
	ОтражениеЗарплатыВУчетеРасширенный.ВыполнитьРаспределениеУдержаний(РаспределениеУдержаний, ДополнительныеПараметры);
	
	Отбор = Новый Структура("ИдентификаторСтроки");
	Для каждого ЭлементКоллекции Из СтрокиУдержаний Цикл
		Отбор.ИдентификаторСтроки = ЭлементКоллекции.Ключ;
		СтрокиРаспределения = РаспределениеУдержаний.НайтиСтроки(Отбор);
		Если СтрокиРаспределения.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(НоваяКоллекцияРаспределениеУдержаний.Добавить(),ЭлементКоллекции.Значение);
		Иначе
			Для каждого СтрокаТЗ Из СтрокиРаспределения Цикл
				НоваяСтрока = НоваяКоллекцияРаспределениеУдержаний.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции.Значение);
				НоваяСтрока.Сотрудник 		= СтрокаТЗ.Сотрудник;
				НоваяСтрока.Подразделение	= СтрокаТЗ.Подразделение;
				НоваяСтрока.СтатьяРасходов 	= СтрокаТЗ.СтатьяРасходов;
				НоваяСтрока.ВидДоходаИсполнительногоПроизводства = СтрокаТЗ.ВидДоходаИсполнительногоПроизводства;
				НоваяСтрока.Сумма 			= СтрокаТЗ.Результат;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат НоваяКоллекцияРаспределениеУдержаний;
	
КонецФункции

// ЗУПК Аналог процедуры ОтражениеЗарплатыВУчетеВнутренний.СоздатьВТРаспределениеНачисленийДляУдержаний
Процедура СоздатьВТРаспределениеНачисленийДляУдержанийНА(ОтборФизическиеЛица, ИсключаемыеРегистраторы, ПараметрыРаспределения) Экспорт
	
	Организация 			= ПараметрыРаспределения.Организация;
	ПериодРегистрации 		= ПараметрыРаспределения.ПериодРегистрации;
	МенеджерВременныхТаблиц = ПараметрыРаспределения.МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ФизическиеЛица", ОтборФизическиеЛица);
	Запрос.УстановитьПараметр("ИсключаемыеРегистраторы", ИсключаемыеРегистраторы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеУчетаЗатрат,
	|	Начисления.НачислениеУдержание КАК НачислениеУдержание,
	|	Начисления.СтатьяФинансирования КАК СтатьяФинансирования,
	|	Начисления.СтатьяРасходов КАК СтатьяРасходов,
	|	Начисления.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	Начисления.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТРаспределениеНачисленийДляУдержанийНА
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК Начисления
	|ГДЕ
	|	Начисления.Организация = &Организация
	|	И Начисления.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты В (ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено), ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Льготы))
	|	И Начисления.ФизическоеЛицо В(&ФизическиеЛица)
	|	И НЕ Начисления.Регистратор В (&ИсключаемыеРегистраторы)";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплатаРасширенный") Тогда
		ОписаниеПоляПодразделениеУчетаЗатрат = 
		"	ВЫБОР
		|		КОГДА Начисления.ПодразделениеУчетаЗатрат = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|			ТОГДА Начисления.Подразделение
		|		ИНАЧЕ Начисления.ПодразделениеУчетаЗатрат
		|	КОНЕЦ КАК ПодразделениеУчетаЗатрат";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеУчетаЗатрат", ОписаниеПоляПодразделениеУчетаЗатрат);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления", "РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам КАК Начисления");
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Возвращает данные для распределения удержаний по рабочим местам и статьям.
//
// Параметры:
//  ОтборФизическиеЛица - Массив.
//  ОтборУдержания - Массив.
//  ИсключаемыеРегистраторы - Массив.
//  ДополнительныеПараметры - Структура - см НовоеОписаниеПараметровПолученияДанныхДляРаспределенияУдержаний.
//
// Возвращаемое значение:
//  Структура - Ключ содержит имя данных
//  	* БазовыеНачисления - ТаблицаЗначений
//  	* СтрокиУжеУдержано - Соответствие.
//  ЗУПК Аналог процедуры ОтражениеЗарплатыВУчете.ДанныеДляРаспределенияУдержаний
Функция ДанныеДляРаспределенияУдержанийНА(ОтборФизическиеЛица, ОтборУдержания, ИсключаемыеРегистраторы, ДополнительныеПараметры) Экспорт
	
	ДанныеДляУчетаУдержаний = Новый Структура("БазовыеНачисления,СтрокиУжеУдержано");
	ДанныеДляУчетаУдержаний.СтрокиУжеУдержано = Новый Соответствие;
	
	МенеджерВременныхТаблиц = ДополнительныеПараметры.МенеджерВременныхТаблиц;
	Организация 			= ДополнительныеПараметры.Организация;
	ПериодРегистрации 		= ДополнительныеПараметры.ПериодРегистрации;
	ОкончательныйРасчет 	= ДополнительныеПараметры.ОкончательныйРасчет;
	ИмяВТДанныеТекущегоДокумента = ДополнительныеПараметры.ИмяВТДанныеТекущегоДокумента;
	РегистраторыУдержанийОбновленияБухучета = ДополнительныеПараметры.РегистраторыУдержанийОбновленияБухучета;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Удержания", ОтборУдержания);
	Запрос.УстановитьПараметр("ФизическиеЛица", ОтборФизическиеЛица);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	
	УдалитьВТ = Новый Массив;
	
	Если ОкончательныйРасчет Тогда
		
		// Получим уже зарегистрированное распределение начислений
		// без учета исключаемых регистраторов и без учета начислений межрасчетного периода.
		СоздатьВТРаспределениеНачисленийДляУдержанийНА(ОтборФизическиеЛица, ИсключаемыеРегистраторы, ДополнительныеПараметры);
		УдалитьВТ.Добавить("ВТРаспределениеНачисленийДляУдержанийНА");
		
		Если РегистраторыУдержанийОбновленияБухучета <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИсключаемыеРегистраторы, РегистраторыУдержанийОбновленияБухучета);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ИсключаемыеРегистраторы", ИсключаемыеРегистраторы);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияУдержания.Сотрудник КАК Сотрудник,
		|	НачисленияУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияУдержания.Подразделение КАК Подразделение,
		|	НачисленияУдержания.НачислениеУдержание КАК ВидУдержания,
		|	НачисленияУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
		|	НачисленияУдержания.СтатьяРасходов КАК СтатьяРасходов,
		|	НачисленияУдержания.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
		|	НачисленияУдержания.ДокументОснование КАК ДокументОснование,
		|	НачисленияУдержания.Контрагент КАК Контрагент,
		|	СУММА(НачисленияУдержания.Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержания
		|ГДЕ
		|	НачисленияУдержания.Организация = &Организация
		|	И НачисленияУдержания.НачислениеУдержание В(&Удержания)
		|	И НачисленияУдержания.Период = &ПериодРегистрации
		|	И НачисленияУдержания.ФизическоеЛицо В(&ФизическиеЛица)
		|	И НЕ НачисленияУдержания.Регистратор В (&ИсключаемыеРегистраторы)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержания.Сотрудник,
		|	НачисленияУдержания.ФизическоеЛицо,
		|	НачисленияУдержания.Подразделение,
		|	НачисленияУдержания.НачислениеУдержание,
		|	НачисленияУдержания.СтатьяФинансирования,
		|	НачисленияУдержания.СтатьяРасходов,
		|	НачисленияУдержания.ДокументОснование,
		|	НачисленияУдержания.Контрагент,
		|	НачисленияУдержания.ВидДоходаИсполнительногоПроизводства";
		ДанныеДляУчетаУдержаний.СтрокиУжеУдержано = ОтражениеЗарплатыВУчете.СтрокиТаблицыЗначенийПоФизическимЛицам(Запрос.Выполнить().Выгрузить());
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Сотрудники.ГоловнойСотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ГоловнойСотрудник,
		|	РаспределениеНачислений.Сотрудник КАК Сотрудник,
		|	РаспределениеНачислений.Подразделение КАК Подразделение,
		|	РаспределениеНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РаспределениеНачислений.Начисление КАК Начисление,
		|	РаспределениеНачислений.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
		|	РаспределениеНачислений.СтатьяФинансирования КАК СтатьяФинансирования,
		|	РаспределениеНачислений.СтатьяРасходов КАК СтатьяРасходов,
		|	РаспределениеНачислений.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
		|	СУММА(РаспределениеНачислений.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		РаспределениеНачислений.Сотрудник КАК Сотрудник,
		|		РаспределениеНачислений.Подразделение КАК Подразделение,
		|		РаспределениеНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
		|		РаспределениеНачислений.НачислениеУдержание КАК Начисление,
		|		РаспределениеНачислений.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
		|		РаспределениеНачислений.СтатьяФинансирования КАК СтатьяФинансирования,
		|		РаспределениеНачислений.СтатьяРасходов КАК СтатьяРасходов,
		|		РаспределениеНачислений.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
		|		РаспределениеНачислений.Сумма КАК Сумма
		|	ИЗ
		|		ВТРаспределениеНачисленийДляУдержанийНА КАК РаспределениеНачислений
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РаспределениеНачислений.Сотрудник,
		|		РаспределениеНачислений.Подразделение,
		|		РаспределениеНачислений.ФизическоеЛицо,
		|		РаспределениеНачислений.Начисление,
		|		РаспределениеНачислений.ПодразделениеУчетаЗатрат,
		|		РаспределениеНачислений.СтатьяФинансирования,
		|		РаспределениеНачислений.СтатьяРасходов,
		|		РаспределениеНачислений.ВидДоходаИсполнительногоПроизводства,
		|		РаспределениеНачислений.Сумма
		|	ИЗ
		|		ВТРаспределениеНачисленийНАТекущегоДокумента КАК РаспределениеНачислений) КАК РаспределениеНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО РаспределениеНачислений.Сотрудник = Сотрудники.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Сотрудники.ГоловнойСотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)),
		|	РаспределениеНачислений.Сотрудник,
		|	РаспределениеНачислений.Подразделение,
		|	РаспределениеНачислений.ФизическоеЛицо,
		|	РаспределениеНачислений.Начисление,
		|	РаспределениеНачислений.СтатьяФинансирования,
		|	РаспределениеНачислений.СтатьяРасходов,
		|	РаспределениеНачислений.ВидДоходаИсполнительногоПроизводства,
		|	РаспределениеНачислений.ПодразделениеУчетаЗатрат
		|
		|ИМЕЮЩИЕ
		|	СУММА(РаспределениеНачислений.Сумма) <> 0";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Сотрудники.ГоловнойСотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ГоловнойСотрудник,
		|	РаспределениеНачислений.Сотрудник КАК Сотрудник,
		|	РаспределениеНачислений.Подразделение КАК Подразделение,
		|	РаспределениеНачислений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РаспределениеНачислений.Начисление КАК Начисление,
		|	РаспределениеНачислений.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат,
		|	РаспределениеНачислений.СтатьяФинансирования КАК СтатьяФинансирования,
		|	РаспределениеНачислений.СтатьяРасходов КАК СтатьяРасходов,
		|	РаспределениеНачислений.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
		|	СУММА(РаспределениеНачислений.Сумма) КАК Сумма
		|ИЗ
		|	ВТРаспределениеНачисленийНАТекущегоДокумента КАК РаспределениеНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО РаспределениеНачислений.Сотрудник = Сотрудники.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(Сотрудники.ГоловнойСотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)),
		|	РаспределениеНачислений.Сотрудник,
		|	РаспределениеНачислений.Подразделение,
		|	РаспределениеНачислений.ФизическоеЛицо,
		|	РаспределениеНачислений.Начисление,
		|	РаспределениеНачислений.ПодразделениеУчетаЗатрат,
		|	РаспределениеНачислений.СтатьяФинансирования,
		|	РаспределениеНачислений.СтатьяРасходов,
		|	РаспределениеНачислений.ВидДоходаИсполнительногоПроизводства
		|
		|ИМЕЮЩИЕ
		|	СУММА(РаспределениеНачислений.Сумма) <> 0";
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТРаспределениеНачисленийНАТекущегоДокумента", ИмяВТДанныеТекущегоДокумента);
	ДанныеДляУчетаУдержаний.БазовыеНачисления = Запрос.Выполнить().Выгрузить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат ДанныеДляУчетаУдержаний;
	
КонецФункции

#КонецОбласти