#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Вакансия",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
// 
// Возвращаемое значение:
//  Массив Из Строка
Функция ЗагруженныеОткликиВакансии(Вакансия) Экспорт
	
	МассивЗагруженныхОткликов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОткликиКандидатов.Вакансия,
	|	ОткликиКандидатов.ИдентификаторРезюме
	|ИЗ
	|	РегистрСведений.ОткликиКандидатов КАК ОткликиКандидатов
	|ГДЕ
	|	ОткликиКандидатов.Вакансия = &Вакансия";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	
	МассивЗагруженныхОткликов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторРезюме");
	
	Возврат МассивЗагруженныхОткликов;
	
КонецФункции

Функция НомерПоследнегоОтклика(Вакансия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОткликиКандидатов.Вакансия КАК Вакансия,
		|	МАКСИМУМ(ОткликиКандидатов.НомерОтклика) КАК НомерОтклика
		|ИЗ
		|	РегистрСведений.ОткликиКандидатов КАК ОткликиКандидатов
		|ГДЕ
		|	ОткликиКандидатов.Вакансия = &Вакансия
		|
		|СГРУППИРОВАТЬ ПО
		|	ОткликиКандидатов.Вакансия";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерОтклика;
	КонецЕсли;
	
	Возврат 0; 
	
КонецФункции

#КонецОбласти

#КонецЕсли