
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК Т2 
	|	ПО Т2.Подразделение = Т.РабочееМесто.Подразделение
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т2.ВышестоящееПодразделение)
	|	И ЗначениеРазрешено(Т.РабочееМесто.Владелец)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"МедицинскиеОсмотры");
КонецПроцедуры

#КонецОбласти

Процедура ПриОбновленииИБОбновитьПериодичностьОсмотровРабочихМест(ПараметрыОбновления = Неопределено) Экспорт 
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодичностьМедицинскихОсмотровРабочихМест.РабочееМесто КАК РабочееМесто
		|ИЗ
		|	РегистрСведений.ПериодичностьМедицинскихОсмотровРабочихМест КАК ПериодичностьМедицинскихОсмотровРабочихМест
		|ГДЕ
		|	НЕ ПериодичностьМедицинскихОсмотровРабочихМест.РабочееМесто В (&Обработанные)
		|	И ПериодичностьМедицинскихОсмотровРабочихМест.ВидОсмотра = &ВидОсмотра";
	
	ВидОсмотраМедицинский = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотраМедицинский);
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	РабочиеМестаКОбновлению = Новый Массив;
	
	Выборка = ОбновляемыеДанные.Выбрать();
	Пока Выборка.Следующий() Цикл
		РабочиеМестаКОбновлению.Добавить(Выборка.РабочееМесто);
	КонецЦикла;
															  
	МедицинскиеОсмотры.ОбновитьПериодичностьОсмотровРабочихМест(РабочиеМестаКОбновлению, ВидОсмотраМедицинский);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, РабочиеМестаКОбновлению);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект) Экспорт
	СохранитьПрежнийНаборЗаписей(Объект);
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект) Экспорт
	ЗаполнитьТаблицуОбновления(Объект);
КонецПроцедуры

Процедура СохранитьПрежнийНаборЗаписей(Объект) Экспорт
	
	Если Объект.Отбор["РабочееМесто"].Использование = Ложь Или Не ЗначениеЗаполнено(Объект.Отбор.РабочееМесто.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Отбор["ВидОсмотра"].Использование = Ложь Или Не ЗначениеЗаполнено(Объект.Отбор.ВидОсмотра.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееМесто", Объект.Отбор.РабочееМесто.Значение);
	Запрос.УстановитьПараметр("ВидОсмотра", Объект.Отбор.ВидОсмотра.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНабора.РабочееМесто КАК РабочееМесто,
		|	ДанныеНабора.КратностьОсмотра КАК КратностьОсмотра,
		|	ДанныеНабора.ПериодичностьОсмотра КАК ПериодичностьОсмотра,
		|	ДанныеНабора.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичностиОсмотра,
		|	ДанныеНабора.ПредставлениеПериодичностиОсмотра КАК ПредставлениеПериодичностиОсмотра
		|ИЗ
		|	РегистрСведений.ПериодичностьМедицинскихОсмотровРабочихМест КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.ВидОсмотра = &ВидОсмотра
		|	И ДанныеНабора.РабочееМесто = &РабочееМесто";
	
	Объект.ДополнительныеСвойства.Вставить("ПрежнийНабор", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновления(Объект) Экспорт
	
	ТаблицаОбновления = МедицинскиеОсмотры.НоваяТаблицаОбновлениеПериодическихОсмотров();
	Объект.ДополнительныеСвойства.Вставить("ТаблицаОбновлениеПериодическихОсмотров", ТаблицаОбновления);
	
	Если Не Объект.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = Объект.ДополнительныеСвойства["ПрежнийНабор"];
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ПрежнийНабор, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМестаМассив = Объект.ВыгрузитьКолонку("РабочееМесто");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМестаМассив, ПрежнийНабор.ВыгрузитьКолонку("РабочееМесто"), Истина);
	
	ТаблицаОбновления = ФизическиеЛицаНаРабочихМестах(РабочиеМестаМассив);
	
	Объект.ДополнительныеСвойства.Вставить("ТаблицаОбновлениеПериодическихОсмотров", ТаблицаОбновления);
	
КонецПроцедуры

Функция ФизическиеЛицаНаРабочихМестах(РабочиеМеста)
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "РабочееМесто", "В", РабочиеМеста);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники";
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		Метаданные.РегистрыСведений.РабочиеМестаСотрудников.Имя,
		Запрос.МенеджерВременныхТаблиц,
		Ложь,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТСотрудникиПериоды", "ФизическоеЛицо"),
		ПараметрыПостроения);
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РабочиеМеста.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	ВТРабочиеМестаСотрудников КАК РабочиеМеста";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаОбновления = МедицинскиеОсмотры.НоваяТаблицаОбновлениеПериодическихОсмотров();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

#КонецОбласти

#КонецЕсли
