#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест.СохранитьПрежнийНаборЗаписей(ЭтотОбъект);
	МедицинскиеОсмотры.ЗаполнитьОрганизацию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеПериодическихОсмотров();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьОбновлениеПериодическихОсмотров()
	
	РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест.ЗаполнитьТаблицуОбновления(ЭтотОбъект);
	МедицинскиеОсмотры.ЗарегистрироватьОбновлениеПериодическихОсмотров(ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОсмотров);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли