#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Процедура выполняет первоначальное заполнение классификатора.
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СоставыВоеннослужащих.Ссылка
	               |ИЗ
	               |	Справочник.СоставыВоеннослужащих КАК СоставыВоеннослужащих";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	КлассификаторТаблица = Новый ТаблицаЗначений;
	КлассификаторТаблица.Колонки.Добавить("Наименование");
	КлассификаторТаблица.Колонки.Добавить("ОфицерскийСостав");
	// ЗУПК
	КлассификаторТаблица.Колонки.Добавить("КатегорияСоставаВоеннослужащих");
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// ЗУПК
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Солдаты, матросы, сержанты, старшины'");
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Прапорщики и мичманы'");
	// ЗУПК
	Иначе
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Рядовые (солдаты, матросы)'");
		НоваяСтрокаКлассификатора.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Солдаты;
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Сержанты (старшины)'");
		НоваяСтрокаКлассификатора.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Сержанты;
		
	КонецЕсли;
	// ЗУПК
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Младшие офицеры'");
	НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
	// ЗУПК
	НоваяСтрокаКлассификатора.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Офицеры;
	// ЗУПК
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Старшие офицеры'");
	НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
	// ЗУПК
	НоваяСтрокаКлассификатора.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Офицеры;
	// ЗУПК
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Высшие офицеры'");
	НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
	// ЗУПК
	НоваяСтрокаКлассификатора.КатегорияСоставаВоеннослужащих = Перечисления.КатегорииСоставаВоеннослужащих.Офицеры;
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
	// ЗУПК
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Командный'");
		НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Инженерно-технический'");
		НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Военно-гуманитарный'");
		НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Педагогический'");
		НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Юридический'");
		НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Медицинский'");
		НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
		
		НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
		НоваяСтрокаКлассификатора.Наименование = НСтр("ru='Ветеринарный'");
		НоваяСтрокаКлассификатора.ОфицерскийСостав = Истина;	
	// ЗУПК
	КонецЕсли;
	// ЗУПК
	Для Каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		СправочникОбъект = Справочники.СоставыВоеннослужащих.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаКлассификатора);
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли