#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично();
	
	РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура ЗаполнитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично() Экспорт
	
   	ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
	ОписаниеЭлемента.Наименование = "Пп. 12 п. 1 ст. 436 (выигрыши по лотерее)";
	ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 6; //...в пределах 30 000-кратного размера месячного расчетного показателя
	ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
	ОписаниеЭлемента.НеИспользуется = Ложь;
	СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
	
	ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
	ОписаниеЭлемента.Наименование = "Пп. 13 п. 1 ст. 432 (выплаты в связи с профессиональным обучением)";
	ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 12;  //...в 12-кратном размере месячного расчетного показателя
	ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
	ОписаниеЭлемента.НеИспользуется = Ложь;
	СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
	
   	ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
	ОписаниеЭлемента.Наименование = "Пп. 3 п. 1 ст. 436 (выплаты на погребение физического лица)";
	ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 94; //...в пределах 94-кратного размера месячного расчетного показателя
	ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода;
	ОписаниеЭлемента.НеИспользуется = Ложь;
	СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
		
КонецПроцедуры

Функция ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично()
	Возврат Новый Структура("Наименование, РазмерНеоблагаемогоДохода, ПериодПредоставления, НеИспользуется");	
КонецФункции	

Процедура СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента)
	
	Если ЗначениеЗаполнено(ОписаниеЭлемента.Наименование) Тогда
		
		СсылкаНаОбъект =  Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию(ОписаниеЭлемента.Наименование); 
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Элемент = СсылкаНаОбъект.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.СоздатьЭлемент();
		КонецЕсли;
		
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
	Элемент.Записать();
	
КонецПроцедуры	

Процедура ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2023() Экспорт 
    
    ДивидендыФизическихЛиц = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 8 п. 1 ст. 341 (дивиденды, полученные от юридического лица – резидента)");
    
    Если ДивидендыФизическихЛиц = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
        ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
        ОписаниеЭлемента.Наименование = "Пп. 8 п. 1 ст. 341 (дивиденды, полученные от юридического лица – резидента)";
        ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 30000; //...в пределах 30 000-кратного размера месячного расчетного показателя
        ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода;
        ОписаниеЭлемента.НеИспользуется = Ложь;
        СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
        
        РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
    КонецЕсли; 
    	
КонецПроцедуры

Процедура ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2026() Экспорт 
    
	ДивидендыФизическихЛиц = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 8 п. 1 ст. 341 (дивиденды, полученные от юридического лица – резидента)");
	Если ДивидендыФизическихЛиц <> Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
		ОписаниеЭлемента.Наименование = "Пп. 8 п. 1 ст. 341 (дивиденды, полученные от юридического лица – резидента)";
		ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 30000; //...в пределах 30 000-кратного размера месячного расчетного показателя
		ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода;
		ОписаниеЭлемента.НеИспользуется = Истина;
		Элемент = ДивидендыФизическихЛиц.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
		Элемент.Записать();
		РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	КонецЕсли; 
	
	ВыигрышиПоЛотерее = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 11 п. 1 ст. 341 (выигрыши по лотере)");
	Если ВыигрышиПоЛотерее <> Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
		ОписаниеЭлемента.Наименование = "Пп. 11 п. 1 ст. 341 (выигрыши по лотере)";
		ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 0.5; //...50 процентов от минимального размера заработной платы
		ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
		ОписаниеЭлемента.НеИспользуется = Истина;
		Элемент = ВыигрышиПоЛотерее.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
		Элемент.Записать();
		РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	КонецЕсли; 
	
	ОбщественныеРаботы = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 12 п. 1 ст. 341 (выплаты в связи с выполнением общественных работ и профессиональным обучением)");
	Если ОбщественныеРаботы <> Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
		ОписаниеЭлемента.Наименование = "Пп. 12 п. 1 ст. 341 (выплаты в связи с выполнением общественных работ и профессиональным обучением)";
		ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 1;  //...в минимальном размере заработной платы
		ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
		ОписаниеЭлемента.НеИспользуется = Истина;
		Элемент = ОбщественныеРаботы.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
		Элемент.Записать();
		РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	КонецЕсли; 
	
	МедУслугиРождениеПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 18 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)");
	Если МедУслугиРождениеПогребение <> Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
		ОписаниеЭлемента.Наименование = "Пп. 18 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)";
		ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 8; //...в пределах 8-кратного минимального размера заработной платы
		ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода;
		ОписаниеЭлемента.НеИспользуется = Истина;
		Элемент = МедУслугиРождениеПогребение.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
		Элемент.Записать();
		РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	КонецЕсли; 
	
	ВыигрышиПоЛотерее2026 = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 12 п. 1 ст. 436 (выигрыши по лотерее)");
    Если ВыигрышиПоЛотерее2026 = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
        ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
        ОписаниеЭлемента.Наименование = "Пп. 12 п. 1 ст. 436 (выигрыши по лотерее)";
		ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 6; //...в пределах 30 000-кратного размера месячного расчетного показателя
		ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
		ОписаниеЭлемента.НеИспользуется = Ложь;
		СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
		РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	КонецЕсли; 
	
	ПрофессиональноеОбучение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 13 п. 1 ст. 432 (выплаты в связи с профессиональным обучением)"); 
	Если ПрофессиональноеОбучение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
		ОписаниеЭлемента.Наименование = "Пп. 13 п. 1 ст. 432 (выплаты в связи с профессиональным обучением)";
		ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 12;  //...в 12-кратном размере месячного расчетного показателя
		ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахМесяца;
		ОписаниеЭлемента.НеИспользуется = Ложь;
		СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
		РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	КонецЕсли; 

	ВыплатыНаПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 3 п. 1 ст. 436 (выплаты на погребение физического лица)"); 
	Если ВыплатыНаПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		ОписаниеЭлемента = ОписаниеЭлементаДоходаНеПодлежащегоНалогообложениюЧастично();
		ОписаниеЭлемента.Наименование = "Пп. 3 п. 1 ст. 436 (выплаты на погребение физического лица)";
		ОписаниеЭлемента.РазмерНеоблагаемогоДохода = 94; //...в пределах 94-кратного размера месячного расчетного показателя
		ОписаниеЭлемента.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов.ВПределахКалендарногоГода;
		ОписаниеЭлемента.НеИспользуется = Ложь;
		СоздатьЭлементДоходаНеПодлежащегоНалогообложениюЧастично(ОписаниеЭлемента);
		РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.НачальноеЗаполнение();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли