#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура ПодготовитьДанныеДляЗаполнения(Параметры, АдресХранилища) Экспорт	
		
	Если Не ЗначениеЗаполнено(Параметры.ДатаАктуальности) Тогда 
		Возврат;
	КонецЕсли;
	
	Организация 		= Параметры.Организация;
	ДатаАктуальности 	= Параметры.ДатаАктуальности;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(ДатаАктуальности, Организация);
	
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПостроения,
		Неопределено);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ШтатноеРасписание.Дата КАК ДатаНачалаДействия,
	               |	ШтатноеРасписание.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	               |	ШтатноеРасписание.КоличествоСтавок КАК КоличествоСтавок,
	               |	ШтатноеРасписание.Занято КАК Занято,
	               |	ИдентификаторыПодразделений.Идентификатор КАК ИдентификаторПодразделения,
	               |	ИдентификаторыПодразделений.Наименование КАК НаименованиеПодразделения,
	               |	ВЫБОР
	               |		КОГДА ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.Характеристика.Код = &СтационарноеСтруктурноеПодразделениеКодТипа
	               |			ТОГДА ИдентификаторыПодразделений.ДополнительныйИдентификатор
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ИдентификаторОтделенияИлиКабинета,
	               |	ВЫБОР
	               |		КОГДА ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.Характеристика.Код = &СтационарноеСтруктурноеПодразделениеКодТипа
	               |			ТОГДА ИдентификаторыПодразделений.ДополнительноеНаименование
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК НаименованиеОтделенияИлиКабинета,
	               |	ХарактеристикиДолжностьПоМедРегистру.Характеристика.Код КАК ДолжностьКод,
	               |	ХарактеристикиДолжностьПоМедРегистру.Характеристика.НаименованиеПолное КАК ДолжностьНаименование,
	               |	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика.Код КАК ДолжностьПоФедСправочникуКод,
	               |	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика.НаименованиеПолное КАК ДолжностьПоФедСправочникуНаименование,
	               |	ВЫРАЗИТЬ(ШтатноеРасписание.Описание КАК СТРОКА(1000)) КАК Описание
	               |ИЗ
	               |	ВТШтатноеРасписание КАК ШтатноеРасписание
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыПодразделений
	               |		ПО ШтатноеРасписание.Подразделение = ИдентификаторыПодразделений.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру
	               |		ПО (ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипСтруктурногоПодразделения)
	               |			И ШтатноеРасписание.Подразделение = ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоМедРегистру
	               |		ПО (ХарактеристикиДолжностьПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжность)
	               |			И ШтатноеРасписание.Должность = ХарактеристикиДолжностьПоМедРегистру.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру
	               |		ПО (ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжностьПоФедСправочнику)
	               |			И ШтатноеРасписание.Должность = ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Объект";
	
	Запрос.УстановитьПараметр("КлассификаторДолжностьПоФедСправочнику", "1.2.643.5.1.13.13.99.2.885");
	Запрос.УстановитьПараметр("КлассификаторДолжность", "1.2.643.5.1.13.13.99.2.181");
	Запрос.УстановитьПараметр("КлассификаторТипСтруктурногоПодразделения", "1.2.643.5.1.13.13.99.2.299");
	Запрос.УстановитьПараметр("СтационарноеСтруктурноеПодразделениеКодТипа", "2");

	Параметры.Вставить("ДанныеДляЗаполнения", Запрос.Выполнить().Выгрузить());
	
	ПоместитьВоВременноеХранилище(Параметры, АдресХранилища);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли