#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		СтатусРезидент = ПредопределенноеЗначение("Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент");
		Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
			ЗаписьНабора.Статус = СтатусРезидент;
			ЗаписьНабора.Период = '19000101';
			ЗаписьНабора.ИмеетПравоНаПенсионноеОбеспечение = Истина;
			ЗаписьНабора.ПодлежитСоциальномуСтрахованию = Истина;
			ЗаписьНабора.ПодлежитСоциальномуМедицинскомуСтрахованию = Истина;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли