#Область ПрограммныйИнтерфейс

#Область СозданиеМетаданныхФормы

Процедура ОбработатьСозданиеМетаданныхФормы(Форма, Отказ = Ложь, СтандартнаяОбработка = Истина) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)  Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)  Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//		// новые реквизиты формы
	//		
	//		МассивДобавляемыхРеквизитов = Новый Массив;

	//		НовыйРеквизит = Новый РеквизитФормы("", Новый ОписаниеТипов(""));
	//		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	//		
	//		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

#КонецОбласти

Процедура ОбработатьСобытияФормПриСозданииЧтенииЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
    //
	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
    //
	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ПанельНастроекУправлениеПерсоналом
	
	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("ПанельНастроекУправлениеПерсоналом") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ОхранаТруда") Тогда
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(НСтр("ru = 'Учет вредных (опасных) производственных '"));
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'факторов'"),,,,"e1cib/list/Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы"));
			МассивСтрок.Добавить(НСтр("ru = ' и '"));
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'видов работ'"),,,,"e1cib/list/Справочник.ВидыРаботМедицинскихОсмотров"));
			МассивСтрок.Добавить(НСтр("ru = ', выполнение которых требует обязательного прохождения медицинского контроля. 
			|Поддержка проведения предварительных и периодических медицинских осмотров. 
			|По команде '"));
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Медицинские осмотры'"),,,,"e1cib/app/Обработка.МедицинскиеОсмотры"));
			МассивСтрок.Добавить(НСтр("ru = ' можно заполнить вредные факторы рабочих мест, направить сотрудников на периодический осмотр и ввести заключение по результатам. '"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИспользоватьМедицинскиеОсмотрыРасширеннаяПодсказка", "Заголовок", Новый ФорматированнаяСтрока(МассивСтрок));
		
		КонецЕсли;
		
	КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область МероприятияОбученияРазвития
	
	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("МероприятияОбученияРазвития") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтоимостьЗаВсех", "Подсказка", НСтр("ru = 'тг.'"));
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтоимостьЗаОдного", "Подсказка", НСтр("ru = 'тг.'"));
    
		КонецЕсли;

#КонецОбласти

#Область РабочиеМестаОхраныТруда
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РабочиеМестаОхраныТруда") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОсобенностиИсчисленияСтраховыхВзносов", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОсмотрыПоПриказу29Н", "Заголовок", НСтр("ru = 'Медицинские осмотры'"));
    
		ИначеЕсли ДополнительныеПараметры.ИмяФормы = ВРег("ФормаСписка") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОсмотрыПоПриказу29Н", "Заголовок", НСтр("ru = 'Медицинские осмотры'"));

		КонецЕсли;
		
#КонецОбласти

#Область ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоответствующиеАктуальныеВредныеФакторыГруппа", "Видимость", Ложь);
    
		КонецЕсли;

#КонецОбласти

#Область ВидыРаботМедицинскихОсмотров
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ВидыРаботМедицинскихОсмотров") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаЭлемента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоответствующиеВредныеФакторы29НГруппа", "Видимость", Ложь);
    
		КонецЕсли;

#КонецОбласти

	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ОтражениеРасходовНаПерсонал
	
	Если ДополнительныеПараметры.ИмяОбъекта = ВРег("ОтражениеРасходовНаПерсонал") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВзносы", "Заголовок", НСтр("ru = 'Налоги/отчисления работодателя'"));
    
		КонецЕсли;

#КонецОбласти

#Область РезультатыСпецоценкиУсловийТруда
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РезультатыСпецоценкиУсловийТруда") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаВредныхФакторовРабочегоМеста") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаОсмотрыПоПриказу29Н", "Заголовок", НСтр("ru = 'Медицинские осмотры'"));
    
		КонецЕсли;

#КонецОбласти

#Область НаправлениеНаМедицинскийОсмотр
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НаправлениеНаМедицинскийОсмотр") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВредныеФакторыИВидыРаботСтарые", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерПолисаОМС", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерПолисаДМС", "Видимость", Ложь);
    
		КонецЕсли;

#КонецОбласти
		
#Область ЗаключениеМедицинскогоОсмотра
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ЗаключениеМедицинскогоОсмотра") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВредныеФакторыИВидыРаботСтарые", "Видимость", Ложь);
    
		КонецЕсли;

#КонецОбласти

#Область НесчастныйСлучайНаПроизводстве
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("НесчастныйСлучайНаПроизводстве") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КвалификацияНесчастногоСлучая", "Подсказка", НСтр("ru = 'Излагается решение лиц, проводивших расследование несчастного случая, о квалификации несчастного случая со ссылками на соответствующие статьи ТК РК'"));
			
		КонецЕсли;

#КонецОбласти


#Область ЗаявкаНаКомандировку
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("ЗаявкаНаКомандировку") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			Элементы.ВидПаспорта.СписокВыбора.Очистить();
			Элементы.ВидПаспорта.СписокВыбора.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДокументовФизическихЛиц.УдостоверениеЛичностиРК"));
			Элементы.ВидПаспорта.СписокВыбора.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДокументовФизическихЛиц.ПаспортРК"));
			
			Элементы.МестоНазначения.ПодсказкаВвода = НСтр("ru = 'Например, Астана, Казахстан");
		
		КонецЕсли;

#КонецОбласти

#Область РешениеОКадровомПереводе
	
	ИначеЕсли ДополнительныеПараметры.ИмяОбъекта = ВРег("РешениеОКадровомПереводе") Тогда
		
		Если ДополнительныеПараметры.ИмяФормы = ВРег("ФормаДокумента") Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РаботаетДистанционно", "Видимость", Ложь);
			
			НовыйЭлемент = Элементы.Вставить("РежимДистанционнойРаботы", Тип("ПолеФормы"), Элементы.ГруппаИзменитьДистанционнуюРаботу, Элементы.РаботаетДистанционно);
			НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 		= "Объект.РежимДистанционнойРаботы";
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_РежимДистанционнойРаботыПриИзменении");
			НовыйЭлемент.ПодсказкаВвода = НСтр("ru = 'Работа по месту нахождения работодателя'");
			НовыйЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;

		КонецЕсли;

#КонецОбласти

	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
    //
	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область СотрудникиОхранаТруда
	
	Если ДополнительныеПараметры.ИмяФормы = ВРег("СотрудникиОхранаТруда") Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаФакторы", "Видимость", Ложь);
		
	КонецЕсли;

#КонецОбласти

КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииПланаОбмена(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	Элементы = Форма.Элементы;

#Область ИмяОбъкта
	
	//Если ДополнительныеПараметры.ИмяОбъекта = ВРег("") Тогда
	//	
	//	Если ДополнительныеПараметры.ИмяФормы = ВРег("") Тогда
	//		
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Видимость", Ложь);
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "", "Заголовок", НСтр("ru = 'Месяц выплаты'"));
    //
	//	КонецЕсли;
	//	
	//КонецЕсли;

#КонецОбласти

КонецПроцедуры

#КонецОбласти
