
#Область ПрограммныйИнтерфейс

Функция СообщенияФоновогоЗадания(ИдентификаторЗадания) Экспорт
	
	СообщениеПользователю = ДлительныеОперации.СообщенияПользователю(Истина, ИдентификаторЗадания);
	
	Адрес = ПоместитьВоВременноеХранилище(СообщениеПользователю);
	
	Возврат Адрес;
	
КонецФункции

// Возвращает БИН организации
//
// Параметры:
//  Организация	- СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Строка - БИН
//
Функция БИНОрганизации(Организация) Экспорт
	
	Возврат ЭТДСервер.БИНОрганизации(Организация);
	
КонецФункции

Функция ПолучитьПараметрыЭТД() Экспорт
	
	Возврат ЭТДСерверПовтИсп.ПолучитьПараметрыЭТД();
	
КонецФункции

Функция ПолучитьМассивВыбораВладельцыПрофиля() Экспорт
	
	Возврат ЭТДСервер.ПолучитьМассивВыбораВладельцыПрофиля();
	
КонецФункции

Процедура ЗаполнитьПараметрыЭТД(Перезаписать = Ложь, ПараметрыЗаполнения) Экспорт
	
	ЭТДСервер.ЗаполнитьПараметрыЭТД(Перезаписать, ПараметрыЗаполнения);
	
КонецПроцедуры

Процедура СоздатьЗаписьЖурналаРегистрации(
	ИмяСобытия, 
	УровеньСтрокой = "", 
	ОбъектМетаданных = Неопределено, 
	Данные = Неопределено, 
	Комментарий = "") Экспорт
	
	ЭТДСервер.СоздатьЗаписьЖурналаРегистрации(ИмяСобытия, УровеньСтрокой, ОбъектМетаданных, Данные, Комментарий);
	
КонецПроцедуры

Функция ЭТД_ЗаписатьЗначениеJSON(Значение) Экспорт
	
	Возврат ЭТДСервер.ЭТД_ЗаписатьЗначениеJSON(Значение);
	
КонецФункции

Функция ЭТД_ПрочитатьЗначениеJSON(Значение, СвойстваДаты = "") Экспорт
	
	Возврат ЭТДСервер.ЭТД_ПрочитатьЗначениеJSON(Значение, СвойстваДаты);
	
КонецФункции

Функция ПроверкаСтатусаСервиса(Адрес, СтрокаЗапроса) Экспорт
	
	Возврат ЭТДКлиентСервер.ПроверкаСтатусаСервиса(Адрес, СтрокаЗапроса);
	
КонецФункции

Функция ПолучитьНаименованиеДолжности(КодДолжности) Экспорт
	
	Возврат ЭТДСервер.ПолучитьНаименованиеДолжности(КодДолжности);
	
КонецФункции

Функция ПолучитьНаименованиеТяжелыхУсловийТруда(КодУсловийТруда) Экспорт
	
	Возврат ЭТДСервер.ПолучитьНаименованиеТяжелыхУсловийТруда(КодУсловийТруда);
	
КонецФункции

Функция ПолучитьНаименованиеОбразованияИностранца(КодОбразования) Экспорт
	
	Возврат ЭТДСервер.ПолучитьНаименованиеОбразованияИностранца(КодОбразования);
	
КонецФункции

Функция ПолучитьНаименованиеОснованияПривлеченияИностранца(КодОснованияПривлеченияИностранца) Экспорт
	
	Возврат ЭТДСервер.ПолучитьНаименованиеОснованияПривлеченияИностранца(КодОснованияПривлеченияИностранца);
	
КонецФункции

Функция ПолучитьНаименованиеСуда(КодСуда) Экспорт
	
	Возврат ЭТДСервер.ПолучитьНаименованиеСуда(КодСуда);
	
КонецФункции

Функция ПолучитьПараметрыСотрудникаДляСоциальногоОтпуска(Сотрудник, ДатаПолученияДанных = Неопределено) Экспорт
	
	Возврат ЭТДСервер.ПолучитьПараметрыСотрудникаДляСоциальногоОтпуска(Сотрудник, ДатаПолученияДанных);
	
КонецФункции

Функция ПолучитьКоличествоВыходныхДнейЗаПериод(Сотрудник, НачалоПериода, КонецПериода) Экспорт
	
	Возврат ЭТДСервер.ПолучитьКоличествоВыходныхДнейЗаПериод(Сотрудник, НачалоПериода, КонецПериода);
	
КонецФункции

Функция ПолучитьНаименованиеПричиныРасторжения(КодПричиныРасторжения) Экспорт
	
	Возврат ЭТДСервер.ПолучитьНаименованиеПричиныРасторжения(КодПричиныРасторжения);
	
КонецФункции

Функция ПолучитьДанныеАутентификацииИВерсию(ДанныеОрганизации) Экспорт
	
	ДанныеАутентификацииСВерсией = ЭТДСервер.ПолучитьДанныеАутентификации(ДанныеОрганизации);
	ВерсияЭТД = ЭТДСервер.ПолучитьВерсиюБиблиотекиЭТД();
	ДанныеАутентификацииСВерсией.Вставить("ВерсияЭТД", ВерсияЭТД);
	
	Возврат ДанныеАутентификацииСВерсией;
	
КонецФункции

#Область Криптобиблиотека

Функция ИспользоватьВнешнююКриптографиюДляКомпоненты() Экспорт
	
	ТипПровайдераКриптографии = КриптографияВызовСервера.ПолучитьТипПровайдераКриптографии();
	
	Если ТипПровайдераКриптографии = Перечисления.ТипПровайдераКриптографии.Kalkan Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ВыполнятьКриптографическиеОперацииНаКлиенте() Экспорт
	
	Возврат КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте();
	
КонецФункции

Функция СохранитьКлючВФайл(ДанныеКлючаЭЦП) Экспорт
	
	Возврат ЭТДКлиентСервер.СохранитьКлючВФайл(ДанныеКлючаЭЦП);
	
КонецФункции

Процедура УдалитьФайлКлюча(ДанныеКлючаЭЦП) Экспорт
	
	ЭТДКлиентСервер.УдалитьФайлКлюча(ДанныеКлючаЭЦП);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
