#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(НалогиВзносы.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.УдержаниеНалоговВзносовПоНУ;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция УдержанияНалоговВзносовПоНУОстатки(НалогиВзносы, Ссылка, Организация, ПериодРегистрации = Неопределено) Экспорт

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ВТФизЛица", НалогиВзносы);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТФизЛица.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТФизЛица.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ВТФизЛица.НалогВзнос КАК НалогВзнос,
	|	ВТФизЛица.ВидДохода КАК ВидДохода
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	&ВТФизЛица КАК ВТФизЛица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	МесяцНалоговогоПериода,
	|	ВидНалогаВзносаОтчисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.НалогВзносПриход - НалогиВзносыРасчетыНалогоплательщиковОстатки.НалогВзносРасход КАК СуммаКПеречислению,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.ВидДохода КАК ВидДохода
	|ПОМЕСТИТЬ ВТ_НалогиВзносыРасчетыНалогоплательщиков
	|ИЗ
	|	РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И (ФизическоеЛицо, МесяцНалоговогоПериода, ВидНалогаВзносаОтчисления, ВидДохода) В
	|					(ВЫБРАТЬ
	|						ВТФизЛица.ФизическоеЛицо,
	|						ВТФизЛица.МесяцНалоговогоПериода,
	|						ВТФизЛица.ВидНалогаВзносаОтчисления,
	|						ВТФизЛица.ВидДохода
	|					ИЗ
	|						ВТФизЛица КАК ВТФизЛица)) КАК НалогиВзносыРасчетыНалогоплательщиковОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	МесяцНалоговогоПериода,
	|	ВидНалогаВзносаОтчисления,
	|	ВидДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТФизЛица.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТФизЛица.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ВЫБОР
	|		КОГДА ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТФизЛица.НалогВзнос - ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению
	|	КОНЕЦ КАК СуммаОстаток,
	|	ВТФизЛица.ВидДохода КАК ВидДохода
	|ИЗ
	|	ВТФизЛица КАК ВТФизЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогиВзносыРасчетыНалогоплательщиков КАК ВТ_НалогиВзносыРасчетыНалогоплательщиков
	|		ПО ВТФизЛица.ФизическоеЛицо = ВТ_НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо
	|			И ВТФизЛица.МесяцНалоговогоПериода = ВТ_НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода
	|			И ВТФизЛица.ВидНалогаВзносаОтчисления = ВТ_НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления
	|			И ВТФизЛица.ВидДохода = ВТ_НалогиВзносыРасчетыНалогоплательщиков.ВидДохода
	|			И ВТФизЛица.НалогВзнос > ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению
	|ГДЕ
	|	НЕ ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции 

#КонецОбласти

#КонецЕсли