#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Отказ = НЕ МожноЗаполнитьДокумент();
	
	Ошибки = Неопределено;
	
	Для Каждого СтрокаТаблицы Из НалогиВзносы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо) Тогда
			СоздатьОшибкуЗаполненияТабличнойЧасти(Ошибки,"ФизическоеЛицо", "Физическое лицо",СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидНалогаВзносаОтчисления) Тогда
			СоздатьОшибкуЗаполненияТабличнойЧасти(Ошибки,"ВидНалогаВзносаОтчисления", "Вид налога / взноса",СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.МесяцНалоговогоПериода) Тогда
			СоздатьОшибкуЗаполненияТабличнойЧасти(Ошибки,"МесяцНалоговогоПериода", "Месяц налогового периода",СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.РегистрацияВНалоговомОргане) Тогда
			СоздатьОшибкуЗаполненияТабличнойЧасти(Ошибки,"РегистрацияВНалоговомОргане", "Регистрация в налоговом органе",СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидДохода) Тогда
			СоздатьОшибкуЗаполненияТабличнойЧасти(Ошибки,"ВидДохода", "Вид дохода",СтрокаТаблицы.НомерСтроки);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	Движения.НалогиВзносыРасчетыНалогоплательщиков.Записать();
	УдержанияНалоговВзносовПоНУОстатки = Документы.УдержаниеНалоговВзносовПоНУ.УдержанияНалоговВзносовПоНУОстатки(НалогиВзносы, Ссылка, Организация, ПериодРегистрации);
	Для Каждого Элемент Из НалогиВзносы Цикл
		ОтборФизическихЛиц = Новый Структура();
		ОтборФизическихЛиц.Вставить("ФизическоеЛицо",Элемент.ФизическоеЛицо);
		ОтборФизическихЛиц.Вставить("ВидДохода",Элемент.ВидДохода);
		ОтборФизическихЛиц.Вставить("ВидНалогаВзносаОтчисления",Элемент.ВидНалогаВзносаОтчисления);
		ОтборФизическихЛиц.Вставить("МесяцНалоговогоПериода",Элемент.МесяцНалоговогоПериода);
		Строки = УдержанияНалоговВзносовПоНУОстатки.НайтиСтроки(ОтборФизическихЛиц);
		Если Строки.Количество() > 0 Тогда
 			Если Строки[0].СуммаОстаток = 0 Тогда
				СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для сотрудника: %1 отсутствует сумма к перечислению по виду налога, взноса: %2 на %3'"),
				Элемент.ФизическоеЛицо,Элемент.ВидНалогаВзносаОтчисления,Формат(Элемент.МесяцНалоговогоПериода,"ДЛФ=DD"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
				Отказ = Истина;
			Иначе			
				СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для сотрудника: %1 сумма к перечислению по виду налога, взноса: %2 на %3 превышает сумму остатка к перечислению на %4'"),
				Элемент.ФизическоеЛицо,Элемент.ВидНалогаВзносаОтчисления,Формат(Элемент.МесяцНалоговогоПериода,"ДЛФ=DD"), Строки[0].СуммаОстаток);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	//ВзаиморасчетыССотрудниками.ВедомостьОбработкаПроведения(ЭтотОбъект, Отказ);
	УчетНалоговВзносовОтчисленийРасширенный.ЗарегистрироватьУдержанныеНалогиВзносы(ЭтотОбъект, Отказ);
	
	Для Каждого НаборЗаписей Из Движения Цикл
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Записывать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииЗаполненияДокумента

Функция МожноЗаполнитьДокумент() Экспорт
	
	ПравилаПроверки = Новый Структура;
	
	ПравилаПроверки.Вставить("Организация",			НСтр("ru='Не выбрана организация'"));
	ПравилаПроверки.Вставить("ПериодРегистрации",	НСтр("ru='Не задан период регистрации'"));
	ПравилаПроверки.Вставить("Дата",				НСтр("ru='Не задана дата документа'"));
	
	Возврат ЗарплатаКадры.СвойстваЗаполнены(ЭтотОбъект, ПравилаПроверки);
	
КонецФункции

Процедура ЗаполнитьДокумент() Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗаполнитьСписокСотрудников(МенеджерВременныхТаблиц);
	
	Результат = УчетНалоговВзносовОтчислений.РассчитатьУдержаниеНалоговВзносовПоНУ(МенеджерВременныхТаблиц, Ссылка, Организация, Дата, ПериодРегистрации);
	
	ЗаполнитьПоТаблицеНалоговВзносов(Результат);
	
	РезультатПрочиеДоходы = УчетНалоговВзносовОтчислений.РассчитатьУдержаниеНалоговВзносовПоНУПрочиеДоходы(Ссылка, Организация, Дата, ПериодРегистрации);
	
	ЗаполнитьПоТаблицеНалоговВзносов(РезультатПрочиеДоходы,, Истина);
	
КонецПроцедуры

Процедура ОбновитьДокумент(СписокОбновления) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗаполнитьСписокСотрудников(МенеджерВременныхТаблиц);
	
	Результат = УчетНалоговВзносовОтчислений.РассчитатьУдержаниеНалоговВзносовПоНУ(МенеджерВременныхТаблиц, Ссылка, Организация, Дата, ПериодРегистрации);
	
	ЗаполнитьПоТаблицеНалоговВзносов(Результат, СписокОбновления);
	
КонецПроцедуры

Процедура ДополнитьДокумент(ФизическиеЛица) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗаполнитьСписокСотрудников(МенеджерВременныхТаблиц, ФизическиеЛица);
	
	Результат = УчетНалоговВзносовОтчислений.РассчитатьУдержаниеНалоговВзносовПоНУ(МенеджерВременныхТаблиц, Ссылка, Организация, Дата, ПериодРегистрации);
	
	ЗаполнитьПоТаблицеНалоговВзносов(Результат,,Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПоТаблицеНалоговВзносов(Результат, СписокОбновления = Неопределено, ДополнитьТаблицу = Ложь)
	
	Если СписокОбновления = Неопределено Тогда
		
		Если НЕ ДополнитьТаблицу Тогда
			НалогиВзносы.Очистить();
		КонецЕсли;
		
		Для каждого Строка Из Результат Цикл
			
			НоваяСтрока = НалогиВзносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
		КонецЦикла;
		
		НалогиВзносы.Сортировать("ФизическоеЛицо Возр");
		
	Иначе
		
		Для каждого СтрокаСписка Из СписокОбновления Цикл
			
			ПараметрыОтбора =
				Новый Структура("ФизическоеЛицо, ВидНалогаВзносаОтчисления, ВидДохода, МесяцНалоговогоПериода, РегистрацияВНалоговомОргане",
				СтрокаСписка.ФизическоеЛицо,
				СтрокаСписка.ВидНалогаВзносаОтчисления,
				СтрокаСписка.ВидДохода,
				СтрокаСписка.МесяцНалоговогоПериода,
				СтрокаСписка.РегистрацияВНалоговомОргане);
			
			МассивСтрокРезультат = Результат.НайтиСтроки(ПараметрыОтбора);
			
			Если МассивСтрокРезультат.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			МассивСтрок = НалогиВзносы.НайтиСтроки(ПараметрыОтбора);
			
			МассивСтрок[0].НалогВзнос = МассивСтрокРезультат[0].НалогВзнос;
			МассивСтрок[0].РучнаяКорректировка = Ложь;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокСотрудников(МенеджерВременныхТаблиц, ФизическиеЛица = Неопределено)
	
	// Получаем всех работавших в организации в периоде регистрации.
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.Организация 					= Организация;
	ПараметрыПолученияСотрудниковОрганизаций.ОтбиратьПоГоловнойОрганизации 	= Ложь;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода 		=  '00010101';
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода	=  КонецМесяца(ПериодРегистрации);
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоТрудовымДоговорам = Истина;
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоДоговорамГПХ = Истина;
	Если ФизическиеЛица <> Неопределено Тогда
		ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц = ФизическиеЛица;
	КонецЕсли;
	//
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудниковОрганизаций,
		"ВТСотрудники");
	
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьОшибкуЗаполненияТабличнойЧасти(Ошибки, Поле, ПолеСиноним, НомерСтроки)
	
	Поле = "Объект.НалогиВзносы[%1]." + Поле;
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Не заполнена колонка """ + ПолеСиноним + """ в строке %1 табличной части.'"),
		НомерСтроки);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,Поле,ТекстСообщения,,НомерСтроки - 1);
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли