
#Область СлужебныйПрограммныйИнтерфейс

Процедура УдалитьДублиФакторовВидовРаботРабочегоМеста(Форма) Экспорт
	
	УдалитьДублиФакторовВидовРабот(Форма.ВредныеФакторыМедицинскихОсмотров, "ВредныйФактор");
	УдалитьДублиФакторовВидовРабот(Форма.ВидыРаботМедицинскихОсмотров, "ВидРабот");
	УдалитьДублиФакторовВидовРабот(Форма.ВредныеФакторыПсихиатрическихОсвидетельствований, "ВредныйФактор");
	УдалитьДублиФакторовВидовРабот(Форма.ВидыРаботПсихиатрическихОсвидетельствований, "ВидРабот");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВредныеФакторыВидыРабот

Процедура ПрочитатьОписаниеПериодичностиВредногоФактораВидаРабот(Форма, ТекущийОбъект = Неопределено) Экспорт
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Форма.Объект;
	КонецЕсли;
	
	Форма.ПрежняяПериодичность = МедицинскиеОсмотрыКлиентСервер.ОписаниеПериодичностиОсмотров();
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьОписаниеПериодичностиПоВредномуФакторуВидуРабот(Форма.ПрежняяПериодичность, ТекущийОбъект);
	
КонецПроцедуры

Функция ПериодичностьВредногоФактораВидаРаботИзменилась(НоваяПериодичность, ПрежняяПериодичность) Экспорт
	
	Возврат Не ОбщегоНазначения.КоллекцииИдентичны(НоваяПериодичность, ПрежняяПериодичность);
	
КонецФункции

Процедура УдалитьДублиФакторовВидовРабот(ТаблицаФакторов, ИмяПоляФактора) Экспорт
	
	Уникальные = Новый Соответствие;
	
	Индекс = 0;
	Пока Индекс < ТаблицаФакторов.Количество() Цикл
		СтрокаТаблицы = ТаблицаФакторов[Индекс];
		Если Уникальные[СтрокаТаблицы[ИмяПоляФактора]] = Неопределено Тогда
			Уникальные.Вставить(СтрокаТаблицы[ИмяПоляФактора], Истина);
			Индекс = Индекс + 1;
		Иначе
			ТаблицаФакторов.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
