
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	СписокИсключаемыхЗначение = Новый СписокЗначений;
	СписокИсключаемыхЗначение.Добавить(Перечисления.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСтраховымВзносам);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВзносамФССНСиПЗ);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Индекс = 0 по Перечисления.ТипыОценочныхОбязательств.Количество()-1 Цикл
		ТекущееЗначение = Перечисления.ТипыОценочныхОбязательств.Получить(Индекс);
		Если СписокИсключаемыхЗначение.НайтиПоЗначению(ТекущееЗначение) = Неопределено Тогда
			ДанныеВыбора.Добавить(ТекущееЗначение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецЕсли