
#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзменениеФизическогоЛицаДляМедицинскогоСтрахованияПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МедицинскоеСтрахование.ЗарегистрироватьИзменениеФизическогоЛицаПриЗаписи(Источник);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеРодственникаФизическогоЛицаДляМедицинскогоСтрахованияПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МедицинскоеСтрахование.ЗарегистрироватьИзменениеРодственникаПриЗаписи(Источник);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗапомнитьПрежнееЗначениеГражданстваФизическогоЛицаПередЗаписьюНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицо = Источник.Отбор.ФизическоеЛицо.Значение;
	Использование = Источник.Отбор["ФизическоеЛицо"].Использование;
	
	Если Не Использование
		Или Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МедицинскоеСтрахование.ЗапомнитьПрежнееЗначениеГражданстваФизическогоЛицаПередЗаписью(Источник, ФизическоеЛицо);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПроверитьИзменениеГражданстваМедицинскогоСтрахованияПриЗаписиНабораЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.ДополнительныеСвойства.Свойство("СоответствиеПрежнееЗначениеГражданстваМедицинскогоСтрахования") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	МедицинскоеСтрахование.ПроверитьИзменениеГражданстваМедицинскогоСтрахованияПриЗаписи(Источник);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
