
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НаДату >= '20150101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;
	Иначе
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  	20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 	5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 	5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2019Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 12 декабря 2018 г. №4"; 
	НоваяФорма.ДатаНачалоДействия = '20180101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20181231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2020Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 5 февраля 2020 г. №17"; 
	НоваяФорма.ДатаНачалоДействия = '20190101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20191231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2020Кв3";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 7 сентября 2020 г. №34"; 
	НоваяФорма.ДатаНачалоДействия = '20200101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20201231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2021Кв4";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 7 сентября 2020 г. №34 (в редакции Приказа от 3 декабря 2021 №42)"; 
	НоваяФорма.ДатаНачалоДействия = '20210101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20211231';

    НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2022Кв4";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 7 сентября 2020 г. №34 (в редакции Приказа от 27 августа 2022 №19)"; 
	НоваяФорма.ДатаНачалоДействия = '20220101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20241231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета1Т2025Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Председателя Комитета по стат-ке Министерства нац. экономики РК от 7 сентября 2020 г. №34 (в редакции Приказа от 24 июня 2024 №9)"; 
	НоваяФорма.ДатаНачалоДействия = '20250101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

    Возврат ТаблицаФормОтчета;
	
КонецФункции