
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		МассивСотрудников = Неопределено;
		Если Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
			Если Параметры.ЗначенияЗаполнения.Свойство("МассивЗастрахованных") И ТипЗнч(Параметры.ЗначенияЗаполнения.МассивЗастрахованных) = Тип("Массив") Тогда
				МассивЗастрахованных = Параметры.ЗначенияЗаполнения.МассивЗастрахованных;
				МассивФизическихЛиц = Новый Массив;
				Для Каждого Застрахованный Из МассивЗастрахованных Цикл
					Если ТипЗнч(Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
						МассивФизическихЛиц.Добавить(Застрахованный);
					Иначе
						МассивФизическихЛиц.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Застрахованный, "Владелец"));
					КонецЕсли;
				КонецЦикла;
				ОсновныеСотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(МассивФизическихЛиц,
					Истина,
					Объект.Организация,
					ТекущаяДатаСеанса());
				МассивСотрудников = ОсновныеСотрудникиФизическихЛиц.ВыгрузитьКолонку("Сотрудник");
			КонецЕсли;
		Иначе
			ЗначенияДляЗаполнения = Новый Структура;
			ЗначенияДляЗаполнения.Вставить("Организация", "Объект.Организация");
			Если Не Параметры.Свойство("ЗначенияЗаполнения") Или Не Параметры.ЗначенияЗаполнения.Свойство("Подразделение") Тогда
				// Подразделение (пустое значение) может быть передано как параметр заполнения из обработки.
				ЗначенияДляЗаполнения.Вставить("Подразделение", "Объект.Подразделение");
			КонецЕсли;
			ЗначенияДляЗаполнения.Вставить("Ответственный", "Объект.Ответственный");
			ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		КонецЕсли;
		
		Объект.ДатаИзменения = ТекущаяДатаСеанса();
		ПриПолученииДанныхНаСервере();
		Если МассивСотрудников <> Неопределено Тогда
			СотрудникиЗаполнитьНаСервере(МассивСотрудников, МассивЗастрахованных);
		КонецЕсли;
	Иначе
		
		// Если это открытие уже существующего документа, 
		// то оно может выполняться в режиме добавления строк.
		Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Сотрудники") Тогда
			МассивСотрудников = Новый Массив;
			Для Каждого ПараметрСотрудник Из Параметры.ЗначенияЗаполнения.Сотрудники Цикл
				НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", ПараметрСотрудник));
				Если НайденныеСтроки.Количество() = 0 Тогда
					МассивСотрудников.Добавить(ПараметрСотрудник);
				КонецЕсли;
			КонецЦикла;
			
			Если МассивСотрудников.Количество() > 0 Тогда
				СотрудникиЗаполнитьНаСервере(МассивСотрудников);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		НадписьОснование = Объект.Основание;
	Иначе
		НадписьОснование = НСтр("ru = '<без основания>'");
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"НадписьОснование",
		"Видимость",
		ЗначениеЗаполнено(Объект.Основание));
	
	ИспользуютсяУдержания = ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиУдержания", "Видимость", ИспользуютсяУдержания);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРасширенияПрограммСтрахования", "Видимость", ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РодственникиРасширенияПрограммСтрахования", "Видимость", ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЧастичноеУдержание", "Видимость", ИспользуетсяЧастичноеУдержание);
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущийОбъект.ДатаОтправки = Дата(Год(ТекущийОбъект.Дата), Месяц(ТекущийОбъект.Дата), День(ТекущийОбъект.Дата), Час(ТекущаяДата), Минута(ТекущаяДата), Секунда(ТекущаяДата));
	РеквизитыВДанные(ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПрикреплениеКПрограммамМедицинскогоСтрахования", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеВРеквизиты();
	ПерерасчетЗарплаты.РегистрацияПерерасчетовПоПредварительнымДаннымВФоне(ТекущийОбъект.Ссылка);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ВыборФорматаВложений") Тогда
		
		Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			ПараметрыОтправки = ПараметрыОтправкиПисьма(ВыбранноеЗначение);
			
			МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
			МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	МедицинскоеСтрахованиеФормы.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыПоказателиДокумента" И Источник.ВладелецФормы = ЭтотОбъект Тогда
		Если Параметр.Показатели.Количество() > 0 Тогда 
			ОбработатьИзменениеПоказателейНаСервере(Параметр.Показатели);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОсновныхПолейНаСервере();
	ЗаполнитьДействиеИПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховаяКомпанияПриИзменении(Элемент)
	ДополнитьФорму();
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияПриИзменении(Элемент)
	
	Для Каждого Сотрудники Из Объект.Сотрудники Цикл
		СотрудникиДатаНачалаПриИзмененииНаСервере(Сотрудники.Сотрудник, Объект.ДатаИзменения, Сотрудники.ДатаРождения);
		
		Если ИспользуютсяУдержания Тогда
			ПересчитатьУдержания(Сотрудники.ФизическоеЛицо, Сотрудники.СпособУдержания);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдержатьПриПрикрепленииПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
	Если Не УдержатьПриПрикреплении Тогда
		ПрекратитьУдержания = Ложь;
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.СуммаПредела = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьУдержанияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
	Если Не ПрекратитьУдержания Тогда
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.СуммаПредела = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВводМесяцаУдержанияНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
		Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Неопределено, "Месяц", Ложь),
		ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УдержаниеПриИзменении(Элемент)
	
	УдержаниеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные.ФизическоеЛицо);
	ОбновитьПодвалГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Элементы.ГрафикУдержаний.ТекущиеДанные.Дата", "Элементы.ГрафикУдержаний.ТекущиеДанные.ДатаСтрокой", Направление);
	Объект.ГрафикУдержаний.Сортировать("Дата");
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Элементы.ГрафикУдержаний.ТекущиеДанные.Дата", "Элементы.ГрафикУдержаний.ТекущиеДанные.ДатаСтрокой");
	СтрокаГрафика = Элементы.ГрафикУдержаний.ТекущиеДанные;
	СтрокаГрафика.ФизическоеЛицо = Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо;
	Объект.ГрафикУдержаний.Сортировать("Дата");
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		Если Не СтрокаГрафика.ВведеноПользователем Тогда
			Элементы.ГрафикУдержаний.ТекущиеДанные.ВведеноПользователем = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные.ФизическоеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	Если ГрафикУдержаний.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные.ФизическоеЛицо);
	ОбновитьПодвалГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрокРодственников(Элементы, ТекущиеДанные.ФизическоеЛицо);
	УстановитьОтборСтрокПоказателей(Элементы, ТекущиеДанные.ИдентификаторСтрокиВидаРасчета);
	
	УдержатьПриПрикреплении = ТекущиеДанные.СуммаУдержания <> 0;
	ПрекратитьУдержания = ТекущиеДанные.СуммаПредела <> 0;
	
	УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
	УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
	
	УстановитьДоступностьЭлементов();
	УстановитьЗаголовокСтраницыСотрудники();
	
	Элементы.ГруппаСтрахованиеШапка.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;
	Элементы.ГруппаНастройкиУдержания.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника Или ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников;
	Для Каждого Элемент Из Элементы.ГруппаСведенияСтрахованияСотрудника.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = ТекущиеДанные.ИзменилисьОтправленныеДанныеСотрудника;
	КонецЦикла;
	Элементы.Родственники.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников;
	
	//Удержания
	Если Не ИспользуютсяУдержания Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяЧастичноеУдержание Тогда
		ЕстьУдержание = ТекущиеДанные.ОбщаяСуммаУдержания > 0;
		Элементы.ГруппаЧастичноеУдержание.Видимость = ЕстьУдержание;
	КонецЕсли;
	
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	УстановитьВидимостьГрафикаУдержаний();
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		УстановитьОтборГрафикаУдержаний(Элементы, ТекущиеДанные.ФизическоеЛицо);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим строки показателей
	СтруктураОтбора = Новый Структура("ИдентификаторСтрокиВидаРасчета", ТекущиеДанные.ИдентификаторСтрокиВидаРасчета);
	НайденныеСтроки = Объект.Показатели.НайтиСтроки(СтруктураОтбора);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.Показатели.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиОбработкаВыбораНаСервере(ТекущиеДанные.Сотрудник);
	ЗаполнитьДействиеИПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиДатаНачалаПриИзмененииНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ДатаИзменения, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиЧастичноеУдержаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СотрудникиПроцентЧастичногоУдержания.Видимость = ТекущиеДанные.ЧастичноеУдержание;
	Элементы.СотрудникиСуммаЧастичногоУдержания.Видимость = ТекущиеДанные.ЧастичноеУдержание;
	
	ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПроцентЧастичногоУдержанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьОбщуюСуммуУдержания(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
		ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
		ТекущиеДанные.СуммаЧастичногоУдержания = 0;
	Иначе
		Если ТекущиеДанные.ПроцентЧастичногоУдержания > 100 Тогда
			ТекущиеДанные.ПроцентЧастичногоУдержания = 100;
		КонецЕсли;
		ТекущиеДанные.СуммаЧастичногоУдержания = Окр(ТекущиеДанные.ОбщаяСуммаУдержания * ТекущиеДанные.ПроцентЧастичногоУдержания / 100, 2);
	КонецЕсли;
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(ТекущиеДанные.ФизическоеЛицо);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСуммаЧастичногоУдержанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьОбщуюСуммуУдержания(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
		ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
		ТекущиеДанные.СуммаЧастичногоУдержания = 0;
	Иначе
		Если ТекущиеДанные.СуммаЧастичногоУдержания > ТекущиеДанные.ОбщаяСуммаУдержания Тогда
			ТекущиеДанные.СуммаЧастичногоУдержания = ТекущиеДанные.ОбщаяСуммаУдержания;
		КонецЕсли;
		ТекущиеДанные.ПроцентЧастичногоУдержания = Окр(ТекущиеДанные.СуммаЧастичногоУдержания / ТекущиеДанные.ОбщаяСуммаУдержания * 100, 2);
	КонецЕсли;
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(ТекущиеДанные.ФизическоеЛицо);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ЭлементКонтактнойИнформацииНачалоВыбора(ЭтотОбъект, Элемент, "Сотрудники", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ДокументУдостоверяющийЛичностьНачалоВыбора(ЭтотОбъект, Элемент, "Сотрудники", "Сотрудник", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиДатаРожденияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиДатаНачалаПриИзмененииНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаРождения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРодственники

&НаКлиенте
Процедура РодственникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанныеПрикрепления = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеПрикрепления = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.ФизическоеЛицо = ТекущиеДанныеПрикрепления.ФизическоеЛицо;
		ТекущиеДанные.ДатаПрикрепления = Объект.ДатаИзменения;
		ТекущиеДанные.ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить");
		Элементы.РодственникиУдалить.Видимость = Истина;
		Элементы.РодственникиУдалить.Заголовок = НСтр("ru = 'Удалить'");
		Элементы.РодственникиУдалить.Картинка = БиблиотекаКартинок.Удалить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		НайденныеСтроки = Объект.Родственники.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.Родственники.Удалить(НайденнаяСтрока);
		КонецЦикла;
		НайденныеСтроки = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.ПрограммыСтрахованияРодственников.Удалить(НайденнаяСтрока);
		КонецЦикла;
		НайденныеСтроки = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.РасширенияПрограммСтрахованияРодственников.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
		
		УстановитьЗаголовокСтраницыСотрудники();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
	
	УстановитьЗаголовокСтраницыСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущиеДанные.ПолучитьИдентификатор());
	УстановитьЗаголовокСтраницыСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ТекущиеДанные.ФизическоеЛицо);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.РодственникиФизическихЛиц.ФормаВыбора", ПараметрыОткрытия, Элементы.Родственники);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРодственникСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ТекущиеДанные.ФизическоеЛицо);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.РодственникиФизическихЛиц.ФормаВыбора", ПараметрыОткрытия, Элементы.Родственники);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиДатаПриИзмененииНаСервере(ТекущиеДанные.РодственникСсылка, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаОткрепления, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеСотрудники = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанныеСотрудники.СпособУдержания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиДатаПриИзмененииНаСервере(ТекущиеДанные.РодственникСсылка, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаОткрепления, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеСотрудники = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанныеСотрудники.СпособУдержания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПрограммыСтрахованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.РодственникСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("РодственникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		МедицинскоеСтрахованиеКлиент.ПрограммыСтрахованияРедактировать(
			ЭтотОбъект, ТекущиеДанные, "ПрограммыСтрахованияРодственников", "РодственникСсылка", ОповещениеЗавершения);
	Иначе
		МассивСтруктурПрограмм = Новый Массив;
		
		СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		НайденныеСтроки = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
			ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
		Иначе
			ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
		КонецЕсли;
		Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
			ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
		Иначе
			ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		КонецЕсли;
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
			СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
			СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
			СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
			Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
				ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("Программы", МассивСтруктурПрограмм);
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
		ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
		ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
		ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
		ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
		ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастовДляРодственников);
		ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("СтраховаяКомпания",  Объект.СтраховаяКомпания);
		ПараметрыОткрытия.Вставить("ДатаИзменения", Объект.ДатаИзменения);

		ОткрытьФорму("Справочник.ПрограммыМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РодственникиРасширенияПрограммСтрахованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.РодственникСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("РодственникиРасширенияПрограммСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		МедицинскоеСтрахованиеКлиент.РасширенияПрограммСтрахованияРедактировать(
			ЭтотОбъект, ТекущиеДанные, "РасширенияПрограммСтрахованияРодственников", "РодственникСсылка", ОповещениеЗавершения);
	Иначе
		МассивСтруктурРасширений = Новый Массив;
		
		СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		НайденныеСтроки = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
			ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
		Иначе
			ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
		КонецЕсли;
		Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
			ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
		Иначе
			ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		КонецЕсли;
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("РасширениеСтрахования", СтрокаТаблицы.РасширениеСтрахования);
			СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
			СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
			СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
			МассивСтруктурРасширений.Добавить(СтруктураПрограммы);
			Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
				ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("МассивСтруктурРасширений", МассивСтруктурРасширений);
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
		ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
		ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
		ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
		ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
		ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастовДляРодственников);
		ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("СтраховаяКомпания",  Объект.СтраховаяКомпания);
		ПараметрыОткрытия.Вставить("ДатаИзменения", Объект.ДатаИзменения);

		ОткрытьФорму("Справочник.РасширенияПрограммМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РодственникиЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ЭлементКонтактнойИнформацииНачалоВыбора(ЭтотОбъект, Элемент, "Родственники", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РодственникиДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ДокументУдостоверяющийЛичностьНачалоВыбора(ЭтотОбъект, Элемент, "Родственники", "РодственникСсылка", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СотрудникиЗаполнить(Команда)
	
	СотрудникиЗаполнитьНаСервере();
	
	Если Элементы.Сотрудники.ТекущаяСтрока = Неопределено И Объект.Сотрудники.Количество() > 0 Тогда
		Элементы.Сотрудники.ТекущаяСтрока = Объект.Сотрудники[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РодственникиЗаполнить(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиЗаполнитьНаСервере(ТекущиеДанные.Сотрудник);
	УстановитьЗаголовокСтраницыСотрудники();
	
	Если ИспользуютсяУдержания Тогда
		ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияРедактировать(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.ПрограммыСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "ПрограммыСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммСтрахованияРедактировать(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиРасширенияПрограммЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.РасширенияПрограммСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Неопределено;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ГосударственнаяСлужбаКлиент");
		Модуль.УточнитьПараметрыОткрытияФормыВыбораСотрудников(ПараметрыОткрытия);
	КонецЕсли; 
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.Сотрудники,
		Объект.Организация,
		Объект.Подразделение,
		Объект.Дата,
		Истина,
		АдресСпискаПодобранныхСотрудников(),
		ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтроки(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОрганизацияСсылка", Объект.Организация);
	Если Элементы.Сотрудники.ВыделенныеСтроки.Количество() = 0 Тогда
		ПараметрыОткрытия.Вставить("ПрограммыСтрахования", Новый Массив);
		ПараметрыОткрытия.Вставить("РасширенияПрограммСтрахования", Новый Массив);
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Неопределено);
		ПараметрыОткрытия.Вставить("СтраховаяПремия", 0);
		ПараметрыОткрытия.Вставить("СуммаУдержания", 0);
		ПараметрыОткрытия.Вставить("СуммаПредела", 0);
	Иначе
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(Элементы.Сотрудники.ВыделенныеСтроки[0]);
		СтруктураОтбора = Новый Структура("Сотрудник", СтрокаСотрудника.Сотрудник);
		
		ПараметрыОткрытия.Вставить("ПрограммыСтрахования", Новый Массив);
		НайденныеСтроки = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыОткрытия.ПрограммыСтрахования.Добавить(НайденнаяСтрока.ПрограммаСтрахования);
		КонецЦикла;
		
		ПараметрыОткрытия.Вставить("РасширенияПрограммСтрахования", Новый Массив);
		НайденныеСтроки = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыОткрытия.РасширенияПрограммСтрахования.Добавить(НайденнаяСтрока.РасширениеСтрахования);
		КонецЦикла;
		
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", СтрокаСотрудника.ДатаПрикрепления);
		ПараметрыОткрытия.Вставить("СтраховаяПремия", СтрокаСотрудника.СтраховаяПремия);
		ПараметрыОткрытия.Вставить("СуммаУдержания", СтрокаСотрудника.СуммаУдержания);
		ПараметрыОткрытия.Вставить("СуммаПредела", СтрокаСотрудника.СуммаПредела);
	КонецЕсли;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнениеСведенийСтрахованияЗакрытие", ЭтотОбъект, Элементы.Сотрудники.ВыделенныеСтроки);
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Форма.ФормаЗаполнениеСведенийСтрахования", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)

	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ТабличнаяЧасть.Сотрудники";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка списка сотрудников из файла'");
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьСотрудниковИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ВведеноПользователем",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ГрафикУдержаний.Представление"));
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийСумма.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ВведеноПользователем",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ИмяОткрываемойФормы = "ОбщаяФорма.ВыборФорматаВложений";
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиЗаполнитьНаСервере(МассивСотрудников = Неопределено, МассивЗастрахованных = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	
	// Очистим данные
	МассивФизическихЛиц = Новый Массив;
	ЗаполняемыеТаблицыСотрудников = Новый Массив;
	ЕстьОтборПоСотрудникам = Ложь;
	Если СтруктураИменТаблиц.ИмяТаблицыСотрудники <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыСотрудники]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников]);
	КонецЕсли;
	
	ЗаполняемыеТаблицыФизическихЛиц = Новый Массив;
	Если СтруктураИменТаблиц.ИмяТаблицыРодственники <> Неопределено Тогда
		ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРодственники]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников <> Неопределено Тогда
		ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников <> Неопределено Тогда
		ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников]);
	КонецЕсли;
	
	Если МассивСотрудников = Неопределено Тогда
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыСотрудников Цикл
			ЗаполняемаяТаблица.Очистить();
		КонецЦикла;
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыФизическихЛиц Цикл
			ЗаполняемаяТаблица.Очистить();
		КонецЦикла;
	Иначе
		Для Каждого СотрудникМассива Из МассивСотрудников Цикл
			
			СтруктураОтбора = Новый Структура("Сотрудник", СотрудникМассива);
			Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыСотрудников Цикл
				НайденныеСтроки = ЗаполняемаяТаблица.НайтиСтроки(СтруктураОтбора);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ЗаполняемаяТаблица.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЦикла;
			
			ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникМассива, "ФизическоеЛицо");
			СтруктураОтбора = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
			Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыФизическихЛиц Цикл
				НайденныеСтроки = ЗаполняемаяТаблица.НайтиСтроки(СтруктураОтбора);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ЗаполняемаяТаблица.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЦикла;
			МассивФизическихЛиц.Добавить(ФизическоеЛицо);
			ЕстьОтборПоСотрудникам = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Или Не ЗначениеЗаполнено(Объект.СтраховаяКомпания) Или Не ЗначениеЗаполнено(Объект.ДатаИзменения) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаИзменения", Объект.ДатаИзменения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних(
		|			&ДатаИзменения,
		|			Организация = &Организация
		|				И ПрограммаСтрахования.СтраховаяКомпания = &СтраховаяКомпания
		|				И Действует = ИСТИНА) КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ФизическоеЛицо В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	МассивПрикреплений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	Если МассивПрикреплений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Прикрепление Из МассивПрикреплений Цикл
		СотрудникиТаблица= СотрудникиПрикрепления(Прикрепление, ЕстьОтборПоСотрудникам, МассивСотрудников);
		Для Каждого СтрокаСотрудники Из СотрудникиТаблица Цикл
			НоваяСтрока = Объект.Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСотрудники);
		КонецЦикла;
		ПрограммыСотрудниковТаблица = ПрограммыСтрахованияСотрудников(Прикрепление, ЕстьОтборПоСотрудникам, МассивСотрудников);
		Для Каждого СтрокаПрограммыСотрудника Из ПрограммыСотрудниковТаблица Цикл
			НоваяСтрока = Объект.ПрограммыСтрахованияСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПрограммыСотрудника);
		КонецЦикла;
		РасширенияСотрудниковТаблица = РасширенияПрограммСтрахованияСотрудников(Прикрепление, ЕстьОтборПоСотрудникам, МассивСотрудников);
		Для Каждого СтрокаРасширениеСотрудника Из РасширенияСотрудниковТаблица Цикл
			НоваяСтрока = Объект.РасширенияПрограммСтрахованияСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасширениеСотрудника);
		КонецЦикла;
		ГрафикУдержанийТаблица = ГрафикУдержаний(Прикрепление, ЕстьОтборПоСотрудникам, МассивФизическихЛиц);
		Для Каждого СтрокаГрафика Из ГрафикУдержанийТаблица Цикл
			НоваяСтрока = Объект.ГрафикУдержаний.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГрафика);
		КонецЦикла;
		РодственникиТаблица = РодственникиПрикрепления(Прикрепление, ЕстьОтборПоСотрудникам, МассивФизическихЛиц);
		Для Каждого СтрокаРодственника Из РодственникиТаблица Цикл
			НоваяСтрока = Объект.Родственники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРодственника);
		КонецЦикла;
		ПрограммыРодственниковТаблица = ПрограммыСтрахованияРодственников(Прикрепление, ЕстьОтборПоСотрудникам, МассивФизическихЛиц);
		Для Каждого СтрокаПрограммыРодственника Из ПрограммыРодственниковТаблица Цикл
			НоваяСтрока = Объект.ПрограммыСтрахованияРодственников.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПрограммыРодственника);
		КонецЦикла;
		РасширенияРодственниковТаблица = РасширенияПрограммСтрахованияРодственников(Прикрепление, ЕстьОтборПоСотрудникам, МассивФизическихЛиц);
		Для Каждого СтрокаРасширениеРодственника Из РасширенияРодственниковТаблица Цикл
			НоваяСтрока = Объект.РасширенияПрограммСтрахованияРодственников.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасширениеРодственника);
		КонецЦикла;
		Если РодственникиТаблица.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивФизическихЛиц,
				РодственникиТаблица.ВыгрузитьКолонку("РодственникСсылка"));
		КонецЕсли;
		ДанныеЗастрахованныхТаблица = ДанныеЗастрахованных(Прикрепление, ЕстьОтборПоСотрудникам, МассивФизическихЛиц);
		Для Каждого СтрокаДанныеЗастрахованных Из ДанныеЗастрахованныхТаблица Цикл
			НоваяСтрока = Объект.ДанныеЗастрахованных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныеЗастрахованных);
		КонецЦикла;
		КИЗастрахованныхТаблица = КонтактнаяИнформацияЗастрахованных(Прикрепление, ЕстьОтборПоСотрудникам, МассивФизическихЛиц);
		Для Каждого СтрокаКИЗастрахованных Из КИЗастрахованныхТаблица Цикл
			НоваяСтрока = Объект.КонтактнаяИнформацияЗастрахованных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИЗастрахованных);
		КонецЦикла;
		Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
			ДопРеквизитыИСведенияЗастрахованныхТаблица = ДополнительныеРеквизитыИСведенияЗастрахованных(Прикрепление, ЕстьОтборПоСотрудникам, МассивФизическихЛиц);
			Для Каждого СтрокаДопРеквизиты Из ДопРеквизитыИСведенияЗастрахованныхТаблица Цикл
				НоваяСтрока = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДопРеквизиты);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьИзмененияПерсональныхДанных(МассивЗастрахованных);
	ДанныеВРеквизиты();
	Объект.Сотрудники.Сортировать("Сотрудник");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияПерсональныхДанных(МассивЗастрахованных)
	
	Если МассивЗастрахованных = Неопределено Тогда
		МассивЗастрахованных = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗастрахованных,
			Объект.Сотрудники.Выгрузить( , "ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗастрахованных,
			Объект.Родственники.Выгрузить( , "РодственникСсылка").ВыгрузитьКолонку("РодственникСсылка"));
	КонецЕсли;
	
	Если МассивЗастрахованных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИзмененияДанных(МассивЗастрахованных);
	ЗаполнитьИзмененияКонтактнойИнформации(МассивЗастрахованных);
	ЗаполнитьИзмененияДопРеквизитовИСведений(МассивЗастрахованных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияДанных(МассивЗастрахованных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеОтправленныхДанныхЗастрахованных.Организация КАК Организация,
		|	ИзменениеОтправленныхДанныхЗастрахованных.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Фамилия КАК Фамилия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзмениласьФамилия КАК ИзмениласьФамилия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Имя КАК Имя,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилосьИмя КАК ИзменилосьИмя,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Отчество КАК Отчество,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилосьОтчество КАК ИзменилосьОтчество,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзмениласьДатаРождения КАК ИзмениласьДатаРождения,
		|	ИзменениеОтправленныхДанныхЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилсяСтраховойНомерПФР КАК ИзменилсяСтраховойНомерПФР,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Пол КАК Пол,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилсяПол КАК ИзменилсяПол,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Страна КАК Страна,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзмениласьСтрана КАК ИзмениласьСтрана,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументВид КАК ДокументВид,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДанныхЗастрахованных КАК ИзменениеОтправленныхДанныхЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДанныхЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленныхДанныхЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ИзменениеОтправленныхДанныхЗастрахованных.Застрахованный В(&МассивЗастрахованных)";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	Запрос.УстановитьПараметр("МассивЗастрахованных", МассивЗастрахованных);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ФизическоеЛицо = ?(ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица"),
			Результат.Застрахованный,
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Застрахованный, "Владелец"));
		НайденныеСтрокиСотрудники = Объект.Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Если НайденныеСтрокиСотрудники.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НайденныеСтрокиСотрудники[0].ИзменилисьОтправленныеДанныеСотрудника = Истина;
		Иначе
			НайденныеСтрокиСотрудники[0].ИзменилисьУсловияСтрахованияРодственников = Истина;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Застрахованный", Результат.Застрахованный);
		НайденныеСтроки = Объект.ДанныеЗастрахованных.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НайденнаяСтрока = Объект.ДанныеЗастрахованных.Добавить();
			НайденнаяСтрока.Застрахованный = Результат.Застрахованный;
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];
		КонецЕсли;
		
		Если Результат.ИзмениласьФамилия Тогда
			НайденнаяСтрока.Фамилия = Результат.Фамилия;
		КонецЕсли;
		Если Результат.ИзменилосьИмя Тогда
			НайденнаяСтрока.Имя = Результат.Имя;
		КонецЕсли;
		Если Результат.ИзменилосьОтчество Тогда
			НайденнаяСтрока.Отчество = Результат.Отчество;
		КонецЕсли;
		Если Результат.ИзмениласьДатаРождения Тогда
			НайденнаяСтрока.ДатаРождения = Результат.ДатаРождения;
		КонецЕсли;
		Если Результат.ИзменилсяСтраховойНомерПФР Тогда
			НайденнаяСтрока.СтраховойНомерПФР = Результат.СтраховойНомерПФР;
		КонецЕсли;
		Если Результат.ИзменилсяПол Тогда
			НайденнаяСтрока.Пол = Результат.Пол;
		КонецЕсли;
		Если Результат.ИзмениласьСтрана Тогда
			НайденнаяСтрока.Страна = Результат.Страна;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументВид) Тогда
			НайденнаяСтрока.ДокументВид = Результат.ДокументВид;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументСерия) Тогда
			НайденнаяСтрока.ДокументСерия = Результат.ДокументСерия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументНомер) Тогда
			НайденнаяСтрока.ДокументНомер = Результат.ДокументНомер;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументДатаВыдачи) Тогда
			НайденнаяСтрока.ДокументДатаВыдачи = Результат.ДокументДатаВыдачи;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументСрокДействия) Тогда
			НайденнаяСтрока.ДокументСрокДействия = Результат.ДокументСрокДействия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументКемВыдан) Тогда
			НайденнаяСтрока.ДокументКемВыдан = Результат.ДокументКемВыдан;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументКодПодразделения) Тогда
			НайденнаяСтрока.ДокументКодПодразделения = Результат.ДокументКодПодразделения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияКонтактнойИнформации(МассивЗастрахованных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Вид КАК Вид,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных КАК ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Застрахованный В(&МассивЗастрахованных)";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	Запрос.УстановитьПараметр("МассивЗастрахованных", МассивЗастрахованных);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НайденныеСтрокиСотрудники = Объект.Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо", Результат.Застрахованный));
			Если НайденныеСтрокиСотрудники.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			НайденныеСтрокиСотрудники[0].ИзменилисьОтправленныеДанныеСотрудника = Истина;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Застрахованный", Результат.Застрахованный);
			СтруктураПоиска.Вставить("Вид", Результат.Вид);
			НайденныеСтрокиКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтрокиКИ.Количество() = 0 Тогда
				НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.Добавить();
				НайденнаяСтрокаКИ.Застрахованный = Результат.Застрахованный;
				НайденнаяСтрокаКИ.Вид = Результат.Вид;
			Иначе
				НайденнаяСтрокаКИ = НайденныеСтрокиКИ[0];
			КонецЕсли;
			НайденнаяСтрокаКИ.Значение = Результат.Представление;
			НайденнаяСтрокаКИ.Представление = Результат.Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияДопРеквизитовИСведений(МассивЗастрахованных)
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Свойство КАК Свойство,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных КАК ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Организация = &Организация
		|	И ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СтраховаяКомпания = &СтраховаяКомпания
		|	И ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Застрахованный В(&МассивЗастрахованных)";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	Запрос.УстановитьПараметр("МассивЗастрахованных", МассивЗастрахованных);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НайденныеСтрокиСотрудники = Объект.Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо", Результат.Застрахованный));
			Если НайденныеСтрокиСотрудники.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			НайденныеСтрокиСотрудники[0].ИзменилисьОтправленныеДанныеСотрудника = Истина;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Застрахованный", Результат.Застрахованный);
			СтруктураПоиска.Вставить("Свойство", Результат.Свойство);
			НайденныеСтрокиДопРеквизитыИСведения = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтрокиДопРеквизитыИСведения.Количество() = 0 Тогда
				НайденнаяСтрокаДопРеквизитыИСведения = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
				НайденнаяСтрокаДопРеквизитыИСведения.Застрахованный = Результат.Застрахованный;
				НайденнаяСтрокаДопРеквизитыИСведения.Свойство = Результат.Свойство;
			Иначе
				НайденнаяСтрокаДопРеквизитыИСведения = НайденныеСтрокиДопРеквизитыИСведения[0];
			КонецЕсли;
			НайденнаяСтрокаДопРеквизитыИСведения.Значение = Результат.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СотрудникиПрикрепления(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивСотрудников);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Сотрудник КАК Сотрудник,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаУдержания КАК СуммаУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаПредела КАК СуммаПредела,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.РасширениеПрограммСтрахования КАК РасширениеПрограммСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.УдерживатьИзЗарплаты КАК УдерживатьИзЗарплаты,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания КАК СпособУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания КАК ОбщаяСуммаУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ЧастичноеУдержание КАК ЧастичноеУдержание,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания КАК СуммаЧастичногоУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ПроцентЧастичногоУдержания КАК ПроцентЧастичногоУдержания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Сотрудник В (&МассивСотрудников)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПрограммыСтрахованияСотрудников(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивСотрудников);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Сотрудник КАК Сотрудник,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Сотрудник В (&МассивСотрудников)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция РасширенияПрограммСтрахованияСотрудников(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивСотрудников);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Сотрудник КАК Сотрудник,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Сотрудник В (&МассивСотрудников)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ГрафикУдержаний(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивФизическихЛиц)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Дата КАК Дата,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ДатаСтрокой КАК ДатаСтрокой,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Сумма КАК Сумма,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ВведеноПользователем КАК ВведеноПользователем,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.КоличествоДней КАК КоличествоДней,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Представление КАК Представление
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ГрафикУдержаний КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ФизическоеЛицо В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция РодственникиПрикрепления(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивФизическихЛиц)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ДатаОткрепления КАК ДатаОткрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.УдерживатьССотрудника КАК УдерживатьССотрудника,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.РодственникСсылка КАК РодственникСсылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ФизическоеЛицо В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПрограммыСтрахованияРодственников(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивФизическихЛиц)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ДатаОкончания КАК ДатаОкончания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.РодственникСсылка КАК РодственникСсылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ФизическоеЛицо В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция РасширенияПрограммСтрахованияРодственников(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивФизическихЛиц)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ДатаОкончания КАК ДатаОкончания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.РодственникСсылка КАК РодственникСсылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ФизическоеЛицо В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ДанныеЗастрахованных(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивФизическихЛиц)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРожденияДоИзменения КАК ДатаРожденияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФРДоИзменения КАК СтраховойНомерПФРДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ПолДоИзменения КАК ПолДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтранаДоИзменения КАК СтранаДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставлениеДоИзменения КАК ДокументПредставлениеДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВид КАК ДокументВид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВидДоИзменения КАК ДокументВидДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерияДоИзменения КАК ДокументСерияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомерДоИзменения КАК ДокументНомерДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения КАК ДокументДатаВыдачиДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействияДоИзменения КАК ДокументСрокДействияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыданДоИзменения КАК ДокументКемВыданДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения КАК ДокументКодПодразделенияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Фамилия КАК Фамилия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Имя КАК Имя,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Отчество КАК Отчество,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ФамилияДоИзменения КАК ФамилияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ИмяДоИзменения КАК ИмяДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ОтчествоДоИзменения КАК ОтчествоДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция КонтактнаяИнформацияЗастрахованных(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивФизическихЛиц)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК Вид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Значение КАК Значение,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК Представление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Значение КАК ЗначениеДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК ПредставлениеДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ДополнительныеРеквизитыИСведенияЗастрахованных(ПрикреплениеСсылка, ЕстьОтборПоСотрудникам, МассивФизическихЛиц)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Свойство КАК Свойство,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Значение КАК Значение,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Значение КАК ЗначениеДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДополнительныеРеквизитыИСведенияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ЕстьОтборПоСотрудникам
		|				ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Застрахованный В (&МассивФизическихЛиц)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		СотрудникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
		Если ИспользуютсяУдержания Тогда
			ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаСотрудника;
	ПрограммыСтрахования = Результат;
	ТекущиеДанные.ПрограммыСтрахования = "";
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.ПрограммыСтрахованияСотрудников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для каждого ЭлементМассива Из ПрограммыСтрахования Цикл
		НоваяСтрока = Объект.ПрограммыСтрахованияСотрудников.Добавить();
		НоваяСтрока.Сотрудник = ТекущиеДанные.Сотрудник;
		НоваяСтрока.ПрограммаСтрахования = ЭлементМассива.ПрограммаСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		НоваяСтрока.Действие = ЭлементМассива.Действие;
		ТекущиеДанные.ПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования + ЭлементМассива.ПрограммаСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.ПрограммыСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.ПрограммыСтрахования, 2);
	КонецЕсли;
	
	РассчитатьСтраховуюПремиюСотрудников(СтрокаСотрудника.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		СотрудникиРасширенияПрограммЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
		Если ИспользуютсяУдержания Тогда
			ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиРасширенияПрограммЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаСотрудника;
	РасширенияСтрахования = Результат;
	ТекущиеДанные.РасширенияПрограммСтрахования = "";
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.РасширенияПрограммСтрахованияСотрудников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для Каждого ЭлементМассива Из РасширенияСтрахования Цикл
		НоваяСтрока = Объект.РасширенияПрограммСтрахованияСотрудников.Добавить();
		НоваяСтрока.Сотрудник = ТекущиеДанные.Сотрудник;
		НоваяСтрока.РасширениеСтрахования = ЭлементМассива.РасширениеСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		НоваяСтрока.Действие = ЭлементМассива.Действие;
		ТекущиеДанные.РасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования + ЭлементМассива.РасширениеСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.РасширенияПрограммСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.РасширенияПрограммСтрахования, 2);
	КонецЕсли;
	
	РассчитатьСтраховуюПремиюСотрудников(СтрокаСотрудника.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПрограммыСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		РодственникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		
		Если ИспользуютсяУдержания Тогда
			ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
			Если ТекущиеДанныеСотрудники = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанныеСотрудники.СпособУдержания);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаРодственника;
	ПрограммыСтрахования = Результат;
	ТекущиеДанные.ПрограммыСтрахования = "";
	СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
	НайденныеСтроки = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.ПрограммыСтрахованияРодственников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для Каждого ЭлементМассива Из ПрограммыСтрахования Цикл
		НоваяСтрока = Объект.ПрограммыСтрахованияРодственников.Добавить();
		НоваяСтрока.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
		НоваяСтрока.РодственникСсылка = ТекущиеДанные.РодственникСсылка;
		НоваяСтрока.ПрограммаСтрахования = ЭлементМассива.ПрограммаСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		Если ЭлементМассива.Свойство("Действие") Тогда
			НоваяСтрока.Действие = ЭлементМассива.Действие;
		Иначе
			НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить;
		КонецЕсли;
		ТекущиеДанные.ПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования + ЭлементМассива.ПрограммаСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.ПрограммыСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.ПрограммыСтрахования, 2);
	КонецЕсли;
	РассчитатьСтраховуюПремиюРодственников(СтрокаРодственника.РодственникСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРасширенияПрограммСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		РодственникиРасширенияПрограммСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		
		Если ИспользуютсяУдержания Тогда
			ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
			Если ТекущиеДанныеСотрудники = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанныеСотрудники.СпособУдержания);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиРасширенияПрограммСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаРодственника;
	РасширенияСтрахования = Результат;
	ТекущиеДанные.РасширенияПрограммСтрахования = "";
	СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
	НайденныеСтроки = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.РасширенияПрограммСтрахованияРодственников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для Каждого ЭлементМассива Из РасширенияСтрахования Цикл
		НоваяСтрока = Объект.РасширенияПрограммСтрахованияРодственников.Добавить();
		НоваяСтрока.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
		НоваяСтрока.РодственникСсылка = ТекущиеДанные.РодственникСсылка;
		НоваяСтрока.РасширениеСтрахования = ЭлементМассива.РасширениеСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		Если ЭлементМассива.Свойство("Действие") Тогда
			НоваяСтрока.Действие = ЭлементМассива.Действие;
		Иначе
			НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить;
		КонецЕсли;
		ТекущиеДанные.РасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования + ЭлементМассива.РасширениеСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.РасширенияПрограммСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.РасширенияПрограммСтрахования, 2);
	КонецЕсли;
	РассчитатьСтраховуюПремиюРодственников(СтрокаРодственника.РодственникСсылка);
	
КонецПроцедуры

&НаСервере
Процедура РодственникиОбработкаВыбораНаСервере(Родственник, ИдентификаторСтроки)
	
	СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаРодственника.РодственникСсылка = Родственник;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Или Не ЗначениеЗаполнено(Объект.СтраховаяКомпания) Тогда
		Возврат;
	КонецЕсли;
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.Организация, Объект.СтраховаяКомпания);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	СтрокаРодственника.Фамилия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "Фамилия");
	СтрокаРодственника.ФамилияДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "Фамилия");
	СтрокаРодственника.Имя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "Имя");
	СтрокаРодственника.ИмяДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "Имя");
	СтрокаРодственника.Отчество = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "Отчество");
	СтрокаРодственника.ОтчествоДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "Отчество");
	
	Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
		СтрокаРодственника.ДатаРождения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "ДатаРождения");
		СтрокаРодственника.ДатаРожденияДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "ДатаРождения");
	КонецЕсли;
	
	Если ОтправляемыеДанные.Найти("Пол") <> Неопределено Тогда
		ПолРодственника = СотрудникиКлиентСервер.ОпределитьПолПоОтчеству(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "Отчество"));
		СтрокаРодственника.Пол = ПолРодственника;
		СтрокаРодственника.ПолДоИзменения = ПолРодственника;
	КонецЕсли;
	
	Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
		СтрокаРодственника.СтраховойНомерПФР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "СНИЛС");
		СтрокаРодственника.СтраховойНомерПФРДоИзменения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родственник, "СНИЛС");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьФорму()
	
	ТаблицыСоСведениями = Новый Соответствие;
	ТаблицыСоСведениями.Вставить("Сотрудники", "ГруппаСведенияСтрахованияСотрудника");
	ТаблицыСоСведениями.Вставить("Родственники", "ГруппаСведенияСтрахованияРодственника");
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеДополнитьФорму(ЭтотОбъект, ТаблицыСоСведениями, Объект.Организация, Объект.СтраховаяКомпания);
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОсновныхПолейНаСервере()
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеПрочитатьНастройки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиСуммаПредела", "Доступность", ПрекратитьУдержания);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиДатаНачалаПриИзмененииНаСервере(Сотрудник, ДатаПрикрепления, ДатаРождения)
	
	ПараметрыОтбора = Новый Структура("Сотрудник", Сотрудник);
	СтрокиПрограмм = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиПрограмм Цикл
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		Если СтрокаТаблицы.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Изменить Тогда
			ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
			ПараметрыРасчета.ДатаОкончания = ДатаПрикрепления;
		ИначеЕсли СтрокаТаблицы.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить Тогда
			ПараметрыРасчета.ДатаНачала = ДатаПрикрепления;
			ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		Иначе
			ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
			ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		КонецЕсли;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(СтрокаТаблицы.ПрограммаСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	СтрокиРасширений = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиРасширений Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(СтрокаТаблицы.РасширениеСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	
	РассчитатьСтраховуюПремиюСотрудников(Сотрудник);
	
КонецПроцедуры

&НаСервере
Процедура РодственникиДатаПриИзмененииНаСервере(РодственникСсылка, ДатаПрикрепления, ДатаОткрепления, ДатаРождения)
	
	ПараметрыОтбора = Новый Структура("РодственникСсылка", РодственникСсылка);
	СтрокиПрограмм = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиПрограмм Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		СтрокаТаблицы.ДатаОкончания = ДатаОткрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастовДляРодственников;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(СтрокаТаблицы.ПрограммаСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	СтрокиРасширений = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиРасширений Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		СтрокаТаблицы.ДатаОкончания = ДатаОткрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастовДляРодственников;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(СтрокаТаблицы.РасширениеСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	
	РассчитатьСтраховуюПремиюРодственников(РодственникСсылка);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтраховуюПремиюСотрудников(Сотрудники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	МедицинскоеСтрахованиеФормы.РассчитатьСтраховуюПремиюСотрудников(Объект, СтруктураИменТаблиц, Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтраховуюПремиюРодственников(Родственники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	МедицинскоеСтрахованиеФормы.РассчитатьСтраховуюПремиюРодственников(Объект, СтруктураИменТаблиц, Родственники);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрокРодственников(Элементы, ФизическоеЛицо)
	
	СтруктураОтбора = ?(ФизическоеЛицо = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Родственники", "ОтборСтрок", СтруктураОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикУдержаний", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрокПоказателей(Элементы, ИдентификаторСтроки)
	
	СтруктураОтбора = ?(ИдентификаторСтроки = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ИдентификаторСтрокиВидаРасчета", ИдентификаторСтроки));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Показатели", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборГрафикаУдержаний(Элементы, ФизическоеЛицо)
	
	СтруктураОтбора = ?(ФизическоеЛицо = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикУдержаний", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьПрограммСтрахования(ТекущиеДанные)
	
	СотрудникиПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования;
	Если ПустаяСтрока(СотрудникиПрограммыСтрахования) Тогда
		СотрудникиПрограммыСтрахования = НСтр("ru = '<Не указаны>'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные)
	
	СотрудникиРасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования;
	Если ПустаяСтрока(СотрудникиРасширенияПрограммСтрахования) Тогда
		СотрудникиРасширенияПрограммСтрахования = НСтр("ru = '<Не указаны>'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны();
	
	ДополнитьФорму();
	ДанныеВРеквизиты();
	ПриИзмененииОсновныхПолейНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДанныеВРеквизиты()
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.Организация, Объект.СтраховаяКомпания);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	ОтправляемаяКонтактнаяИнформацияТаблица = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Объект.Организация, Объект.СтраховаяКомпания);
	ОтправляемаяКонтактнаяИнформация = ОтправляемаяКонтактнаяИнформацияТаблица.ВыгрузитьКолонку("Вид");

	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		ОтправляемыеДопРеквизитыИСведенияТаблица = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Объект.Организация, Объект.СтраховаяКомпания);
		ОтправляемыеДопРеквизитыИСведения = ОтправляемыеДопРеквизитыИСведенияТаблица.ВыгрузитьКолонку("Свойство");
	КонецЕсли;
	
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		ОтборСтрок = Новый Структура("Застрахованный", СтрокаСотрудника.ФизическоеЛицо);
		НайденнаяСтрока = Объект.ДанныеЗастрахованных.НайтиСтроки(ОтборСтрок);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСотрудника.Фамилия = НайденнаяСтрока[0].Фамилия;
		СтрокаСотрудника.ФамилияДоИзменения = НайденнаяСтрока[0].ФамилияДоИзменения;
		СтрокаСотрудника.Имя = НайденнаяСтрока[0].Имя;
		СтрокаСотрудника.ИмяДоИзменения = НайденнаяСтрока[0].ИмяДоИзменения;
		СтрокаСотрудника.Отчество = НайденнаяСтрока[0].Отчество;
		СтрокаСотрудника.ОтчествоДоИзменения = НайденнаяСтрока[0].ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			СтрокаСотрудника[Сведение] = НайденнаяСтрока[0][Сведение];
			СтрокаСотрудника[Сведение + "ДоИзменения"] = НайденнаяСтрока[0][Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ОтправляемаяКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			ОтборСтрок = Новый Структура("Застрахованный, Вид", СтрокаСотрудника.ФизическоеЛицо, ОтправляемаяКИ);
			НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
			Если НайденнаяСтрокаКИ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул + "ДоИзменения"] = НайденнаяСтрокаКИ[0].ЗначениеДоИзменения;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул + "Представление"] = НайденнаяСтрокаКИ[0].Представление;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"] = НайденнаяСтрокаКИ[0].ПредставлениеДоИзменения;
		КонецЦикла;
		Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
			Для Каждого Свойство Из ОтправляемыеДопРеквизитыИСведения Цикл
				ОтборСтрок = Новый Структура("Застрахованный, Свойство", СтрокаСотрудника.ФизическоеЛицо, Свойство);
				НайденнаяСтрокаСвойств = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.НайтиСтроки(ОтборСтрок);
				Если НайденнаяСтрокаСвойств.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСотрудника[Свойство.Имя] = НайденнаяСтрокаСвойств[0].Значение;
				СтрокаСотрудника[Свойство.Имя + "ДоИзменения"] = НайденнаяСтрокаСвойств[0].ЗначениеДоИзменения;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаРодственника Из Объект.Родственники Цикл
		ОтборСтрок = Новый Структура("Застрахованный", СтрокаРодственника.РодственникСсылка);
		НайденнаяСтрока = Объект.ДанныеЗастрахованных.НайтиСтроки(ОтборСтрок);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРодственника.Фамилия = НайденнаяСтрока[0].Фамилия;
		СтрокаРодственника.ФамилияДоИзменения = НайденнаяСтрока[0].ФамилияДоИзменения;
		СтрокаРодственника.Имя = НайденнаяСтрока[0].Имя;
		СтрокаРодственника.ИмяДоИзменения = НайденнаяСтрока[0].ИмяДоИзменения;
		СтрокаРодственника.Отчество = НайденнаяСтрока[0].Отчество;
		СтрокаРодственника.ОтчествоДоИзменения = НайденнаяСтрока[0].ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			СтрокаРодственника[Сведение] = НайденнаяСтрока[0][Сведение];
			СтрокаРодственника[Сведение + "ДоИзменения"] = НайденнаяСтрока[0][Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ОтправляемаяКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			ОтборСтрок = Новый Структура("Застрахованный, Вид", СтрокаРодственника.РодственникСсылка, ОтправляемаяКИ);
			НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
			Если НайденнаяСтрокаКИ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул + "ДоИзменения"] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул + "Представление"] = НайденнаяСтрокаКИ[0].Представление;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"] = НайденнаяСтрокаКИ[0].Представление;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РеквизитыВДанные(ТекущийОбъект)
	
	ТекущийОбъект.ДанныеЗастрахованных.Очистить();
	ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Очистить();
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.Организация, Объект.СтраховаяКомпания);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	ОтправляемаяКонтактнаяИнформацияТаблица = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Объект.Организация, Объект.СтраховаяКомпания);
	ОтправляемаяКонтактнаяИнформация = ОтправляемаяКонтактнаяИнформацияТаблица.ВыгрузитьКолонку("Вид");

	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		ТекущийОбъект.ДополнительныеРеквизитыИСведенияЗастрахованных.Очистить();
		ОтправляемыеДопРеквизитыИСведенияТаблица = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Объект.Организация, Объект.СтраховаяКомпания);
		ОтправляемыеДопРеквизитыИСведения = ОтправляемыеДопРеквизитыИСведенияТаблица.ВыгрузитьКолонку("Свойство");
	КонецЕсли;
	
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		НоваяСтрока = ТекущийОбъект.ДанныеЗастрахованных.Добавить();
		НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
		НоваяСтрока.Фамилия = СтрокаСотрудника.Фамилия;
		НоваяСтрока.ФамилияДоИзменения = СтрокаСотрудника.ФамилияДоИзменения;
		НоваяСтрока.Имя = СтрокаСотрудника.Имя;
		НоваяСтрока.ИмяДоИзменения = СтрокаСотрудника.ИмяДоИзменения;
		НоваяСтрока.Отчество = СтрокаСотрудника.Отчество;
		НоваяСтрока.ОтчествоДоИзменения = СтрокаСотрудника.ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			НоваяСтрока[Сведение] = СтрокаСотрудника[Сведение];
			НоваяСтрока[Сведение + "ДоИзменения"] = СтрокаСотрудника[Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ВидКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			НоваяСтрока = ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Добавить();
			НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
			НоваяСтрока.Вид = ВидКИ;
			НоваяСтрока.Значение = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул];
			НоваяСтрока.Представление = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул + "Представление"];
			НоваяСтрока.ЗначениеДоИзменения = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул + "ДоИзменения"];
			НоваяСтрока.ПредставлениеДоИзменения = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"];
		КонецЦикла;
		Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
			Для Каждого Свойство Из ОтправляемыеДопРеквизитыИСведения Цикл
				НоваяСтрока = ТекущийОбъект.ДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
				НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
				НоваяСтрока.Свойство = Свойство;
				НоваяСтрока.Значение = СтрокаСотрудника[Свойство.Имя];
				НоваяСтрока.ЗначениеДоИзменения = СтрокаСотрудника[Свойство.Имя + "ДоИзменения"];
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаРодственника Из Объект.Родственники Цикл
		НоваяСтрока = ТекущийОбъект.ДанныеЗастрахованных.Добавить();
		НоваяСтрока.Застрахованный = СтрокаРодственника.РодственникСсылка;
		НоваяСтрока.Фамилия = СтрокаРодственника.Фамилия;
		НоваяСтрока.ФамилияДоИзменения = СтрокаРодственника.ФамилияДоИзменения;
		НоваяСтрока.Имя = СтрокаРодственника.Имя;
		НоваяСтрока.ИмяДоИзменения = СтрокаРодственника.ИмяДоИзменения;
		НоваяСтрока.Отчество = СтрокаРодственника.Отчество;
		НоваяСтрока.ОтчествоДоИзменения = СтрокаРодственника.ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			НоваяСтрока[Сведение] = СтрокаРодственника[Сведение];
			НоваяСтрока[Сведение + "ДоИзменения"] = СтрокаРодственника[Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ВидКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			НоваяСтрока = ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Добавить();
			НоваяСтрока.Застрахованный = СтрокаРодственника.РодственникСсылка;
			НоваяСтрока.Вид = ВидКИ;
			НоваяСтрока.Значение = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул];
			НоваяСтрока.ЗначениеДоИзменения = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул + "ДоИзменения"];
			НоваяСтрока.Представление = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул + "Представление"];
			НоваяСтрока.ПредставлениеДоИзменения = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"];
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура РодственникиЗаполнитьНаСервере(Сотрудник)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийСотрудников = "СведенияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийРодственников = "СведенияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнитьРодственников(ЭтотОбъект, СтруктураИменТаблиц, Объект.Ссылка, Сотрудник);
	
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Сотрудники.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура СотрудникиОбработкаВыбораНаСервере(ВыбранныеСотрудники)

	Если ТипЗнч(ВыбранныеСотрудники) = Тип("Массив") Тогда
		СписокСотрудников = ВыбранныеСотрудники;
	Иначе
		СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеСотрудники);
	КонецЕсли;
	
	Если СписокСотрудников.Количество() > 0 Тогда
		СотрудникиЗаполнитьНаСервере(СписокСотрудников);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОтправкиПисьма(ВыбранноеЗначение)
	Возврат МедицинскоеСтрахование.ПараметрыОтправкиПисьма(ЭтотОбъект, ВыбранноеЗначение, Получатели, НСтр("ru = 'Прикрепление сотрудников'"));
КонецФункции

&НаКлиенте
Процедура ЗаполнениеСведенийСтрахованияЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Модифицированность = Истина;
		ЗаполнениеСведенийСтрахованияЗакрытиеНаСервере(Результат, ДополнительныеПараметры);
		ПересчитатьУдержанияПослеИзмененияСтрок(Результат, ДополнительныеПараметры);
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
			УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
			Если ИспользуютсяУдержания Тогда
				УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
				Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
					ОбновитьПодвалГрафикаУдержаний();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСведенийСтрахованияЗакрытиеНаСервере(Результат, ДополнительныеПараметры)
	
	МассивСотрудников = Новый Массив;
	Для каждого ИдентификаторСтроки Из ДополнительныеПараметры Цикл
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаСотрудника.ДатаПрикрепления = Результат.ДатаНачалаСтрахования;
		СтрокаСотрудника.СуммаУдержания = Результат.СуммаУдержания;
		СтрокаСотрудника.СуммаПредела = Результат.СуммаПредела;
		
		МассивСтруктурПрограмм = Новый Массив;
		Для Каждого ЭлементСписка Из Результат.ПрограммыСтрахования Цикл
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", ЭлементСписка);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаСотрудника.ДатаПрикрепления);
			СтруктураПрограммы.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			Если Результат.СтраховаяПремия = 0 Тогда
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = СтруктураПрограммы.ДатаНачала;
				ПараметрыРасчета.ДатаОкончания = СтруктураПрограммы.ДатаОкончания;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = СтрокаСотрудника.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ЭлементСписка);
				СтруктураПрограммы.Вставить("СтраховаяПремия", МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
			Иначе
				СтруктураПрограммы.Вставить("СтраховаяПремия", Результат.СтраховаяПремия);
			КонецЕсли;
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		КонецЦикла;
		МассивСтруктурРасширений = Новый Массив;
		Для Каждого ЭлементСписка Из Результат.РасширенияПрограммСтрахования Цикл
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("РасширениеСтрахования", ЭлементСписка);
			СтруктураРасширения.Вставить("ДатаНачала", СтрокаСотрудника.ДатаПрикрепления);
			СтруктураРасширения.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			Если Результат.СтраховаяПремия = 0 Тогда
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = СтруктураРасширения.ДатаНачала;
				ПараметрыРасчета.ДатаОкончания = СтруктураРасширения.ДатаОкончания;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = СтрокаСотрудника.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ЭлементСписка);
				СтруктураРасширения.Вставить("СтраховаяПремия", МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
			Иначе
				СтруктураРасширения.Вставить("СтраховаяПремия", Результат.СтраховаяПремия);
			КонецЕсли;
			МассивСтруктурРасширений.Добавить(СтруктураРасширения);
		КонецЦикла;
		МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
		МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
		МассивСотрудников.Добавить(СтрокаСотрудника.Сотрудник);
	КонецЦикла;
	РассчитатьСтраховуюПремиюСотрудников(МассивСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСотрудниковИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	ЗагруженныеДанные.Сортировать("Сотрудник");
	
	СотрудникиДобавлены = Ложь;
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийСотрудников = "СведенияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийРодственников = "СведенияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	Для Каждого ТаблицаДокумента Из СтруктураИменТаблиц Цикл
		Объект[ТаблицаДокумента.Значение].Очистить();
	КонецЦикла;
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнить(ЭтотОбъект, СтруктураИменТаблиц, ЗагруженныеДанные.ВыгрузитьКолонку("Сотрудник"));
	
	ТекущийСотрудник = Неопределено;
	МассивСтруктурПрограмм = Новый Массив;
	МассивСтруктурРасширений = Новый Массив;
	СтрокаСотрудника = Неопределено;
	Для Каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТекущийСотрудник <> СтрокаТаблицы.Сотрудник Тогда
			Если СтрокаСотрудника <> Неопределено И МассивСтруктурПрограмм.Количество() > 0 Тогда
				МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
			КонецЕсли;
			Если СтрокаСотрудника <> Неопределено И МассивСтруктурРасширений.Количество() > 0 Тогда
				МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
			КонецЕсли;
			ТекущийСотрудник = СтрокаТаблицы.Сотрудник;
			МассивСтруктурПрограмм = Новый Массив;
			МассивСтруктурРасширений = Новый Массив;
			
			СтруктураОтбора = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
			НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаСотрудника = Объект.Сотрудники.Добавить();
			Иначе
				СтрокаСотрудника = НайденныеСтроки[0];
				СтрокаСотрудника.СтраховаяПремия = 0;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаСотрудника.Сотрудник = СтрокаТаблицы.Сотрудник;
		СтрокаСотрудника.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Сотрудник, "ФизическоеЛицо");
		СтрокаСотрудника.ДатаПрикрепления = СтрокаТаблицы.ДатаПрикрепления;
		СтрокаСотрудника.СтраховаяПремия = СтрокаСотрудника.СтраховаяПремия + СтрокаТаблицы.СтраховаяПремия;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПрограммаСтрахования) Тогда
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаПрикрепления);
			СтруктураПрограммы.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.РасширениеПрограммСтрахования) Тогда
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("РасширениеСтрахования", СтрокаТаблицы.РасширениеПрограммСтрахования);
			СтруктураРасширения.Вставить("ДатаНачала", СтрокаТаблицы.ДатаПрикрепления);
			СтруктураРасширения.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			СтруктураРасширения.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			МассивСтруктурРасширений.Добавить(СтруктураРасширения);
		КонецЕсли;
		
		СотрудникиДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТекущийСотрудник <> Неопределено Тогда
		Если СтрокаСотрудника <> Неопределено И МассивСтруктурПрограмм.Количество() > 0 Тогда
			МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
		КонецЕсли;
		Если СтрокаСотрудника <> Неопределено И МассивСтруктурРасширений.Количество() > 0 Тогда
			МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
		КонецЕсли;
	КонецЕсли;
	
	Если СотрудникиДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдержаниеПриИзмененииНаСервере()
	
	ЗаполнитьДействиеИПоказатели();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеТаблицыУдержаний()
	
	ОписаниеТаблицы = РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеТаблицыРасчета();
	ОписаниеТаблицы.ИмяТаблицы = "Сотрудники";
	ОписаниеТаблицы.ПутьКДанным = "Объект.Сотрудники";
	ОписаниеТаблицы.ИмяРеквизитаВидРасчета = "Удержание";
	ОписаниеТаблицы.СодержитПолеВидРасчета = Ложь;
	ОписаниеТаблицы.СодержитПолеСотрудник = Истина;
	ОписаниеТаблицы.ИмяРеквизитаСотрудник = "Сотрудник";
	ОписаниеТаблицы.ЭтоПлановыеНачисленияУдержания = Истина;
	ОписаниеТаблицы.НомерТаблицы = 2;
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДействиеИПоказатели()
	
	ДокументыПлановыхУдержанийЗаполнитьПоказатели();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	РасчетЗарплатыРасширенныйФормы.ДокументыПлановыхУдержанийУстановитьВидимостьПоказателей(Элементы, Объект.Удержание);
	РасчетЗарплатыРасширенныйФормы.ДокументыПлановыхУдержанийУстановитьВидимостьРазмера(Элементы, Объект.Удержание, "ГруппаУдержания");
	
КонецПроцедуры

&НаСервере
Процедура ДокументыПлановыхУдержанийЗаполнитьПоказатели() Экспорт
	
	// Принимается решение о том, показывать ли таблицу показателей.
	// Если показывать, то таблица заполняется по состоянию на указанную дату действия.
	
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Объект.Удержание);
	
	// Удалим показатели, которых нет в удержании
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого СтрокаПоказателей Из Объект.Показатели Цикл
		ПоказательНайден = Ложь;
		Для каждого ДанныеПоказателя Из ВидРасчетаИнфо.Показатели Цикл
			Если СтрокаПоказателей.Показатель = ДанныеПоказателя.Показатель Тогда
				ПоказательНайден = Истина;
			КонецЕсли
		КонецЦикла;
		Если Не ПоказательНайден Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаПоказателей);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
		Объект.Показатели.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	ТаблицаУдержаний = ОписаниеТаблицыУдержаний();
	ИдентификаторСтрокиВидаРасчета = ТаблицаУдержаний.НомерТаблицы * 1000000 + 1;
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		
		ТекущийИдентификаторСтрокиВидаРасчета = СтрокаСотрудника.ИдентификаторСтрокиВидаРасчета;
		
		Для Каждого ДанныеПоказателя Из ВидРасчетаИнфо.Показатели Цикл
			Если ДанныеПоказателя.ЗапрашиватьПриВводе Тогда
				
				СтруктураОтбора = Новый Структура("ИдентификаторСтрокиВидаРасчета, Показатель", ТекущийИдентификаторСтрокиВидаРасчета, ДанныеПоказателя.Показатель);
				НайденныеСтроки = Объект.Показатели.НайтиСтроки(СтруктураОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
					КонецЦикла;
				Иначе
					НоваяСтрока = Объект.Показатели.Добавить();
					НоваяСтрока.Показатель = ДанныеПоказателя.Показатель;
					НоваяСтрока.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		СтрокаСотрудника.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
		ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПоказателейНаСервере(ЗначенияПоказателей)
	
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Объект.Удержание);
	ФиксированнаяСумма = ЗначенияПоказателей[Справочники.ПоказателиРасчетаЗарплаты.ПустаяСсылка()];
	
	Для Каждого СтрокаСотрудника Из Объект.Показатели Цикл
		
		Если ФиксированнаяСумма = Неопределено Тогда
			
			МаксимальноеЧислоПоказателей = ВидРасчетаИнфо.КоличествоПостоянныхПоказателей;
			Для Сч = 1 По МаксимальноеЧислоПоказателей Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаСотрудника.Показатель) Тогда 
					Прервать;
				КонецЕсли;
				
				ЗначениеПоказателя = ЗначенияПоказателей[СтрокаСотрудника.Показатель];
				Если ЗначениеПоказателя <> Неопределено Тогда 
					СтрокаСотрудника.Значение = ЗначениеПоказателя;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			
			СтрокаСотрудника.Размер = ФиксированнаяСумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	МассивСтруктурПрограмм = Новый Массив;
	
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
		ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
	Иначе
		ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
	КонецЕсли;
	Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
		ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
	Иначе
		ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		СтруктураПрограммы = Новый Структура;
		СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
		СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
		СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
		СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
		СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
		МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
			ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("Программы", МассивСтруктурПрограмм);
	ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
	ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
	ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
	ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
	ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
	ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастов);
	ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("СтраховаяКомпания",  Объект.СтраховаяКомпания);
	ПараметрыОткрытия.Вставить("ДатаИзменения",  Объект.ДатаИзменения);
	
	ОткрытьФорму("Справочник.ПрограммыМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммСтрахованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиРасширенияПрограммЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	МассивСтруктурРасширений = Новый Массив;
	
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
		ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
	Иначе
		ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
	КонецЕсли;
	Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
		ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
	Иначе
		ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		СтруктураПрограммы = Новый Структура;
		СтруктураПрограммы.Вставить("РасширениеСтрахования", СтрокаТаблицы.РасширениеСтрахования);
		СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
		СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
		СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
		СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
		МассивСтруктурРасширений.Добавить(СтруктураПрограммы);
		Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
			ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("МассивСтруктурРасширений", МассивСтруктурРасширений);
	ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
	ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
	ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
	ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
	ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
	ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастов);
	ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("СтраховаяКомпания",  Объект.СтраховаяКомпания);
	ПараметрыОткрытия.Вставить("ДатаИзменения",  Объект.ДатаИзменения);
	
	ОткрытьФорму("Справочник.РасширенияПрограммМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУдерживатьИзЗарплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособУдержания) Тогда
		ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Единовременно");
	КонецЕсли;
	
	Если ИспользуетсяЧастичноеУдержание Тогда
		Элементы.ГруппаЧастичноеУдержание.Видимость = ТекущиеДанные.УдерживатьИзЗарплаты;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиУдерживатьССотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.СпособУдержания);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписиУдержаний(ФизическоеЛицо)
	
	СуммаУдержанияЗаСотрудника = СуммаУдержанияЗаСотрудника(ФизическоеЛицо);
	СуммаУдержанияЗаРодственников = СуммаУдержанияЗаРодственников(ФизическоеЛицо);
	
	Если СуммаУдержанияЗаРодственников > 0 И СуммаУдержанияЗаСотрудника = 0 Тогда
		НадписьСуммаУдержания = НСтр("ru = 'Удержание за родственников'");
	ИначеЕсли СуммаУдержанияЗаРодственников > 0 И СуммаУдержанияЗаСотрудника > 0 Тогда 
		НадписьСуммаУдержания = НСтр("ru = 'Удержание за сотрудника и родственников'");
	Иначе
		НадписьСуммаУдержания = НСтр("ru = 'Удержание стоимости полиса'");
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если ДанныеСотрудника[0].ЧастичноеУдержание Тогда
		СуммаУдержания = ДанныеСотрудника[0].СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = СуммаУдержанияЗаРодственников + СуммаУдержанияЗаСотрудника;
	КонецЕсли;

	Если СуммаУдержания = 0 Тогда
		Элементы.ГруппаУдержаниеСпособ.Доступность = Ложь;
		Элементы.СотрудникиСуммаУдержания.Доступность = Ложь;
		Элементы.ГруппаГрафикУдержаний.Доступность = Ложь;
		Элементы.ГруппаНастройкиУдержания.Заголовок = НСтр("ru = 'Удержание стоимости полиса'");
	Иначе
		Элементы.ГруппаУдержаниеСпособ.Доступность = Истина;
		Элементы.СотрудникиСуммаУдержания.Доступность = Истина;
		Элементы.ГруппаГрафикУдержаний.Доступность = Истина;
		Элементы.ГруппаНастройкиУдержания.Заголовок =
			СтрШаблон(НСтр("ru = '%1 %2 руб.'"),
			НадписьСуммаУдержания,
			СуммаУдержания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СуммаУдержанияЗаСотрудника(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если ДанныеСотрудника[0].УдерживатьИзЗарплаты Тогда
		Сумма = ДанныеСотрудника[0].СтраховаяПремия;
	Иначе
		Сумма = 0;
	КонецЕсли;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Функция СуммаУдержанияЗаРодственников(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	НастройкиРодственников = Объект.Родственники.НайтиСтроки(Отбор);
	Сумма = 0;
	Для Каждого Настройка Из НастройкиРодственников Цикл
		Если Настройка.УдерживатьССотрудника Тогда
			Сумма = Сумма + Настройка.СтраховаяПремия;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьУдержанияПослеИзмененияСтрок(Результат, ДополнительныеПараметры)
	
	Если Не ИспользуютсяУдержания Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из ДополнительныеПараметры Цикл
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаСотрудника.ОбщаяСуммаУдержания = СуммаУдержанияЗаСотрудника(СтрокаСотрудника.ФизическоеЛицо)
			+ СуммаУдержанияЗаРодственников(СтрокаСотрудника.ФизическоеЛицо);
		Если СтрокаСотрудника.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
			ПересчитатьГрафикУдержаний(СтрокаСотрудника.ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьУдержания(ФизическоеЛицо, СпособУдержания)

	РассчитатьОбщуюСуммуУдержания(ФизическоеЛицо);
	Если ИспользуетсяЧастичноеУдержание Тогда
		РассчитатьЧастичноеУдержание();
	КонецЕсли;
	УстановитьНадписиУдержаний(ФизическоеЛицо);
	Если СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(ФизическоеЛицо);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбщуюСуммуУдержания(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	ДанныеСотрудника[0].ОбщаяСуммаУдержания = СуммаУдержанияЗаСотрудника(ФизическоеЛицо)
		+ СуммаУдержанияЗаРодственников(ФизическоеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЧастичноеУдержание()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЧастичноеУдержание Тогда
		Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
			ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
			ТекущиеДанные.СуммаЧастичногоУдержания = 0;
		Иначе
			Процент = ?(ТекущиеДанные.ПроцентЧастичногоУдержания = 0, 100, ТекущиеДанные.ПроцентЧастичногоУдержания);
			ТекущиеДанные.СуммаЧастичногоУдержания = Окр(ТекущиеДанные.ОбщаяСуммаУдержания * Процент / 100, 2);
			ТекущиеДанные.ПроцентЧастичногоУдержания = Окр(ТекущиеДанные.СуммаЧастичногоУдержания / ТекущиеДанные.ОбщаяСуммаУдержания * 100, 2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУдержанияМедицинскогоСтрахованияПриИзменении(Элемент)
	
	УстановитьВидимостьГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГрафикаУдержаний()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СотрудникиСуммаУдержания.Видимость =
		?(ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно"), Истина, Ложь);
	Элементы.ГруппаГрафикУдержаний.Видимость =
		?(ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику"), Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводМесяцаУдержанияНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГрафика = Элементы.ГрафикУдержаний.ТекущиеДанные;
	СтрокаГрафика.ФизическоеЛицо = Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо;
	СтрокаГрафика.Дата = ВыбранноеЗначение;
	СтрокаГрафика.ДатаСтрокой = Формат(ВыбранноеЗначение, НСтр("ru='ДФ=''ММММ гггг'''"));
	
	Объект.ГрафикУдержаний.Сортировать("Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьГрафикУдержаний(ФизическоеЛицо)
	
Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	КоличествоЗаписейВГрафике = ГрафикУдержаний.Количество();
	Если КоличествоЗаписейВГрафике = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если ДанныеСотрудника[0].ЧастичноеУдержание Тогда
		СуммаУдержания = ДанныеСотрудника[0].СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = ДанныеСотрудника[0].ОбщаяСуммаУдержания;
	КонецЕсли;
	
	Если КоличествоЗаписейВГрафике = 1 Тогда
		СтрокаГрафика = ГрафикУдержаний[0];
		СтрокаГрафика.ВведеноПользователем = Истина;
		СтрокаГрафика.Сумма = СуммаУдержания;
	КонецЕсли;
	
	МассивКоэффициентов = Новый Массив;
	Счетчик = 0;
	СуммаВведеноПользователем = 0;
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		Если СтрокаГрафика.ВведеноПользователем Тогда
			СуммаВведеноПользователем = СуммаВведеноПользователем + СтрокаГрафика.Сумма;
		Иначе
			Если Счетчик = КоличествоЗаписейВГрафике -1 Тогда
				КонецПериодаСтрокиГрафика = Объект.ДатаОкончанияСтрахования;
				ДнейВПериодеСтрокиГрафика = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(СтрокаГрафика.Дата, КонецПериодаСтрокиГрафика);
			Иначе
				КонецПериодаСтрокиГрафика = ГрафикУдержаний[Счетчик + 1].Дата;
				ДнейВПериодеСтрокиГрафика = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(СтрокаГрафика.Дата, КонецПериодаСтрокиГрафика) - 1;
			КонецЕсли;
			МассивКоэффициентов.Добавить(ДнейВПериодеСтрокиГрафика);
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	СуммыПоГрафику = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СуммаУдержания - СуммаВведеноПользователем, МассивКоэффициентов);
	
	Индекс = 0;
	Для Каждого График Из ГрафикУдержаний Цикл
		Если График.ВведеноПользователем Тогда
			График.КоличествоДней = 0;
			Продолжить;
		КонецЕсли;
		График.Сумма = ?(СуммыПоГрафику = Неопределено, 0, СуммыПоГрафику[Индекс]);
		График.КоличествоДней = МассивКоэффициентов[Индекс];
		График.Представление = СтрШаблон(НСтр("ru = '%1, %2 дн.'"), График.ДатаСтрокой, График.КоличествоДней);
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалГрафикаУдержаний()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	СуммаПоГрафику = 0;
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		СуммаПоГрафику = СтрокаГрафика.Сумма + СуммаПоГрафику;
	КонецЦикла;
	
	Элементы.ГрафикУдержанийСумма.ТекстПодвала = Формат(СуммаПоГрафику, "ЧДЦ=2");
	
	Если ТекущиеДанные.ЧастичноеУдержание Тогда
		СуммаУдержания = ТекущиеДанные.СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = ТекущиеДанные.ОбщаяСуммаУдержания;
	КонецЕсли;

	Если СуммаУдержания <> СуммаПоГрафику Тогда
		ЭлементыСтиля = СтандартныеПодсистемыКлиент.ЭлементыСтиля();
		Элементы.ГрафикУдержанийСумма.ЦветТекстаПодвала = ЭлементыСтиля.ЦветТекстаОтрицательногоЗначения;
	Иначе
		Элементы.ГрафикУдержанийСумма.ЦветТекстаПодвала = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокСтраницыСотрудники()
	
	КоличествоРодственников = "";
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ДанныеРодственников = Объект.Родственники.НайтиСтроки(Отбор);
	КоличествоРодственниковСотрудника = ДанныеРодственников.Количество();
	Если КоличествоРодственниковСотрудника > 0 Тогда
		КоличествоРодственников = КоличествоРодственниковСотрудника;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОснованиеНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ФормаОбъекта", Новый Структура("Ключ", Объект.Основание));
КонецПроцедуры

&НаКлиенте
Процедура ИзменилисьУсловияСтрахованияСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтрахованиеШапка.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;
	Элементы.ГруппаНастройкиУдержания.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;

КонецПроцедуры

&НаКлиенте
Процедура ИзменилисьОтправленныеДанныеСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы.ГруппаСведенияСтрахованияСотрудника.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = ТекущиеДанные.ИзменилисьОтправленныеДанныеСотрудника;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИзменилисьУсловияСтрахованияРодственниковПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Родственники.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников;
	Элементы.ГруппаНастройкиУдержания.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников Или ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		Элементы.РодственникиУдалить.Видимость = Истина;
		Элементы.РодственникиУдалить.Заголовок = НСтр("ru = 'Удалить'");
		Элементы.РодственникиУдалить.Картинка = БиблиотекаКартинок.Удалить;
	Иначе
		Элементы.РодственникиУдалить.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

