
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПериодДекларации) Тогда 
		ПериодДекларации = Параметры.ПериодДекларации;
	Иначе 
		ПериодДекларации = НачалоКвартала(ТекущаяДата());
	КонецЕсли;
	
	// Заполнение списка строк
	ЗаполнитьТаблицуСтрок();
	
	ИсходнаяСтрока = КодыСтрок.НайтиСтроки(Новый Структура("КодСтроки", Параметры.КодСтроки));

	Если ИсходнаяСтрока.Количество() > 0 Тогда
		Элементы.КодыСтрок.ТекущаяСтрока = ИсходнаяСтрока[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокВалют

&НаКлиенте
Процедура КодыСтрокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеВозврата = Неопределено;
	
	ЗначениеВозврата = Элемент.ТекущиеДанные.КодСтроки;
	Если ЗначениеВозврата = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОповеститьОВыборе(ЗначениеВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура КодыСтрокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеВозврата = Неопределено;
	
	ЗначениеВозврата = Элемент.ТекущиеДанные.КодСтроки;
	Если ЗначениеВозврата = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ОповеститьОВыборе(ЗначениеВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуСтрок()

	Если ПериодДекларации >= Дата("20250101") Тогда
		ИмяМакета = "КодыСтрокДекларации2025Кв1";
	ИначеЕсли ПериодДекларации >= Дата("20210101") Тогда
		ИмяМакета = "КодыСтрокДекларации2021Кв1";
	ИначеЕсли ПериодДекларации >= Дата("20170101") Тогда
		ИмяМакета = "КодыСтрокДекларации2017Кв1";
	Иначе
		Возврат;	
	КонецЕсли; 
	
	КлассификаторXML = РегистрыСведений.КодыСтрокДекларацииПоИПНиСН.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Для Каждого ЗаписьОКВ Из КлассификаторТаблица Цикл
		НоваяСтрока = КодыСтрок.Добавить();
		НоваяСтрока.КодСтроки		= ЗаписьОКВ.Code;
		НоваяСтрока.Наименование    = ЗаписьОКВ.Name;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
