
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ВедущийОбъект", ОбъектВладелец);
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Если объект еще не заблокирован для изменений и есть права на изменение набора        //Проверка Роли?
	// попытаемся установить блокировку.
	Если Ложь Тогда
		
		ТолькоПросмотр = Истина;
		
	КонецЕсли; 
	
	Если ТолькоПросмотр Тогда
		
		Элементы.НаборЗаписей.ТолькоПросмотр = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, 
			"ФормаКомандаОК",
			"Доступность",
			Ложь);
			
		Элементы.ФормаКомандаОтмена.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
    Элементы.НаборЗаписейВыбиратьВсеВидыДоходов.Пометка = Ложь;
	УправлениеФормой(ЭтаФорма);
		
	Для Каждого ЗаписьНабора Из Параметры.МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ЗаписьНабора);
	КонецЦикла;
	
	НаборЗаписей.Сортировать("Период");
	
	КоличествоЗаписей = НаборЗаписей.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		ПолучитьПризнакиУчета(НаборЗаписей[КоличествоЗаписей - 1].ВидДохода);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	РедактированиеПериодическихСведенийКлиент.ОповеститьОЗавершении(ЭтаФорма, "НалогообложениеНачислений", ОбъектВладелец);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВыбиратьВсеВидыДоходов(Команда)
	
	Элементы.НаборЗаписейВыбиратьВсеВидыДоходов.Пометка = НЕ Элементы.НаборЗаписейВыбиратьВсеВидыДоходов.Пометка;
	ВыбиратьВсеВидыДоходов = Элементы.НаборЗаписейВыбиратьВсеВидыДоходов.Пометка;
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйПериод = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
	Если НаборЗаписей.Количество() > 1 Тогда
		ПоследнийПериод = НаборЗаписей.Получить(НаборЗаписей.Количество() - 2).Период;
	Иначе
		ПоследнийПериод = '00010101000000';
	КонецЕсли; 
	Если НовыйПериод <= ПоследнийПериод Тогда
		НовыйПериод = КонецДня(ПоследнийПериод) + 1;
	КонецЕсли; 
	Элемент.ТекущиеДанные.Период = НовыйПериод;
	НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Период", Элемент.ТекущиеДанные.Период));
	
	ПроинициализироватьПоУмолчанию(НайденныеСтроки, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
		СообщениеОбОшибке = НСтр("ru = 'Необходимо указать дату сведений'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , "НаборЗаписей.Период", , Отказ);
	Иначе
		Элемент.ТекущиеДанные.Период = НачалоМесяца(Элемент.ТекущиеДанные.Период);
		НайденныеСтроки = НаборЗаписей.НайтиСтроки(Новый Структура("Период", Элемент.ТекущиеДанные.Период));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если НайденнаяСтрока <> Элемент.ТекущиеДанные Тогда
				СообщениеОбОшибке = НСтр("ru = 'Уже есть запись с указанной датой сведений'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , "НаборЗаписей.Период", , Отказ);
				Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.Начисление = ОбъектВладелец;
	
	РедактированиеПериодическихСведенийКлиент.УпорядочитьНаборЗаписейВФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейСпособОбложенияИПНПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.СпособОбложенияИПН = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично")
			И ЗначениеЗаполнено(ТекущиеДанные.ДоходНеПодлежащийНалогообложениюИПН) Тогда
			
			ТекущиеДанные.ДоходНеПодлежащийНалогообложениюИПН = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейСпособОбложенияОПВПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.СпособОбложенияОПВ = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично")
			И ЗначениеЗаполнено(ТекущиеДанные.ДоходНеПодлежащийНалогообложениюОПВ) Тогда
			
			ТекущиеДанные.ДоходНеПодлежащийНалогообложениюОПВ = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейСпособОбложенияСНПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.СпособОбложенияСН = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично")
			И ЗначениеЗаполнено(ТекущиеДанные.ДоходНеПодлежащийНалогообложениюСН) Тогда
			
			ТекущиеДанные.ДоходНеПодлежащийНалогообложениюСН = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейСпособОбложенияСОПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.СпособОбложенияСО = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично")
			И ЗначениеЗаполнено(ТекущиеДанные.ДоходНеПодлежащийНалогообложениюСО) Тогда
			
			ТекущиеДанные.ДоходНеПодлежащийНалогообложениюСО = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейСпособОбложенияОППВПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.СпособОбложенияОППВ = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично")
			И ЗначениеЗаполнено(ТекущиеДанные.ДоходНеПодлежащийНалогообложениюОППВ) Тогда
			
			ТекущиеДанные.ДоходНеПодлежащийНалогообложениюОППВ = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейСпособОбложенияВОСМСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.СпособОбложенияВОСМС = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично")
			И ЗначениеЗаполнено(ТекущиеДанные.ДоходНеПодлежащийНалогообложениюВОСМС) Тогда
			
			ТекущиеДанные.ДоходНеПодлежащийНалогообложениюВОСМС = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейСпособОбложенияООСМСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.СпособОбложенияООСМС = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично")
			И ЗначениеЗаполнено(ТекущиеДанные.ДоходНеПодлежащийНалогообложениюООСМС) Тогда
			
			ТекущиеДанные.ДоходНеПодлежащийНалогообложениюООСМС = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьПризнакиУчета(ВидДохода)

	УчитыватьИПН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьИПН");
	УчитыватьОПВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОПВ");
	УчитыватьСН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСН");
	УчитыватьСО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьСО");
	УчитыватьОППВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОППВ");
	УчитыватьВОСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьВОСМС");
	УчитыватьООСМС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьООСМС");
	УчитыватьЕП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьЕП");
	УчитыватьОПВР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьОПВР");

КонецПроцедуры

&НаКлиенте
Процедура ПроинициализироватьПоУмолчанию(Данные, Копирование)
	
	МассивВидовНВО = Новый Массив;
	МассивВидовНВО.Добавить("ИПН");
	МассивВидовНВО.Добавить("ОПВ");
	МассивВидовНВО.Добавить("СН");
	МассивВидовНВО.Добавить("СО");
	МассивВидовНВО.Добавить("ОППВ");
	МассивВидовНВО.Добавить("ВОСМС");
	МассивВидовНВО.Добавить("ООСМС");
	МассивВидовНВО.Добавить("ОПВР");
	
	СтрокаКопирования = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Если Копирование
		И НЕ СтрокаКопирования = Неопределено Тогда
		
		Данные[0].ВидДохода = СтрокаКопирования["ВидДохода"];

		Для Каждого ВидНВО Из МассивВидовНВО Цикл
			
			Если ЭтаФорма["Учитывать" + ВидНВО] Тогда
				
				Данные[0]["СпособОбложения" + ВидНВО] = СтрокаКопирования["СпособОбложения" + ВидНВО];
				Данные[0]["ДоходНеПодлежащийНалогообложению" + ВидНВО] = СтрокаКопирования["ДоходНеПодлежащийНалогообложению" + ВидНВО];
				
			КонецЕсли;
		
		КонецЦикла;

	Иначе 
		
		Если ТипЗнч(ОбъектВладелец) = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
					
			ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя");
						
		Иначе
			
			Если НаборЗаписей.Количество() > 0 Тогда
				ВидДохода = НаборЗаписей[НаборЗаписей.Количество() - 2].ВидДохода;
			Иначе
				ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента");
			КонецЕсли;

		КонецЕсли;
		
		ПолучитьПризнакиУчета(ВидДохода);
		
		Данные[0].ВидДохода = ВидДохода;

		Для Каждого ВидНВО Из МассивВидовНВО Цикл
			
			Если ЭтаФорма["Учитывать" + ВидНВО] Тогда
				
				Данные[0]["СпособОбложения" + ВидНВО] = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом");
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейВидДоходаПриИзменении(Элемент)
	
	ВидДохода = Элементы.НаборЗаписей.ТекущиеДанные.ВидДохода;
	ПолучитьПризнакиУчета(ВидДохода);
	
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияИПН	= ?(УчитыватьИПН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияОПВ	= ?(УчитыватьОПВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияСН	= ?(УчитыватьСН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияСО	= ?(УчитыватьСО, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияОППВ	= ?(УчитыватьОППВ, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияВОСМС= ?(УчитыватьВОСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияООСМС= ?(УчитыватьООСМС, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияЕП   = ?(УчитыватьЕП, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	Элементы.НаборЗаписей.ТекущиеДанные.СпособОбложенияОПВР	= ?(УчитыватьОПВР, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Если ТипЗнч(Форма.ОбъектВладелец) = Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам") Тогда
		
		ВидыДоходов = Новый Массив;
		
		Если НЕ Форма.ВыбиратьВсеВидыДоходов Тогда
			
			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"));
			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ПрочиеДоходы"));
	 		Элементы.НаборЗаписейВидДохода.СписокВыбора.ЗагрузитьЗначения(ВидыДоходов);
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Истина;
			
		Иначе
			
	 		Элементы.НаборЗаписейВидДохода.СписокВыбора.Очистить();
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Ложь;

		КонецЕсли;

		Элементы.НаборЗаписейСпособОбложенияЕП.Видимость = Ложь;
		Элементы.НаборЗаписейДоходНеПодлежащийНалогообложениюЕП.Видимость = Ложь;
		Элементы.НаборЗаписейСпособОбложенияОППВ.Видимость = Ложь;
		Элементы.НаборЗаписейДоходНеПодлежащийНалогообложениюОППВ.Видимость = Ложь;
		
	ИначеЕсли ТипЗнч(Форма.ОбъектВладелец) = Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц") Тогда
		
		ВидыДоходов = Новый Массив;
		
		Если НЕ Форма.ВыбиратьВсеВидыДоходов Тогда

			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"));
			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.Выигрыши"));
			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.Вознаграждения"));
			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ПрочиеДоходы"));
			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства"));
			Элементы.НаборЗаписейВидДохода.СписокВыбора.ЗагрузитьЗначения(ВидыДоходов);
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Истина;
			
		Иначе
			
	 		Элементы.НаборЗаписейВидДохода.СписокВыбора.Очистить();
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Ложь;

		КонецЕсли;

		Элементы.НаборЗаписейСпособОбложенияЕП.Видимость = Ложь;
		Элементы.НаборЗаписейДоходНеПодлежащийНалогообложениюЕП.Видимость = Ложь;
		Элементы.НаборЗаписейСпособОбложенияОППВ.Видимость = Ложь;
		Элементы.НаборЗаписейДоходНеПодлежащийНалогообложениюОППВ.Видимость = Ложь;
		
	ИначеЕсли ТипЗнч(Форма.ОбъектВладелец) = Тип("СправочникСсылка.ВидыДивидендов") Тогда
		
		ВидыДоходов = Новый Массив;
		
		Если НЕ Форма.ВыбиратьВсеВидыДоходов Тогда

			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.Дивиденды"));
			Элементы.НаборЗаписейВидДохода.СписокВыбора.ЗагрузитьЗначения(ВидыДоходов);
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Истина;
			
		Иначе
			
	 		Элементы.НаборЗаписейВидДохода.СписокВыбора.Очистить();
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Ложь;

		КонецЕсли;

	ИначеЕсли ТипЗнч(Форма.ОбъектВладелец) = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
		
		ВидыДоходов = Новый Массив;
		
		Если НЕ Форма.ВыбиратьВсеВидыДоходов Тогда

			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтРаботодателя"));
			ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"));
			Элементы.НаборЗаписейВидДохода.СписокВыбора.ЗагрузитьЗначения(ВидыДоходов);
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Истина;
			
		Иначе
			
	 		Элементы.НаборЗаписейВидДохода.СписокВыбора.Очистить();
	        Элементы.НаборЗаписейВидДохода.РежимВыбораИзСписка = Ложь;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры        

#КонецОбласти


