#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ЗУПК
    Если ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением")
        ИЛИ ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
		ПроверятьЗарплатныйПроект = Ложь;
	Иначе
	// ЗУПК
	ПроверятьЗарплатныйПроект = ОбменСБанкамиПоЗарплатнымПроектам.ЭтоВедомостьВБанк(Ведомость);
	// ЗУПК
	КонецЕсли;
	// ЗУПК
	
	ДанныеВедомости = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ведомость, "Проведен, Организация" + ?(ПроверятьЗарплатныйПроект, ", ЗарплатныйПроект", ""));
	
	ПроверятьЗарплатныйПроект = ПроверятьЗарплатныйПроект И ЗначениеЗаполнено(ДанныеВедомости.ЗарплатныйПроект);
	
	Если НЕ Ведомость.Проведен Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 не проведен.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	Если ДанныеВедомости.Организация <> Организация Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Документ %1 относится к другой организации.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	
	СведенияОНезачисленнойЗарплатеПоВедомости = Документы.СведенияОНезачисленнойЗарплате.ВыбратьПоВедомости(Ведомость, Истина);
	Если СведенияОНезачисленнойЗарплатеПоВедомости.Количество() <> 0 
		И (СведенияОНезачисленнойЗарплатеПоВедомости.Количество() > 1 ИЛИ СведенияОНезачисленнойЗарплатеПоВедомости[0] <> Ссылка) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'По документу %1 уже введены сведения о незачисленной зарплате.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;	
	КонецЕсли;	
	
	// ЗУПК
	// Если в документе выбран сотрудник, которого нет в указанной ведомости, необходимо выдавать предупреждение
	РезультатПроверки = ПроверитьСоответствиеСотрудниковВедомости();
	Если Не РезультатПроверки Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В таблице есть сотрудники, отсутствующие в документе %1.'"), Ведомость);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	// ЗУПК
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Физлица = Сотрудники.ВыгрузитьКолонку("ФизическоеЛицо");
	
	Если Не Отказ И Физлица.Количество() > 0 Тогда
		
		// Отключение контроля соответствия начислений и выплат 
		// Регистрация незачисленной зарплаты не является ни начислением, ни выплатой.
		// Это своего рода сторнирующий документ: выплата не удалась, возвращаем сумму в зарплату к выплате.
		// Поэтому проверка тут не нужна
		КонтрольСоответствияНачисленийИВыплат.Отключить(Движения);
		
		// Взаиморасчеты
		Если ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк")
			Или ТипЗнч(Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
			ВзаиморасчетыПоПрочимДоходам.ЗарегистрироватьНевыплатуПоВедомостиПрочихДоходов(Движения, Отказ, Ведомость, Физлица);
		Иначе
			ВзаиморасчетыССотрудниками.ЗарегистрироватьНевыплатуПоВедомости(Движения, Отказ, Ведомость, Физлица);
		КонецЕсли;
		
		// НДФЛ
		УчетНДФЛ.ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, Ведомость, Физлица);
		УчетФактическиПолученныхДоходовРасширенный.ЗарегистрироватьНевыплатуДокументом(Движения, Отказ, Ведомость, Физлица);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// ЗУПК
Функция ПроверитьСоответствиеСотрудниковВедомости()
	
	//Получаем список сотрудников в первоначальном документе
	СотрудникиПоВедомости = Новый Массив();
	Для Каждого ДанныеСтроки Из Ведомость.Состав Цикл
		СотрудникиПоВедомости.Добавить(ДанныеСтроки.ФизическоеЛицо);
	КонецЦикла;
	
	//Проверяем наличие каждого сотрудника из текущего документа в ведомости
	ВсеСотрудникиСоответствуют = Истина;
	Для Каждого Сотрудник Из ЭтотОбъект.Сотрудники Цикл
		Если СотрудникиПоВедомости.Найти(Сотрудник.ФизическоеЛицо) = Неопределено Тогда
			ВсеСотрудникиСоответствуют = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеСотрудникиСоответствуют;
	
КонецФункции
// ЗУПК

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли