#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает виды доходов исполнительного производства начислений
// Параметры:
//	Период - дата, на которую необходимо получить виды доходов исполнительного производства.
//
// Возвращаемое значение:
// 	Соответствие:
// 	 	* Ключ     - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний
// 	 	* Значение - ПеречислениеСсылка.ВидыДоходовИсполнительногоПроизводства
// 
Функция ВидыДоходовИсполнительногоПроизводства(Период) Экспорт

	ВидыДоходовИсполнительногоПроизводства = Новый Соответствие;
	
	ВидыДоходов = Перечисления.ВидыДоходовИсполнительногоПроизводства;
	ВидыДоходовИсполнительногоПроизводства.Вставить(Дивиденды,            ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДивидендыСотрудников, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
    // ЗУПК
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорАвторскогоЗаказа, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорРаботыУслуги,     ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
	ВидыДоходовИсполнительногоПроизводства.Вставить(КомпенсацияЗаЗадержкуЗарплаты, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
	// МатериальнаяВыгодаПоЗаймам не является доходом вообще, в том смысле, 
	// что ИЛ с ее сумм не должны начисляться, и ее НДФЛ можно регистрировать как угодно.
	// Призы проходят в "Перечне видов заработной платы и иного дохода, из которых производится удержание алиментов"
	// в пункте "м) с других видов выплат к заработной плате, установленных законодательством..."
	// Поэтому относим эти виды особых начислений и удержаний к "зарплатным" доходам.
	ВидыДоходовИсполнительногоПроизводства.Вставить(МатериальнаяВыгодаПоЗаймам, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(СтоимостьПодарковПризов,    ВидыДоходов.ДоходыБезОграниченияВзысканий);
	Если ВидыДоходовИсполнительногоПроизводствавызовСервера.ВступилиВСилуИзменения353ФЗ(Период) Тогда
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности, ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриРожденииРебенка,     ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребение,           ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребениеСотруднику, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	Иначе
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности, ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриРожденииРебенка,     ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребение,           ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребениеСотруднику, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	КонецЕсли;
    // ЗУПК
	
	Возврат ВидыДоходовИсполнительногоПроизводства
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	СписокИсключаемыхЗначение = Новый СписокЗначений;
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ДСВРаботодателя);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.МатериальнаяВыгодаПоЗаймам);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛ);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛДоначисленныйПоРезультатамПроверки);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛДоходыКонтрагентов);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛЗачтено);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛКЗачету);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛПрочиеРасчетыСПерсоналом);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛРасчетыСБывшимиСотрудниками);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НФДЛДивиденды);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НФДЛДивидендыСотрудникам);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛСПревышения);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПособиеНаПогребение);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПособиеПриРожденииРебенка);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.УдалитьМатериальнаяПомощь);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Индекс = 0 по Перечисления.ВидыОсобыхНачисленийИУдержаний.Количество()-1 Цикл
		ТекущееЗначение = Перечисления.ВидыОсобыхНачисленийИУдержаний.Получить(Индекс);
		Если СписокИсключаемыхЗначение.НайтиПоЗначению(ТекущееЗначение) = Неопределено Тогда
			ДанныеВыбора.Добавить(ТекущееЗначение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли