
#Область ПолучениеДанныхДляРасчетаСреднегоЗаработка

// Получает таблицу коэффициентов по месяцам, 
// которые необходимо применить к среднему заработку из-за проводимой индексации заработка.
//
// Параметры:
//	ИсходныеДанные - таблица значений, 
//		созданная конструктором см. ПустаяТаблицаИсходныхДанныхРасчетаОбщегоСреднегоЗаработка
//	КоэффициентУчитываетПоследующиеИндексации 
//		- если Истина, коэффициент на конкретный месяц учитывает все индексации произошедшие ПОСЛЕ него (для расчета
//		показателя КоэффициентИндексации)
//		- если Ложь, коэффициент на конкретный месяц учитывает все индексации произошедшие ДО него.
//
Функция ДанныеИндексации(ИсходныеДанные, КоэффициентУчитываетПоследующиеИндексации = Ложь) Экспорт
	
	ДанныеИндексации = Новый ТаблицаЗначений;
	ДанныеИндексации.Колонки.Добавить("Сотрудник");
	ДанныеИндексации.Колонки.Добавить("Период");
	
	Если КоэффициентУчитываетПоследующиеИндексации Тогда
		ДанныеИндексации.Колонки.Добавить("ИдентификаторСтроки");
		ДанныеИндексации.Колонки.Добавить("Коэффициент");
		ДанныеИндексации.Колонки.Добавить("ДатаНачала");
		ДанныеИндексации.Колонки.Добавить("ДатаОкончания");
	Иначе
		ДанныеИндексации.Колонки.Добавить("КоэффициентИндексации");
	КонецЕсли;
	
	Если ИсходныеДанные.Количество() = 0 Тогда
		Возврат ДанныеИндексации;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходныеДанные.Сотрудник КАК Сотрудник,
		|	ИсходныеДанные.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	ИсходныеДанные.НачалоПериодаРасчетаСреднего КАК НачалоПериодаРасчетаСреднего,
		|	ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего КАК ОкончаниеПериодаРасчетаСреднего,
		|	0 КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТИсходныеДанные
		|ИЗ
		|	&ИсходныеДанные КАК ИсходныеДанные
		|;
		| 
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеДанные.Сотрудник КАК Сотрудник,
		|	ИсходныеДанные.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
		|	МИНИМУМ(ИсходныеДанные.НачалоПериодаРасчетаСреднего) КАК НачалоПериодаРасчетаСреднего,
		|	МАКСИМУМ(ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего) КАК ОкончаниеПериодаРасчетаСреднего,
		// для получения кадровых данных ограничения по периодам (в рамках среднего) не используем,
		// т.к необходимо видеть кадровые на начальную и последнюю дату (т.е учитывать предыдущую и последующую историю перемещений)
		|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоПериодаРасчетаДляКадрового,
		|	ДАТАВРЕМЯ(3999, 1, 1) КАК ОкончаниеПериодаРасчетаДляКадрового,
		|	0 КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТИсходныеДанныеДляТаблицаПериодов
		|ИЗ
		|	ВТИсходныеДанные КАК ИсходныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсходныеДанные.Сотрудник,
		|	ИсходныеДанные.ДатаНачалаСобытия,
		|	0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(ИсходныеДанные.НачалоПериодаРасчетаСреднего, МЕСЯЦ)) КАК НачалоПервогоИнтервала,
		|	МАКСИМУМ(КОНЕЦПЕРИОДА(ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего, МЕСЯЦ)) КАК ОкончаниеПоследнегоИнтервала
		|ИЗ
		|	ВТИсходныеДанные КАК ИсходныеДанные";
		
	Если КоэффициентУчитываетПоследующиеИндексации Тогда
		
		// в случае получения показателя используем ИдентификаторСтроки расчета для корректной подстановки коэффициента в нужную строку расчета;
		// вместо ВТПериоды будем использовать ПериодДействияНачало для определения дат, на которые необходимо получить коэффициент
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК ИдентификаторСтроки", 
												 "ИсходныеДанные.ИдентификаторСтроки КАК ИдентификаторСтроки,
												 |ИсходныеДанные.ПериодДействияНачало КАК ПериодДействияНачало");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "0", 
												 "ИсходныеДанные.ИдентификаторСтроки,
												 |ИсходныеДанные.ПериодДействияНачало");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИсходныеДанные", ИсходныеДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДанныеИндексации;
	КонецЕсли;

	Сотрудник = ИсходныеДанные[0].Сотрудник;
	
	Если КоэффициентУчитываетПоследующиеИндексации Тогда
		ПериодРегистрации = НачалоМесяца(ИсходныеДанные[0].ПериодДействияНачало);
	Иначе
		ПериодРегистрации = НачалоМесяца(ИсходныеДанные[0].ДатаНачалаСобытия);
	КонецЕсли;
	
	ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, Сотрудник, "Организация, ДатаПриема", ПериодРегистрации);
	
	Если ДанныеСотрудника.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно получить данные порядка учета среднего заработка из-за отсутствия необходимых данных кадрового учета'");
	КонецЕсли;
	
	Организация = ДанныеСотрудника[0].Организация;
	ДатаПриема = ДанныеСотрудника[0].ДатаПриема;
	
	УчитыватьИзмененияРазряда = Истина;
	УчитыватьИзмененияПодразделения = ЗарплатаКадрыРКПовтИсп.ВариантУчетаКадровыхПерестановок(Организация, ПериодРегистрации) = Перечисления.ВариантыУчетаКадровыхПерестановок.ДолжностьРазрядПодразделение;
	РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок = ЗарплатаКадрыРКПовтИсп.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок(Организация, ПериодРегистрации);
	
	// поддержим существовавший расчет
	Если НЕ РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок Тогда
		УчитыватьИзмененияРазряда = Ложь;
		УчитыватьИзмененияПодразделения = Истина;
	КонецЕсли;
	
	ЭтоКоэффициентУчитываетПоследующиеИндексацииВПределахКадровых = КоэффициентУчитываетПоследующиеИндексации И РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок;
	
	// при расчете периоды события не учитываем кадровые перемещения (РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок поддержим существовавший расчет)
	Если НЕ ЭтоКоэффициентУчитываетПоследующиеИндексацииВПределахКадровых Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		// Создаем ВТ с месяцами
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(МенеджерВременныхТаблиц, Выборка.НачалоПервогоИнтервала, Выборка.ОкончаниеПоследнегоИнтервала);
		
		// Получим кадровые данные
		ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТИсходныеДанныеДляТаблицаПериодов", 
			"Сотрудник");
			
		ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаНачала", "НачалоПериодаРасчетаДляКадрового");
		ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаОкончания", "ОкончаниеПериодаРасчетаДляКадрового");
		
		ПараметрыПостроения = ЗарплатаКадрыПериодическиеРегистры.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
        ПараметрыПостроения.ИсключатьНеИспользуемыеПоля = Ложь;
		// не используем параметр ВключатьЗаписиНаНачалоПериода, тк он не используется в построении запроса для интервального регистра в СоздатьВТИмяРегистраПериоды
		//ПараметрыПостроения.ВключатьЗаписиНаНачалоПериода = Истина;
		
		ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды(
			"КадроваяИсторияСотрудников",
			МенеджерВременныхТаблиц,
			Истина,
			ОписаниеФильтра,
			ПараметрыПостроения,
			"ВТИнтервалыКадроваяИсторияСотрудников");
			
		ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды(
			"РазрядыКатегорииСотрудников",
			МенеджерВременныхТаблиц,
			Истина,
			ОписаниеФильтра,
			,
			"ВТИнтервалыРазрядыКатегорииСотрудников");
			
		Запрос.Текст = "
			|ВЫБРАТЬ
			|	ИсходныеДанныеДляТаблицаПериодов.Сотрудник КАК Сотрудник,
			|	ИнтервалыКадроваяИсторияСотрудников.Должность КАК Должность,
			|	ИнтервалыКадроваяИсторияСотрудников.Подразделение КАК Подразделение,
			|	ВЫБОР
			|		КОГДА ИнтервалыКадроваяИсторияСотрудников.ЭтоВозвратноеСобытие
			|			ТОГДА ИнтервалыКадроваяИсторияСотрудников.НачалоПериода
			|		ИНАЧЕ ИнтервалыКадроваяИсторияСотрудников.Период
			|	КОНЕЦ КАК ПериодЗаписи,
			|	ИнтервалыКадроваяИсторияСотрудников.ВидСобытия КАК ВидСобытия,
			|	ИнтервалыКадроваяИсторияСотрудников.НачалоПериода КАК НачалоПериода,
			|	ИнтервалыКадроваяИсторияСотрудников.КонецПериода КАК КонецПериода,
			|	ИсходныеДанныеДляТаблицаПериодов.НачалоПериодаРасчетаСреднего КАК НачалоПериодаРасчетаСреднего,
			|	ИсходныеДанныеДляТаблицаПериодов.ОкончаниеПериодаРасчетаСреднего КАК ОкончаниеПериодаРасчетаСреднего,
			|	ИсходныеДанныеДляТаблицаПериодов.ОкончаниеПериодаРасчетаДляКадрового КАК ОкончаниеПериодаРасчетаДляКадрового,
			// дата начала кадрового события
			|	ИнтервалыКадроваяИсторияСотрудников.НачалоПериода КАК Период
			|ПОМЕСТИТЬ ВТКадровыеПеремещенияЗаПериодДанные
			|ИЗ
			|	ВТИсходныеДанныеДляТаблицаПериодов КАК ИсходныеДанныеДляТаблицаПериодов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалыКадроваяИсторияСотрудников КАК ИнтервалыКадроваяИсторияСотрудников
			|		ПО ИсходныеДанныеДляТаблицаПериодов.Сотрудник = ИнтервалыКадроваяИсторияСотрудников.Сотрудник
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КадровыеПеремещения.Сотрудник КАК Сотрудник,
			|	КадровыеПеремещения.Должность КАК Должность,
			|	КадровыеПеремещения.Подразделение КАК Подразделение,
			|	КадровыеПеремещения.ВидСобытия КАК ВидСобытия,
			|	КадровыеПеремещения.ПериодЗаписи КАК ПериодЗаписи,
			|	КадровыеПеремещения.НачалоПериода КАК НачалоПериода,
			|	КадровыеПеремещения.КонецПериода КАК КонецПериода,
			|	КадровыеПеремещения.НачалоПериодаРасчетаСреднего КАК НачалоПериодаРасчетаСреднего,
			|	КадровыеПеремещения.ОкончаниеПериодаРасчетаСреднего КАК ОкончаниеПериодаРасчетаСреднего,
			|	КадровыеПеремещения.ОкончаниеПериодаРасчетаДляКадрового КАК ОкончаниеПериодаРасчетаДляКадрового,
			|	МАКСИМУМ(ЕСТЬNULL(КадровыеПеремещенияПредыдущая.ПериодЗаписи, ДАТАВРЕМЯ(1,1,1)))  КАК ПериодПредыдущейЗаписи,
			// дата начала кадрового события
			|	КадровыеПеремещения.Период КАК Период
			|ПОМЕСТИТЬ ВТКадровыеПеремещенияПериодыПредыдущейЗаписи
			|ИЗ
			|	ВТКадровыеПеремещенияЗаПериодДанные КАК КадровыеПеремещения
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеПеремещенияЗаПериодДанные КАК КадровыеПеремещенияПредыдущая
			|		ПО КадровыеПеремещения.Сотрудник = КадровыеПеремещенияПредыдущая.Сотрудник
			|           И (КадровыеПеремещения.ПериодЗаписи > КадровыеПеремещенияПредыдущая.ПериодЗаписи)
			|
			|СГРУППИРОВАТЬ ПО
			|	КадровыеПеремещения.Сотрудник,
			|	КадровыеПеремещения.Должность,
			|	КадровыеПеремещения.Подразделение,
			|	КадровыеПеремещения.ВидСобытия,
			|	КадровыеПеремещения.ПериодЗаписи,
			|	КадровыеПеремещения.НачалоПериода,
			|	КадровыеПеремещения.КонецПериода,
			|	КадровыеПеремещения.НачалоПериода,
			|	КадровыеПеремещения.КонецПериода,
			|	КадровыеПеремещения.НачалоПериодаРасчетаСреднего,
			|	КадровыеПеремещения.ОкончаниеПериодаРасчетаСреднего,
			|	КадровыеПеремещения.ОкончаниеПериодаРасчетаДляКадрового,
			|	КадровыеПеремещения.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КадровыеПеремещения.Сотрудник КАК Сотрудник,
			|	КадровыеПеремещения.Должность КАК Должность,
			|	КадровыеПеремещения.Подразделение КАК Подразделение,
			|	КадровыеПеремещения.ПериодЗаписи КАК ПериодЗаписи,
			|	КадровыеПеремещения.ПериодПредыдущейЗаписи КАК ПериодПредыдущейЗаписи,
			|	ВЫБОР
			|		КОГДА КадровыеПеремещения.ПериодПредыдущейЗаписи <= КадровыеПеремещения.НачалоПериодаРасчетаСреднего
			|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
			|		ИНАЧЕ КадровыеПеремещения.НачалоПериода
			|	КОНЕЦ КАК НачалоПериода,
			|	ВЫБОР
			|		КОГДА НАЧАЛОПЕРИОДА(КадровыеПеремещения.КонецПериода, ДЕНЬ) = КадровыеПеремещения.ОкончаниеПериодаРасчетаДляКадрового
			|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
			|		ИНАЧЕ КадровыеПеремещения.КонецПериода
			|	КОНЕЦ КАК КонецПериода,
			|	КадровыеПеремещения.Период КАК Период
			|ПОМЕСТИТЬ ВТКадровыеПеремещенияЗаПериод
			|ИЗ
			|	ВТКадровыеПеремещенияПериодыПредыдущейЗаписи КАК КадровыеПеремещения
			// анализируем НачалоПериода и КонецПериода - как периоды фактического наступления события (без сдвигов)
			|ГДЕ
			|	(КадровыеПеремещения.НачалоПериода МЕЖДУ КадровыеПеремещения.НачалоПериодаРасчетаСреднего И КадровыеПеремещения.ОкончаниеПериодаРасчетаСреднего
			|			ИЛИ КадровыеПеремещения.КонецПериода МЕЖДУ КадровыеПеремещения.НачалоПериодаРасчетаСреднего И КадровыеПеремещения.ОкончаниеПериодаРасчетаСреднего)
			|	И КадровыеПеремещения.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Перемещение)
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТКадровыеПеремещенияЗаПериодДанные
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТКадровыеПеремещенияПериодыПредыдущейЗаписи
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|" + ?(УчитыватьИзмененияРазряда, "
			|ВЫБРАТЬ
			|	ИсходныеДанныеДляТаблицаПериодов.Сотрудник КАК Сотрудник,
			|	ИнтервалыРазрядыКатегорииСотрудников.РазрядКатегория КАК РазрядКатегория,
			|	ВЫБОР
			|		КОГДА ИнтервалыРазрядыКатегорииСотрудников.ЭтоВозвратноеСобытие
			|			ТОГДА ИнтервалыРазрядыКатегорииСотрудников.НачалоПериода
			|		ИНАЧЕ ИнтервалыРазрядыКатегорииСотрудников.ПериодЗаписи
			|	КОНЕЦ КАК ПериодЗаписи,
			|	ИнтервалыРазрядыКатегорииСотрудников.НачалоПериода КАК НачалоПериода,
			|	ИнтервалыРазрядыКатегорииСотрудников.КонецПериода КАК КонецПериода,
			|	ИсходныеДанныеДляТаблицаПериодов.НачалоПериодаРасчетаСреднего КАК НачалоПериодаРасчетаСреднего,
			|	ИсходныеДанныеДляТаблицаПериодов.ОкончаниеПериодаРасчетаДляКадрового КАК ОкончаниеПериодаРасчетаДляКадрового,
			// дата начала кадрового события
			|	ИнтервалыРазрядыКатегорииСотрудников.НачалоПериода КАК Период
			|ПОМЕСТИТЬ ВТИзменениеРазрядовЗаПериодДанные
			|ИЗ
			|	ВТИсходныеДанныеДляТаблицаПериодов КАК ИсходныеДанныеДляТаблицаПериодов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалыРазрядыКатегорииСотрудников КАК ИнтервалыРазрядыКатегорииСотрудников
			|		ПО ИсходныеДанныеДляТаблицаПериодов.Сотрудник = ИнтервалыРазрядыКатегорииСотрудников.Сотрудник
			// анализируем НачалоПериода и КонецПериода - как периоды фактического наступления события (без сдвигов)
			|           И (ИнтервалыРазрядыКатегорииСотрудников.НачалоПериода МЕЖДУ ИсходныеДанныеДляТаблицаПериодов.НачалоПериодаРасчетаСреднего И ИсходныеДанныеДляТаблицаПериодов.ОкончаниеПериодаРасчетаСреднего
			|           ИЛИ ИнтервалыРазрядыКатегорииСотрудников.КонецПериода МЕЖДУ ИсходныеДанныеДляТаблицаПериодов.НачалоПериодаРасчетаСреднего И ИсходныеДанныеДляТаблицаПериодов.ОкончаниеПериодаРасчетаСреднего) 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// найдем период ПериодПредыдущейЗаписи по разрядам
			|ВЫБРАТЬ
			|	ИзменениеРазрядовЗаПериод.Сотрудник КАК Сотрудник,
			|	ИзменениеРазрядовЗаПериод.РазрядКатегория КАК РазрядКатегория,
			|	ИзменениеРазрядовЗаПериод.ПериодЗаписи КАК ПериодЗаписи,
			|	ИзменениеРазрядовЗаПериод.НачалоПериода КАК НачалоПериода,
			|	ИзменениеРазрядовЗаПериод.КонецПериода КАК КонецПериода,
			|	ИзменениеРазрядовЗаПериод.НачалоПериодаРасчетаСреднего КАК НачалоПериодаРасчетаСреднего,
			|	ИзменениеРазрядовЗаПериод.ОкончаниеПериодаРасчетаДляКадрового КАК ОкончаниеПериодаРасчетаДляКадрового,
			|	ИзменениеРазрядовЗаПериод.Период КАК Период,
			|	МАКСИМУМ(ЕСТЬNULL(ИзменениеРазрядовЗаПериодПредыдущиеЗаписи.ПериодЗаписи, ДАТАВРЕМЯ(1,1,1))) КАК ПериодПредыдущейЗаписи
			|ПОМЕСТИТЬ ВТИзменениеРазрядовПериодыПредыдущейЗаписи
			|ИЗ
			|	ВТИзменениеРазрядовЗаПериодДанные КАК ИзменениеРазрядовЗаПериод
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИзменениеРазрядовЗаПериодДанные КАК ИзменениеРазрядовЗаПериодПредыдущиеЗаписи
			|		ПО ИзменениеРазрядовЗаПериод.Сотрудник = ИзменениеРазрядовЗаПериодПредыдущиеЗаписи.Сотрудник
			|			И ИзменениеРазрядовЗаПериод.ПериодЗаписи > ИзменениеРазрядовЗаПериодПредыдущиеЗаписи.ПериодЗаписи
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзменениеРазрядовЗаПериод.Сотрудник,
			|	ИзменениеРазрядовЗаПериод.РазрядКатегория,
			|	ИзменениеРазрядовЗаПериод.ПериодЗаписи,
			|	ИзменениеРазрядовЗаПериод.НачалоПериода,
			|	ИзменениеРазрядовЗаПериод.КонецПериода,
			|	ИзменениеРазрядовЗаПериод.НачалоПериодаРасчетаСреднего,
			|	ИзменениеРазрядовЗаПериод.ОкончаниеПериодаРасчетаДляКадрового,
			|	ИзменениеРазрядовЗаПериод.Период
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// приведем НачалоПериода и КонецПериода
			|ВЫБРАТЬ
			|	ИзменениеРазрядовПериодыПредыдущейЗаписи.Сотрудник КАК Сотрудник,
			|	ИзменениеРазрядовПериодыПредыдущейЗаписи.РазрядКатегория КАК РазрядКатегория,
			|	ИзменениеРазрядовПериодыПредыдущейЗаписи.ПериодЗаписи КАК ПериодЗаписи,
			|	ИзменениеРазрядовПериодыПредыдущейЗаписи.ПериодПредыдущейЗаписи,
			|	ИзменениеРазрядовПериодыПредыдущейЗаписи.Период,
			|	ВЫБОР
			|		КОГДА ИзменениеРазрядовПериодыПредыдущейЗаписи.ПериодПредыдущейЗаписи <= ИзменениеРазрядовПериодыПредыдущейЗаписи.НачалоПериодаРасчетаСреднего
			|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
			|		ИНАЧЕ ИзменениеРазрядовПериодыПредыдущейЗаписи.НачалоПериода
			|	КОНЕЦ КАК НачалоПериода,
			|	ВЫБОР
			|		КОГДА НАЧАЛОПЕРИОДА(ИзменениеРазрядовПериодыПредыдущейЗаписи.КонецПериода, ДЕНЬ) = ИзменениеРазрядовПериодыПредыдущейЗаписи.ОкончаниеПериодаРасчетаДляКадрового
			|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
			|		ИНАЧЕ ИзменениеРазрядовПериодыПредыдущейЗаписи.КонецПериода
			|	КОНЕЦ КАК КонецПериода
			|ПОМЕСТИТЬ ВТИзменениеРазрядовЗаПериод
			|ИЗ
			|	ВТИзменениеРазрядовПериодыПредыдущейЗаписи КАК ИзменениеРазрядовПериодыПредыдущейЗаписи
			|
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТИзменениеРазрядовПериодыПредыдущейЗаписи
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|", "") + "
			// изменения должности
			|ВЫБРАТЬ
			|	КадровыеПеремещенияЗаПериод.Сотрудник КАК Сотрудник,
			|	ВЫБОР
			|		КОГДА КадровыеПеремещенияЗаПериод.Должность <> ИнтервалыКадроваяИсторияСотрудников.Должность
			|			ТОГДА КадровыеПеремещенияЗаПериод.Период
			|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
			|	КОНЕЦ КАК Период,
			|	""Должность"" КАК ВидИзменения,
			|	КадровыеПеремещенияЗаПериод.НачалоПериода КАК НачалоПериода,
			|	КадровыеПеремещенияЗаПериод.КонецПериода КАК КонецПериода
			|ПОМЕСТИТЬ ВТВсеДатыКадровыхПерестановок
			|ИЗ
			|	ВТКадровыеПеремещенияЗаПериод КАК КадровыеПеремещенияЗаПериод
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалыКадроваяИсторияСотрудников КАК ИнтервалыКадроваяИсторияСотрудников
			|		ПО КадровыеПеремещенияЗаПериод.Сотрудник = ИнтервалыКадроваяИсторияСотрудников.Сотрудник
			|			И (КадровыеПеремещенияЗаПериод.ПериодПредыдущейЗаписи = ИнтервалыКадроваяИсторияСотрудников.Период
			|					И НЕ ИнтервалыКадроваяИсторияСотрудников.ЭтоВозвратноеСобытие
			|				ИЛИ КадровыеПеремещенияЗаПериод.ПериодПредыдущейЗаписи = ИнтервалыКадроваяИсторияСотрудников.НачалоПериода
			|					И ИнтервалыКадроваяИсторияСотрудников.ЭтоВозвратноеСобытие)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсходныеДанные КАК ИсходныеДанные
			|		ПО КадровыеПеремещенияЗаПериод.Сотрудник = ИсходныеДанные.Сотрудник
			// будем использовать только записи попадающие в интересующий период (ранее получены кадровые данные без ограничений по периоду)
			|			И ((КадровыеПеремещенияЗаПериод.НачалоПериода МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего
			|				ИЛИ КадровыеПеремещенияЗаПериод.КонецПериода МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)
			// или внутри периода было перемещение, при этом первоначальное событие было вне рамок периода
			|           ИЛИ ((КадровыеПеремещенияЗаПериод.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
			|          		ИЛИ КадровыеПеремещенияЗаПериод.КонецПериода = ДАТАВРЕМЯ(3999, 1, 1))
			|				И КадровыеПеремещенияЗаПериод.Период МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)) 
			|
			|ГДЕ
			|	КадровыеПеремещенияЗаПериод.Должность <> ИнтервалыКадроваяИсторияСотрудников.Должность
			// поддержим существовавший расчет (приемы ранее не учитывались в запросах)
			|" + ?(РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок И НЕ КоэффициентУчитываетПоследующиеИндексации, "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			// приемы
			|ВЫБРАТЬ
			|	ИнтервалыКадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
			|	МИНИМУМ(ИнтервалыКадроваяИсторияСотрудников.НачалоПериода) КАК Период,
			|	""Прием"" КАК ВидИзменения,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоПериода,
			|	МАКСИМУМ(ИнтервалыКадроваяИсторияСотрудников.КонецПериода) КАК КонецПериода
			|ИЗ
			|	ВТИсходныеДанныеДляТаблицаПериодов КАК ИсходныеДанныеДляТаблицаПериодов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалыКадроваяИсторияСотрудников КАК ИнтервалыКадроваяИсторияСотрудников
			|		ПО ИсходныеДанныеДляТаблицаПериодов.Сотрудник = ИнтервалыКадроваяИсторияСотрудников.Сотрудник
			|ГДЕ
			|	ИнтервалыКадроваяИсторияСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)
			|	ИЛИ ИнтервалыКадроваяИсторияСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.НеподтвержденныеДанные)
			|	ИЛИ ИнтервалыКадроваяИсторияСотрудников.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.НачальныеДанные)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИнтервалыКадроваяИсторияСотрудников.Сотрудник
			|
			|", "") + "
			// поддержим существовавший расчет (изменения категорий ранее не учитывались в запросах)
			|" + ?(УчитыватьИзмененияРазряда, "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			// изменения разряда
			|ВЫБРАТЬ
			|	ИзменениеРазрядовЗаПериод.Сотрудник КАК Сотрудник,
			|	ВЫБОР
			|		КОГДА ИзменениеРазрядовЗаПериод.РазрядКатегория <> ЕСТЬNULL(ИнтервалыРазрядыКатегорииСотрудников.РазрядКатегория, ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка))
			|			ТОГДА ИзменениеРазрядовЗаПериод.Период
			|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
			|	КОНЕЦ КАК Период,
			|	""Разряд"",
			|	ИзменениеРазрядовЗаПериод.НачалоПериода КАК НачалоПериода,
			|	ИзменениеРазрядовЗаПериод.КонецПериода КАК КонецПериода
			|ИЗ
			|	ВТИзменениеРазрядовЗаПериод КАК ИзменениеРазрядовЗаПериод
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалыРазрядыКатегорииСотрудников КАК ИнтервалыРазрядыКатегорииСотрудников
			|		ПО ИзменениеРазрядовЗаПериод.Сотрудник = ИнтервалыРазрядыКатегорииСотрудников.Сотрудник
			|			И ИзменениеРазрядовЗаПериод.ПериодПредыдущейЗаписи = ИнтервалыРазрядыКатегорииСотрудников.ПериодЗаписи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсходныеДанные КАК ИсходныеДанные
			|		ПО ИзменениеРазрядовЗаПериод.Сотрудник = ИсходныеДанные.Сотрудник
			// будем использовать только записи попадающие в интересующий период (ранее получены кадровые данные без ограничений по периоду)
			|			И ((ИзменениеРазрядовЗаПериод.НачалоПериода МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего
			|				ИЛИ ИзменениеРазрядовЗаПериод.КонецПериода МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)
			// или внутри периода было перемещение, при этом первоначальное событие было вне рамок периода
			|           ИЛИ ((ИзменениеРазрядовЗаПериод.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
			|           	ИЛИ ИзменениеРазрядовЗаПериод.КонецПериода = ДАТАВРЕМЯ(3999, 1, 1))
			|				И ИзменениеРазрядовЗаПериод.Период МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)) 
			|
			|ГДЕ
			|	ИзменениеРазрядовЗаПериод.РазрядКатегория <> ЕСТЬNULL(ИнтервалыРазрядыКатегорииСотрудников.РазрядКатегория, ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка))
			|", "") + "
			|" + ?(УчитыватьИзмененияПодразделения, "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			// изменения подразделения
			|ВЫБРАТЬ
			|	КадровыеПеремещенияЗаПериод.Сотрудник КАК Сотрудник,
			|	ВЫБОР
			|		КОГДА КадровыеПеремещенияЗаПериод.Подразделение <> ИнтервалыКадроваяИсторияСотрудников.Подразделение
			|			ТОГДА КадровыеПеремещенияЗаПериод.Период
			|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
			|	КОНЕЦ КАК Период,
			|	""Подразделение"",
			|	КадровыеПеремещенияЗаПериод.НачалоПериода КАК НачалоПериода,
			|	КадровыеПеремещенияЗаПериод.КонецПериода КАК КонецПериода
			|ИЗ
			|	ВТКадровыеПеремещенияЗаПериод КАК КадровыеПеремещенияЗаПериод
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИнтервалыКадроваяИсторияСотрудников КАК ИнтервалыКадроваяИсторияСотрудников
			|		ПО КадровыеПеремещенияЗаПериод.Сотрудник = ИнтервалыКадроваяИсторияСотрудников.Сотрудник
			|			И КадровыеПеремещенияЗаПериод.ПериодПредыдущейЗаписи = ИнтервалыКадроваяИсторияСотрудников.Период
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТИсходныеДанные КАК ИсходныеДанные
			|		ПО КадровыеПеремещенияЗаПериод.Сотрудник = ИсходныеДанные.Сотрудник
			// будем использовать только записи попадающие в интересующий период (ранее получены кадровые данные без ограничений по периоду)
			|			И ((КадровыеПеремещенияЗаПериод.НачалоПериода МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего
			|				ИЛИ КадровыеПеремещенияЗаПериод.КонецПериода МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)
			// или внутри периода было перемещение, при этом первоначальное событие было вне рамок периода
			|           ИЛИ ((КадровыеПеремещенияЗаПериод.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
			|           	ИЛИ КадровыеПеремещенияЗаПериод.КонецПериода = ДАТАВРЕМЯ(3999, 1, 1))
			|				И КадровыеПеремещенияЗаПериод.Период МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)) 
			|
			|ГДЕ
			|	КадровыеПеремещенияЗаПериод.Подразделение <> ИнтервалыКадроваяИсторияСотрудников.Подразделение
			|", "") + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			// при расчете коэффициента в рамках периода события среднего рассматриваем одно кадровое перемещение
			|" + ?(РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок И НЕ КоэффициентУчитываетПоследующиеИндексации, "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВсеДатыКадровыхПерестановок.Сотрудник КАК Сотрудник,
			|	ВсеДатыКадровыхПерестановок.Период КАК Период,
			|	ВсеДатыКадровыхПерестановок.НачалоПериода КАК НачалоПериода,
			|	ВсеДатыКадровыхПерестановок.КонецПериода КАК КонецПериода
			|ИЗ
			|	ВТВсеДатыКадровыхПерестановок КАК ВсеДатыКадровыхПерестановок
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВсеДатыКадровыхПерестановок.Период
			|
			|", "
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВсеДатыКадровыхПерестановок.Сотрудник КАК Сотрудник,
			// при расчете коэффициента в рамках периода события находим самое раннее событие смены 
			|	" + ?(КоэффициентУчитываетПоследующиеИндексации, "МИНИМУМ", "МАКСИМУМ") + "(ВсеДатыКадровыхПерестановок.Период) КАК Период
			|ПОМЕСТИТЬ ВТМаксимумыДатКадровыхПерестановок
			|ИЗ
			|	ВТВсеДатыКадровыхПерестановок КАК ВсеДатыКадровыхПерестановок
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеДатыКадровыхПерестановок.Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВсеДатыКадровыхПерестановок.Сотрудник КАК Сотрудник,
			|	ВсеДатыКадровыхПерестановок.Период КАК Период,
			|	ВсеДатыКадровыхПерестановок.НачалоПериода КАК НачалоПериода,
			|	ВсеДатыКадровыхПерестановок.КонецПериода КАК КонецПериода
			|ПОМЕСТИТЬ ВТПериодыКадровыхПерестановок
			|ИЗ
			|	ВТВсеДатыКадровыхПерестановок КАК ВсеДатыКадровыхПерестановок
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимумыДатКадровыхПерестановок КАК МаксимумыДатКадровыхПерестановок
			|		ПО ВсеДатыКадровыхПерестановок.Сотрудник = МаксимумыДатКадровыхПерестановок.Сотрудник
			|			И ВсеДатыКадровыхПерестановок.Период = МаксимумыДатКадровыхПерестановок.Период
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ВсеДатыКадровыхПерестановок.Сотрудник,
			|   ВсеДатыКадровыхПерестановок.Период") + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТИнтервалыКадроваяИсторияСотрудников
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТКадровыеПеремещенияЗаПериод
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТВсеДатыКадровыхПерестановок
			|" + ?(КоэффициентУчитываетПоследующиеИндексации И РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок, "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТМаксимумыДатКадровыхПерестановок
			|", "") + "
			|" + ?(УчитыватьИзмененияРазряда, "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТИнтервалыРазрядыКатегорииСотрудников
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ВТИзменениеРазрядовЗаПериод
			|", "") + "
			|";
			
	    // обработаем таблицу периодов, чтобы не было "разрывов" между перидами строк при включенной настройке РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок 
		Если РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок И НЕ КоэффициентУчитываетПоследующиеИндексации Тогда
			
			ПериодыКадровыхПерестановок = Запрос.Выполнить().Выгрузить();
			
			КоличествоСтрок = ПериодыКадровыхПерестановок.Количество();
			
			// в общем случае при наличии учитываемого кадрового должно быть как минимум две строки: прием и перемещение.
			Если КоличествоСтрок > 1 Тогда
				
				СчетчикСтрок = 0;
				
				// внутри могут быть неучитываемые перемещения (например, не учитывается изменения подразделения в среднем)
				// тогда могут возникать "разрывы" по периодам, исправим это, сделав непрерывными периоды между строками
				Для Каждого СтрокаТаблицыПериодов Из ПериодыКадровыхПерестановок Цикл
					
					Если СчетчикСтрок = 0 Тогда
						
						СчетчикСтрок = СчетчикСтрок + 1;
						
						КонецПериода  = СтрокаТаблицыПериодов.КонецПериода;
						
						Продолжить;
						
					КонецЕсли;
					
					// исправим "разрывы" в датах строк
					СтрокаТаблицыПериодов.НачалоПериода = НачалоДня(КонецПериода + 86400);
					
					СчетчикСтрок = СчетчикСтрок + 1;
					
					//НачалоПериода = СтрокаТаблицыПериодов.НачалоПериода;
					КонецПериода  = СтрокаТаблицыПериодов.КонецПериода;
					
				КонецЦикла;
				
				// проверим в последней строке КонецПериода 01.01.3999
				Если ПериодыКадровыхПерестановок[КоличествоСтрок - 1].КонецПериода <> Дата('39990101') Тогда
					
					ПериодыКадровыхПерестановок[КоличествоСтрок - 1].КонецПериода = Дата('39990101');
					
				КонецЕсли;
				
			// обработаем ситуацию, когда прием имеет дату окончания внутри периода расчета (из-за неучитываемого кадрового перемещения), 
			// для корреткности применения коэффициента будем считать такие записи действующие на весь период среднего
			ИначеЕсли ПериодыКадровыхПерестановок.Количество() = 1 Тогда
				
				ПериодыКадровыхПерестановок[0].КонецПериода = Дата('39990101');
				
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ПериодыКадровыхПерестановок", ПериодыКадровыхПерестановок);
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
		    |	ВсеДатыКадровыхПерестановок.Сотрудник КАК Сотрудник,
		    |	ВсеДатыКадровыхПерестановок.Период КАК Период,
		    |	ВсеДатыКадровыхПерестановок.НачалоПериода КАК НачалоПериода,
		    |	ВсеДатыКадровыхПерестановок.КонецПериода КАК КонецПериода
		    |ПОМЕСТИТЬ ВТПериодыКадровыхПерестановок
		    |ИЗ
		    |	&ПериодыКадровыхПерестановок КАК ВсеДатыКадровыхПерестановок
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ВсеДатыКадровыхПерестановок.Сотрудник,
			|   ВсеДатыКадровыхПерестановок.Период";
		
		КонецЕсли;

		Запрос.Выполнить();
	
	КонецЕсли;	
	
	// Выбираем коэффициенты индексации заработка: 
	// - для расчета показателя КоэффициентИндексации - для каждой строки начислений 
	// выборка коэффициентов всех индексаций, случившихся ПОСЛЕ даты начала события
	// - для индексации выплат, учитываемых при расчете периода среднего заработка, 
	// для каждого месяца выбираем коэффициенты индексаций, случившихся ДО даты начала события

	Если КоэффициентУчитываетПоследующиеИндексации Тогда
		
		Если РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок Тогда
			
			КоэффициентыИндексацииЗаработкаТекст = 
				"ВЫБРАТЬ
				|	ИсходныеДанные.Сотрудник КАК Сотрудник,
				|	ИсходныеДанные.ДатаНачалаСобытия,
				|	ИсходныеДанные.ИдентификаторСтроки,
				// При расчете показателя начисления принимаем во внимание период действия начало начислений
				|	ИсходныеДанные.ПериодДействияНачало КАК Период,
				|	МИНИМУМ(КоэффициентИндексацииЗаработка.ДатаИндексации) КАК ДатаИндексации,
				|	МАКСИМУМ(ЕСТЬNULL(КоэффициентИндексацииЗаработка.Период, ДАТАВРЕМЯ(1,1,1))) КАК ПериодИндексации
				|ПОМЕСТИТЬ ВТКоэффициентыИндексацииЗаработка
				|ИЗ
				|	ВТИсходныеДанные КАК ИсходныеДанные
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
				|		ПО ИсходныеДанные.Сотрудник = КоэффициентИндексацииЗаработка.Сотрудник
				|			И (ИсходныеДанные.ПериодДействияНачало >= КоэффициентИндексацииЗаработка.Период)
				|			И (КоэффициентИндексацииЗаработка.Период >= ИсходныеДанные.НачалоПериодаРасчетаСреднего И КоэффициентИндексацииЗаработка.Период < ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)
				|				И КоэффициентИндексацииЗаработка.Период >= ИсходныеДанные.ДатаНачалаСобытия
				|				И КоэффициентИндексацииЗаработка.Период = КоэффициентИндексацииЗаработка.ДатаИндексации
				|
				|СГРУППИРОВАТЬ ПО
				|	ИсходныеДанные.Сотрудник,
				|	ИсходныеДанные.ДатаНачалаСобытия,
				|	ИсходныеДанные.ИдентификаторСтроки,
				|	ИсходныеДанные.ПериодДействияНачало
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИсходныеДанные.Сотрудник,
				|	ИсходныеДанные.ПериодДействияНачало";
				
				
		Иначе
			
			// поддержим существовавший расчет
			КоэффициентыИндексацииЗаработкаТекст = 
				"ВЫБРАТЬ
				|	ИсходныеДанные.Сотрудник КАК Сотрудник,
				|	ИсходныеДанные.ДатаНачалаСобытия,
				|	ИсходныеДанные.ИдентификаторСтроки,
				// При расчете показателя начисления принимаем во внимание период действия начало начислений
				|	ИсходныеДанные.ПериодДействияНачало КАК Период,
				|	КоэффициентИндексацииЗаработка.ДатаИндексации КАК ДатаИндексации,
				|	МАКСИМУМ(ЕСТЬNULL(КоэффициентИндексацииЗаработка.Период, ДАТАВРЕМЯ(1,1,1))) КАК ПериодИндексации
				|ПОМЕСТИТЬ ВТКоэффициентыИндексацииЗаработка
				|ИЗ
				|	ВТИсходныеДанные КАК ИсходныеДанные
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
				|		ПО ИсходныеДанные.Сотрудник = КоэффициентИндексацииЗаработка.Сотрудник
				|			И (ИсходныеДанные.ПериодДействияНачало >= КоэффициентИндексацииЗаработка.Период)
				|			И (КоэффициентИндексацииЗаработка.Период >= ИсходныеДанные.НачалоПериодаРасчетаСреднего И КоэффициентИндексацииЗаработка.Период < ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)
				|				И КоэффициентИндексацииЗаработка.Период >= ИсходныеДанные.ДатаНачалаСобытия
				// выбираем одну актуальную на дату ввода индексации запись
				|				И КоэффициентИндексацииЗаработка.Период = КоэффициентИндексацииЗаработка.ДатаИндексации
				|
				|СГРУППИРОВАТЬ ПО
				|	ИсходныеДанные.Сотрудник,
				|	ИсходныеДанные.ДатаНачалаСобытия,
				|	ИсходныеДанные.ИдентификаторСтроки,
				|	КоэффициентИндексацииЗаработка.ДатаИндексации,
				|	ИсходныеДанные.ПериодДействияНачало
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИсходныеДанные.Сотрудник,
				|	ИсходныеДанные.ПериодДействияНачало";
				
		КонецЕсли;
		
	Иначе
		
		Если РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок Тогда
			
			КоэффициентыИндексацииЗаработкаТекст = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КоэффициентыИндексацииЗаработка.Сотрудник КАК Сотрудник,
				|	ПериодыКадровыхПерестановок.НачалоПериода КАК НачалоПериода,
				|	ПериодыКадровыхПерестановок.КонецПериода КАК КонецПериода,
				|	МАКСИМУМ(КоэффициентыИндексацииЗаработка.Период) КАК Период
				|ПОМЕСТИТЬ ВТПериодыИндексации
				|
				|ИЗ
				|	ВТИсходныеДанные КАК ИсходныеДанные
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентыИндексацииЗаработка
				|		ПО ИсходныеДанные.Сотрудник = КоэффициентыИндексацииЗаработка.Сотрудник
				|			И ИсходныеДанные.НачалоПериодаРасчетаСреднего < КоэффициентыИндексацииЗаработка.Период
				|			И ИсходныеДанные.ДатаНачалаСобытия > КоэффициентыИндексацииЗаработка.Период
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыКадровыхПерестановок КАК ПериодыКадровыхПерестановок
				|		ПО ИсходныеДанные.Сотрудник = ПериодыКадровыхПерестановок.Сотрудник
				|			И (КоэффициентыИндексацииЗаработка.Период >= ПериодыКадровыхПерестановок.НачалоПериода)
				|			И (КоэффициентыИндексацииЗаработка.Период <= ПериодыКадровыхПерестановок.КонецПериода)
				|
				|ГДЕ
				|	КоэффициентыИндексацииЗаработка.Коэффициент > 1
				|
				|СГРУППИРОВАТЬ ПО
				|	КоэффициентыИндексацииЗаработка.Сотрудник,
				|	ПериодыКадровыхПерестановок.НачалоПериода,
				|	ПериодыКадровыхПерестановок.КонецПериода
				|
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КоэффициентыИндексацииЗаработка.Сотрудник КАК Сотрудник,
				|	КоэффициентыИндексацииЗаработка.ДатаИндексации КАК ДатаИндексации,
				|	ВЫБОР
				|		КОГДА КоэффициентыИндексацииЗаработка.КоэффициентИндексации < 1
				|			ТОГДА 1
				|		ИНАЧЕ ВЫБОР 
				|				КОГДА КоэффициентыИндексацииЗаработка.ДатаИндексации = ПериодыИндексации.НачалоПериода
				|					ТОГДА 1
				|				ИНАЧЕ КоэффициентыИндексацииЗаработка.КоэффициентИндексации
				|			  КОНЕЦ
				|	КОНЕЦ КАК КоэффициентИндексации
				|ПОМЕСТИТЬ ВТКоэффициентыИндексацииЗаработкаОбщая
				|
				|ИЗ
				|	РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентыИндексацииЗаработка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодыИндексации КАК ПериодыИндексации
				|		ПО КоэффициентыИндексацииЗаработка.Сотрудник = ПериодыИндексации.Сотрудник
				|			И КоэффициентыИндексацииЗаработка.Период = ПериодыИндексации.Период
				|			И КоэффициентыИндексацииЗаработка.ДатаИндексации МЕЖДУ ПериодыИндексации.НачалоПериода И ПериодыИндексации.КонецПериода
				|
				|ОБЪЕДИНИТЬ
				// добавим строки для кадровых перемещений без индексации (коэффициент равен 1)
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПериодыКадровыхПерестановок.Сотрудник,
				|	ПериодыКадровыхПерестановок.Период,
				|	1
				|ИЗ
				|	ВТПериодыКадровыхПерестановок КАК ПериодыКадровыхПерестановок
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентыИндексацииЗаработка
				|		ПО ПериодыКадровыхПерестановок.Сотрудник = КоэффициентыИндексацииЗаработка.Сотрудник
				// в запросе будем анализировать все кадровые перемещения (как на начало месяца, которые равны индексации, так и в течение месяца, так как они также влияют на коэффицент индексации месяца)
				// в условии ГДЕ отсечем ненужные записи
				|			И (ПериодыКадровыхПерестановок.Период = КоэффициентыИндексацииЗаработка.Период
				|				ИЛИ НАЧАЛОПЕРИОДА(ПериодыКадровыхПерестановок.Период, МЕСЯЦ) = КоэффициентыИндексацииЗаработка.Период)
				|
				|ГДЕ 
				// учтем следующие варианты (в скобках коэффициент индексации среднего заработка в периоде расчета, без скобок коэффициент индексации назначаемый кадровым событием, <> - кадровое перемещение)
				// Вариант 1. 01.09	- (1.35) | 01.10 - (1)    - 1.35  | 10.10 - <> | 01.11 - (1)
				// Вариант 2. 01.09	- (1)    | 01.10 - (1)    - <>    | -		   | 01.11 - (1)
				// Вариант 3. 01.09	- (1)	 | 01.10 - (1.35) - <>    | -		   | 01.11 - (1) - 1.35 
				// Вариант 4. 01.09	- (1)    | 01.10 - (1)	   		  | 10.10 - <> | 01.11 - (1) - 1.35 
				|	(КоэффициентыИндексацииЗаработка.Сотрудник) ЕСТЬ NULL
				|		ИЛИ НАЧАЛОПЕРИОДА(ПериодыКадровыхПерестановок.НачалоПериода, ДЕНЬ) < НАЧАЛОПЕРИОДА(КоэффициентыИндексацииЗаработка.Период, ДЕНЬ)
				|
				|;
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КоэффициентыИндексацииЗаработкаОбщая.Сотрудник,
				// коэффициент индексации начинает действовать в обратную сторону и распространяет действие на предыдущий период
				// с начала предшествующего месяца (за каждый месяц, предшествующий повышению, исчисляется с учетом коэффициента повышения)
				// к началу месяца не приводим, тк в месяце может быть несколько индексаций, но не в одну дату, 
				// поэтому в целях контроля кадрового перемещения интересует конкретный день
				|	НАЧАЛОПЕРИОДА(КоэффициентыИндексацииЗаработкаОбщая.ДатаИндексации, МЕСЯЦ) КАК ДатаИндексации,
				// если в одном месяце в разные даты было и индексация и кадровое перемещение
				// берем коэффициент кадрового перемещения - единицу (меньший)
				|	МИНИМУМ(КоэффициентыИндексацииЗаработкаОбщая.КоэффициентИндексации)
				|ПОМЕСТИТЬ ВТКоэффициентыИндексацииЗаработка
				|
				|ИЗ
				|	ВТКоэффициентыИндексацииЗаработкаОбщая КАК КоэффициентыИндексацииЗаработкаОбщая
				|
				|СГРУППИРОВАТЬ ПО
				|	КоэффициентыИндексацииЗаработкаОбщая.Сотрудник,
				|	НАЧАЛОПЕРИОДА(КоэффициентыИндексацииЗаработкаОбщая.ДатаИндексации, МЕСЯЦ)
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	КоэффициентыИндексацииЗаработкаОбщая.Сотрудник,
				|   НАЧАЛОПЕРИОДА(КоэффициентыИндексацииЗаработкаОбщая.ДатаИндексации, МЕСЯЦ)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТПериодыИндексации
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТКоэффициентыИндексацииЗаработкаОбщая
				|";
			
		Иначе
			
			// поддержим существовавший расчет
			КоэффициентыИндексацииЗаработкаТекст = 
				"ВЫБРАТЬ
				|	ИсходныеДанные.Сотрудник КАК Сотрудник,
				|	ИсходныеДанные.ДатаНачалаСобытия,
				|	ИсходныеДанные.ИдентификаторСтроки,
				|	Месяцы.Период КАК Период,
				|	МИНИМУМ(ЕСТЬNULL(КоэффициентИндексацииЗаработка.Период, ДАТАВРЕМЯ(1,1,1))) КАК ДатаИндексации
				|ПОМЕСТИТЬ ВТКоэффициентыИндексацииЗаработка
				|ИЗ
				|	ВТИсходныеДанные КАК ИсходныеДанные
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Месяцы
				|		ПО (Месяцы.Период МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
				|		ПО ИсходныеДанные.Сотрудник = КоэффициентИндексацииЗаработка.Сотрудник
				|			И (Месяцы.Период < НАЧАЛОПЕРИОДА(КоэффициентИндексацииЗаработка.Период, МЕСЯЦ))
				|			И (КоэффициентИндексацииЗаработка.Период >= ИсходныеДанные.НачалоПериодаРасчетаСреднего И КоэффициентИндексацииЗаработка.Период < ИсходныеДанные.ДатаНачалаСобытия)
				// выбираем одну актуальную на дату ввода индексации запись
				|			И (КоэффициентИндексацииЗаработка.ДатаИндексации = КоэффициентИндексацииЗаработка.Период)
				|
				|СГРУППИРОВАТЬ ПО
				|	ИсходныеДанные.Сотрудник,
				|	ИсходныеДанные.ДатаНачалаСобытия,
				|	ИсходныеДанные.ИдентификаторСтроки,
				|	Месяцы.Период
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	ИсходныеДанные.Сотрудник,
				|	Месяцы.Период";
			
		КонецЕсли;
			
	КонецЕсли;
	
	// ЗУП РК индексация в рамках дня
	КоэффициентыИндексацииЗаработкаТекст = СтрЗаменить(КоэффициентыИндексацииЗаработкаТекст, "КоэффициентыИндексацииЗаработка.Период", "НАЧАЛОПЕРИОДА(КоэффициентыИндексацииЗаработка.Период, ДЕНЬ)");
	КоэффициентыИндексацииЗаработкаТекст = СтрЗаменить(КоэффициентыИндексацииЗаработкаТекст, "КоэффициентИндексацииЗаработка.Период", "НАЧАЛОПЕРИОДА(КоэффициентИндексацииЗаработка.Период, ДЕНЬ)");  
	// ЗУП РК индексация в рамках дня
	
	Запрос.Текст = КоэффициентыИндексацииЗаработкаТекст;
	Запрос.Выполнить();

	Если КоэффициентУчитываетПоследующиеИндексации Тогда	
		
		Если РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок Тогда
			
			// при расчете показателей не учитываем кадровые перемещения, приводим коэффициенты индексации
			// к текущему за месяц расчета заработку
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ИсходныеДанные.Сотрудник КАК Сотрудник,
				|	ИсходныеДанные.Период КАК Период,
				|	ИсходныеДанные.ИдентификаторСтроки КАК ИдентификаторСтроки,
				//  В расчетном периоде было изменение места работы, коэффициент устанавливается равным единице
				|	ЕСТЬNULL(КоэффициентИндексацииЗаработка.КоэффициентИндексации, 1) КАК КоэффициентИндексации
				|ИЗ
				|	ВТКоэффициентыИндексацииЗаработка КАК ИсходныеДанные
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
				|		ПО ИсходныеДанные.Сотрудник = КоэффициентИндексацииЗаработка.Сотрудник
				|			И ИсходныеДанные.ПериодИндексации = КоэффициентИндексацииЗаработка.Период
				|			И ИсходныеДанные.ДатаИндексации = КоэффициентИндексацииЗаработка.ДатаИндексации
				|
				|УПОРЯДОЧИТЬ ПО
				|	ИдентификаторСтроки,
				|	Сотрудник,
				|	Период УБЫВ";
			
		Иначе
			
			// поддержим существовавший расчет
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ИсходныеДанные.Сотрудник КАК Сотрудник,
				|	ИсходныеДанные.Период КАК Период,
				|	ИсходныеДанные.ИдентификаторСтроки КАК ИдентификаторСтроки,
				//  В расчетном периоде было изменение места работы, коэффициент устанавливается равным единице
				|	ВЫБОР
				|		КОГДА (НЕ ПоследнийКадровыйПеревод.Сотрудник ЕСТЬ NULL)
				|				И ПоследнийКадровыйПеревод.Период <= ИсходныеДанные.Период
				|			ТОГДА 1
				|		ИНАЧЕ ЕСТЬNULL(КоэффициентИндексацииЗаработка.Коэффициент, 1) 
				|	КОНЕЦ КАК КоэффициентИндексации
				|ИЗ
				|	ВТКоэффициентыИндексацииЗаработка КАК ИсходныеДанные
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
				|		ПО ИсходныеДанные.Сотрудник = КоэффициентИндексацииЗаработка.Сотрудник
				|			И ИсходныеДанные.ПериодИндексации = КоэффициентИндексацииЗаработка.Период
				|			И ИсходныеДанные.ДатаИндексации = КоэффициентИндексацииЗаработка.ДатаИндексации
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыКадровыхПерестановок КАК ПоследнийКадровыйПеревод
				|		ПО ИсходныеДанные.Сотрудник = ПоследнийКадровыйПеревод.Сотрудник
				|			И ПоследнийКадровыйПеревод.Период >= ИсходныеДанные.Период
				|
				|УПОРЯДОЧИТЬ ПО
				|	ИдентификаторСтроки,
				|	Сотрудник,
				|	Период УБЫВ";
				
		КонецЕсли;
	
	Иначе
		
		Если РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок Тогда
		
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ИсходныеДанные.Сотрудник КАК Сотрудник,
				|	Месяцы.Период КАК Период,
				|	ИсходныеДанные.ИдентификаторСтроки КАК ИдентификаторСтроки,
				|	КоэффициентыИндексацииЗаработка.КоэффициентИндексации КАК КоэффициентИндексации
				|ИЗ
				|	ВТИсходныеДанные КАК ИсходныеДанные
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериоды КАК Месяцы
				|		ПО (Месяцы.Период МЕЖДУ ИсходныеДанные.НачалоПериодаРасчетаСреднего И ИсходныеДанные.ОкончаниеПериодаРасчетаСреднего)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыИндексацииЗаработка КАК КоэффициентыИндексацииЗаработка
				|		ПО (КоэффициентыИндексацииЗаработка.Сотрудник = ИсходныеДанные.Сотрудник)
				|			И ИсходныеДанные.ДатаНачалаСобытия >= КоэффициентыИндексацииЗаработка.ДатаИндексации
				|			И ИсходныеДанные.НачалоПериодаРасчетаСреднего < КоэффициентыИндексацииЗаработка.ДатаИндексации
				|			И ДОБАВИТЬКДАТЕ(Месяцы.Период, МЕСЯЦ, 1) = КоэффициентыИндексацииЗаработка.ДатаИндексации
				|
				|УПОРЯДОЧИТЬ ПО
				|	ИдентификаторСтроки,
				|	Сотрудник,
				|	Период УБЫВ";
			
		Иначе
			
			// поддержим существовавший расчет
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	КоэффициентыИндексацииЗаработка.Сотрудник КАК Сотрудник,
				|	КоэффициентыИндексацииЗаработка.Период КАК Период,
				|	КоэффициентыИндексацииЗаработка.ИдентификаторСтроки КАК ИдентификаторСтроки,
				//  В расчетном периоде было изменение места работы, коэффициент устанавливается равным единице
				|	ВЫБОР
				|		КОГДА (НЕ ПоследнийКадровыйПеревод.Сотрудник ЕСТЬ NULL)
				|				И ПоследнийКадровыйПеревод.Период > КоэффициентыИндексацииЗаработка.Период
				|			ТОГДА 1
				|		ИНАЧЕ ЕСТЬNULL(КоэффициентИндексацииЗаработка.Коэффициент, 1) 
				|	КОНЕЦ КАК КоэффициентИндексации
				|ИЗ
				|	ВТКоэффициентыИндексацииЗаработка КАК КоэффициентыИндексацииЗаработка
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
				|		ПО КоэффициентыИндексацииЗаработка.Сотрудник = КоэффициентИндексацииЗаработка.Сотрудник
				|			И КоэффициентыИндексацииЗаработка.ДатаИндексации = КоэффициентИндексацииЗаработка.Период
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыКадровыхПерестановок КАК ПоследнийКадровыйПеревод
				|		ПО КоэффициентыИндексацииЗаработка.Сотрудник = ПоследнийКадровыйПеревод.Сотрудник
				|			И ПоследнийКадровыйПеревод.Период >= КоэффициентыИндексацииЗаработка.Период
				|
				|УПОРЯДОЧИТЬ ПО
				|	ИдентификаторСтроки,
				|	Сотрудник,
				|	Период ВОЗР";
			
		КонецЕсли;
		
	КонецЕсли;

	// ЗУП РК индексация в рамках дня
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КоэффициентыИндексацииЗаработка.Период", "НАЧАЛОПЕРИОДА(КоэффициентыИндексацииЗаработка.Период, ДЕНЬ)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КоэффициентИндексацииЗаработка.Период", "НАЧАЛОПЕРИОДА(КоэффициентИндексацииЗаработка.Период, ДЕНЬ)");
	// ЗУП РК индексация в рамках дня
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Обходя результаты запроса агрегируем коэффициенты.
	ВыборкаПоСотрудникам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПредыдущийКоэффициентИндексации = 1;
	
	Если КоэффициентУчитываетПоследующиеИндексации Тогда
		ИмяКолонкиКоэффициента = "Коэффициент";
	Иначе
		ИмяКолонкиКоэффициента = "КоэффициентИндексации";
 	КонецЕсли;
	
	Пока ВыборкаПоСотрудникам.Следующий() Цикл
		
		СтрокаИндексации = ДанныеИндексации.Добавить();
		СтрокаИндексации.Сотрудник = ВыборкаПоСотрудникам.Сотрудник;
		СтрокаИндексации.Период = ВыборкаПоСотрудникам.Период;
			
		// поддержим существовавший расчет
		Если НЕ РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок Тогда
			
			СтрокаИндексации[ИмяКолонкиКоэффициента] = ВыборкаПоСотрудникам.КоэффициентИндексации;
			
		// если расчет в рамках кадровых перемещений	
		Иначе
			
			
			Если КоэффициентУчитываетПоследующиеИндексации Тогда
				
				СтрокаИндексации[ИмяКолонкиКоэффициента] = ВыборкаПоСотрудникам.КоэффициентИндексации;
				
			Иначе	
			
				Если ВыборкаПоСотрудникам.КоэффициентИндексации = Null Тогда
					СтрокаИндексации[ИмяКолонкиКоэффициента] = ПредыдущийКоэффициентИндексации;
				Иначе
					СтрокаИндексации[ИмяКолонкиКоэффициента] = ВыборкаПоСотрудникам.КоэффициентИндексации;
				КонецЕсли;
				
				Если ПредыдущийКоэффициентИндексации <> ВыборкаПоСотрудникам.КоэффициентИндексации
					И ВыборкаПоСотрудникам.КоэффициентИндексации <> Null Тогда
					
					ПредыдущийКоэффициентИндексации = ВыборкаПоСотрудникам.КоэффициентИндексации;
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если КоэффициентУчитываетПоследующиеИндексации Тогда
			СтрокаИндексации.ИдентификаторСтроки = ВыборкаПоСотрудникам.ИдентификаторСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеИндексации;
	
КонецФункции

// Определяет порядок учета рабочего времени при расчете среднего заработка.
//
Функция ПорядокУчетаРабочегоВремени(Сотрудник, ДатаАктуальности, Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КадровыеДанныеТекст = "Подразделение" + ?(Организация = Неопределено, ",Организация", ""); 
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, КадровыеДанныеТекст, ДатаАктуальности);

	Запрос.УстановитьПараметр("Организация", ?(Организация = Неопределено И КадровыеДанные.Количество() > 0, КадровыеДанные[0].Организация, Организация));
	Запрос.УстановитьПараметр("Подразделение", ?(КадровыеДанные.Количество() > 0, КадровыеДанные[0].Подразделение, Справочники.ПодразделенияОрганизаций.ПустаяСсылка()));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 КАК Приоритет,
		|	РасчетСреднегоЗаработкаСотрудниковСрезПоследних.УчетРабочегоВремени
		|ПОМЕСТИТЬ ВТНастройкиРасчетаСреднегоЗаработка
		|ИЗ
		|	РегистрСведений.РасчетСреднегоЗаработкаСотрудников.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РасчетСреднегоЗаработкаСотрудниковСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	РасчетСреднегоЗаработкаПодразделенийСрезПоследних.УчетРабочегоВремени
		|ИЗ
		|	РегистрСведений.РасчетСреднегоЗаработкаПодразделений.СрезПоследних(&ДатаАктуальности, Подразделение = &Подразделение) КАК РасчетСреднегоЗаработкаПодразделенийСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	РасчетСреднегоЗаработкаОрганизацийСрезПоследних.УчетРабочегоВремени
		|ИЗ
		|	РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &Организация) КАК РасчетСреднегоЗаработкаОрганизацийСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиРасчетаСреднегоЗаработка.УчетРабочегоВремени
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(НастройкиРасчетаСреднегоЗаработка.Приоритет) КАК Приоритет
		|	ИЗ
		|		ВТНастройкиРасчетаСреднегоЗаработка КАК НастройкиРасчетаСреднегоЗаработка) КАК МинимальноеЗначениеПриоритета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНастройкиРасчетаСреднегоЗаработка КАК НастройкиРасчетаСреднегоЗаработка
		|		ПО МинимальноеЗначениеПриоритета.Приоритет = НастройкиРасчетаСреднегоЗаработка.Приоритет";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УчетРабочегоВремени;
	Иначе 
		Возврат Перечисления.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоФактическомуГрафику;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьВТПорядокУчетаРабочегоВремени(Организация = Неопределено, МенеджерВременныхТаблиц, СтрокиРасчета) Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВТПорядокУчетаРабочегоВремени") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНачислений = Новый ТаблицаЗначений;
	
	Если Организация = Неопределено Тогда
		ТаблицаНачислений.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	КонецЕсли;
	
	ТаблицаНачислений.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаНачислений.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаНачислений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаНачислений.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Для Каждого СтрокаРасчета Из СтрокиРасчета Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНачислений.Добавить(), СтрокаРасчета.Значение);		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТаблицаНачислений", ТаблицаНачислений);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|" + ?(Организация = Неопределено, "Начисления.Организация КАК Организация,", "") + "
		|	Начисления.Подразделение КАК Подразделение,
		|	Начисления.Сотрудник КАК Сотрудник,
		|   Начисления.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТТаблицаНачислений
		|ИЗ
		|	&ТаблицаНачислений КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РасчетСреднегоЗаработкаСотрудников.Период) КАК Период,
		|	РасчетСреднегоЗаработкаСотрудников.Сотрудник,
		|	Начисления.ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТПериодыСотрудников
		|ИЗ
		|	ВТТаблицаНачислений КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаСотрудников КАК РасчетСреднегоЗаработкаСотрудников
		|		ПО Начисления.Сотрудник = РасчетСреднегоЗаработкаСотрудников.Сотрудник
		|			И Начисления.ДатаНачала >= РасчетСреднегоЗаработкаСотрудников.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ИдентификаторСтроки,
		|	РасчетСреднегоЗаработкаСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыСотрудников.ИдентификаторСтроки,
		|	ВТПериодыСотрудников.Сотрудник,
		|	РасчетСреднегоЗаработкаСотрудников.УчетРабочегоВремени,
        |	РасчетСреднегоЗаработкаСотрудников.УчетРабочегоВремениДляСуммированногоУчета
		|ПОМЕСТИТЬ ВТУчетВремениПоСотрудникам
		|ИЗ
		|	ВТПериодыСотрудников КАК ВТПериодыСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаСотрудников КАК РасчетСреднегоЗаработкаСотрудников
		|		ПО ВТПериодыСотрудников.Период = РасчетСреднегоЗаработкаСотрудников.Период
		|			И ВТПериодыСотрудников.Сотрудник = РасчетСреднегоЗаработкаСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РасчетСреднегоЗаработкаПодразделений.Период) КАК Период,
		|	РасчетСреднегоЗаработкаПодразделений.Подразделение,
		|	Начисления.ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТПериодыПодразделений
		|ИЗ
		|	ВТТаблицаНачислений КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаПодразделений КАК РасчетСреднегоЗаработкаПодразделений
		|		ПО Начисления.Подразделение = РасчетСреднегоЗаработкаПодразделений.Подразделение
		|			И Начисления.ДатаНачала >= РасчетСреднегоЗаработкаПодразделений.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ИдентификаторСтроки,
		|	РасчетСреднегоЗаработкаПодразделений.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыПодразделений.ИдентификаторСтроки,
		|	ВТПериодыПодразделений.Подразделение,
		|	РасчетСреднегоЗаработкаПодразделений.УчетРабочегоВремени,
		|	РасчетСреднегоЗаработкаПодразделений.УчетРабочегоВремениДляСуммированногоУчета
		|ПОМЕСТИТЬ ВТУчетВремениПоПодразделениям
		|ИЗ
		|	ВТПериодыПодразделений КАК ВТПериодыПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаПодразделений КАК РасчетСреднегоЗаработкаПодразделений
		|		ПО ВТПериодыПодразделений.Период = РасчетСреднегоЗаработкаПодразделений.Период
		|			И ВТПериодыПодразделений.Подразделение = РасчетСреднегоЗаработкаПодразделений.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РасчетСреднегоЗаработкаОрганизаций.Период) КАК Период,
		|	РасчетСреднегоЗаработкаОрганизаций.Организация,
		|	Начисления.ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТПериодыОрганизаций
		|ИЗ
		|	ВТТаблицаНачислений КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаОрганизаций КАК РасчетСреднегоЗаработкаОрганизаций
		|" + ?(Организация = Неопределено, "ПО Начисления.Организация = РасчетСреднегоЗаработкаОрганизаций.Организация", "
		|		ПО РасчетСреднегоЗаработкаОрганизаций.Организация = &Организация") + "
		|			И Начисления.ДатаНачала >= РасчетСреднегоЗаработкаОрганизаций.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ИдентификаторСтроки,
		|	РасчетСреднегоЗаработкаОрганизаций.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыОрганизаций.ИдентификаторСтроки,
		|	ВТПериодыОрганизаций.Организация,
		|	РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремени,
		|	РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета
		|ПОМЕСТИТЬ ВТУчетВремениПоОрганизациям
		|ИЗ
		|	ВТПериодыОрганизаций КАК ВТПериодыОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаОрганизаций КАК РасчетСреднегоЗаработкаОрганизаций
		|		ПО ВТПериодыОрганизаций.Период = РасчетСреднегоЗаработкаОрганизаций.Период
		|			И ВТПериодыОрганизаций.Организация = РасчетСреднегоЗаработкаОрганизаций.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	ВТУчетВремениПоСотрудникам.ИдентификаторСтроки,
		|	ВТУчетВремениПоСотрудникам.УчетРабочегоВремени,
		|	ВТУчетВремениПоСотрудникам.УчетРабочегоВремениДляСуммированногоУчета
		|ПОМЕСТИТЬ ВТНастройкиРасчетаСреднегоЗаработка
		|ИЗ
		|	ВТУчетВремениПоСотрудникам КАК ВТУчетВремениПоСотрудникам
		|
        |ОБЪЕДИНИТЬ ВСЕ
        |
		|ВЫБРАТЬ
		|	2,
		|	ВТУчетВремениПоПодразделениям.ИдентификаторСтроки,
		|	ВТУчетВремениПоПодразделениям.УчетРабочегоВремени,
		|	ВТУчетВремениПоПодразделениям.УчетРабочегоВремениДляСуммированногоУчета
		|ИЗ
		|	ВТУчетВремениПоПодразделениям КАК ВТУчетВремениПоПодразделениям
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	ВТУчетВремениПоОрганизациям.ИдентификаторСтроки,
		|	ВТУчетВремениПоОрганизациям.УчетРабочегоВремени,
		|	ВТУчетВремениПоОрганизациям.УчетРабочегоВремениДляСуммированногоУчета
		|ИЗ
		|	ВТУчетВремениПоОрганизациям КАК ВТУчетВремениПоОрганизациям
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МинимальноеЗначениеПриоритета.ИдентификаторСтроки,
		|	ВТНастройкиРасчетаСреднегоЗаработка.УчетРабочегоВремени,
		|	ВТНастройкиРасчетаСреднегоЗаработка.УчетРабочегоВремениДляСуммированногоУчета
		|ПОМЕСТИТЬ ВТПорядокУчетаРабочегоВремени
		|ИЗ
		|	(ВЫБРАТЬ
		|		МИНИМУМ(ВТНастройкиРасчетаСреднегоЗаработка.Приоритет) КАК Приоритет,
		|		ВТНастройкиРасчетаСреднегоЗаработка.ИдентификаторСтроки КАК ИдентификаторСтроки
		|	ИЗ
		|		ВТНастройкиРасчетаСреднегоЗаработка КАК ВТНастройкиРасчетаСреднегоЗаработка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВТНастройкиРасчетаСреднегоЗаработка.ИдентификаторСтроки) КАК МинимальноеЗначениеПриоритета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНастройкиРасчетаСреднегоЗаработка КАК ВТНастройкиРасчетаСреднегоЗаработка
		|		ПО МинимальноеЗначениеПриоритета.Приоритет = ВТНастройкиРасчетаСреднегоЗаработка.Приоритет
		|			И МинимальноеЗначениеПриоритета.ИдентификаторСтроки = ВТНастройкиРасчетаСреднегоЗаработка.ИдентификаторСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетВремениПоОрганизациям КАК ВТУчетВремениПоОрганизациям
		|		ПО ВТУчетВремениПоОрганизациям.ИдентификаторСтроки = ВТНастройкиРасчетаСреднегоЗаработка.ИдентификаторСтроки";
		
	Запрос.Выполнить();	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТПорядокУчетаРабочегоВремени";
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТТаблицаНачислений");
	УдалитьВТ.Добавить("ВТПериодыСотрудников");
	УдалитьВТ.Добавить("ВТУчетВремениПоСотрудникам");
	УдалитьВТ.Добавить("ВТПериодыПодразделений");
	УдалитьВТ.Добавить("ВТУчетВремениПоПодразделениям");
	УдалитьВТ.Добавить("ВТПериодыОрганизаций");
	УдалитьВТ.Добавить("ВТУчетВремениПоОрганизациям");
	УдалитьВТ.Добавить("ВТНастройкиРасчетаСреднегоЗаработка");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

Процедура СоздатьВТДоляНеполногоРабочегоВремени(МенеджерВременныхТаблиц, СтрокиРасчета) Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВТДоляНеполногоРабочегоВремени") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНачислений = Новый ТаблицаЗначений;
	
	ТаблицаНачислений.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаНачислений.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаНачислений.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Для Каждого СтрокаРасчета Из СтрокиРасчета Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНачислений.Добавить(), СтрокаРасчета.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНачислений", ТаблицаНачислений);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТИсходныеДанные
		|ИЗ
		|	&ТаблицаНачислений КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсходныеДанные.ДатаНачала КАК Период,
		|	ИсходныеДанные.Сотрудник,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК НачалоПериодаРасчетаДляКадрового,
		|	ДАТАВРЕМЯ(3999, 1, 1) КАК ОкончаниеПериодаРасчетаДляКадрового,
		|	ИсходныеДанные.ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТИсходныеДанныеДляТаблицаПериодов
		|ИЗ
		|	ВТИсходныеДанные КАК ИсходныеДанные";
	
	Запрос.Выполнить();
	
	// Получим кадровые данные
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		"ВТИсходныеДанныеДляТаблицаПериодов", 
		"Сотрудник");
		
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаНачала", "НачалоПериодаРасчетаДляКадрового");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ДатаОкончания", "ОкончаниеПериодаРасчетаДляКадрового");
	
	ПараметрыПостроения = ЗарплатаКадрыПериодическиеРегистры.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	ПараметрыПостроения.ИсключатьНеИспользуемыеПоля = Ложь;
	
	ЗарплатаКадрыПериодическиеРегистры.СоздатьВТИмяРегистраПериоды(
		"КадроваяИсторияСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ОписаниеФильтра,
		ПараметрыПостроения,
		"ВТИнтервалыКадроваяИсторияСотрудников");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Начисления.Сотрудник КАК Сотрудник,
		|	Начисления.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТТаблицаНачислений
		|ИЗ
		|	&ТаблицаНачислений КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(КадроваяИсторияСотрудников.НачалоПериода, ДАТАВРЕМЯ(1,1,1))) КАК НачалоПериода,
		|	Начисления.Сотрудник,
		|	Начисления.ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТПериодыСотрудников
		|ИЗ
		|	ВТТаблицаНачислений КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнтервалыКадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ПО Начисления.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
		|			И Начисления.ДатаНачала >= НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.НачалоПериода, ДЕНЬ)
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.ИдентификаторСтроки,
		|	Начисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПериодыСотрудников.ИдентификаторСтроки,
		|	ВТПериодыСотрудников.Сотрудник,
		|	ВЫБОР
		|		КОГДА КадроваяИсторияСотрудников.КоличествоСтавок ЕСТЬ NULL
		|			ТОГДА 1
		|		КОГДА КадроваяИсторияСотрудников.КоличествоСтавок > 1
		|			ТОГДА 1
		|		ИНАЧЕ КадроваяИсторияСотрудников.КоличествоСтавок
		|	КОНЕЦ КАК КоличествоСтавок
		|ПОМЕСТИТЬ ВТДоляНеполногоРабочегоВремени
		|ИЗ
		|	ВТПериодыСотрудников КАК ВТПериодыСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнтервалыКадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ПО ВТПериодыСотрудников.НачалоПериода = КадроваяИсторияСотрудников.НачалоПериода
		|			И ВТПериодыСотрудников.Сотрудник = КадроваяИсторияСотрудников.Сотрудник";
	
	Запрос.Выполнить();
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТИсходныеДанные");
	УдалитьВТ.Добавить("ВТИсходныеДанныеДляТаблицаПериодов");
	УдалитьВТ.Добавить("ВТТаблицаНачислений");
	УдалитьВТ.Добавить("ВТПериодыСотрудников");
	УдалитьВТ.Добавить("ВТИнтервалыКадроваяИсторияСотрудников");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

Процедура ОбработатьТаблицуКоэффициентовИндексации(ТаблицаКоэффициентыИндексации) Экспорт

	ТаблицаКоэффициентыИндексацииОбработанная = ТаблицаКоэффициентыИндексации.СкопироватьКолонки();
	
	ТекущийСотрудник = "";
	ТекущийПериод = "";
	КоэффициентИндексации = 1;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКоэффициентыИндексации Цикл 
		
		Если ТекущийСотрудник <> СтрокаТаблицы.Сотрудник
			ИЛИ ТекущийПериод <> СтрокаТаблицы.Период Тогда
			
			// Установим новые текущие значения
			ТекущийСотрудник = СтрокаТаблицы.Сотрудник;
			ТекущийПериод = СтрокаТаблицы.Период;
			
			КоэффициентИндексации = СтрокаТаблицы.КоэффициентИндексации;
			
			ОбработаннаяСтрока = ТаблицаКоэффициентыИндексацииОбработанная.Добавить();
			
			ОбработаннаяСтрока.Период                   = СтрокаТаблицы.Период;
			ОбработаннаяСтрока.Сотрудник                = СтрокаТаблицы.Сотрудник;
			ОбработаннаяСтрока.ДатаИндексации			= СтрокаТаблицы.ДатаИндексации;
			ОбработаннаяСтрока.Коэффициент				= СтрокаТаблицы.Коэффициент;
			ОбработаннаяСтрока.КоэффициентИндексации	= КоэффициентИндексации;
			
		Иначе
			
			КоэффициентИндексации = КоэффициентИндексации * СтрокаТаблицы.КоэффициентИндексации;
			
			ОбработаннаяСтрока = ТаблицаКоэффициентыИндексацииОбработанная.Добавить();
			ОбработаннаяСтрока.Период                   = СтрокаТаблицы.Период;
			ОбработаннаяСтрока.Сотрудник                = СтрокаТаблицы.Сотрудник;
			ОбработаннаяСтрока.ДатаИндексации			= СтрокаТаблицы.ДатаИндексации;
			ОбработаннаяСтрока.Коэффициент				= СтрокаТаблицы.Коэффициент;
			ОбработаннаяСтрока.КоэффициентИндексации	= КоэффициентИндексации;

		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаКоэффициентыИндексации = ТаблицаКоэффициентыИндексацииОбработанная.Скопировать();
	
КонецПроцедуры

Функция РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок(Организация, Период) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(Период));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок
	|ИЗ
	|	РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок;

КонецФункции

Функция ВариантУчетаКадровыхПерестановок(Организация, Период) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаСреза", НачалоМесяца(Период));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.ВариантУчетаКадровыхПерестановок
	|ИЗ
	|	РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Перечисления.ВариантыУчетаКадровыхПерестановок.ДолжностьРазрядПодразделение;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ВариантУчетаКадровыхПерестановок;

КонецФункции

Функция КоэффициентИндексацииЗаработка(Фильтр, ДатыНачалаСобытий) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Фильтр", Фильтр);
	Запрос.УстановитьПараметр("ДатыНачалаСобытия", ДатыНачалаСобытий);
	Запрос.УстановитьПараметр("КоэффициентИндексацииСреднегоЗаработка", ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоэффициентИндексацииСреднегоЗаработка"));
	
	Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|   ВсеДатыНачала.Сотрудник,
		|   ВсеДатыНачала.ДатаНачала,
		|   ВсеДатыНачала.ДатаОкончания
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ 
		|	&Фильтр КАК ВсеДатыНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ВсеДатыНачала.Сотрудник,
		|   ВсеДатыНачала.Дата КАК ДатаНачалаСобытия
		|ПОМЕСТИТЬ ВТДатыНачалаСобытияПоДанным
		|ИЗ 
		|	&ДатыНачалаСобытия КАК ВсеДатыНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.Сотрудник,
		// необходим для корректного получения коэффициентов при делении периода
		|	Начисления.ДатаНачала КАК ПериодДействияНачало,
		// коэффициентов индексации будем получать от даты начала события 
		|	ЕСТЬNULL(ДатыНачалаСобытияПоДаннымВТ.ДатаНачалаСобытия, Начисления.ДатаНачала) КАК НачалоПериодаРасчетаСреднего,
		|	Начисления.ДатаОкончания КАК ОкончаниеПериодаРасчетаСреднего,
		|	&КоэффициентИндексацииСреднегоЗаработка КАК Показатель,
		|	ЕСТЬNULL(ДатыНачалаСобытияПоДаннымВТ.ДатаНачалаСобытия, Начисления.ДатаНачала) КАК ДатаНачалаСобытия,
		|	0 КАК ИдентификаторСтроки
		|ИЗ
		|	ВТНачисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыНачалаСобытияПоДанным КАК ДатыНачалаСобытияПоДаннымВТ
		|		ПО (ДатыНачалаСобытияПоДаннымВТ.Сотрудник = Начисления.Сотрудник)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Начисления.Сотрудник";

	УстановитьПривилегированныйРежим(Истина);
	ИсходныеДанные = Запрос.Выполнить().Выгрузить();
	ДанныеИндексации = УчетСреднегоЗаработкаРК.ДанныеИндексации(ИсходныеДанные, Истина);
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ДанныеИндексации;
	
КонецФункции

Функция ДатаИзмененияЕдиныхПравил2024() Экспорт

	Возврат '20240101'

КонецФункции

#КонецОбласти