#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьПрименениеВычетовПоВидамДохода();
	
КонецПроцедуры

Процедура ЗаполнитьПрименениеВычетовПоВидамДохода() Экспорт
	
	НаборЗаписей = РегистрыСведений.ПрименениеВычетовПоВидамДохода.СоздатьНаборЗаписей();

	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20190101', Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20250101', Справочники.ВидыВычетовИПН.Стандартный1МЗП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20250101', Справочники.ВидыВычетовИПН.Стандартный1МЗП, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.Дивиденды, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.Выигрыши, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.Вознаграждения, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.Дивиденды, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.Выигрыши, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.Вознаграждения, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.Дивиденды, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.Выигрыши, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.Вознаграждения, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.ВычетОПВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.ВычетОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.ВычетВОСМС, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.ВычетВОСМС, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20260101', Справочники.ВидыВычетовИПН.ВычетСО, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерЛьготИПН(НаборЗаписей, Период, ВидВычетаИПН, ВидДохода, Используется)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидВычетаИПН = ВидВычетаИПН;
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.Используется = Используется;
	
КонецПроцедуры	

Процедура ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой(Период, ВидВычетаИПН, ВидДохода, Используется) 
	
	НаборЗаписей = РегистрыСведений.ПрименениеВычетовПоВидамДохода.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидВычетаИПН.Установить(ВидВычетаИПН, Истина);
	НаборЗаписей.Отбор.ВидДохода.Установить(ВидДохода, Истина);
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.ВидВычетаИПН = ВидВычетаИПН;
		Движение.ВидДохода = ВидДохода;
		// Ресурсы
		Движение.Используется = Используется;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСведенияОПримененииВычетовПоВидамДоходаСПроверкой20250101() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.ВидыВычетовИПН.Стандартный1МЗП, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20250101', Справочники.ВидыВычетовИПН.Стандартный1МЗП, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	
КонецПроцедуры

Процедура ДобавитьСведенияОПримененииВычетовПоВидамДоходаСПроверкой2026() Экспорт
	
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.Дивиденды, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.Выигрыши, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа, Справочники.ВидыДоходов.Вознаграждения, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.Дивиденды, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.Выигрыши, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа, Справочники.ВидыДоходов.Вознаграждения, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.Дивиденды, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.Выигрыши, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители, Справочники.ВидыДоходов.Вознаграждения, Истина);

	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.ВычетОПВ, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.ВычетОПВ, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.ВычетВОСМС, Справочники.ВидыДоходов.ДоходыОтРаботодателя, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.ВычетВОСМС, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	ДобавитьСведенияОСтавкахНалоговСборовОтчисленийСПроверкой('20260101', Справочники.ВидыВычетовИПН.ВычетСО, Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли