#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		// с 2026 года необходимо заполнять виды доходов для элементов справочника Виды вычетов ИПН
		Если СтрокаНабора.Период >= Дата('20260101') Тогда
			Возврат;	
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20190101') Тогда
			
			ВызватьИсключение НСтр("ru = 'Применение вычетов по разным видам дохода поддерживается с 2019 года'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20250101')
			И СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.Стандартный1МЗП Тогда
			
			ВызватьИсключение НСтр("ru = 'Применение стандартного вычета (14 МРП) по разным видам дохода поддерживается с 2025 года'");	
			
		КонецЕсли;
		
		РеквизитыВычета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаНабора.ВидВычетаИПН, "ПредоставлениеВычета, Предопределенный"); 
		
		МассивВычетовСРазнымиВидамДоходов = Новый Массив;
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.Стандартный1МЗП);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.Стандартный75МЗПИнвалиды);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.Стандартный75МЗПРодители);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.БазовыйНалоговыйВычет);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа);
		МассивВычетовСРазнымиВидамДоходов.Добавить(Справочники.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители);
		
		СтрокаВидыВычетов = "";
		ЭтоПерваяСтрока = Истина;
		
		Для Каждого ВидВычета Из МассивВычетовСРазнымиВидамДоходов Цикл
			
			Если ЭтоПерваяСтрока Тогда
				
				СтрокаВидыВычетов = СтрокаВидыВычетов + ВидВычета;
				ЭтоПерваяСтрока = Ложь;
				
				Продолжить;
				
			КонецЕсли;	
			
			СтрокаВидыВычетов = СтрокаВидыВычетов + ", " + ВидВычета;
			
		КонецЦикла;
		
		
		Если РеквизитыВычета.Предопределенный И МассивВычетовСРазнымиВидамДоходов.Найти(СтрокаНабора.ВидВычетаИПН) = Неопределено Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Применение суммы вычета по разным видам дохода допускается использовать для видов вычета: %1'"), СтрокаВидыВычетов)
			
		КонецЕсли;
		
		Если РеквизитыВычета.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Применение суммы вычета по разным видам дохода не допускается до 1 января 2026 года для вычета с предоставлением ""По исчисленной сумме взносов"": %1'"), СтрокаНабора.ВидВычетаИПН);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
