
&НаКлиенте
// Обрабатывает оповещения, связанные с процессами формы.
// В зависимости от имени события выполняет соответствующие действия
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = ИсходноеСобытие Тогда
		Закрыть();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
// Инициализирует форму при создании на сервере.
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсходноеСобытие = Параметры.ИсходноеСобытие;
	ТекстСообщения = Параметры.ТекстСообщения;
	Если Не ЗначениеЗаполнено(Параметры.ТекстСообщения)  Тогда
		ТекстСообщения = НСтр("ru='Пожалуйста, ожидайте завершения операции.'");	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.ИсходноеСобытие) Тогда	
		ИсходноеСобытие = "ЗавершениеОперацииWSSocket";
	КонецЕсли;
	
	Элементы.ТекстСообщения.Заголовок = ТекстСообщения;
КонецПроцедуры
