
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Отбор.Свойство("Организация") Тогда
		// Открытие из настройки организации как просмотр истории изменений
		ОрганизацияСсылка = ЭтаФорма.Параметры.Отбор.Организация;
		ЭтотОбъект.АвтоЗаголовок = Ложь;
		ЭтотОбъект.Заголовок = ОрганизацияСсылка.Наименование + ": История изменений данных печати";
	Иначе
		// Открытие без отборов для просмотра всех данных регистра
		ЭтотОбъект.АвтоЗаголовок = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Элементы.Список.Обновить();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		ОрганизацияОтбор = Элемент.ТекущиеДанные.Организация;
	Иначе
		ОрганизацияОтбор = ОрганизацияСсылка;
	КонецЕсли;		
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОрганизацияСсылка", ОрганизацияОтбор);
	ПараметрыОткрытия.Вставить("Дата", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Период);
	
	ОткрытьФорму("РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Форма.ФормаРедактированияЗаписейВИстории", ПараметрыОткрытия, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	СтрокиДляУдаления = Элементы.Список.ВыделенныеСтроки;
	СписокПериодовДляУдаления = ПолучитьСписокПередУдалениемНаСервере(СтрокиДляУдаления);
	УдаляемыеПериоды.ЗагрузитьЗначения(СписокПериодовДляУдаления);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПередУдалениемНаСервере(СтрокиДляУдаления)

	УдаляемыеПериоды = Новый Массив();
	
	Для Каждого Строка Из СтрокиДляУдаления Цикл
		Если УдаляемыеПериоды.Найти(Строка.Период) = Неопределено Тогда
			УдаляемыеПериоды.Добавить(Строка.Период);
		КонецЕсли;
	КонецЦикла;
	
	Возврат УдаляемыеПериоды;
	
КонецФункции

&НаСервере
Процедура СписокПослеУдаленияНаСервере()

	Отбор = Новый Структура();
	Отбор.Вставить("Организация", ОрганизацияСсылка);
	
	Выборка = РегистрыСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Выбрать(,, Отбор);
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = Выборка.ПолучитьМенеджерЗаписи();
		МенеджерЗаписи.Прочитать();
		
		Если УдаляемыеПериоды.НайтиПоЗначению(МенеджерЗаписи.Период) <> Неопределено Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	СписокПослеУдаленияНаСервере();
КонецПроцедуры

#КонецОбласти





