#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о минимальном размере оплаты труда в РФ.
// Данные включают в себя сам размер и дату, с которой он действует.
//
// Параметры:
//  ДатаАктуальности - Дата - дата, на которую нужно получить размер МРОТ.
//                            Если параметр не указан, возвращается последнее действующее значение.
// Возвращаемое значение:
//  Структура  - содержит:
//     * Размер - Число
//     * Период - Дата
//
Функция ДанныеМинимальногоРазмераОплатыТрудаРФ(ДатаАктуальности = Неопределено) Экспорт
	
	ДанныеМРОТ = Новый Структура("Размер, Период");
	
	СрезПоследних = РегистрыСведений.МинимальнаяОплатаТрудаРФ.СрезПоследних(ДатаАктуальности);
	Если СрезПоследних.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Сведения о минимальном размере оплаты труда РФ не заполнены'");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеМРОТ, СрезПоследних[0]);
	
	Возврат ДанныеМРОТ;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение и обновление информационной базы.
Процедура НачальноеЗаполнение() Экспорт
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст(), Ложь);
КонецПроцедуры

// Обновляет данные регистра.
Процедура Обновить(ТекстXML, ПолучатьДанныеИзСервиса = Истина) Экспорт
	ЗарплатаКадры.ОбновитьЗначенияМинимальнойОплатыТрудаРФ(ТекстXML, ПолучатьДанныеИзСервиса);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СервисКлассификаторов

Процедура ОбновитьИзСервиса(Идентификатор, ДанныеКлассификатора) Экспорт
	
	Если Идентификатор <> ИдентификаторКлассификатора() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();

	Попытка
        
        ОбработанныеДанные = ОбработанныеДанные(ДанныеКлассификатора); 	
		РанняяДатаВКлассификаторе = РанняяДатаВКлассификаторе(ОбработанныеДанные); 
		СохраняемыйНабор = СохраняемыйНабор(РанняяДатаВКлассификаторе);
		
		НаборЗаписей = РегистрыСведений.МинимальнаяОплатаТрудаРФ.СоздатьНаборЗаписей(); 	
		
		Для Каждого Элемент Из СохраняемыйНабор Цикл 
							
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Элемент);
								
		КонецЦикла;
		
		Для Каждого Элемент Из ОбработанныеДанные Цикл 
							
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Элемент);
								
		КонецЦикла;

        ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
								
		Обработан = Истина;  
						
		ЗафиксироватьТранзакцию();
	Исключение	
		ОтменитьТранзакцию();
		
		Обработан = Ложь;
		
		ЗаписьЖурналаРегистрации("ЗагрузкаКлассификатора",
			УровеньЖурналаРегистрации.Ошибка, РегистрыСведений.МинимальнаяОплатаТрудаРФ,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ИдентификаторКлассификатора() Экспорт
	
	Возврат "ReglIndicatorsKz";
	
КонецФункции 

Функция ОбработанныеДанные(ДанныеИзСервиса)
	
	Данные = Новый Массив; 
	
	Для Каждого Элемент Из ДанныеИзСервиса Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Период", ПрочитатьДатуJSON(Элемент.period, ФорматДатыJSON.ISO));
		СтруктураДанных.Вставить("Размер", Элемент.mzp);
        
		Данные.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция РанняяДатаВКлассификаторе(Данные)
	
	МинимальнаяДата = Неопределено;
	Для Каждого Элемент Из Данные Цикл
		Если МинимальнаяДата = Неопределено Тогда
			МинимальнаяДата = Элемент.Период;
		КонецЕсли;
		Если Элемент.Период < МинимальнаяДата Тогда
			МинимальнаяДата = Элемент.Период;
		КонецЕсли;
	КонецЦикла;

	Возврат МинимальнаяДата;
	
КонецФункции  

Функция СохраняемыйНабор(Дата) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МинимальнаяОплатаТрудаРФ.Период КАК Период,
		|	МинимальнаяОплатаТрудаРФ.Размер КАК Размер
		|ИЗ
		|	РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ
		|ГДЕ
		|	МинимальнаяОплатаТрудаРФ.Период < &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();		
	УстановитьПривилегированныйРежим(Ложь); 
	
	СохраняемыйНабор = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДанныеНабора = Новый Структура; 
		ДанныеНабора.Вставить("Период", Выборка.Период);
		ДанныеНабора.Вставить("Размер", Выборка.Размер);
		
		СохраняемыйНабор.Добавить(ДанныеНабора);
	КонецЦикла;

	Возврат СохраняемыйНабор; 
	
КонецФункции

#КонецОбласти

// Проверяет заполненность данных о минимальном размере оплаты труда в РФ.
//
// Возвращаемое значение - булево, Истина - если есть хотя бы одно значение.
//
Функция МинимальныйРазмерОплатыТрудаРФЗаполнен() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.МинимальнаяОплатаТрудаРФ КАК МинимальнаяОплатаТрудаРФ");
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли