#Область СлужебныеПроцедурыИФункции

Функция ТокенДоступа(ДанныеСертификата, Пароль, АдресСервиса, МоментВыпуска, ИдентификаторИнформационнойСистемы) Экспорт
	
	МоментОкончания = МоментВыпуска + 300;
	
	ПроверочноеВремя = МестноеВремя('19700101' + МоментВыпуска);
	
	JsonHeader = "{""x5c"": [""" + ДвоичныеДанныеВСтрокуBase64(ДанныеСертификата.Данные) + """], ""alg"": ""ECGOST3410-2012""}";
	JsonHeaderBinary = ПолучитьДвоичныеДанныеИзСтроки(JsonHeader, КодировкаТекста.UTF8, Ложь);
	JsonPayload = "{""sub"": """ + ИдентификаторИнформационнойСистемы 
			+ """, ""aud"": """ + АдресСервиса 
			+ """, ""exp"": " + Формат(МоментОкончания, "ЧГ=0")
			+ ", ""iat"": " + Формат(МоментВыпуска, "ЧГ=0") + "}";
	JsonPayloadBinary = ПолучитьДвоичныеДанныеИзСтроки(JsonPayload, КодировкаТекста.UTF8, Ложь); 
	
	JsonHeaderAndPayload = ДвоичныеДанныеВСтрокуBase64Url(JsonHeaderBinary) + "." + ДвоичныеДанныеВСтрокуBase64Url(JsonPayloadBinary);
	ДанныеНаПодпись = ПолучитьДвоичныеДанныеИзСтроки(JsonHeaderAndPayload, КодировкаТекста.UTF8, Ложь);

	ДанныеПодписи = Новый ПотокВПамяти();
	СертификатКриптографии = Новый СертификатКриптографии(ДанныеСертификата.Данные);
    МенеджерКриптографии = Новый МенеджерКриптографии("", "", 80);
    МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = Пароль;
	МенеджерКриптографии.ВключениеСертификатовВПодпись = РежимВключенияСертификатовКриптографии.НеВключать;
    ДвоичныеДанныеПодписи = МенеджерКриптографии.Подписать(ДанныеНаПодпись, СертификатКриптографии);
	
	JsonSignature = ДвоичныеДанныеВСтрокуBase64Url(ДвоичныеДанныеПодписи);
	
	Возврат JsonHeaderAndPayload + "." + JsonSignature;

КонецФункции

Функция ДвоичныеДанныеВСтрокуBase64(Знач ДвоичныеДанные)
	
	СтрокаBase64 = Base64Строка(ДвоичныеДанные);
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	Возврат СтрокаBase64;
	
КонецФункции

Функция ДвоичныеДанныеВСтрокуBase64Url(Знач ДвоичныеДанные)
	
	СтрокаBase64 = Base64Строка(ДвоичныеДанные);
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");  
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, "=", "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, "+", "-");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, "/", "_");
	Возврат СтрокаBase64;
	
КонецФункции

Функция ТолькоЦифры(ИсходнаяСтрока) Экспорт
	
	Результат = "";
	Цифры = "0123456789";
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(ИсходнаяСтрока, ИндексСимвола, 1);
		Если СтрНайти(Цифры, Символ)>0 Тогда 
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаИзUTC(ДатаВремяUTC) Экспорт
	
	Если ДатаВремяUTC=Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастиДатаВремя = СтрРазделить(ДатаВремяUTC, "T", Ложь);
	ЧастиДата = СтрРазделить(ЧастиДатаВремя[0], "-", Ложь);
	
	Возврат Дата(ЧастиДата[0] + ЧастиДата[1] + ЧастиДата[2]);
	
КонецФункции

#КонецОбласти