#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

#Область ОбъявлениеБиблиотеки

// Заполняет стандартные свойства библиотеки или конфигурации, требуемые для ее использования.
// Поставляемая конфигурация должна рассматриваться как потенциальная библиотека, поэтому
// ее свойства описываются не только в метаданных, но и в коде, как и для любой библиотеки.
//
// Под библиотекой понимается одна или несколько подсистем, а под конфигурацией все, что
// не принадлежит ни одной библиотеке. Библиотека у которой имя совпадает с именем
// конфигурации в метаданных, считается конечной конфигурацией.
// БСП - всегда первая, конечная конфигурация всегда последняя (например, для порядка обновления ИБ).
// 
// Параметры:
//  Описание - Структура со свойствами:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив значений типа Строка, содержащий имена других библиотек.
//                         После получения описаний всех библиотек будет проверено, что
//                         все библиотеки требуемые другими библиотеками зарегистрированы и
//                         будет построена линейная последовательность библиотек по мере
//                         их требуемости. При наличии взаимозависимости или их отсутствии
//                         порядок определяется порядком добавления основных модулей библиотек
//                         в процедуре ПриДобавленииПодсистемы общего модуля
//                         ПодсистемыКонфигурацииПереопределяемый.
//                         Порядок используется при выполнении обработчиков обновления
//                         информационной базы.
//
// Для стандартных процедур в основных модулях библиотек рекомендуется использовать
// не копию комментария, а ссылку на комментарий в модуле этом модуле.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "ЗарплатаКадрыДляКазахстанаБазовая";
	Описание.Версия = "3.1.2.21";
	Описание.ИдентификаторИнтернетПоддержки = МодификацияКонфигурацииЗУПК.ИдентификаторИнтернетПоддержки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОбновленияИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//
// Параметры:
//  Обработчики - это таблица значений, возвращаемая функцией
//                НоваяТаблицаОбработчиковОбновления модуля ОбновлениеИнформационнойБазы.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия    = "1.0.0.0";
//  Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
// 
//  Все свойства обработчика см. в комментарии к функции
//  НоваяТаблицаОбработчиковОбновления в модуле ОбновлениеИнформационнойБазы.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
    // ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХОЗУПК
    Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХО") Тогда
        МодульВзаиморасчетыССотрудникамиВХОЗУПК = ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыССотрудникамиВХОЗУПК");
        МодульВзаиморасчетыССотрудникамиВХОЗУПК.ЗарегистрироватьОбработчикиОбновления(Обработчики);
    КонецЕсли;
    // Конец ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХОЗУПК

    Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.0.0.0";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
		Обработчик.НачальноеЗаполнение = Истина;
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.ВидыДоходов.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.КатегорииЛицПолучателейЛьготИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.РазмерыЛьготИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.РазмерыВычетовИПН.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.ПрименениеВычетовПоВидамДохода.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.СведенияОДоляхЕП.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.СоздатьВалютуУчетаЗаработнойПлаты";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеПоказателейОтОбратного";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахОСМС.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.0";
	Обработчик.Процедура = "Справочники.СтраныМира.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеПереходаНаСборку3126";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьГруппуИнвалидности";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "ЗарплатаКадрыОтчеты.ОчиститьМакетыКомпоновкиДанных";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "РегистрыСведений.НастройкиПечатныхФормБЗК.ЗаполнитьНастройки";
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ОснованияУвольнения) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.1";
		Обработчик.Процедура = "Справочники.ОснованияУвольнения.ЗагрузитьКлассификатор";
		Обработчик.ОбщиеДанные = Истина;
        
        Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.1";
		Обработчик.Процедура = "Справочники.ОснованияУвольнения.ОбновитьОснованияУвольненийСтатьи55п2";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;
        
   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УдалитьПустыеПоказателиУдержанияЕП";
	Обработчик.Комментарий = НСтр("ru = 'Уточнение показателей плана видов расчета «Удержания».'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьОчередностьРасчетаУдержаний";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.НачальноеЗаполнение";
 	Обработчик.НачальноеЗаполнение = Истина;

	// 2024
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "Справочники.ВидыДоходов.ЗаполнитьПризнакиВидовДоходов2024";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахОПВР2024";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийПоКатегориям20240101";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.ОбновитьСведенияКоэффициентыСтавкиРефинансированияНБ2024";

	// 2024
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.2";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.2";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.2";
    Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.ОбновитьПрожиточныеМинимумы";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрРасчетСреднегоЗаработкаОрганизаций2023";

	Если НЕ ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.2";
		Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахЕдиногоПлатежа2024";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.2";
		Обработчик.Процедура = "РегистрыСведений.СведенияОДоляхЕП.ДобавитьСведенияОДоляхЕдиногоПлатежа2024";
		
	КонецЕсли;

   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.3";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;

	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.3";
		Обработчик.Процедура = "УчетХозрасчетныхОрганизаций.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыВБанк";
		Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("76bdfb82-a348-4e0f-a993-8a1f4cf55610");
		Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости в банк.""'");
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.3";
		Обработчик.Процедура = "УчетХозрасчетныхОрганизаций.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыВКассу";
		Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("1ee51407-1623-4035-86ca-a3809988c794");
		Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости в кассу.""'");
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.3";
		Обработчик.Процедура = "УчетХозрасчетныхОрганизаций.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыПеречислением";
		Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("17df28fc-891d-4ce9-a87a-e22b6183c177");
		Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости на счета.""'");
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.3";
		Обработчик.Процедура = "УчетХозрасчетныхОрганизаций.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыРаздатчиком";
		Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
		Обработчик.Идентификатор = Новый УникальныйИдентификатор("1ad23a59-6018-4538-a2ad-0c7985ed9452");
		Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости через раздатчика.""'");

	КонецЕсли;	
		
   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОчиститьМакетыКомпоновкиДанных";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.2.4";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьДанныеИсполнительныхЛистовПрожиточныеМинимумы";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("79c6c26f-210d-4d20-9d5c-606773618869");
	Обработчик.Комментарий     = НСтр("ru = 'Заполняет новые данные исполнительных листов по удержаниям с учетом прожиточных минимумов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.4";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыВБанк";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("dbf915f4-6116-43d2-a038-ab8ea7e2cc80");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости в банк.""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыВКассу";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("663103e9-c017-490d-b4fe-5ae8e82896a9");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости в кассу.""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыПеречислением";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("30b6b7e7-7c92-422d-a191-02b00ef2ed33");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости на счета.""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыРаздатчиком";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();   
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a0ccd527-3e10-48a4-8a62-983a2b580812");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение статьи расходов в документах ""Ведомости через раздатчика.""'");
	
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.5";
		Обработчик.Процедура = "РегистрыСведений.СведенияОДоляхЕП.ДобавитьСведенияОДоляхЕдиногоПлатежа2024ВКонфигурацииЗарплатногоУчета";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.5";
		Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахЕдиногоПлатежа2024ВКонфигурацииЗарплатногоУчета";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.5";
		Обработчик.Процедура = "Справочники.ПоказателиРасчетаЗарплаты.СоздатьПоказателиПоНастройкам";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.5";
		Обработчик.Процедура = "Справочники.ВидыДоходов.ЗаполнитьПризнакиВидовДоходов2024УчитыватьЕдиныйПлатеж";
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.5";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьПоказателиУдержанийДляЕдиногоПлатежа";
		
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.5";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ОбновитьСтавкуОПВРЗаИП2024";

   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрыРасчетаСреднегоЗаработка2024";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.5";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьСтратегиюБухучетаСдельногоЗаработка";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.5";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
 	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.5";
	Обработчик.Процедура = "Справочники.КлассификаторБанков.ОбновлениеКлассификатора_ОбработатьДанные";
 	Обработчик.ОбщиеДанные = Истина;

	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда

		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.7";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновлениеВидОперацииПлатежныхПоручений";
		Обработчик.Идентификатор   = Новый УникальныйИдентификатор("831ed7fe-e65a-4261-b896-3930df6ac396");
	 	Обработчик.РежимВыполнения = "Отложенно";
		Обработчик.Комментарий = НСтр("ru = 'Заполнение вида операции в документе ""Платежное поручение""'");
		
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.7";
	Обработчик.Процедура = "РегистрыСведений.СведенияОДоляхЕП.ДобавитьСведенияОДоляхЕдиногоПлатежа2024Корректировка";
    
   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.7";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьРегистрРасчетСреднегоЗаработкаОрганизацийДляФилиалов2024";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.8";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.9";
	Обработчик.Процедура = "Справочники.КлассификаторБанков.ОбновлениеКлассификатора_ОбработатьДанные";
 	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.11";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьДокументыУдержаниеНалоговВзносовПоНУ";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("97cf0f64-8e1a-498b-97de-7f39893a1516");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение краткого состава документа ""Удержание налогов и взносов по налоговому учету""'");

   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.11";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;

    Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
        
        Обработчик = Обработчики.Добавить();
        Обработчик.Версия = "3.1.2.11";
        Обработчик.Процедура = "ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ЗаполнитьЗначениеНастройкиВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы";
        
    КонецЕсли;

 	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.2.12";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнениеРегистраНалогиВзносыОтчисленияПоСотрудникамВидДохода";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("9ee439cf-6bad-41e0-a2af-746d711645a5");
	Обработчик.Комментарий     = НСтр("ru = 'Заполняет новое измерение ""Вид дохода"" в регистре ""Налоги, взносы и отчисления по сотрудникам""'");

    Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда

		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.12";
		Обработчик.Процедура = "МедицинскиеРегистры.ОчиститьРегистрыИдентификации";
		
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ДополнитьВидыВремениПремий";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("d1751efa-1ba8-4e80-bdcd-c584326a6c64");
	Обработчик.Комментарий     = НСтр("ru = 'Добавление вида времени ""Командировка"" в учет времени начислений категории ""Премия""'");

	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета()
		И НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.13";
		Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УстановитьИспользованиеПрочихВзаиморасчетов";
		Обработчик.НачальноеЗаполнение = Истина;
		
	КонецЕсли;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОбновитьМакетОтчетаТ8Т8а";
	
	// 2025
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.13";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.13";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.ОбновитьПрожиточныеМинимумы";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахЕдиногоПлатежа2025";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "РегистрыСведений.СведенияОДоляхЕП.ДобавитьСведенияОДоляхЕдиногоПлатежа2025";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавках2025";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "Справочники.ВидыДоходов.ЗаполнитьПризнакиВидовДоходов2025";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.13";
	Обработчик.Процедура = "РегистрыСведений.НалогообложениеНачислений.ЗаполнитьНалогообложениеНачисленийПоКатегориям20250101";

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ОснованияУвольнения) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.14";
		Обработчик.Процедура = "Справочники.ОснованияУвольнения.ОбновитьОснованияУвольненийСтатьи57п1пп1";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.14";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.ОбновитьПриоритетыВычетовИПН2025";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.14";
	Обработчик.Процедура = "РегистрыСведений.РазмерыВычетовИПН.ОбновитьРазмерыВычетовИПН2025";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.15";
	Обработчик.Процедура = "РегистрыСведений.ПрименениеВычетовПоВидамДохода.ДобавитьСведенияОПримененииВычетовПоВидамДоходаСПроверкой20250101";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ДобавитьБольничныйЗаСчетРаботодателяСОкруглением";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("e91b22c8-120c-4694-806a-bfc503762589");
	Обработчик.Комментарий     = НСтр("ru = 'Добавление начисления ""Больничный за счет работодателя (с округлением)""'");
    
   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.15";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ОчиститьМакетыКомпоновкиДанных";
    
    Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.17";
	Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.ЗаполнитьЗначенияСтавкиРефинансированияЦБ";
	Обработчик.ОбщиеДанные = Истина;
	
	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ОснованияУвольнения) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.17";
		Обработчик.Процедура = "Справочники.ОснованияУвольнения.ОбновитьОснованияУвольненийСтатьи52п1пп24";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.18";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьДатуКорректировкиВеденияУчетаПоДаннымНВО";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.2.18";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнениеРегистраНалогиВзносыОтчисленияПоСотрудникамДанныеМежрасчетногоПериода";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("e33aafb5-d604-45f2-ab76-0b40f42a70c4");
	Обработчик.Комментарий     = НСтр("ru = 'Заполняет новое измерение ""Данные межрасчетного периода"" в регистре ""Налоги, взносы и отчисления по сотрудникам""'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.18";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ПеренестиПризнакВестиУчетРабочегоВремениПоУсловиямТруда";

   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.18";
	Обработчик.Процедура = "Справочники.КлассификаторБанков.ОбновлениеКлассификатора_ОбработатьДанные";
 	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.19";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УдалитьВидыВремениПремийИНадбавкиЗаВредность";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("c2c0e7e8-7b6f-46bb-b1da-fb9c875a9518");
	Обработчик.Комментарий     = НСтр("ru = 'Корректировка видов времени для начислений категории ""Премия"" и ""Надбавка за вредность""'");

 	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.2.19";
	Обработчик.Процедура       = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнениеРегистраНалогиВзносыОтчисленияПоСотрудникамВидДоходаСДаннымиМежрасчета";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("9714480b-632c-462c-8c0c-9b32bfee76d4");
	Обработчик.Комментарий     = НСтр("ru = 'Заполняет новое измерение ""Вид дохода"" в регистре ""Налоги, взносы и отчисления по сотрудникам""'");

    Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.Справочники.ОснованияУвольнения) Тогда
        Обработчик = Обработчики.Добавить();
        Обработчик.Версия = "3.1.2.19";
        Обработчик.Процедура = "Справочники.ОснованияУвольнения.ОбновитьОснованияУвольненийСтатьи52п1";
        Обработчик.ОбщиеДанные = Истина;
    КонецЕсли;
    
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.19";
    Обработчик.Процедура = "РегистрыСведений.РазмерыВычетовИПН.ОбновитьРазмерыВычетовИПНВычетыДляМногодетнойСемьи2025";
    
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.19";
    Обработчик.Процедура = "Справочники.ПоказателиРасчетаЗарплаты.СоздатьПоказателиПоНастройкам";
    
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.19";
    Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьПоказателиУдержанийДляСО";

    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.19";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.ОбновитьПриоритетыВычетовИПН2025";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.19";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.ОбновитьДанныеВычетовНК2025";

   	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.19";
	Обработчик.Процедура = "Справочники.КлассификаторБанков.ОбновлениеКлассификатора_ОбработатьДанные";
 	Обработчик.ОбщиеДанные = Истина;

    Обработчик = Обработчики.Добавить();
    Обработчик.Версия          = "3.1.2.20";
    Обработчик.Процедура       = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнениеРегистраВзаиморасчетыСКонтрагентамиАкционерами";
    Обработчик.РежимВыполнения = "Отложенно";
    Обработчик.Идентификатор   = Новый УникальныйИдентификатор("5659ed18-4852-411d-b7d1-32527b2400a3");
    Обработчик.Комментарий     = НСтр("ru = 'Заполняет новое измерение ""Период взаиморасчетов"" в регистре ""Взаиморасчеты с контрагентами и акционерами""'");
    
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.20";
    Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьПериодВзаиморасчетовВВедомостьПрочихДоходовВБанк";
    Обработчик.РежимВыполнения = "Отложенно";
    Обработчик.Идентификатор = Новый УникальныйИдентификатор("394ecc37-88e7-48a8-aa4e-4f977844c911");
    Обработчик.Комментарий = НСтр("ru = 'Заполнение периода взаиморасчетов в документах ""Ведомости прочих доходов в банк.""'");
    
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.20";
    Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьПериодВзаиморасчетовВВедомостьПрочихДоходовВКассу";
    Обработчик.РежимВыполнения = "Отложенно";
    Обработчик.Идентификатор = Новый УникальныйИдентификатор("015f57f8-51ea-460a-9252-54b01e64d0fc");
    Обработчик.Комментарий = НСтр("ru = 'Заполнение периода взаиморасчетов в документах ""Ведомости прочих доходов в кассу.""'");
    
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.20";
    Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.ЗаполнитьПериодВзаиморасчетовВВедомостьПрочихДоходовПеречислением";
    Обработчик.РежимВыполнения = "Отложенно";
    Обработчик.Идентификатор = Новый УникальныйИдентификатор("29b2ec1a-ac7e-4725-8e02-e81e4276b04c");
    Обработчик.Комментарий = НСтр("ru = 'Заполнение периода взаиморасчетов в документах ""Ведомости прочих доходов на счета.""'");

	Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.20";
    Обработчик.Процедура = "ОбновлениеИнформационнойБазыЗарплатаКадрыДляКазахстанаБазовый.УдалитьЗаписиНеиспользуемыхКлассификаторов";
	Обработчик.ОбщиеДанные = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавкахЕдиногоПлатежа2026";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "РегистрыСведений.СведенияОДоляхЕП.ДобавитьСведенияОДоляхЕдиногоПлатежа2026";

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.21";
		Обработчик.Процедура = "РегистрыСведений.МинимальнаяОплатаТрудаРФ.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Если ЗарплатаКадры.АвтономнаяРаботаРазрешеноИзменениеДанных(Метаданные.РегистрыСведений.МесячныйРасчетныйПоказатель) Тогда
		Обработчик = Обработчики.Добавить();
		Обработчик.Версия = "3.1.2.21";
		Обработчик.Процедура = "РегистрыСведений.МесячныйРасчетныйПоказатель.НачальноеЗаполнение";
		Обработчик.ОбщиеДанные = Истина;
	КонецЕсли;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "Справочники.ПрожиточныеМинимумы.ОбновитьПрожиточныеМинимумы";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений.ДобавитьСведенияОСтавках2026";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "Справочники.ВидыВычетовИПН.ОбновитьПриоритетыВычетовИПН2026";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "РегистрыСведений.РазмерыВычетовИПН.ОбновитьРазмерыВычетовИПН2026";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "РегистрыСведений.ПрименениеВычетовПоВидамДохода.ДобавитьСведенияОПримененииВычетовПоВидамДоходаСПроверкой2026";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "РегистрыСведений.СведенияОСтавкахИПН.ОбновитьСведенияОСтавкахИПН2026";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.21";
	Обработчик.Процедура = "Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ОбновитьСправочникДоходыНеПодлежащиеНалогообложениюЧастично2026";

    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.21";
    Обработчик.Процедура = "РегистрыСведений.СтавкаРефинансированияЦБ.НачальноеЗаполнение";
	Обработчик.ОбщиеДанные = Истина;

КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения монопольного обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия подсистемы до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия подсистемы после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления
//                                             подсистемы, сгруппированных по номеру версии.
//                            Процедура обхода выполненных обработчиков:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
//   ВыводитьОписаниеОбновлений - Булево (возвращаемое значение)- если установить Истина,
//                                тогда выводить форму с описанием обновлений.
//   МонопольныйРежим           - Булево - признак выполнения обновления в монопольном режиме.
//                                Истина - обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	// Не используется в БСП.
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиОбновленияИнформационнойБазы

Процедура ЗаменитьСсылкиВРегистре(МетаданныеРегистра, Поля, СоответствиеСсылок) Экспорт
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗаменитьСсылкиВРегистре(МетаданныеРегистра, Поля, СоответствиеСсылок);
КонецПроцедуры

Процедура УдалитьРеглОтчетыРФ() Экспорт
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РегламентированныеОтчеты.Ссылка КАК Ссылка,
	|	РегламентированныеОтчеты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
	|ГДЕ
	|	РегламентированныеОтчеты.ПометкаУдаления
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УдаляемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если НЕ УдаляемыйОбъект = Неопределено Тогда
			УдаляемыйОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура СоздатьВалютуУчетаЗаработнойПлаты() Экспорт
	
	// Создаем "Тенге".
	
	Коды = Новый Массив;
	Коды.Добавить("398");
	
	РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(Коды);
	
КонецПроцедуры

Процедура ОчиститьМакетыКомпоновкиДанных() Экспорт

	ЗарплатаКадрыОтчеты.ОчиститьМакетыКомпоновкиДанных();

КонецПроцедуры

Процедура ЗаполнитьСтатьюРасходовВедомостейНаВыплатуЗарплаты(МетаданныеВедомости, ПараметрыОбновления) 
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВедомостьЗарплата.Ссылка, Ведомость.Ссылка) КАК Ссылка
	|ИЗ
	|	#Ведомость КАК Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ВедомостьЗарплата КАК ВедомостьЗарплата
    |		ПО ВедомостьЗарплата.Ссылка = Ведомость.Ссылка
	|
	|ГДЕ
	|	Ведомость.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)
	|			ИЛИ ВедомостьЗарплата.СтатьяРасходов = ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВедомостьЗарплата",	МетаданныеВедомости.ПолноеИмя() + ".Зарплата"); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#Ведомость",	МетаданныеВедомости.ПолноеИмя()); 
	
	ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(МетаданныеВедомости);
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	Иначе
		ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	КонецЕсли;	

	СтатьиРасходовПоСпособамРасчетов = ЗарплатаКадры.СтатьиРасходовПоСпособамРасчетовСФизическимиЛицами();
	СтатьяРасчетыПоОплатеТруда       = СтатьиРасходовПоСпособамРасчетов[Перечисления.СпособыРасчетовСФизическимиЛицами.ОплатаТруда];
	
	ВыборкаОбновляемыхДанных = ОбновляемыеДанные.Выбрать();
	Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
		
		ОписаниеБлокировки.ПоляБлокировки.Ссылка = ВыборкаОбновляемыхДанных.Ссылка;
		Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Продолжить	
		КонецЕсли;
		
		Ведомость = ВыборкаОбновляемыхДанных.Ссылка.ПолучитьОбъект();
        // ЗУПК
		Ведомость.СтатьяРасходов = СтатьяРасчетыПоОплатеТруда;
        // ЗУПК
		Для Каждого СтрокаТЧ Из Ведомость.Зарплата Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ.СтатьяРасходов) Тогда
				СтрокаТЧ.СтатьяРасходов = СтатьяРасчетыПоОплатеТруда;
			КонецЕсли;	
		КонецЦикла;	
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Ведомость,,, РежимЗаписиДокумента.Запись);
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);			
		
	КонецЦикла;

КонецПроцедуры	

#КонецОбласти

#Область Обновление_3_1_0

Процедура ОбновлениеПоказателейОтОбратного() Экспорт
	
	ОтОбратногоСуммаНаРуки = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ОтОбратногоСуммаНаРуки");
	
	Если ОтОбратногоСуммаНаРуки = Неопределено Тогда
		Справочники.ПоказателиРасчетаЗарплаты.СоздатьПредопределенныеПоказателиОтОбратного();
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьПредопределенныеПоказателиОтОбратного();
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Обновление_3_1_2

Процедура ОбновлениеПереходаНаСборку3126() Экспорт

	
КонецПроцедуры

Процедура ЗаполнитьГруппуИнвалидности() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОбИнвалидностиФизическихЛиц.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбИнвалидностиФизическихЛиц.Период КАК Период,
		|	СведенияОбИнвалидностиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА СведенияОбИнвалидностиФизическихЛиц.УдалитьГруппаИнвалидности = ЗНАЧЕНИЕ(Перечисление.УдалитьГруппыИнвалидностиФизическихЛиц.I)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ГруппыИнвалидности.Первая)
		|		КОГДА СведенияОбИнвалидностиФизическихЛиц.УдалитьГруппаИнвалидности = ЗНАЧЕНИЕ(Перечисление.УдалитьГруппыИнвалидностиФизическихЛиц.II)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ГруппыИнвалидности.Вторая)
		|		КОГДА СведенияОбИнвалидностиФизическихЛиц.УдалитьГруппаИнвалидности = ЗНАЧЕНИЕ(Перечисление.УдалитьГруппыИнвалидностиФизическихЛиц.III)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ГруппыИнвалидности.Третья)
		|	КОНЕЦ КАК ГруппаИнвалидности
		|ИЗ
		|	РегистрСведений.СведенияОбИнвалидностиФизическихЛиц КАК СведенияОбИнвалидностиФизическихЛиц
		|ГДЕ
		|	НЕ СведенияОбИнвалидностиФизическихЛиц.УдалитьГруппаИнвалидности = ЗНАЧЕНИЕ(Перечисление.УдалитьГруппыИнвалидностиФизическихЛиц.ПустаяСсылка)
		|	И СведенияОбИнвалидностиФизическихЛиц.ГруппаИнвалидности = ЗНАЧЕНИЕ(Перечисление.ГруппыИнвалидности.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ВыборкаДетальныеЗаписи.ФизическоеЛицо);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей[0].ГруппаИнвалидности = ВыборкаДетальныеЗаписи.ГруппаИнвалидности;
		КонецЕсли;
		
		Попытка
			
			НаборЗаписей.Записать();

		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи набора данных ""Сведения об инвалидности физических лиц"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Сведения об инвалидности физических лиц"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПустыеПоказателиУдержанияЕП(ПараметрыОбновления = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УдержанияПоказатели.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовРасчета.Удержания КАК Удержания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания.Показатели КАК УдержанияПоказатели
	               |		ПО (УдержанияПоказатели.Ссылка = Удержания.Ссылка
	               |			И УдержанияПоказатели.Показатель = ЗНАЧЕНИЕ(Справочник.ПоказателиРасчетаЗарплаты.ПустаяСсылка))
	               |ГДЕ
	               |	Удержания.ВычитатьИзРасчетнойБазыНалогиВзносы
	               |	И НЕ УдержанияПоказатели.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();			   
				   
	Если РезультатЗапроса.Пустой() Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Удержания", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Удержание = Выборка.Ссылка.ПолучитьОбъект();
		ЗарплатаКадрыРасширенный.ОбновитьПоказателиФормулыРасчета(Удержание, Ложь, Справочники.ПоказателиРасчетаЗарплаты.ПоказателиНедоступныеДляУдержаний());
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОПоказателяхВидаРасчета(Удержание);
		
		// ОбменДанными не взводим
		Удержание.Записать();
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьОчередностьРасчетаУдержаний(ПараметрыОбновления = Неопределено) Экспорт
    
    Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Удержания.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовРасчета.Удержания КАК Удержания
	               |ГДЕ
	               |	Удержания.ВычитатьИзРасчетнойБазыНалогиВзносы";
	
	РезультатЗапроса = Запрос.Выполнить();			   
				   
	Если РезультатЗапроса.Пустой() Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Удержания", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Удержание = Выборка.Ссылка.ПолучитьОбъект();
		Удержание.ОчередностьРасчета = 3;
		Удержание.Записать();
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРегистрРасчетСреднегоЗаработкаОрганизаций2023() Экспорт
	
	НаборЗаписей = РегистрыСведений.РасчетСреднегоЗаработкаОрганизаций.СоздатьНаборЗаписей();
	
	ДатаИзмененияЕдиныхПравил = НачалоМесяца(УчетСреднегоЗаработкаРК.ДатаИзмененияЕдиныхПравил2024());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаИзмененияЕдиныхПравил", ДатаИзмененияЕдиныхПравил);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&ДатаИзмененияЕдиныхПравил КАК Период,
		|	РасчетСреднегоЗаработкаОрганизаций.Организация КАК Организация,
		|	РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремени КАК УчетРабочегоВремени,
		|	РасчетСреднегоЗаработкаОрганизаций.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок КАК РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок,
		|	РасчетСреднегоЗаработкаОрганизаций.ВариантУчетаКадровыхПерестановок КАК ВариантУчетаКадровыхПерестановок,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ГрафикиРаботыСотрудников.РабочихДнейВНеделе, 6) = 5
		|			ТОГДА ВЫБОР
		|					КОГДА ЕСТЬNULL(ГрафикиРаботыСотрудников.ДлительностьРабочейНедели, 40) = 36
		|						ТОГДА ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоПятидневнойНеделе36)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоПятидневнойНеделе)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(ГрафикиРаботыСотрудников.ДлительностьРабочейНедели, 40) = 36
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоШестидневнойНеделе36)
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПоШестидневнойНеделе)
		|			КОНЕЦ
		|	КОНЕЦ КАК УчетРабочегоВремениДляСуммированногоУчета
		|ИЗ
		|	РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ДатаИзмененияЕдиныхПравил, ) КАК РасчетСреднегоЗаработкаОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников
		|			ПО Организации.ГрафикРаботыСотрудников = ГрафикиРаботыСотрудников.Ссылка
		|		ПО РасчетСреднегоЗаработкаОрганизаций.Организация = Организации.Ссылка
		|ГДЕ
		|	НЕ РасчетСреднегоЗаработкаОрганизаций.Период = &ДатаИзмененияЕдиныхПравил";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
		НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
		НаборЗаписей.Прочитать();
		
		ЗаписНабора = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(ЗаписНабора, ВыборкаДетальныеЗаписи);
		
		Попытка
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();

		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи набора данных ""Расчет среднего заработка организаций"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Расчет среднего заработка организаций"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеИсполнительныхЛистовПрожиточныеМинимумы(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсполнительныйЛист.Ссылка КАК Регистратор,
		|	ИсполнительныйЛист.Ссылка КАК ИсполнительныйДокумент,
		|	&ПрожиточныйМинимум КАК ПрожиточныйМинимум,
		|	1 КАК КоличествоПрожиточныхМинимумов,
		|	ИсполнительныйЛист.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИсполнительныйЛист.Организация КАК Организация,
		|	ИсполнительныйЛист.ДатаДействия КАК Период,
		|	ИсполнительныйЛист.Проведен КАК Проведен,
		|	""Документ.ИсполнительныйЛист"" КАК ИмяТаблицы
		|ИЗ
		|	Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист.СохраняемыйЗаработок КАК ИсполнительныйЛистСохраняемыйЗаработок
		|		ПО (ИсполнительныйЛистСохраняемыйЗаработок.Ссылка = ИсполнительныйЛист.Ссылка)
		|ГДЕ
		|	НЕ ИсполнительныйЛист.ОчередностьВзыскания = &ОчередностьБезУчетаПрожиточного
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсполнительныйЛист.Ссылка,
		|	ИсполнительныйЛист.ФизическоеЛицо,
		|	ИсполнительныйЛист.Организация,
		|	ИсполнительныйЛист.Ссылка,
		|	ИсполнительныйЛист.ДатаДействия
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ИсполнительныйЛистСохраняемыйЗаработок.Ссылка) = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзменениеУсловийИсполнительногоЛиста.Ссылка,
		|	ИсполнительныйЛистДокумент.Ссылка,
		|	&ПрожиточныйМинимум КАК ПрожиточныйМинимум,
		|	1 КАК КоличествоПрожиточныхМинимумов,
		|	ИсполнительныйЛистДокумент.ФизическоеЛицо,
		|	ИзменениеУсловийИсполнительногоЛиста.Организация,
		|	ИзменениеУсловийИсполнительногоЛиста.ДатаИзменения,
		|	ИзменениеУсловийИсполнительногоЛиста.Проведен,
		|	""Документ.ИзменениеУсловийИсполнительногоЛиста""
		|ИЗ
		|	Документ.ИзменениеУсловийИсполнительногоЛиста КАК ИзменениеУсловийИсполнительногоЛиста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист КАК ИсполнительныйЛистДокумент
		|		ПО ИзменениеУсловийИсполнительногоЛиста.ИсполнительныйЛист = ИсполнительныйЛистДокумент.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийИсполнительногоЛиста.СохраняемыйЗаработок КАК ИзменениеУсловийИсполнительногоЛистаСохраняемыйЗаработок
		|		ПО (ИзменениеУсловийИсполнительногоЛистаСохраняемыйЗаработок.Ссылка = ИзменениеУсловийИсполнительногоЛиста.Ссылка)
		|ГДЕ
		|	НЕ ИсполнительныйЛистДокумент.ОчередностьВзыскания = &ОчередностьБезУчетаПрожиточного
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзменениеУсловийИсполнительногоЛиста.Ссылка,
		|	ИсполнительныйЛистДокумент.Ссылка,
		|	ИсполнительныйЛистДокумент.ФизическоеЛицо,
		|	ИзменениеУсловийИсполнительногоЛиста.Организация,
		|	ИзменениеУсловийИсполнительногоЛиста.ДатаИзменения
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ИзменениеУсловийИсполнительногоЛистаСохраняемыйЗаработок.Ссылка) = 0";
	
	Запрос.УстановитьПараметр("ОчередностьБезУчетаПрожиточного", Перечисления.ОчередностьВзысканияУдержаний.ПерваяОчередьПроцент70);
	Запрос.УстановитьПараметр("ПрожиточныйМинимум", Справочники.ПрожиточныеМинимумы.ПрожиточныйМинимум);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Проведен Тогда
		
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.СохраняемыйЗаработокПриВзысканиях.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.СохраняемыйЗаработокПриВзысканиях.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			СтрокаНабораЗаписей = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаНабораЗаписей, Выборка);

			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЕсли;
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, Выборка.ИмяТаблицы, "Ссылка", Выборка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;

		ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
		
		ДокументОбъект.СохранятьЗаработокСУчетомПрожиточногоМинимума = Истина;
		
		СтрокаПрожиточногоМинимума = ДокументОбъект.СохраняемыйЗаработок.Добавить();
		СтрокаПрожиточногоМинимума.ПрожиточныйМинимум = Справочники.ПрожиточныеМинимумы.ПрожиточныйМинимум;
		СтрокаПрожиточногоМинимума.КоличествоПрожиточныхМинимумов = 1;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);

	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсполнительныйЛист.Ссылка КАК Ссылка,
		|	""Документ.ИсполнительныйЛист"" КАК ИмяТаблицы
		|ИЗ
		|	Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист.СохраняемыйЗаработок КАК ИсполнительныйЛистСохраняемыйЗаработок
		|		ПО (ИсполнительныйЛистСохраняемыйЗаработок.Ссылка = ИсполнительныйЛист.Ссылка)
		|ГДЕ
		|	ИсполнительныйЛист.ОчередностьВзыскания = &ОчередностьБезУчетаПрожиточного
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеУсловийИсполнительногоЛиста.Ссылка,
		|	""Документ.ИзменениеУсловийИсполнительногоЛиста""
		|ИЗ
		|	Документ.ИзменениеУсловийИсполнительногоЛиста КАК ИзменениеУсловийИсполнительногоЛиста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист КАК ИсполнительныйЛистДокумент
		|		ПО ИзменениеУсловийИсполнительногоЛиста.ИсполнительныйЛист = ИсполнительныйЛистДокумент.Ссылка
		|ГДЕ
		|	ИсполнительныйЛистДокумент.ОчередностьВзыскания = &ОчередностьБезУчетаПрожиточного";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, Выборка.ИмяТаблицы, "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();

		ДокументОбъект.ОчередностьВзыскания = Перечисления.ОчередностьВзысканияУдержаний.ПерваяОчередьПроцент50;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыВБанк(ПараметрыОбновления = Неопределено) Экспорт 
	ЗаполнитьСтатьюРасходовВедомостейНаВыплатуЗарплаты(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВБанк, ПараметрыОбновления)
КонецПроцедуры	

Процедура ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыВКассу(ПараметрыОбновления = Неопределено) Экспорт 
	ЗаполнитьСтатьюРасходовВедомостейНаВыплатуЗарплаты(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу, ПараметрыОбновления)
КонецПроцедуры	

Процедура ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыПеречислением(ПараметрыОбновления = Неопределено) Экспорт 
	ЗаполнитьСтатьюРасходовВедомостейНаВыплатуЗарплаты(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыПеречислением, ПараметрыОбновления)
КонецПроцедуры	

Процедура ЗаполнитьСтатьюРасходовВВедомостьНаВыплатуЗарплатыРаздатчиком(ПараметрыОбновления = Неопределено) Экспорт 
	ЗаполнитьСтатьюРасходовВедомостейНаВыплатуЗарплаты(Метаданные.Документы.ВедомостьНаВыплатуЗарплатыРаздатчиком, ПараметрыОбновления)
КонецПроцедуры	

Процедура ЗаполнитьПоказателиУдержанийДляЕдиногоПлатежа(ПараметрыОбновления = Неопределено) Экспорт 
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Удержания.Ссылка КАК Ссылка,
		|	Удержания.ВычитатьИзРасчетнойБазыНалогиВзносы КАК ВычитатьИзРасчетнойБазыНалогиВзносы
		|ИЗ
		|	ПланВидовРасчета.Удержания КАК Удержания
		|ГДЕ
		|	(Удержания.ВычитатьИзРасчетнойБазыНалогиВзносы
		|			ИЛИ Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
		|				И Удержания.ВидОперацииПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Удержания", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		УдержаниеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		РасчетЗарплатыРасширенный.ЗаполнитьТаблицуПоказателейВидаРасчета(УдержаниеОбъект, Неопределено);
		Если Выборка.ВычитатьИзРасчетнойБазыНалогиВзносы Тогда
			УчетПрочихУдержаний.ПередЗаписьюНачисления(УдержаниеОбъект);
		КонецЕсли;
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОПоказателяхВидаРасчета(УдержаниеОбъект);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(УдержаниеОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ЗаполнитьРегистрыРасчетаСреднегоЗаработка2024(ПараметрыОбновления = Неопределено) Экспорт
	
    НаборЗаписей = РегистрыСведений.РасчетСреднегоЗаработкаПодразделений.СоздатьНаборЗаписей();
    
    ДатаИзмененияЕдиныхПравил = НачалоМесяца(УчетСреднегоЗаработкаРК.ДатаИзмененияЕдиныхПравил2024());
    
    Запрос = Новый Запрос;
   	Запрос.УстановитьПараметр("ДатаИзмененияЕдиныхПравил", ДатаИзмененияЕдиныхПравил);
   	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   &ДатаИзмененияЕдиныхПравил КАК Период,
    |   РасчетСреднегоЗаработкаПодразделений.Подразделение КАК Подразделение,
    |   РасчетСреднегоЗаработкаПодразделений.УчетРабочегоВремени КАК УчетРабочегоВремени,
    |   ЕСТЬNULL(РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета, ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПустаяСсылка)) КАК УчетРабочегоВремениДляСуммированногоУчета
    |ИЗ
    |   РегистрСведений.РасчетСреднегоЗаработкаПодразделений.СрезПоследних(&ДатаИзмененияЕдиныхПравил, ) КАК РасчетСреднегоЗаработкаПодразделений
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ДатаИзмененияЕдиныхПравил, ) КАК РасчетСреднегоЗаработкаОрганизаций
    |       ПО (ВЫРАЗИТЬ(РасчетСреднегоЗаработкаПодразделений.Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец = РасчетСреднегоЗаработкаОрганизаций.Организация)
    |
    |ОБЪЕДИНИТЬ
    |
    |ВЫБРАТЬ
    |   РасчетСреднегоЗаработкаПодразделений.Период,
    |   РасчетСреднегоЗаработкаПодразделений.Подразделение,
    |   РасчетСреднегоЗаработкаПодразделений.УчетРабочегоВремени,
    |   ЕСТЬNULL(РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета, ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПустаяСсылка))
    |ИЗ
    |   РегистрСведений.РасчетСреднегоЗаработкаПодразделений КАК РасчетСреднегоЗаработкаПодразделений
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ТекущаяДата, ) КАК РасчетСреднегоЗаработкаОрганизаций
    |       ПО (ВЫРАЗИТЬ(РасчетСреднегоЗаработкаПодразделений.Подразделение КАК Справочник.ПодразделенияОрганизаций).Владелец = РасчетСреднегоЗаработкаОрганизаций.Организация)
    |ГДЕ
    |   РасчетСреднегоЗаработкаПодразделений.Период МЕЖДУ &ДатаИзмененияЕдиныхПравил И &ТекущаяДата";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        НаборЗаписей.Отбор.Подразделение.Установить(ВыборкаДетальныеЗаписи.Подразделение);
        НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
        НаборЗаписей.Прочитать();
        Если НаборЗаписей.Количество() <> 0 Тогда
            НаборЗаписей.Очистить();
        КонецЕсли;
        
        ЗаписьНабора = НаборЗаписей.Добавить();     
        ЗаполнитьЗначенияСвойств(ЗаписьНабора, ВыборкаДетальныеЗаписи);  
        
        Попытка
            
            НаборЗаписей.ОбменДанными.Загрузка = Истина;
            НаборЗаписей.Записать();
            
        Исключение
            
            ТекстСообщения = НСтр(
            "ru = 'при записи набора данных ""Расчет среднего заработка подразделений"" произошла ошибка: 
            |%1");
            
            ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
            Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
            
            ЗаписьЖурналаРегистрации(
            НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Расчет среднего заработка подразделений"""".'"), 
            УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
            
        КонецПопытки;
        
    КонецЦикла;
    
    НаборЗаписей = РегистрыСведений.РасчетСреднегоЗаработкаСотрудников.СоздатьНаборЗаписей();
		
	Запрос = Новый Запрос;
   	Запрос.УстановитьПараметр("ДатаИзмененияЕдиныхПравил", ДатаИзмененияЕдиныхПравил);
   	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст = 
    "ВЫБРАТЬ
    |   &ДатаИзмененияЕдиныхПравил КАК Период,
    |   РасчетСреднегоЗаработкаСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
    |   РасчетСреднегоЗаработкаСотрудниковСрезПоследних.УчетРабочегоВремени КАК УчетРабочегоВремени
    |ПОМЕСТИТЬ ВТ_ПериодыСотрудников
    |ИЗ
    |   РегистрСведений.РасчетСреднегоЗаработкаСотрудников.СрезПоследних(&ДатаИзмененияЕдиныхПравил, ) КАК РасчетСреднегоЗаработкаСотрудниковСрезПоследних
    |
    |ОБЪЕДИНИТЬ
    |
    |ВЫБРАТЬ
    |   РасчетСреднегоЗаработкаСотрудников.Период,
    |   РасчетСреднегоЗаработкаСотрудников.Сотрудник,
    |   РасчетСреднегоЗаработкаСотрудников.УчетРабочегоВремени
    |ИЗ
    |   РегистрСведений.РасчетСреднегоЗаработкаСотрудников КАК РасчетСреднегоЗаработкаСотрудников
    |ГДЕ
    |   РасчетСреднегоЗаработкаСотрудников.Период МЕЖДУ &ДатаИзмененияЕдиныхПравил И &ТекущаяДата
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   МАКСИМУМ(КадроваяИсторияСотрудников.Период) КАК Период,
    |   ПериодыСотрудников.Сотрудник КАК Сотрудник,
    |   ПериодыСотрудников.Период КАК ПериодСреднегоЗаработка,
    |   ПериодыСотрудников.УчетРабочегоВремени КАК УчетРабочегоВремени
    |ПОМЕСТИТЬ ВТМаксимальныеПериодыКадровойИстории
    |ИЗ
    |   РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПериодыСотрудников КАК ПериодыСотрудников
    |       ПО КадроваяИсторияСотрудников.Сотрудник = ПериодыСотрудников.Сотрудник
    |           И (НАЧАЛОПЕРИОДА(КадроваяИсторияСотрудников.Период, ДЕНЬ) <= ПериодыСотрудников.Период)
    |
    |СГРУППИРОВАТЬ ПО
    |   ПериодыСотрудников.Сотрудник,
    |   ПериодыСотрудников.Период,
    |   ПериодыСотрудников.УчетРабочегоВремени
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ПериодыКадровойИстории.Сотрудник КАК Сотрудник,
    |   ПериодыКадровойИстории.ПериодСреднегоЗаработка КАК Период,
    |   ПериодыКадровойИстории.УчетРабочегоВремени КАК УчетРабочегоВремени,
    |   ЕСТЬNULL(РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета, ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПустаяСсылка)) КАК УчетРабочегоВремениДляСуммированногоУчета
    |ИЗ
    |   ВТМаксимальныеПериодыКадровойИстории КАК ПериодыКадровойИстории
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
    |       ПО ПериодыКадровойИстории.Период = КадроваяИсторияСотрудников.Период
    |           И ПериодыКадровойИстории.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ТекущаяДата, ) КАК РасчетСреднегоЗаработкаОрганизаций
    |       ПО (РасчетСреднегоЗаработкаОрганизаций.Организация = КадроваяИсторияСотрудников.Организация)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        НаборЗаписей.Отбор.Сотрудник.Установить(ВыборкаДетальныеЗаписи.Сотрудник);
        НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
        НаборЗаписей.Прочитать();
        
        Если НаборЗаписей.Количество() <> 0 Тогда
            НаборЗаписей.Очистить();
        КонецЕсли;
        
        ЗаписьНабора = НаборЗаписей.Добавить();
        ЗаполнитьЗначенияСвойств(ЗаписьНабора, ВыборкаДетальныеЗаписи);  
        
		Попытка
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();

		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи набора данных ""Расчет среднего заработка сотрудников"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Расчет среднего заработка сотрудников"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
    КонецЦикла;
        
КонецПроцедуры

Процедура ОбновитьСтратегиюБухучетаСдельногоЗаработка(ПараметрыОбновления = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
	|		ПО НачисленияПоказатели.Ссылка = Начисления.Ссылка
	|ГДЕ
	|	НачисленияПоказатели.Показатель = &СдельныйЗаработок
	|	И Начисления.СтратегияОтраженияВУчете <> ЗНАЧЕНИЕ(Перечисление.СтратегииОтраженияВУчетеНачисленийУдержаний.ПоСдельномуЗаработку)";
	
    Запрос.УстановитьПараметр("СдельныйЗаработок", ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СдельныйЗаработок"));
	РезультатЗапроса = Запрос.Выполнить();
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Начисления", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НачислениеОбъект.СтратегияОтраженияВУчете = Перечисления.СтратегииОтраженияВУчетеНачисленийУдержаний.ПоСдельномуЗаработку;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НачислениеОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеВидОперацииПлатежныхПоручений(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ПлатежноеПоручение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|ГДЕ
		|	ПлатежноеПоручение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежногоПоручения.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПлатежноеПоручение", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();

		ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура ЗаполнитьРегистрРасчетСреднегоЗаработкаОрганизацийДляФилиалов2024() Экспорт
	
	НаборЗаписей = РегистрыСведений.РасчетСреднегоЗаработкаОрганизаций.СоздатьНаборЗаписей();
	
	ДатаИзмененияЕдиныхПравил = НачалоМесяца(УчетСреднегоЗаработкаРК.ДатаИзмененияЕдиныхПравил2024());
	
	Запрос = Новый Запрос;
   	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   Организации.Ссылка КАК Ссылка,
        |   Организации.ЕстьОбособленныеПодразделения КАК ЕстьОбособленныеПодразделения
        |ПОМЕСТИТЬ ВТГоловныеОрганизации
        |ИЗ
        |   Справочник.Организации КАК Организации
        |ГДЕ
        |   Организации.ЕстьОбособленныеПодразделения
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   Организации.Ссылка КАК Ссылка,
        |   Организации.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
        |   Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация
        |ПОМЕСТИТЬ ВТФилиалы
        |ИЗ
        |   Справочник.Организации КАК Организации
        |ГДЕ
        |   Организации.ОбособленноеПодразделение
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   РасчетСреднегоЗаработкаОрганизаций.Период КАК Период,
        |   РасчетСреднегоЗаработкаОрганизаций.Организация КАК Организация,
        |   РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремени КАК УчетРабочегоВремени,
        |   РасчетСреднегоЗаработкаОрганизаций.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок КАК РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок,
        |   РасчетСреднегоЗаработкаОрганизаций.ВариантУчетаКадровыхПерестановок КАК ВариантУчетаКадровыхПерестановок,
        |   РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета КАК УчетРабочегоВремениДляСуммированногоУчета
        |ПОМЕСТИТЬ ВТРасчетСреднегоЗаработкаГоловнойОрганизации
        |ИЗ
        |   РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ТекущаяДата, ) КАК РасчетСреднегоЗаработкаОрганизаций
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГоловныеОрганизации КАК Организации
        |       ПО РасчетСреднегоЗаработкаОрганизаций.Организация = Организации.Ссылка
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ВЫБОР
        |       КОГДА РасчетСреднегоЗаработкаОрганизаций.Период ЕСТЬ NULL
        |           ТОГДА ЕСТЬNULL(ВТРасчетСреднегоЗаработкаГоловнойОрганизации.Период, ДАТАВРЕМЯ(2024, 1, 1))
        |       ИНАЧЕ РасчетСреднегоЗаработкаОрганизаций.Период
        |   КОНЕЦ КАК Период,
        |   ВЫБОР
        |       КОГДА РасчетСреднегоЗаработкаОрганизаций.Организация ЕСТЬ NULL
        |           ТОГДА ВТФилиалы.Ссылка
        |       ИНАЧЕ РасчетСреднегоЗаработкаОрганизаций.Организация
        |   КОНЕЦ КАК Организация,
        |   ВЫБОР
        |       КОГДА РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремени ЕСТЬ NULL
        |           ТОГДА ЕСТЬNULL(ВТРасчетСреднегоЗаработкаГоловнойОрганизации.УчетРабочегоВремени, ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПустаяСсылка))
        |       ИНАЧЕ РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремени
        |   КОНЕЦ КАК УчетРабочегоВремени,
        |   ВЫБОР
        |       КОГДА РасчетСреднегоЗаработкаОрганизаций.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок ЕСТЬ NULL
        |           ТОГДА ЕСТЬNULL(ВТРасчетСреднегоЗаработкаГоловнойОрганизации.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок, ЛОЖЬ)
        |       ИНАЧЕ РасчетСреднегоЗаработкаОрганизаций.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок
        |   КОНЕЦ КАК РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок,
        |   ВЫБОР
        |       КОГДА РасчетСреднегоЗаработкаОрганизаций.ВариантУчетаКадровыхПерестановок ЕСТЬ NULL
        |           ТОГДА ЕСТЬNULL(ВТРасчетСреднегоЗаработкаГоловнойОрганизации.ВариантУчетаКадровыхПерестановок, ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаКадровыхПерестановок.ПустаяСсылка))
        |       ИНАЧЕ РасчетСреднегоЗаработкаОрганизаций.ВариантУчетаКадровыхПерестановок
        |   КОНЕЦ КАК ВариантУчетаКадровыхПерестановок,
        |   ВЫБОР
        |       КОГДА РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета ЕСТЬ NULL
        |           ТОГДА ЕСТЬNULL(ВТРасчетСреднегоЗаработкаГоловнойОрганизации.УчетРабочегоВремениДляСуммированногоУчета, ЗНАЧЕНИЕ(Перечисление.УчетРабочегоВремениПриРасчетеСреднегоЗаработка.ПустаяСсылка))
        |       ИНАЧЕ РасчетСреднегоЗаработкаОрганизаций.УчетРабочегоВремениДляСуммированногоУчета
        |   КОНЕЦ КАК УчетРабочегоВремениДляСуммированногоУчета
        |ИЗ
        |   ВТФилиалы КАК ВТФилиалы
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.СрезПоследних(&ТекущаяДата, ) КАК РасчетСреднегоЗаработкаОрганизаций
        |       ПО (РасчетСреднегоЗаработкаОрганизаций.Организация = ВТФилиалы.Ссылка)
        |       ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетСреднегоЗаработкаГоловнойОрганизации КАК ВТРасчетСреднегоЗаработкаГоловнойОрганизации
        |       ПО ВТФилиалы.ГоловнаяОрганизация = ВТРасчетСреднегоЗаработкаГоловнойОрганизации.Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
        НаборЗаписей.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
        НаборЗаписей.Прочитать(); 
        
        Если НаборЗаписей.Количество() > 0 Тогда
            Продолжить;
        КонецЕсли;
        
		ЗаписНабора = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(ЗаписНабора, ВыборкаДетальныеЗаписи);
		
		Попытка
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();

		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи набора данных ""Расчет среднего заработка организаций"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Расчет среднего заработка организаций"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДокументыУдержаниеНалоговВзносовПоНУ(ПараметрыОбновления = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыКОбработке.Ссылка КАК Ссылка,
	|	ДокументыКОбработке.Дата КАК Дата,
	|	ДокументыКОбработке.НалогиВзносы.(
	|		ФизическоеЛицо КАК Ссылка
	|	) КАК ФизическиеЛица
	|ИЗ
	|	Документ.УдержаниеНалоговВзносовПоНУ КАК ДокументыКОбработке
	|ГДЕ
	|	ДокументыКОбработке.КраткийСоставДокумента = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыКОбработке.ПериодРегистрации УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.УдержаниеНалоговВзносовПоНУ", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ФизическиеЛицаТаблица = Выборка.ФизическиеЛица.Выгрузить();
		ФизическиеЛица = Новый Массив;
		Для Каждого СтрокаФизлица Из ФизическиеЛицаТаблица Цикл
			ФизическиеЛица.Добавить(СтрокаФизлица.Ссылка);
		КонецЦикла;
		
		ДокументОбъект.КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудниковПоСпискуФизическихЛиц(ФизическиеЛица, Выборка.Дата);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ЗаполнениеРегистраНалогиВзносыОтчисленияПоСотрудникамВидДохода(ПараметрыОбновления = Неопределено) Экспорт
	
    ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|ГДЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.Период КАК Период,
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор,
	|	НалогиВзносыОтчисленияПоСотрудникам.Начисление КАК Начисление
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистраторы КАК Регистраторы
	|	ПО НалогиВзносыОтчисленияПоСотрудникам.Регистратор = Регистраторы.Регистратор
	|ГДЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления.Период КАК Период,
	|	ВТ_Начисления.Регистратор КАК Регистратор,
	|	ВТ_Начисления.Начисление КАК Начисление,
	|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК ПериодНалогообложение
	|ПОМЕСТИТЬ ВТ_ПериодыНалогообложения
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
	|		ПО ВТ_Начисления.Начисление = НалогообложениеНачислений.Начисление
	|			И ВТ_Начисления.Период >= НалогообложениеНачислений.Период
	// если учет вели некорректно вид дохода может быть пустым, что приведет к зацикливанию
	|			И НЕ НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Начисления.Период,
	|	ВТ_Начисления.Начисление,
	|	ВТ_Начисления.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодНалогообложение,
	|	Период,
	|	Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления.Период КАК Период,
	|	ВТ_Начисления.Регистратор КАК Регистратор,
	|	ВТ_Начисления.Начисление КАК Начисление,
	|	ЕСТЬNULL(НалогообложениеНачислений.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)) КАК ВидДохода
	|ПОМЕСТИТЬ ВТ_ДанныеВидовДохода
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыНалогообложения КАК ВТ_ПериодыНалогообложения
	|		ПО ВТ_Начисления.Период = ВТ_ПериодыНалогообложения.Период
	|			И ВТ_Начисления.Регистратор = ВТ_ПериодыНалогообложения.Регистратор
	|			И ВТ_Начисления.Начисление = ВТ_ПериодыНалогообложения.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
	|		ПО (НалогообложениеНачислений.Период = ВТ_ПериодыНалогообложения.ПериодНалогообложение)
	|			И (НалогообложениеНачислений.Начисление = ВТ_ПериодыНалогообложения.Начисление)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПериодыНалогообложения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиВзносыОтчисленияПоСотрудникам.Период КАК Период,
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор,
	|	НалогиВзносыОтчисленияПоСотрудникам.НомерСтроки КАК НомерСтроки,
	|	НалогиВзносыОтчисленияПоСотрудникам.Активность КАК Активность,
	|	НалогиВзносыОтчисленияПоСотрудникам.Организация КАК Организация,
	|	НалогиВзносыОтчисленияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисленияПоСотрудникам.Сотрудник КАК Сотрудник,
	|	НалогиВзносыОтчисленияПоСотрудникам.Подразделение КАК Подразделение,
	|	НалогиВзносыОтчисленияПоСотрудникам.Начисление КАК Начисление,
	|	НалогиВзносыОтчисленияПоСотрудникам.СО КАК СО,
	|	НалогиВзносыОтчисленияПоСотрудникам.СН КАК СН,
	|	НалогиВзносыОтчисленияПоСотрудникам.ОППВ КАК ОППВ,
	|	НалогиВзносыОтчисленияПоСотрудникам.ООСМС КАК ООСМС,
	|	НалогиВзносыОтчисленияПоСотрудникам.ОПВР КАК ОПВР,
	|	НалогиВзносыОтчисленияПоСотрудникам.Сторно КАК Сторно,
	|	ВТ_ДанныеВидовДохода.ВидДохода КАК ВидДохода
	|ИЗ
	|	ВТ_ДанныеВидовДохода КАК ВТ_ДанныеВидовДохода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|		ПО ВТ_ДанныеВидовДохода.Период = НалогиВзносыОтчисленияПоСотрудникам.Период
	|			И ВТ_ДанныеВидовДохода.Регистратор = НалогиВзносыОтчисленияПоСотрудникам.Регистратор
	|			И ВТ_ДанныеВидовДохода.Начисление = НалогиВзносыОтчисленияПоСотрудникам.Начисление
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки";
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОбработатьНаборыЗаписейРегистраНакопления("НалогиВзносыОтчисленияПоСотрудникам", ТекстЗапроса, , , ПараметрыОбновления);
	
КонецПроцедуры

Процедура ДополнитьВидыВремениПремий(ПараметрыОбновления = Неопределено) Экспорт
	
	ВидВремениКомандировка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Командировка");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.ВидыВремени КАК НачисленияВидыВремени
	|		ПО НачисленияВидыВремени.Ссылка = Начисления.Ссылка
	|			И НачисленияВидыВремени.ВидВремени = &Командировка
	|ГДЕ
	|	(Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.Премия)
	|		ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КвартальнаяПремия))
	|	И НачисленияВидыВремени.Ссылка ЕСТЬ NULL";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Командировка", ВидВремениКомандировка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Начисления", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтрокаВремени = НачислениеОбъект.ВидыВремени.Добавить();
		СтрокаВремени.ВидВремени = ВидВремениКомандировка;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НачислениеОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура ОбновитьМакетОтчетаТ8Т8а() Экспорт
	
	МетаданныеОтчетаТ8 = Метаданные.Отчеты.ПечатнаяФормаТ8;
	МетаданныеОтчетаТ8а = Метаданные.Отчеты.ПечатнаяФормаТ8а;
	
	ЗарплатаКадрыОтчеты.ОчиститьМакетОтчета(МетаданныеОтчетаТ8);
	ЗарплатаКадрыОтчеты.ОчиститьМакетОтчета(МетаданныеОтчетаТ8а);
	
КонецПроцедуры

Процедура УстановитьИспользованиеПрочихВзаиморасчетов() Экспорт

	ИспользоватьРегистрациюПрочихДоходов = ПолучитьФункциональнуюОпцию("ИспользоватьРегистрациюПрочихДоходов");
	ИспользоватьНачисленияПоДоговорам = ПолучитьФункциональнуюОпцию("ИспользоватьНачисленияПоДоговорам");
	ИспользоватьВыплатыБывшимСотрудникам = ПолучитьФункциональнуюОпцию("ИспользоватьВыплатыБывшимСотрудникам");
	
	Если НЕ ИспользоватьНачисленияПоДоговорам
		И НЕ ИспользоватьРегистрациюПрочихДоходов
		И НЕ ИспользоватьВыплатыБывшимСотрудникам Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиВзаиморасчетовПоПрочимДоходам.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей[0].ИспользоватьВзаиморасчетыПоПрочимДоходам = Истина;		
		НаборЗаписей[0].ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;		
	Иначе 
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ИспользоватьВзаиморасчетыПоПрочимДоходам = Истина;		
		ЗаписьНабора.ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;		
	КонецЕсли;	
	
	Попытка
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();

	Исключение
		
		ТекстСообщения = НСтр(
		"ru = 'при записи набора данных ""Настройки взаиморасчетов по прочим доходам"" произошла ошибка: 
		|%1");
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Настройки взаиморасчетов по прочим доходам"""".'"), 
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьБольничныйЗаСчетРаботодателяСОкруглением(ПараметрыОбновления = Неопределено) Экспорт
	
	Начисления = ПланыВидовРасчета.Начисления;
	КоллекторНачислений = Новый Соответствие;
	КоллекторУдержаний = Новый Соответствие;
	СвойстваНачислений = Новый ФиксированноеСоответствие(Начисления.СвойстваНачисленийПоКатегориям());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УдержанияБазовыеВидыРасчета.Ссылка КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.Удержания.БазовыеВидыРасчета КАК УдержанияБазовыеВидыРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
	|		ПО УдержанияБазовыеВидыРасчета.ВидРасчета = Начисления.Ссылка
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя)";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		СвойстваУдержаний = ПланыВидовРасчета.Удержания.СвойстваУдержанийПоКатегориям();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ВРОбъект = Выборка.ВидРасчета.ПолучитьОбъект();
			КоллекторУдержаний.Вставить(Выборка.ВидРасчета, ВРОбъект);
			
		КонецЦикла;
		
	КонецЕсли;
	
	СвойстваПоКатегории = Начисления.СвойстваНачисленияПоКатегорииПоУмолчанию();
	СвойстваПоКатегории.СпособВыполненияНачисления = Перечисления.СпособыВыполненияНачислений.ПоОтдельномуДокументуДоОкончательногоРасчета;
	СвойстваПоКатегории.ВидДокументаНачисления = Перечисления.ВидыДокументовНачисления.БольничныйЛист;
	СвойстваПоКатегории.СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПроизвольнаяФормула;
	СвойстваПоКатегории.ФормулаРасчета = "СреднийЗаработокОбщий * ВремяВДняхЧасах * КоэффициентИндексацииСреднегоЗаработка";
	СвойстваПоКатегории.СреднийЗаработокОбщий = Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ОбщийЗаработок;
	СвойстваПоКатегории.ВидВремени = Перечисления.ВидыРабочегоВремениСотрудников.ЦелодневноеНеотработанное;
	СвойстваПоКатегории.ОбозначениеВТабелеУчетаРабочегоВремени = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Болезнь");
	СвойстваПоКатегории.ВидПособияСоциальногоСтрахования = Неопределено;
	СвойстваПоКатегории.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.НайтиПоКоду("2300");
	СвойстваПоКатегории.КатегорияДохода = УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(СвойстваПоКатегории.КодДоходаНДФЛ);
	СвойстваПоКатегории.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликом;
	СвойстваПоКатегории.КодДоходаСтраховыеВзносы2017 = Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликом;
	СвойстваПоКатегории.КатегорияСтатистическогоНаблюдения = Неопределено;
	СвойстваПоКатегории.КатегорияСтатистическогоНаблюдения2019 = Неопределено;
	СвойстваПоКатегории.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = Перечисления.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоТрудовомуЗаконодательству;
	СвойстваПоКатегории.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель;
	СвойстваПоКатегории.ВидСтажаСЗВ = Перечисления.ВидыСтажаСЗВ.ВременнаяНетрудоспособность;
	СвойстваПоКатегории.ВидСтажаПФР2014 = Перечисления.ВидыСтажаПФР2014.ВременнаяНетрудоспособность;
	СвойстваПоКатегории.ВидНачисленияДляНУ	= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп48ст266;
	СвойстваПоКатегории.НедоступныеСвойства.Добавить("ВидВремени");
	
	Описание = Начисления.ОписаниеНачисления();
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя;
	Описание.СвойстваПоКатегории 	= СвойстваПоКатегории;
	Описание.Код					= НСтр("ru = 'БЛНФ'");
	Описание.Наименование			= НСтр("ru = 'Больничный за счет работодателя'");
	Описание.КлючевыеСвойства		= "Ссылка";
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Начисления.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
	
	Начисление = Новый Массив;
	НачислениеСсылка = Неопределено;
	Для Каждого СозданноеНачисление Из КоллекторНачислений Цикл
		Начисление.Добавить(СозданноеНачисление.Ключ);
		НачислениеСсылка = СозданноеНачисление.Ключ;
	КонецЦикла;
	
	// Записываем новое начисление, добавляем в приоритет начислений
	Начисления.ЗаписатьВидыРасчетаКоллектора(КоллекторНачислений, СвойстваНачислений);
	
	// Добавляем новое начисление в зависимые удержания
	Для Каждого Удержание Из КоллекторУдержаний Цикл
		УдержаниеОбъект = Удержание.Значение;
		Если УдержаниеОбъект.БазовыеВидыРасчета.Найти(НачислениеСсылка, "ВидРасчета") = Неопределено Тогда
			УдержаниеОбъект.БазовыеВидыРасчета.Добавить().ВидРасчета = НачислениеСсылка;
			УдержаниеОбъект.ОбменДанными.Загрузка = Истина;
			УдержаниеОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Создаем настройки налогообложения нового начисления
	РегистрыСведений.НалогообложениеНачислений.СоздатьНалогообложениеНачисленийПоНастройкам(Начисление);
	
	// Пометка прочих начислений с той же категорией начисления как "больше не используется"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя)
		|	И Начисления.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаНачислений.ОплатаБольничного)
		|	И НЕ Начисления.ВАрхиве";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Начисления", "Ссылка", ВыборкаДетальныеЗаписи.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НачислениеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		НачислениеОбъект.ВАрхиве = Истина;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НачислениеОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ЗаполнитьДатуКорректировкиВеденияУчетаПоДаннымНВО() Экспорт

    Попытка
    
    	Константы.ДатаКорректировкиВеденияУчетаПоДаннымНВО.Установить(НачалоМесяца(ТекущаяДатаСеанса()));
    
    Исключение  
        
		ТекстСообщения = НСтр(
		"ru = 'при установки константы ""Дата корректировки ведения учета по данным налогов, взносов, отчислений"" произошла ошибка: 
		|%1");
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Не удалось обновить ""Константу  ""Дата корректировки ведения учета по данным налогов, взносов, отчислений"""".'"), 
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					

    КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнениеРегистраНалогиВзносыОтчисленияПоСотрудникамДанныеМежрасчетногоПериода(ПараметрыОбновления = Неопределено) Экспорт
	
    ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(НалогиВзносыОтчисленияПоСотрудникам.Регистратор) В (ТИП(Документ.НачислениеПоДоговорам),
	|			ТИП(Документ.ВыплатаБывшимСотрудникам),
	|			ТИП(Документ.РегистрацияПрочихДоходов))
	|	И НалогиВзносыОтчисленияПоСотрудникам.ДанныеМежрасчетногоПериода = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.Период КАК Период,
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор,
	|	НалогиВзносыОтчисленияПоСотрудникам.Начисление КАК Начисление
	|ПОМЕСТИТЬ ВТ_ДанныеМежрасчетногоПериода
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистраторы КАК Регистраторы
	|		ПО НалогиВзносыОтчисленияПоСотрудникам.Регистратор = Регистраторы.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиВзносыОтчисленияПоСотрудникам.Период КАК Период,
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор,
	|	НалогиВзносыОтчисленияПоСотрудникам.НомерСтроки КАК НомерСтроки,
	|	НалогиВзносыОтчисленияПоСотрудникам.Активность КАК Активность,
	|	НалогиВзносыОтчисленияПоСотрудникам.Организация КАК Организация,
	|	НалогиВзносыОтчисленияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисленияПоСотрудникам.Сотрудник КАК Сотрудник,
	|	НалогиВзносыОтчисленияПоСотрудникам.Подразделение КАК Подразделение,
	|	НалогиВзносыОтчисленияПоСотрудникам.Начисление КАК Начисление,
	|	НалогиВзносыОтчисленияПоСотрудникам.ВидДохода КАК ВидДохода,
	|	НалогиВзносыОтчисленияПоСотрудникам.СО КАК СО,
	|	НалогиВзносыОтчисленияПоСотрудникам.СН КАК СН,
	|	НалогиВзносыОтчисленияПоСотрудникам.ОППВ КАК ОППВ,
	|	НалогиВзносыОтчисленияПоСотрудникам.ООСМС КАК ООСМС,
	|	НалогиВзносыОтчисленияПоСотрудникам.ОПВР КАК ОПВР,
	|	НалогиВзносыОтчисленияПоСотрудникам.Сторно КАК Сторно,
	|	ИСТИНА КАК ДанныеМежрасчетногоПериода
	|ИЗ
	|	ВТ_ДанныеМежрасчетногоПериода КАК ВТ_ДанныеМежрасчетногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|		ПО ВТ_ДанныеМежрасчетногоПериода.Период = НалогиВзносыОтчисленияПоСотрудникам.Период
	|			И ВТ_ДанныеМежрасчетногоПериода.Регистратор = НалогиВзносыОтчисленияПоСотрудникам.Регистратор
	|			И ВТ_ДанныеМежрасчетногоПериода.Начисление = НалогиВзносыОтчисленияПоСотрудникам.Начисление
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки";
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОбработатьНаборыЗаписейРегистраНакопления("НалогиВзносыОтчисленияПоСотрудникам", ТекстЗапроса, , , ПараметрыОбновления);
	
КонецПроцедуры

Процедура ПеренестиПризнакВестиУчетРабочегоВремениПоУсловиямТруда() Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиЗарплатаКадрыРасширенная.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиЗарплатаКадрыРасширенная.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.НастройкиЗарплатаКадрыРасширенная КАК НастройкиЗарплатаКадрыРасширенная
		|ГДЕ
		|	НастройкиЗарплатаКадрыРасширенная.ВестиУчетРабочегоВремениПоУсловиямТруда = ИСТИНА
		|	И НастройкиЗарплатаКадрыРасширенная.ИспользоватьОсобыеУсловияТруда = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьНабора = НаборЗаписей[0];
		ЗаписьНабора.ИспользоватьОсобыеУсловияТруда = Истина;
		
		Попытка
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			
		Исключение
			
			ТекстСообщения = НСтр(
			"ru = 'при записи набора данных ""Настройки зарплата кадры (расширенный)"" произошла ошибка: 
			|%1");
			
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
			
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Настройки зарплата кадры (расширенный)"""".'"), 
			УровеньЖурналаРегистрации.Ошибка, , , Комментарий);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьВидыВремениПремийИНадбавкиЗаВредность(ПараметрыОбновления = Неопределено) Экспорт
	
	ВидВремениВыходныеРабочиеДни = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ВыходныеРабочиеДни");
	ВидВремениВыходныеРабочиеДниБезПовышеннойОплаты = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ВыходныеРабочиеДниБезПовышеннойОплаты");
	ВидВремениПраздники = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Праздники");
	ВидВремениПраздникиБезПовышеннойОплаты = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ПраздникиБезПовышеннойОплаты");
	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(ВидВремениВыходныеРабочиеДни);
	ВидыВремени.Добавить(ВидВремениВыходныеРабочиеДниБезПовышеннойОплаты);
	ВидыВремени.Добавить(ВидВремениПраздники);
	ВидыВремени.Добавить(ВидВремениПраздникиБезПовышеннойОплаты);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.ВидыВремени КАК НачисленияВидыВремени
	|		ПО НачисленияВидыВремени.Ссылка = Начисления.Ссылка
	|			И НачисленияВидыВремени.ВидВремени В (&ВидыВремени)
	|ГДЕ
	|	(Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.Премия)
	|		ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.КвартальнаяПремия)
	|		ИЛИ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.НадбавкаЗаВредность))
	|	И НЕ НачисленияВидыВремени.Ссылка ЕСТЬ NULL";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВидыВремени", ВидыВремени);
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Начисления", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого ВидВремени Из ВидыВремени Цикл
			СтрокаВидаВремени = НачислениеОбъект.ВидыВремени.Найти(ВидВремени);
			Если НЕ СтрокаВидаВремени = Неопределено Тогда
				НачислениеОбъект.ВидыВремени.Удалить(СтрокаВидаВремени);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НачислениеОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура ЗаполнениеРегистраНалогиВзносыОтчисленияПоСотрудникамВидДоходаСДаннымиМежрасчета(ПараметрыОбновления = Неопределено) Экспорт
	
    ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|ГДЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
	|	И НалогиВзносыОтчисленияПоСотрудникам.ДанныеМежрасчетногоПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.Период КАК Период,
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор,
	|	НалогиВзносыОтчисленияПоСотрудникам.Начисление КАК Начисление
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистраторы КАК Регистраторы
	|	ПО НалогиВзносыОтчисленияПоСотрудникам.Регистратор = Регистраторы.Регистратор
	|ГДЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления.Период КАК Период,
	|	ВТ_Начисления.Регистратор КАК Регистратор,
	|	ВТ_Начисления.Начисление КАК Начисление,
	|	МАКСИМУМ(НалогообложениеНачислений.Период) КАК ПериодНалогообложение
	|ПОМЕСТИТЬ ВТ_ПериодыНалогообложения
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
	|		ПО ВТ_Начисления.Начисление = НалогообложениеНачислений.Начисление
	|			И ВТ_Начисления.Период >= НалогообложениеНачислений.Период
	// если учет вели некорректно вид дохода может быть пустым, что приведет к зацикливанию
	|			И НЕ НалогообложениеНачислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Начисления.Период,
	|	ВТ_Начисления.Начисление,
	|	ВТ_Начисления.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодНалогообложение,
	|	Период,
	|	Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления.Период КАК Период,
	|	ВТ_Начисления.Регистратор КАК Регистратор,
	|	ВТ_Начисления.Начисление КАК Начисление,
	|	ЕСТЬNULL(НалогообложениеНачислений.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)) КАК ВидДохода
	|ПОМЕСТИТЬ ВТ_ДанныеВидовДохода
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыНалогообложения КАК ВТ_ПериодыНалогообложения
	|		ПО ВТ_Начисления.Период = ВТ_ПериодыНалогообложения.Период
	|			И ВТ_Начисления.Регистратор = ВТ_ПериодыНалогообложения.Регистратор
	|			И ВТ_Начисления.Начисление = ВТ_ПериодыНалогообложения.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений КАК НалогообложениеНачислений
	|		ПО (НалогообложениеНачислений.Период = ВТ_ПериодыНалогообложения.ПериодНалогообложение)
	|			И (НалогообложениеНачислений.Начисление = ВТ_ПериодыНалогообложения.Начисление)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	Начисление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПериодыНалогообложения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// выберем различные, без номера строки с целью удаления замножения 3.1.2.17
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПоСотрудникам.Период КАК Период,
	|	НалогиВзносыОтчисленияПоСотрудникам.Регистратор КАК Регистратор,
	|	НалогиВзносыОтчисленияПоСотрудникам.Активность КАК Активность,
	|	НалогиВзносыОтчисленияПоСотрудникам.Организация КАК Организация,
	|	НалогиВзносыОтчисленияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисленияПоСотрудникам.Сотрудник КАК Сотрудник,
	|	НалогиВзносыОтчисленияПоСотрудникам.Подразделение КАК Подразделение,
	|	НалогиВзносыОтчисленияПоСотрудникам.Начисление КАК Начисление,
	|	НалогиВзносыОтчисленияПоСотрудникам.ДанныеМежрасчетногоПериода КАК ДанныеМежрасчетногоПериода,
	|	НалогиВзносыОтчисленияПоСотрудникам.СО КАК СО,
	|	НалогиВзносыОтчисленияПоСотрудникам.СН КАК СН,
	|	НалогиВзносыОтчисленияПоСотрудникам.ОППВ КАК ОППВ,
	|	НалогиВзносыОтчисленияПоСотрудникам.ООСМС КАК ООСМС,
	|	НалогиВзносыОтчисленияПоСотрудникам.ОПВР КАК ОПВР,
	|	НалогиВзносыОтчисленияПоСотрудникам.Сторно КАК Сторно,
	|	НалогиВзносыОтчисленияПоСотрудникам.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДанныеВидовДохода.ВидДохода КАК ВидДохода
	|ИЗ
	|	ВТ_ДанныеВидовДохода КАК ВТ_ДанныеВидовДохода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам КАК НалогиВзносыОтчисленияПоСотрудникам
	|		ПО ВТ_ДанныеВидовДохода.Период = НалогиВзносыОтчисленияПоСотрудникам.Период
	|			И ВТ_ДанныеВидовДохода.Регистратор = НалогиВзносыОтчисленияПоСотрудникам.Регистратор
	|			И ВТ_ДанныеВидовДохода.Начисление = НалогиВзносыОтчисленияПоСотрудникам.Начисление
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОбработатьНаборыЗаписейРегистраНакопления("НалогиВзносыОтчисленияПоСотрудникам", ТекстЗапроса, , , ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьПоказателиУдержанийДляСО(ПараметрыОбновления = Неопределено) Экспорт 
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Удержания.Ссылка КАК Ссылка,
		|	Удержания.ВычитатьИзРасчетнойБазыНалогиВзносы КАК ВычитатьИзРасчетнойБазыНалогиВзносы
		|ИЗ
		|	ПланВидовРасчета.Удержания КАК Удержания
		|ГДЕ
		|	(Удержания.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
		|			И Удержания.ВидОперацииПоЗарплате = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "ПланВидовРасчета.Удержания", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		УдержаниеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		РасчетЗарплатыРасширенный.ЗаполнитьТаблицуПоказателейВидаРасчета(УдержаниеОбъект, Неопределено);
		РасчетЗарплатыРасширенный.ЗаполнитьИнформациюОПоказателяхВидаРасчета(УдержаниеОбъект);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(УдержаниеОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ЗаполнениеРегистраВзаиморасчетыСКонтрагентамиАкционерами(ПараметрыОбновления = Неопределено) Экспорт
	
    ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор КАК Регистратор
    |ПОМЕСТИТЬ ВТ_РегистраторыВзаиморасчеты
    |ИЗ
    |   РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
    |ГДЕ
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1)
    |
    |ИНДЕКСИРОВАТЬ ПО
    |   Регистратор
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор КАК Регистратор,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование КАК ДокументОснование,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
    |ПОМЕСТИТЬ ВТ_ДокументыОснованияВзаиморасчеты
    |ИЗ
    |   РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегистраторыВзаиморасчеты КАК ВТ_РегистраторыВзаиморасчеты
    |       ПО ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор = ВТ_РегистраторыВзаиморасчеты.Регистратор
    |
    |ИНДЕКСИРОВАТЬ ПО
    |   Регистратор,
    |   ДокументОснование
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |УНИЧТОЖИТЬ ВТ_РегистраторыВзаиморасчеты
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование КАК ДокументОснование,
    |   ВыплатаБывшимСотрудникам.ПериодРегистрации КАК ПериодВзаиморасчетов
    |ПОМЕСТИТЬ ВТ_ПериодыВзаиморасчетов
    |ИЗ
    |   ВТ_ДокументыОснованияВзаиморасчеты КАК ВТ_ДокументыОснованияВзаиморасчеты
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
    |       ПО (ВыплатаБывшимСотрудникам.Ссылка = ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование,
    |   РегистрацияПрочихДоходов.ПериодРегистрации
    |ИЗ
    |   ВТ_ДокументыОснованияВзаиморасчеты КАК ВТ_ДокументыОснованияВзаиморасчеты
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
    |       ПО (РегистрацияПрочихДоходов.Ссылка = ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование,
    |   НачислениеЗарплаты.МесяцНачисления
    |ИЗ
    |   ВТ_ДокументыОснованияВзаиморасчеты КАК ВТ_ДокументыОснованияВзаиморасчеты
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
    |       ПО (НачислениеЗарплаты.Ссылка = ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование,
    |   НачислениеПоДоговорам.МесяцНачисления
    |ИЗ
    |   ВТ_ДокументыОснованияВзаиморасчеты КАК ВТ_ДокументыОснованияВзаиморасчеты
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоДоговорам КАК НачислениеПоДоговорам
    |       ПО (НачислениеПоДоговорам.Ссылка = ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Период КАК Период,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор КАК Регистратор,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.НомерСтроки КАК НомерСтроки,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Активность КАК Активность,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения КАК ВидДвижения,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование КАК ДокументОснование,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.ГруппаНачисленияУдержанияВыплаты КАК ГруппаНачисленияУдержанияВыплаты,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.Сотрудник КАК Сотрудник,
    |   ВзаиморасчетыСКонтрагентамиАкционерами.МоментВремени КАК МоментВремени,
    |   ЕСТЬNULL(ВТ_ПериодыВзаиморасчетов.ПериодВзаиморасчетов, ВзаиморасчетыСКонтрагентамиАкционерами.Период) КАК ПериодВзаиморасчетов
    |ИЗ
    |   ВТ_ДокументыОснованияВзаиморасчеты КАК ВТ_ДокументыОснованияВзаиморасчеты
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
    |       ПО ВТ_ДокументыОснованияВзаиморасчеты.Регистратор = ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор
    |           И ВТ_ДокументыОснованияВзаиморасчеты.Организация = ВзаиморасчетыСКонтрагентамиАкционерами.Организация
    |           И ВТ_ДокументыОснованияВзаиморасчеты.ФизическоеЛицо = ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо
    |           И ВТ_ДокументыОснованияВзаиморасчеты.СпособРасчетов = ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов
    |           И ВТ_ДокументыОснованияВзаиморасчеты.СтатьяРасходов = ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов
    |           И ВТ_ДокументыОснованияВзаиморасчеты.Подразделение = ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение
    |           И ВТ_ДокументыОснованияВзаиморасчеты.ПериодВзаиморасчетов = ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов
    |       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыВзаиморасчетов КАК ВТ_ПериодыВзаиморасчетов
    |       ПО (ВТ_ПериодыВзаиморасчетов.ДокументОснование = ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование)";
    
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		
		ТекстЗапросаДивиденды = "    
        |       ПО (НачислениеПоДоговорам.Ссылка = ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование)
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование,
        |   ДивидендыФизическимЛицам.ПериодРегистрации
        |ИЗ
        |   ВТ_ДокументыОснованияВзаиморасчеты КАК ВТ_ДокументыОснованияВзаиморасчеты,
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ #Дивиденды КАК ДивидендыФизическимЛицам
        |       ПО (ДивидендыФизическимЛицам.Ссылка = ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование)
        |";

		ТекстЗапросаДивиденды = СтрЗаменить(ТекстЗапросаДивиденды, "#Дивиденды",	"Документ.ДивидендыФизическимЛицам"); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПО (НачислениеПоДоговорам.Ссылка = ВТ_ДокументыОснованияВзаиморасчеты.ДокументОснование)",	ТекстЗапросаДивиденды); 
		
	КонецЕсли;
    
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОбработатьНаборыЗаписейРегистраНакопления("ВзаиморасчетыСКонтрагентамиАкционерами", ТекстЗапроса, , , ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьПериодВзаиморасчетовВВедомостьПрочихДоходовВБанк(ПараметрыОбновления = Неопределено) Экспорт 
	ЗаполнитьПериодВзаиморасчетовВедомостейПрочихДоходовНаВыплатуЗарплаты(Метаданные.Документы.ВедомостьПрочихДоходовВБанк, ПараметрыОбновления)
КонецПроцедуры	

Процедура ЗаполнитьПериодВзаиморасчетовВВедомостьПрочихДоходовВКассу(ПараметрыОбновления = Неопределено) Экспорт 
	ЗаполнитьПериодВзаиморасчетовВедомостейПрочихДоходовНаВыплатуЗарплаты(Метаданные.Документы.ВедомостьПрочихДоходовВКассу, ПараметрыОбновления)
КонецПроцедуры	

Процедура ЗаполнитьПериодВзаиморасчетовВВедомостьПрочихДоходовПеречислением(ПараметрыОбновления = Неопределено) Экспорт 
	ЗаполнитьПериодВзаиморасчетовВедомостейПрочихДоходовНаВыплатуЗарплаты(Метаданные.Документы.ВедомостьПрочихДоходовПеречислением, ПараметрыОбновления)
КонецПроцедуры	

Процедура ЗаполнитьПериодВзаиморасчетовВедомостейПрочихДоходовНаВыплатуЗарплаты(МетаданныеВедомости, ПараметрыОбновления) 
	
 	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ 
    |	ВедомостьВыплаты.Ссылка КАК Ссылка
    |ПОМЕСТИТЬ ВТ_Ведомости
    |ИЗ
    |	#ВедомостьВыплаты КАК ВедомостьВыплаты 
    |ГДЕ
    |   ВедомостьВыплаты.ПериодВзаиморасчетов = ДАТАВРЕМЯ(1, 1, 1)
    |СГРУППИРОВАТЬ ПО
    |	ВедомостьВыплаты.Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ 
    |	ВедомостьВыплаты.Ссылка КАК Ссылка,
    |	ВедомостьВыплаты.ДокументОснование КАК ДокументОснование
    |ПОМЕСТИТЬ ВТ_ДокументыОснованияВедомости
    |ИЗ
    |	#ВедомостьВыплаты КАК ВедомостьВыплаты
    |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ведомости КАК ВТ_Ведомости
    |       ПО ВТ_Ведомости.Ссылка = ВедомостьВыплаты.Ссылка
    |СГРУППИРОВАТЬ ПО   
    |	ВедомостьВыплаты.Ссылка,
    |	ВедомостьВыплаты.ДокументОснование
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |УНИЧТОЖИТЬ ВТ_Ведомости
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВТ_ДокументыОснованияВедомости.ДокументОснование КАК ДокументОснование,
    |	ВыплатаБывшимСотрудникам.ПериодРегистрации КАК ПериодВзаиморасчетов
    |ПОМЕСТИТЬ ВТ_ПериодыВзаиморасчетов
    |ИЗ
    |	ВТ_ДокументыОснованияВедомости КАК ВТ_ДокументыОснованияВедомости
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
    |		ПО (ВыплатаБывшимСотрудникам.Ссылка = ВТ_ДокументыОснованияВедомости.ДокументОснование)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВТ_ДокументыОснованияВедомости.ДокументОснование,
    |	РегистрацияПрочихДоходов.ПериодРегистрации
    |ИЗ
    |	ВТ_ДокументыОснованияВедомости КАК ВТ_ДокументыОснованияВедомости
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
    |		ПО (РегистрацияПрочихДоходов.Ссылка = ВТ_ДокументыОснованияВедомости.ДокументОснование)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВТ_ДокументыОснованияВедомости.ДокументОснование,
    |	НачислениеЗарплаты.МесяцНачисления
    |ИЗ
    |	ВТ_ДокументыОснованияВедомости КАК ВТ_ДокументыОснованияВедомости
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
    |		ПО (НачислениеЗарплаты.Ссылка = ВТ_ДокументыОснованияВедомости.ДокументОснование)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВТ_ДокументыОснованияВедомости.ДокументОснование,
    |	НачислениеПоДоговорам.МесяцНачисления
    |ИЗ
    |	ВТ_ДокументыОснованияВедомости КАК ВТ_ДокументыОснованияВедомости
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеПоДоговорам КАК НачислениеПоДоговорам
    |		ПО (НачислениеПоДоговорам.Ссылка = ВТ_ДокументыОснованияВедомости.ДокументОснование)
    |
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ВедомостьВыплаты.Ссылка КАК Ссылка,
    |	ВедомостьВыплаты.ДокументОснование КАК ДокументОснование,
    |	ЕСТЬNULL(ВТ_ПериодыВзаиморасчетов.ПериодВзаиморасчетов, ВедомостьВыплаты.Ссылка.ПериодРегистрации) КАК ПериодВзаиморасчетов
    |ИЗ
    |	ВТ_ДокументыОснованияВедомости КАК ВТ_ДокументыОснованияВедомости
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВедомостьВыплаты КАК ВедомостьВыплаты
    |		ПО (ВедомостьВыплаты.Ссылка = ВТ_ДокументыОснованияВедомости.Ссылка)
    |			И (ВедомостьВыплаты.ДокументОснование = ВТ_ДокументыОснованияВедомости.ДокументОснование)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыВзаиморасчетов КАК ВТ_ПериодыВзаиморасчетов
    |		ПО (ВедомостьВыплаты.ДокументОснование = ВТ_ПериодыВзаиморасчетов.ДокументОснование)
    |ИТОГИ ПО
    |	Ссылка"; 
    
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		
		ТекстЗапросаДивиденды = "    
        |		ПО (НачислениеПоДоговорам.Ссылка = ВТ_ДокументыОснованияВедомости.ДокументОснование)
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |	ВТ_ДокументыОснованияВедомости.ДокументОснование,
        |	ДивидендыФизическимЛицам.ПериодРегистрации
        |ИЗ
        |	ВТ_ДокументыОснованияВедомости КАК ВТ_ДокументыОснованияВедомости
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #Дивиденды КАК ДивидендыФизическимЛицам
        |		ПО (ДивидендыФизическимЛицам.Ссылка = ВТ_ДокументыОснованияВедомости.ДокументОснование)
        |";	
        ТекстЗапросаДивиденды = СтрЗаменить(ТекстЗапросаДивиденды, "#Дивиденды",	"Документ.ДивидендыФизическимЛицам"); 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО (НачислениеПоДоговорам.Ссылка = ВТ_ДокументыОснованияВедомости.ДокументОснование)",	ТекстЗапросаДивиденды); 
		
	КонецЕсли;
    
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВедомостьВыплаты",	МетаданныеВедомости.ПолноеИмя() + ".Выплаты"); 

	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, МетаданныеВедомости.ПолноеИмя(), "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
        Ведомость = Выборка.Ссылка.ПолучитьОбъект();
        
        СоответствиеПериодов = Новый Соответствие;
        ПериодВзаиморасчетов = Дата('00010101');
        ВыборкаПоВыплатам = Выборка.Выбрать();
        Пока ВыборкаПоВыплатам.Следующий() Цикл
            Если ЗначениеЗаполнено(ВыборкаПоВыплатам.ДокументОснование) Тогда
                СоответствиеПериодов.Вставить(ВыборкаПоВыплатам.ДокументОснование, ВыборкаПоВыплатам.ПериодВзаиморасчетов);
            Иначе
                ПериодВзаиморасчетов = ВыборкаПоВыплатам.ПериодВзаиморасчетов;
            КонецЕсли;
        КонецЦикла;
        
        // Обход строк табличной части документа
        Для Каждого СтрокаТЧ Из Ведомость.Выплаты Цикл
            Если Не ЗначениеЗаполнено(СтрокаТЧ.ПериодВзаиморасчетов) Тогда
                Если СоответствиеПериодов.Получить(СтрокаТЧ.ДокументОснование) <> Неопределено Тогда
                    СтрокаТЧ.ПериодВзаиморасчетов = СоответствиеПериодов[СтрокаТЧ.ДокументОснование];
                Иначе
                    СтрокаТЧ.ПериодВзаиморасчетов = ПериодВзаиморасчетов;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;

        ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Ведомость,,, РежимЗаписиДокумента.Запись);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
    
КонецПроцедуры	

Процедура УдалитьЗаписиНеиспользуемыхКлассификаторов(ПараметрыОбновления = Неопределено) Экспорт

	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлассификаторЗанятий.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КлассификаторЗанятий КАК КлассификаторЗанятий
	               |";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УдаляемыйОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ УдаляемыйОбъект = Неопределено Тогда
			Попытка
				УдаляемыйОбъект.ОбменДанными.Загрузка = Истина;
				УдаляемыйОбъект.Удалить();
			Исключение
				ТекстСообщения = НСтр(
				"ru = 'при удалении данных ""Классификатора занятий"" произошла ошибка: 
				|%1");
				
				ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
				
				ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Не удалось обновить ""Справочник  ""Классификатор занятий"""".'"), 
				УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Набор = РегистрыСведений.РазмерВычетовНДФЛ.СоздатьНаборЗаписей();

	Попытка
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
	Исключение
		ТекстСообщения = НСтр(
		"ru = 'при записи набора данных ""Размер вычетов НДФЛ"" произошла ошибка: 
		|%1");
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Размер вычетов НДФЛ"""".'"), 
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
	КонецПопытки;
	
	Набор = РегистрыСведений.РазмерыГосударственныхПособий.СоздатьНаборЗаписей();

	Попытка
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
	Исключение
		ТекстСообщения = НСтр(
		"ru = 'при записи набора данных ""Размер государственных пособий"" произошла ошибка: 
		|%1");
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Размер государственных пособий"""".'"), 
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
	КонецПопытки;
	
	Набор = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.СоздатьНаборЗаписей();

	Попытка
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
	Исключение
		ТекстСообщения = НСтр(
		"ru = 'при записи набора данных ""Предельная величина базы страховых взносов"" произошла ошибка: 
		|%1");
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Предельная величина базы страховых взносов"""".'"), 
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
	КонецПопытки;
	
	Набор = РегистрыСведений.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты.СоздатьНаборЗаписей();

	Попытка
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
	Исключение
		ТекстСообщения = НСтр(
		"ru = 'при записи набора данных ""Максимальный размер ежемесячной страховой выплаты"" произошла ошибка: 
		|%1");
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Максимальный размер ежемесячной страховой выплаты"""".'"), 
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
		
	КонецПопытки;
		
	Набор = РегистрыСведений.ТарифыСтраховыхВзносов.СоздатьНаборЗаписей();

	Попытка
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
	Исключение
		ТекстСообщения = НСтр(
		"ru = 'при записи набора данных ""Тарифы страховых взносов"" произошла ошибка: 
		|%1");
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки);
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Не удалось обновить ""Регистр сведений  ""Тарифы страховых взносов"""".'"), 
		УровеньЖурналаРегистрации.Ошибка, , , Комментарий);					
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

#КонецОбласти

#КонецОбласти

