#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПрочиеДоходы") И Параметры.ПрочиеДоходы Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВидыДоходов.Ссылка
			|ИЗ
			|	Справочник.ВидыДоходов КАК ВидыДоходов
			|ГДЕ
			|	ВидыДоходов.Ссылка <> ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
			|	И ВидыДоходов.Наименование ПОДОБНО &СтрокаПоиска";
		Если Параметры.СтрокаПоиска = Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидыДоходов.Наименование ПОДОБНО &СтрокаПоиска", "");
		Иначе 
			Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%"); 	
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ВыплатыБывшимСотрудникам() Экспорт

	ВидыДоходов = Новый Массив;
	
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтРаботодателя"));
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"));
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ПрочиеДоходы"));
	
	МодификацияКонфигурацииЗУПКПереопределяемый.ВидыДоходовВыплатыБывшимСотрудникам(ВидыДоходов);
	
	Возврат ВидыДоходов;

КонецФункции

Функция ВидыПрочихДоходовФизическихЛиц() Экспорт

	ВидыДоходов = Новый Массив;
	
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"));
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.Выигрыши"));
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.Вознаграждения"));
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ПрочиеДоходы"));
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходСубъектаПредпринимательства"));
	
	МодификацияКонфигурацииЗУПКПереопределяемый.ВидыДоходовВидыПрочихДоходовФизическихЛиц(ВидыДоходов);
	
	Возврат ВидыДоходов;

КонецФункции

Функция ВидыДивидендов() Экспорт

	ВидыДоходов = Новый Массив;
	
	ВидыДоходов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыДоходов.Дивиденды"));
	
	Возврат ВидыДоходов;

КонецФункции

Функция ВидыНачисленияПВР() Экспорт

	ВидыДоходов = Новый Массив;
	
	ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтРаботодателя"));
	ВидыДоходов.Добавить(ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента"));
	
	Возврат ВидыДоходов;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСправочникВидыДоходов();
	
КонецПроцедуры

Процедура ЗаполнитьСправочникВидыДоходов() Экспорт
	
   	ОписаниеЭлемента = ОписаниеЭлементаВидаДохода();
	ОписаниеЭлемента.ИмяПредопределенныхДанных = "ДоходыОтРаботодателя";
	ОписаниеЭлемента.Описание = НСтр("ru = 'Доходы, полученные от работодателя, облагаемые у источника выплаты'"); 
	ОписаниеЭлемента.УчитыватьИПН = Истина;
	ОписаниеЭлемента.УчитыватьСН = Истина;
	ОписаниеЭлемента.УчитыватьОПВ = Истина;
	ОписаниеЭлемента.УчитыватьОППВ = Истина;
	ОписаниеЭлемента.УчитыватьСО = Истина;
	ОписаниеЭлемента.УчитыватьВОСМС = Истина;
	ОписаниеЭлемента.УчитыватьООСМС = Истина;
	ОписаниеЭлемента.УчитыватьОПВР = Истина;
	ОписаниеЭлемента.УчитыватьЕП = Истина;
	СоздатьЭлементВидДохода(ОписаниеЭлемента);
	
   	ОписаниеЭлемента = ОписаниеЭлементаВидаДохода();
	ОписаниеЭлемента.ИмяПредопределенныхДанных = "ДоходыОтНалоговогоАгента";
	ОписаниеЭлемента.Описание = НСтр("ru = 'Доход, облагаемый у источника выплаты (доход по заключенным с налоговым агентом договорам ГПХ, оплата стоимости товаров, выполненных работ, оказанных услуг и др.)'"); 
	ОписаниеЭлемента.УчитыватьИПН = Истина;
	ОписаниеЭлемента.УчитыватьОПВ = Истина;
	ОписаниеЭлемента.УчитыватьВОСМС = Истина;
	ОписаниеЭлемента.УчитыватьСО = Истина;
	СоздатьЭлементВидДохода(ОписаниеЭлемента);
	
   	ОписаниеЭлемента = ОписаниеЭлементаВидаДохода();
	ОписаниеЭлемента.ИмяПредопределенныхДанных = "Дивиденды";
	ОписаниеЭлемента.Описание = НСтр("ru = 'Доходы, подлежащие выплате по акциям, части выплаты чистого дохода, распределяемые юридическим лицом между его учредителями'"); 
	ОписаниеЭлемента.УчитыватьИПН = Истина;
	СоздатьЭлементВидДохода(ОписаниеЭлемента);
	
	ОписаниеЭлемента = ОписаниеЭлементаВидаДохода();
	ОписаниеЭлемента.ИмяПредопределенныхДанных = "Выигрыши";
	ОписаниеЭлемента.Описание = НСтр("ru = 'Доходы в натуральном и денежном выражении, получаемые на конкурсах, соревнованиях (олимпиадах), фестивалях, по лотереям, розыгрышам'"); 
	ОписаниеЭлемента.УчитыватьИПН = Истина;
	СоздатьЭлементВидДохода(ОписаниеЭлемента);

	ОписаниеЭлемента = ОписаниеЭлементаВидаДохода();
	ОписаниеЭлемента.ИмяПредопределенныхДанных = "Вознаграждения";
	ОписаниеЭлемента.Описание = НСтр("ru = 'Доходы, полученные в связи с кредитом (займом, микрокредитом, долговыми ценными бумагами)'"); 
	ОписаниеЭлемента.УчитыватьИПН = Истина;
	СоздатьЭлементВидДохода(ОписаниеЭлемента);

	ОписаниеЭлемента = ОписаниеЭлементаВидаДохода();
	ОписаниеЭлемента.ИмяПредопределенныхДанных = "ПрочиеДоходы";
	ОписаниеЭлемента.Описание = НСтр("ru = 'Прочие доходы, облагаемые у источника выплаты'"); 
	ОписаниеЭлемента.УчитыватьИПН = Истина;
	СоздатьЭлементВидДохода(ОписаниеЭлемента);

	ОписаниеЭлемента = ОписаниеЭлементаВидаДохода();
	ОписаниеЭлемента.ИмяПредопределенныхДанных = "ДоходСубъектаПредпринимательства";
	ОписаниеЭлемента.Описание = НСтр("ru = 'Доход субъекта предпринимательства'"); 
	ОписаниеЭлемента.УчитыватьОПВ = Истина;
	ОписаниеЭлемента.УчитыватьВОСМС = Истина;
	ОписаниеЭлемента.УчитыватьИПН = Истина;
	ОписаниеЭлемента.УчитыватьСО = Истина;
	ОписаниеЭлемента.УчитыватьСН = Истина;
	ОписаниеЭлемента.УчитыватьОПВР = Истина;
	СоздатьЭлементВидДохода(ОписаниеЭлемента);

КонецПроцедуры

Функция ОписаниеЭлементаВидаДохода()
	Возврат Новый Структура("ИмяПредопределенныхДанных, Описание, УчитыватьИПН, УчитыватьСН, УчитыватьОПВ, УчитыватьОППВ, УчитыватьСО, УчитыватьООСМС, УчитыватьВОСМС, УчитыватьЕП, УчитыватьОПВР");	
КонецФункции	

Процедура СоздатьЭлементВидДохода(ОписаниеЭлемента)
	
	Если ЗначениеЗаполнено(ОписаниеЭлемента.ИмяПредопределенныхДанных) Тогда
		
		СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыДоходов." + ОписаниеЭлемента.ИмяПредопределенныхДанных);
		Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
			Элемент = СсылкаПредопределенного.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ВидыДоходов.СоздатьЭлемент();
			Элемент.ИмяПредопределенныхДанных = ОписаниеЭлемента.ИмяПредопределенныхДанных;
		КонецЕсли;
	
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
	Элемент.Записать();
	
КонецПроцедуры	

Процедура ЗаполнитьПризнакиВидовДоходов() Экспорт
	
	ВидДоходыОтРаботодателя = Справочники.ВидыДоходов.ДоходыОтРаботодателя.ПолучитьОбъект();
	ВидДоходыОтРаботодателя.УчитыватьВОСМС = Истина;
	ВидДоходыОтРаботодателя.УчитыватьООСМС = Истина;
	ВидДоходыОтРаботодателя.ОбменДанными.Загрузка = Истина;
	ВидДоходыОтРаботодателя.Записать();
	
	ВидДоходыОтНалоговогоАгента = Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента.ПолучитьОбъект();
	ВидДоходыОтНалоговогоАгента.УчитыватьВОСМС = Истина;
	ВидДоходыОтНалоговогоАгента.ОбменДанными.Загрузка = Истина;
	ВидДоходыОтНалоговогоАгента.Записать();

КонецПроцедуры

Процедура ЗаполнитьПризнакиВидовДоходов2024() Экспорт
	
	ВидДоходыОтРаботодателя = Справочники.ВидыДоходов.ДоходыОтРаботодателя.ПолучитьОбъект();
	ВидДоходыОтРаботодателя.УчитыватьОПВР = Истина;
	ВидДоходыОтРаботодателя.ОбменДанными.Загрузка = Истина;
	ВидДоходыОтРаботодателя.Записать();
	
	ВидДоходыОтРаботодателя = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства.ПолучитьОбъект();
	ВидДоходыОтРаботодателя.УчитыватьОПВР = Истина;
	ВидДоходыОтРаботодателя.ОбменДанными.Загрузка = Истина;
	ВидДоходыОтРаботодателя.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиВидовДоходов2025() Экспорт
	
	ВидДоходыОтРаботодателя = Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента.ПолучитьОбъект();
	ВидДоходыОтРаботодателя.УчитыватьСО = Истина;
	ВидДоходыОтРаботодателя.ОбменДанными.Загрузка = Истина;
	ВидДоходыОтРаботодателя.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиВидовДоходов2024УчитыватьЕдиныйПлатеж() Экспорт
	
	ВидДоходыОтРаботодателя = Справочники.ВидыДоходов.ДоходыОтРаботодателя.ПолучитьОбъект();
	ВидДоходыОтРаботодателя.УчитыватьЕП = Истина;
	ВидДоходыОтРаботодателя.ОбменДанными.Загрузка = Истина;
	ВидДоходыОтРаботодателя.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиДоходаИндивидуальногоПредпринимателя() Экспорт
	
	ВидДоходСубъектаПредпринимательства = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства.ПолучитьОбъект();
	ВидДоходСубъектаПредпринимательства.Описание = НСтр("ru = 'Доход субъекта предпринимательства'"); 
	ВидДоходСубъектаПредпринимательства.УчитыватьОПВ = Истина;
	ВидДоходСубъектаПредпринимательства.УчитыватьВОСМС = Истина;
	ВидДоходСубъектаПредпринимательства.УчитыватьИПН = Истина;
	ВидДоходСубъектаПредпринимательства.УчитыватьСО = Истина;
	ВидДоходСубъектаПредпринимательства.УчитыватьСН = Истина;
	ВидДоходСубъектаПредпринимательства.УчитыватьОПВР = Истина;
	ВидДоходСубъектаПредпринимательства.ОбменДанными.Загрузка = Истина;
	ВидДоходСубъектаПредпринимательства.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли