// Конвертация ЗУП 3.1.2 от 24.09.2025 14:51:42
#Область ПроцедурыКонвертации
Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
	Если КомпонентыОбмена.НаправлениеОбмена <> "Получение" Тогда
		
		ЗаполнитьЗначенияСвойств(КомпонентыОбмена.ПараметрыКонвертации, КомпонентыОбмена.УзелКорреспондента,
			"ВыгружатьСДетализациейПоФизическимЛицам");	
	
		ЗаполнитьЗначенияСвойств(КомпонентыОбмена.ПараметрыКонвертации, КомпонентыОбмена.УзелКорреспондента,
			"ОтправлятьВедомостиКакЗаявки");	
	
	    КомпонентыОбмена.ПараметрыКонвертации.ВыгружатьСДетализациейПоФизЛицамНезарплатныеДоходы = КомпонентыОбмена.УзелКорреспондента.ВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы;
	
	КонецЕсли;
КонецПроцедуры

Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт
	
КонецПроцедуры

Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
	
КонецПроцедуры

#КонецОбласти
#Область ПОД
// Заполняет таблицу правил обработки данных.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		Если ПравилаОбработкиДанных.Колонки.Найти("ОчисткаДанных") = Неопределено Тогда
			ПравилаОбработкиДанных.Колонки.Добавить("ОчисткаДанных");
		КонецЕсли;
		ДобавитьПОД_Документ_ВедомостьНаВозвратПрочихВыплат(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ВедомостьПрочихДоходовВКассу(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ВозвратСотрудникомЗадолженности(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ВыплатаДепонированнойЗарплаты(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ДепонированиеЗарплаты(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ДоговорЗаймаСотруднику_УП_От(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_НачислениеОценочныхОбязательствПоОтпускам(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ОтражениеЗарплатыВБухучете(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ПеречислениеВзносовИОтчислений(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ПлатежноеПоручение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_РегистрацияПрочихВыплат(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_РезервыПоОплатеТруда(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_СведенияОНезачисленнойЗарплате(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_СведенияОНезачисленныхВзносахОтчислениях(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_БанковскиеСчетаКонтрагентов(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_БанковскиеСчетаОрганизаций(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Валюты(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыДокументовФизическихЛиц_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыПрочихВыплат(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыРаботСотрудников_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ДокументыФизическихЛиц_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ЗППроекты_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Кассы(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_КлассификаторБанков(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_КлассификаторСтранМира(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Контрагенты(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_НастройкиРасчетаРезервовПоОплатеТруда(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Организации(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ПодразделенияОрганизаций(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Пользователи(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_РегистрацииВНалоговомОргане(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Резервы(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_СпособыОтраженияЗарплатыВБухУчете(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_СтруктураПредприятия(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ФизическиеЛица(ПравилаОбработкиДанных);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПОД_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_НачислениеОценочныхОбязательств_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ОтражениеЗарплатыВБухучете_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_РезервыПоОплатеТруда_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыРаботСотрудников_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидыРаботСотрудниковГруппа_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Организации_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Пользователи_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ФизическиеЛица_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ФизическиеЛицаГруппа(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры

#Область Отправка
#Область Документ_ВедомостьНаВозвратПрочихВыплат
Процедура ДобавитьПОД_Документ_ВедомостьНаВозвратПрочихВыплат(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ВедомостьНаВозвратПрочихВыплат";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ВедомостьНаВозвратПрочихВыплат;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВозвратПрочихВыплат");
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыВКассу
Процедура ДобавитьПОД_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ВедомостьНаВыплатуЗарплатыВКассу";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВыплатуЗарплатыВКассу");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП");
КонецПроцедуры

Процедура ПОД_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗарплатыВКассу = Ложь;
	ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ = Ложь;
	ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменЗУП31БП" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСДепонентами.Ведомость КАК Ведомость,
		|	ВзаиморасчетыСДепонентами.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТДепонирования
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
		|ГДЕ
		|	ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И ВзаиморасчетыСДепонентами.Ведомость = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВедомостьНаВыплатуЗарплатыВКассу.Номер КАК НомерВедомости,
		|	ВедомостьНаВыплатуЗарплатыВКассу.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
		|	ВедомостьНаВыплатуЗарплатыВКассу.ПериодРегистрации КАК МесяцНачисления,
		|	ВедомостьНаВыплатуЗарплатыВКассу.Подразделение КАК ПодразделениеОрганизации,
		|	СУММА(ВедомостьНаВыплатуЗарплатыВКассуЗарплата.КВыплате) КАК Сумма,
		|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.ФизическоеЛицо КАК Сотрудник,
		|	ЛОЖЬ КАК Депонент
		|ИЗ
		|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК ВедомостьНаВыплатуЗарплатыВКассу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВКассу.Зарплата КАК ВедомостьНаВыплатуЗарплатыВКассуЗарплата
		|		ПО (ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Ссылка = ВедомостьНаВыплатуЗарплатыВКассу.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДепонирования КАК Депоненты
		|		ПО (Депоненты.Ведомость = ВедомостьНаВыплатуЗарплатыВКассу.Ссылка)
		|			И (Депоненты.ФизическоеЛицо = ВедомостьНаВыплатуЗарплатыВКассуЗарплата.ФизическоеЛицо)
		|ГДЕ
		|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка = &Ссылка
		|	И Депоненты.ФизическоеЛицо ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьНаВыплатуЗарплатыВКассу.Номер,
		|	ВедомостьНаВыплатуЗарплатыВКассу.Дата,
		|	ВедомостьНаВыплатуЗарплатыВКассу.ПериодРегистрации,
		|	ВедомостьНаВыплатуЗарплатыВКассу.Подразделение,
		|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.ФизическоеЛицо
		|";
	
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
		РезультатВыборки = Запрос.Выполнить().Выгрузить();
	
		Если РезультатВыборки.Количество() = 0 Тогда
			ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗарплатыВКассу = Ложь;
		Иначе
			ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗарплатыВКассу = Истина;
		КонецЕсли;
	
	ИначеЕсли КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3" 
	        И КомпонентыОбмена.УзелКорреспондента.ОтправлятьВедомости Тогда
		
		Если Не ДанныеИБ.Проведен Тогда
			Возврат;
		КонецЕсли;
		
		ЕстьСуммаКВыплата = ЕстьСуммаКВыплата(ДанныеИБ, Ложь);
		
		Если Не КомпонентыОбмена.ПараметрыКонвертации.ОтправлятьВедомостиКакЗаявки Тогда
			ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП = ЕстьСуммаКВыплата;
		ИначеЕсли КомпонентыОбмена.ПараметрыКонвертации.ОтправлятьВедомостиКакЗаявки Тогда
			ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ = ЕстьСуммаКВыплата;
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком
Процедура ДобавитьПОД_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыРаздатчиком;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВыплатуЗарплатыРаздатчик");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВыплатуЗарплатыРаздатчик");
КонецПроцедуры

Процедура ПОД_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗарплатыРаздатчик = Ложь;
	ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменЗУП31БП" Тогда
		ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗарплатыРаздатчик = Истина;
	ИначеЕсли КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3" Тогда
		ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьПрочихДоходовВКассу
Процедура ДобавитьПОД_Документ_ВедомостьПрочихДоходовВКассу(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ВедомостьПрочихДоходовВКассу";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ВедомостьПрочихДоходовВКассу;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ВедомостьПрочихДоходовВКассу_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьПрочихДоходовВКассу");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьПрочихДоходовВКассу_УП_От");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП");
КонецПроцедуры

Процедура ПОД_Документ_ВедомостьПрочихДоходовВКассу_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ВедомостьПрочихДоходовВКассу = Ложь;
	ИспользованиеПКО.Документ_ВедомостьПрочихДоходовВКассу_УП_От = Ложь;
	ИспользованиеПКО.Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменЗУП31БП" Тогда
		Если ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.ВыплатаПрочихДоходов
			ИЛИ ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.ВыплатыБывшимСотрудникам Тогда
			ИспользованиеПКО.Документ_ВедомостьПрочихДоходовВКассу = Истина;
		КонецЕсли;
	ИначеЕсли КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3"
	  		И КомпонентыОбмена.УзелКорреспондента.ОтправлятьВедомости Тогда
		Если ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.ВыплатаПрочихДоходов 
			ИЛИ ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.ВыплатыБывшимСотрудникам Тогда
	
			Если Не ДанныеИБ.Проведен Тогда
				Возврат;
			КонецЕсли;
			
			ЕстьСуммаКВыплата = ЕстьСуммаКВыплата(ДанныеИБ, Истина);
			 
			Если НЕ КомпонентыОбмена.ПараметрыКонвертации.ОтправлятьВедомостиКакЗаявки Тогда
				ИспользованиеПКО.Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП = ЕстьСуммаКВыплата;
			ИначеЕсли КомпонентыОбмена.ПараметрыКонвертации.ОтправлятьВедомостиКакЗаявки Тогда
				ИспользованиеПКО.Документ_ВедомостьПрочихДоходовВКассу_УП_От = ЕстьСуммаКВыплата;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ВозвратСотрудникомЗадолженности
Процедура ДобавитьПОД_Документ_ВозвратСотрудникомЗадолженности(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ВозвратСотрудникомЗадолженности";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ВозвратСотрудникомЗадолженности;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ВозвратСотрудникомЗадолженности_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВозвратСотрудникомЗадолженности");
КонецПроцедуры

Процедура ПОД_Документ_ВозвратСотрудникомЗадолженности_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратСотрудникомЗадолженности.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВозвратСотрудникомЗадолженности КАК ВозвратСотрудникомЗадолженности
	|ГДЕ
	|	ВозвратСотрудникомЗадолженности.Ссылка = &Ссылка
	|	И ВозвратСотрудникомЗадолженности.ФормаРасчетов = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		ИспользованиеПКО.Документ_ВозвратСотрудникомЗадолженности = Истина;
	Иначе
		ИспользованиеПКО.Документ_ВозвратСотрудникомЗадолженности = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ВыплатаДепонированнойЗарплаты
Процедура ДобавитьПОД_Документ_ВыплатаДепонированнойЗарплаты(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ВыплатаДепонированнойЗарплаты";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ВыплатаДепонированнойЗарплаты;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ВыплатаДепонированнойЗарплаты_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВыплатаДепонированнойЗарплаты_Касса");
КонецПроцедуры

Процедура ПОД_Документ_ВыплатаДепонированнойЗарплаты_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	//ИспользованиеПКО.Документ_ВыплатаДепонированнойЗарплаты_Раздатчик = Ложь;
	//ИспользованиеПКО.Документ_ВыплатаДепонированнойЗарплаты_Касса = Ложь;
	
	//Если ДанныеИБ.ФормаРасчетов = Перечисления.ФормыОплаты.Безналичная Тогда
	//	ИспользованиеПКО.Документ_ВыплатаДепонированнойЗарплаты_Раздатчик = Истина;
	//Иначе
	//	ИспользованиеПКО.Документ_ВыплатаДепонированнойЗарплаты_Касса = Истина;
	//КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ДепонированиеЗарплаты
Процедура ДобавитьПОД_Документ_ДепонированиеЗарплаты(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ДепонированиеЗарплаты";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ДепонированиеЗарплаты;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ДепонированиеЗарплаты");
КонецПроцедуры
#КонецОбласти
#Область Документ_ДоговорЗаймаСотруднику_УП_От
Процедура ДобавитьПОД_Документ_ДоговорЗаймаСотруднику_УП_От(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ДоговорЗаймаСотруднику_УП_От";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ДоговорЗаймаСотруднику;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ДоговорЗаймаСотруднику_УП_От");
КонецПроцедуры

Процедура ПОД_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ДоговорЗаймаСотруднику_УП_От = Ложь;
КонецПроцедуры
#КонецОбласти
#Область Документ_НачислениеОценочныхОбязательствПоОтпускам
Процедура ДобавитьПОД_Документ_НачислениеОценочныхОбязательствПоОтпускам(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_НачислениеОценочныхОбязательствПоОтпускам";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_НачислениеОценочныхОбязательствПоОтпускам");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_НачислениеОценочныхОбязательств_БК_ОТ");
КонецПроцедуры

Процедура ПОД_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_НачислениеОценочныхОбязательств_БК_ОТ = Ложь;
	ИспользованиеПКО.Документ_НачислениеОценочныхОбязательствПоОтпускам = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменЗУП31БП" Тогда
		ИспользованиеПКО.Документ_НачислениеОценочныхОбязательств_БК_ОТ = Истина;
	ИначеЕсли КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3" Тогда
		ИспользованиеПКО.Документ_НачислениеОценочныхОбязательствПоОтпускам = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ОтражениеЗарплатыВБухучете
Процедура ДобавитьПОД_Документ_ОтражениеЗарплатыВБухучете(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ОтражениеЗарплатыВБухучете";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ОтражениеЗарплатыВБухучете;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ОтражениеЗарплатыВБухучете_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ОтражениеЗарплатыВБухучете");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ОтражениеЗарплатыВБухучете_УП_От");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ОтражениеЗарплатыВБухучете");
КонецПроцедуры

Процедура ПОД_Документ_ОтражениеЗарплатыВБухучете_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ОтражениеЗарплатыВБухучете = Ложь;
	ИспользованиеПКО.Документ_ОтражениеЗарплатыВБухучете_УП_От = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменЗУП31БП" Тогда
		ИспользованиеПКО.Документ_ОтражениеЗарплатыВБухучете = Истина;
	ИначеЕсли КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3" Тогда
		ИспользованиеПКО.Документ_ОтражениеЗарплатыВБухучете_УП_От = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ПеречислениеВзносовИОтчислений
Процедура ДобавитьПОД_Документ_ПеречислениеВзносовИОтчислений(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ПеречислениеВзносовИОтчислений";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ПеречислениеВзносовИОтчислений;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ПеречислениеВзносовИОтчислений_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПеречислениеВзносовИОтчислений");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПеречислениеВзносовИОтчислений_УП_ОТ");
КонецПроцедуры

Процедура ПОД_Документ_ПеречислениеВзносовИОтчислений_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ПеречислениеВзносовИОтчислений = Ложь;
	ИспользованиеПКО.Документ_ПеречислениеВзносовИОтчислений_УП_ОТ = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменЗУП31БП" Тогда
		ИспользованиеПКО.Документ_ПеречислениеВзносовИОтчислений = Истина;
	ИначеЕсли КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3" Тогда
		ИспользованиеПКО.Документ_ПеречислениеВзносовИОтчислений_УП_ОТ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ПлатежноеПоручение
Процедура ДобавитьПОД_Документ_ПлатежноеПоручение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ПлатежноеПоручение";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ПлатежноеПоручение;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ПлатежноеПоручение_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПлатежноеПоручение");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПлатежноеПоручение_УП_ОТ");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПлатежноеПоручениеПДПеречислением_Заявка");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ВедомостьНаВыплатуЗППеречислением_Заявка");
КонецПроцедуры

Процедура ПОД_Документ_ПлатежноеПоручение_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ПлатежноеПоручение = Ложь;
	    ИспользованиеПКО.Документ_ПлатежноеПоручение_УП_ОТ = Ложь;
	    ИспользованиеПКО.Документ_ПлатежноеПоручениеПДПеречислением_Заявка = Ложь;
	   	ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗППеречислением_Заявка = Ложь; 
	   	
	    Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменЗУП31БП" Тогда
	        Если ДанныеИБ.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов") Тогда
	            Если ДанныеИБ.Ведомости.Количество() > 0 Тогда
	                СпособВыплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.Ведомости[0].Ведомость, "СпособВыплаты");
	                Если СпособВыплаты = ПредопределенноеЗначение("Перечисление.СпособыВыплатыПрочихДоходов.ВыплатаПрочихДоходов")
	               		ИЛИ СпособВыплаты = ПредопределенноеЗначение("Перечисление.СпособыВыплатыПрочихДоходов.ВыплатыБывшимСотрудникам") Тогда
	                    ИспользованиеПКО.Документ_ПлатежноеПоручение = Истина;
	                Иначе
	                    ИспользованиеПКО.Документ_ПлатежноеПоручение = Ложь;
	                КонецЕсли;
	            КонецЕсли;
	        Иначе
	            ИспользованиеПКО.Документ_ПлатежноеПоручение = Истина;
	        КонецЕсли;
	    ИначеЕсли КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3"
	        И КомпонентыОбмена.УзелКорреспондента.ОтправлятьВедомости Тогда
	        Если ДанныеИБ.Ведомости.Количество() > 0 Тогда
	            Если ДанныеИБ.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов") Тогда
	                Если ТипЗнч(ДанныеИБ.Ведомости[0].Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
	                    ИспользованиеПКО.Документ_ПлатежноеПоручение_УП_ОТ = Истина;
	                ИначеЕсли ТипЗнч(ДанныеИБ.Ведомости[0].Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
	                    ИспользованиеПКО.Документ_ПлатежноеПоручениеПДПеречислением_Заявка = Истина;
	                КонецЕсли;
	            ИначеЕсли ДанныеИБ.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты") Тогда
	                Если ТипЗнч(ДанныеИБ.Ведомости[0].Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк") Тогда
	                    ИспользованиеПКО.Документ_ПлатежноеПоручение_УП_ОТ = Истина;
	                ИначеЕсли ТипЗнч(ДанныеИБ.Ведомости[0].Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
	                    ИспользованиеПКО.Документ_ВедомостьНаВыплатуЗППеречислением_Заявка = Истина;
	                КонецЕсли;
	            КонецЕсли;
	        КонецЕсли;  
	    КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_РегистрацияПрочихВыплат
Процедура ДобавитьПОД_Документ_РегистрацияПрочихВыплат(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_РегистрацияПрочихВыплат";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.РегистрацияПрочихВыплат;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_РегистрацияПрочихВыплат");
КонецПроцедуры
#КонецОбласти
#Область Документ_РезервыПоОплатеТруда
Процедура ДобавитьПОД_Документ_РезервыПоОплатеТруда(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_РезервыПоОплатеТруда";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.РезервыПоОплатеТруда;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_РезервыПоОплатеТруда");
КонецПроцедуры
#КонецОбласти
#Область Документ_СведенияОНезачисленнойЗарплате
Процедура ДобавитьПОД_Документ_СведенияОНезачисленнойЗарплате(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_СведенияОНезачисленнойЗарплате";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.СведенияОНезачисленнойЗарплате;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_СведенияОНезачисленнойЗарплате_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_СведенияОНезачисленнойЗарплате");
КонецПроцедуры

Процедура ПОД_Документ_СведенияОНезачисленнойЗарплате_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОНезачисленнойЗарплате.Ведомость КАК Ведомость
	|ИЗ
	|	Документ.СведенияОНезачисленнойЗарплате КАК СведенияОНезачисленнойЗарплате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
	|		ПО (СведенияОНезачисленнойЗарплате.Ведомость = ПлатежноеПоручениеВедомости.Ведомость)
	|ГДЕ
	|	СведенияОНезачисленнойЗарплате.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда  
	    Пока Выборка.Следующий() Цикл
	        Если ТипЗнч(Выборка.Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением")
	            ИЛИ ТипЗнч(Выборка.Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк") Тогда
	            ИспользованиеПКО.Документ_СведенияОНезачисленнойЗарплате = Истина;  
	        Иначе
	            ИспользованиеПКО.Документ_СведенияОНезачисленнойЗарплате = Ложь;
	        КонецЕсли;        	
	    КонецЦикла; 		
	Иначе
		ИспользованиеПКО.Документ_СведенияОНезачисленнойЗарплате = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_СведенияОНезачисленныхВзносахОтчислениях
Процедура ДобавитьПОД_Документ_СведенияОНезачисленныхВзносахОтчислениях(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_СведенияОНезачисленныхВзносахОтчислениях";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.СведенияОНезачисленныхВзносахОтчислениях;
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_СведенияОНезачисленныхВзносахОтчислениях");
КонецПроцедуры

Процедура ПОД_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОНезачисленныхВзносахОтчислениях.Ведомость КАК Ведомость
	|ИЗ
	|	Документ.СведенияОНезачисленныхВзносахОтчислениях КАК СведенияОНезачисленныхВзносахОтчислениях
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеречислениеВзносовИОтчислений.ВедомостиНаПеречислениеВзносовИОтчислений КАК ПеречислениеВзносовИОтчислений
	|		ПО СведенияОНезачисленныхВзносахОтчислениях.Ведомость = ПеречислениеВзносовИОтчислений.Ведомость
	|ГДЕ
	|	СведенияОНезачисленныхВзносахОтчислениях.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		ИспользованиеПКО.Документ_СведенияОНезачисленныхВзносахОтчислениях = Истина;
	Иначе
		ИспользованиеПКО.Документ_СведенияОНезачисленныхВзносахОтчислениях = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_БанковскиеСчетаКонтрагентов
Процедура ДобавитьПОД_Справочник_БанковскиеСчетаКонтрагентов(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_БанковскиеСчетаКонтрагентов";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.БанковскиеСчетаКонтрагентов;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_БанковскиеСчетаКонтрагентов");
КонецПроцедуры
#КонецОбласти
#Область Справочник_БанковскиеСчетаОрганизаций
Процедура ДобавитьПОД_Справочник_БанковскиеСчетаОрганизаций(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_БанковскиеСчетаОрганизаций";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.БанковскиеСчетаОрганизаций;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_БанковскиеСчетаОрганизаций");
КонецПроцедуры
#КонецОбласти
#Область Справочник_Валюты
Процедура ДобавитьПОД_Справочник_Валюты(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Валюты";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Валюты;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Валюты");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыДокументовФизическихЛиц_Отправка
Процедура ДобавитьПОД_Справочник_ВидыДокументовФизическихЛиц_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ВидыДокументовФизическихЛиц_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыДокументовФизическихЛиц;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыДокументовФизическихЛиц_Отправка");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыПрочихВыплат
Процедура ДобавитьПОД_Справочник_ВидыПрочихВыплат(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ВидыПрочихВыплат";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыПрочихВыплат;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыПрочихВыплат");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыРаботСотрудников_Отправка
Процедура ДобавитьПОД_Справочник_ВидыРаботСотрудников_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ВидыРаботСотрудников_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыРаботСотрудников;
	ПравилоОбработки.ПриОбработке = "ПОД_Справочник_ВидыРаботСотрудников_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыРаботСотрудников");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыРаботСотрудниковГруппа");
КонецПроцедуры

Процедура ПОД_Справочник_ВидыРаботСотрудников_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_ВидыРаботСотрудников = Ложь;
	ИспользованиеПКО.Справочник_ВидыРаботСотрудниковГруппа = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3" Тогда
		ИспользованиеПКО.Справочник_ВидыРаботСотрудников		= Не ДанныеИБ.ЭтоГруппа;
		ИспользованиеПКО.Справочник_ВидыРаботСотрудниковГруппа	= ДанныеИБ.ЭтоГруппа;
	КонецЕсли
КонецПроцедуры
#КонецОбласти
#Область Справочник_ДокументыФизическихЛиц_Отправка
Процедура ДобавитьПОД_Справочник_ДокументыФизическихЛиц_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ДокументыФизическихЛиц_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	ПравилоОбработки.ПриОбработке = "ПОД_Справочник_ДокументыФизическихЛиц_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ДокументыФизическихЛиц_Отправка");
КонецПроцедуры

Процедура ПОД_Справочник_ДокументыФизическихЛиц_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	//Если ИспользованиеПКО.Свойство("Справочник_ДокументыФизическихЛиц_Отправка")
	//	И (Не СвойствоФорматаОбмена(КомпонентыОбмена, "Справочник.ДокументыФизическихЛиц")
	//		Или ТипЗнч(ДанныеИБ.Отбор.Физлицо.Значение) = Тип("СправочникСсылка.Контрагенты")) Тогда
	//	ИспользованиеПКО.Удалить("Справочник_ДокументыФизическихЛиц_Отправка");
	//КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ЗППроекты_Отправка
Процедура ДобавитьПОД_Справочник_ЗППроекты_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ЗППроекты_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ЗарплатныеПроекты;
	ПравилоОбработки.ПриОбработке = "ПОД_Справочник_ЗППроекты_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ЗППроекты_КакБанковскиеСчета");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ЗППроекты_КакКонтрагенты");
КонецПроцедуры

Процедура ПОД_Справочник_ЗППроекты_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_ЗППроекты_КакБанковскиеСчета = Ложь;
	ИспользованиеПКО.Справочник_ЗППроекты_КакКонтрагенты = Ложь; 
	ИспользованиеПКО.Справочник_ЗППроектыБК_КакБанковскиеСчета = Ложь;
	
	Если КомпонентыОбмена.УзелКорреспондента.ВариантНастройки = "ОбменУП2ЗУП3" Тогда
		ИспользованиеПКО.Справочник_ЗППроекты_КакБанковскиеСчета = Истина;
		ИспользованиеПКО.Справочник_ЗППроекты_КакКонтрагенты = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Кассы
Процедура ДобавитьПОД_Справочник_Кассы(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Кассы";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Кассы;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Кассы");
КонецПроцедуры
#КонецОбласти
#Область Справочник_КлассификаторБанков
Процедура ДобавитьПОД_Справочник_КлассификаторБанков(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_КлассификаторБанков";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.КлассификаторБанков;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_КлассификаторБанков");
КонецПроцедуры
#КонецОбласти
#Область Справочник_КлассификаторСтранМира
Процедура ДобавитьПОД_Справочник_КлассификаторСтранМира(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_КлассификаторСтранМира";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.СтраныМира;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_КлассификаторСтранМира");
КонецПроцедуры
#КонецОбласти
#Область Справочник_Контрагенты
Процедура ДобавитьПОД_Справочник_Контрагенты(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Контрагенты";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Контрагенты;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Контрагенты");
КонецПроцедуры
#КонецОбласти
#Область Справочник_НастройкиРасчетаРезервовПоОплатеТруда
Процедура ДобавитьПОД_Справочник_НастройкиРасчетаРезервовПоОплатеТруда(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_НастройкиРасчетаРезервовПоОплатеТруда";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.НастройкиРасчетаРезервовПоОплатеТруда;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_НастройкиРасчетаРезервовПоОплатеТруда");
КонецПроцедуры
#КонецОбласти
#Область Справочник_Организации
Процедура ДобавитьПОД_Справочник_Организации(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Организации";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Организации;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Организации");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ПодразделенияОрганизаций
Процедура ДобавитьПОД_Справочник_ПодразделенияОрганизаций(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ПодразделенияОрганизаций";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ПодразделенияОрганизаций;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ПодразделенияОрганизаций");
КонецПроцедуры
#КонецОбласти
#Область Справочник_Пользователи
Процедура ДобавитьПОД_Справочник_Пользователи(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Пользователи";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Пользователи;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Пользователи");
КонецПроцедуры
#КонецОбласти
#Область Справочник_РегистрацииВНалоговомОргане
Процедура ДобавитьПОД_Справочник_РегистрацииВНалоговомОргане(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_РегистрацииВНалоговомОргане";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.РегистрацииВНалоговомОргане;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_РегистрацииВНалоговомОргане");
КонецПроцедуры
#КонецОбласти
#Область Справочник_Резервы
Процедура ДобавитьПОД_Справочник_Резервы(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Резервы";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Резервы;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Резервы");
КонецПроцедуры
#КонецОбласти
#Область Справочник_СпособыОтраженияЗарплатыВБухУчете
Процедура ДобавитьПОД_Справочник_СпособыОтраженияЗарплатыВБухУчете(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.СпособыОтраженияЗарплатыВБухУчете;
	ПравилоОбработки.ПриОбработке = "ПОД_Справочник_СпособыОтраженияЗарплатыВБухУчете_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_СпособыОтраженияЗарплатыВБухУчете");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа");
КонецПроцедуры

Процедура ПОД_Справочник_СпособыОтраженияЗарплатыВБухУчете_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_СпособыОтраженияЗарплатыВБухУчете = НЕ (ДанныеИБ.ЭтоГруппа);
	ИспользованиеПКО.Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа = (ДанныеИБ.ЭтоГруппа);
КонецПроцедуры
#КонецОбласти
#Область Справочник_СтруктураПредприятия
Процедура ДобавитьПОД_Справочник_СтруктураПредприятия(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_СтруктураПредприятия";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.СтруктураПредприятия;
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_СтруктураПредприятия");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ФизическиеЛица
Процедура ДобавитьПОД_Справочник_ФизическиеЛица(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ФизическиеЛица";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.ФизическиеЛица;
	ПравилоОбработки.ПриОбработке = "ПОД_Справочник_ФизическиеЛица_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ФизическиеЛица");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ФизическиеЛицаГруппа");
КонецПроцедуры

Процедура ПОД_Справочник_ФизическиеЛица_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_ФизическиеЛицаГруппа = (ДанныеИБ.ЭтоГруппа);
	ИспользованиеПКО.Справочник_ФизическиеЛица = НЕ (ДанныеИБ.ЭтоГруппа);
КонецПроцедуры
#КонецОбласти
#КонецОбласти
#Область Получение
#Область Документ_ДанныеДляРасчетаЗарплаты_УП_Получение
Процедура ДобавитьПОД_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ДанныеДляРасчетаЗарплаты_УП_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Документ.ВыработкаСотрудников";
	ПравилоОбработки.ПриОбработке = "ПОД_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриОбработке";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ДанныеДляРасчетаЗарплаты_УП_Получение");
КонецПроцедуры

Процедура ПОД_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	ВидДокумента = ВидДокументаСдельныеРаботы(КомпонентыОбмена, Справочники.Организации.ПустаяСсылка());
	Если ВидДокумента.Пустая() Тогда
		// Не введено ни одного шаблона для ввода данных по сдельным работам.
		ИспользованиеПКО.Документ_ДанныеДляРасчетаЗарплаты_УП_Получение = Ложь;
		
		ТекстПредупреждения = НСтр("ru = 'Данные для расчета зарплаты (выработка сотрудников) не могут быть загружены,
		|т.к. в справочнике ""Шаблоны ввода исходных данных"" нет ни одного элемента, соответствующего сдельным работам.'");
		
		КомпонентыОбмена.СостояниеОбменаДанными.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями; 
		ОбменДаннымиXDTOСервер.ЗаписатьВПротоколВыполнения(КомпонентыОбмена, ТекстПредупреждения, , Ложь, , , );
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_НачислениеОценочныхОбязательств_Получение
Процедура ДобавитьПОД_Документ_НачислениеОценочныхОбязательств_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_НачислениеОценочныхОбязательств_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_НачислениеОценочныхОбязательств_Получение");
КонецПроцедуры
#КонецОбласти
#Область Документ_ОтражениеЗарплатыВБухучете_Получение
Процедура ДобавитьПОД_Документ_ОтражениеЗарплатыВБухучете_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_ОтражениеЗарплатыВБухучете_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Документ.ОтражениеЗарплатыВФинансовомУчете";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ОтражениеЗарплатыВБухучете_Получение");
КонецПроцедуры
#КонецОбласти
#Область Документ_РезервыПоОплатеТруда_Получение
Процедура ДобавитьПОД_Документ_РезервыПоОплатеТруда_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Документ_РезервыПоОплатеТруда_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Документ.РезервыПоОплатеТруда";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_РезервыПоОплатеТруда_Получение");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыРаботСотрудников_Получение
Процедура ДобавитьПОД_Справочник_ВидыРаботСотрудников_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ВидыРаботСотрудников_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Справочник.ВидыРаботСотрудников";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыРаботСотрудников");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыРаботСотрудниковГруппа_Получение
Процедура ДобавитьПОД_Справочник_ВидыРаботСотрудниковГруппа_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ВидыРаботСотрудниковГруппа_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Справочник.ВидыРаботСотрудниковГруппа";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ВидыРаботСотрудниковГруппа");
КонецПроцедуры
#КонецОбласти
#Область Справочник_Организации_Получение
Процедура ДобавитьПОД_Справочник_Организации_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Организации_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Справочник.Организации";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Организации_Получение");
КонецПроцедуры
#КонецОбласти
#Область Справочник_Пользователи_Получение
Процедура ДобавитьПОД_Справочник_Пользователи_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_Пользователи_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Справочник.Пользователи";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_Пользователи_Получение");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ФизическиеЛица_Получение
Процедура ДобавитьПОД_Справочник_ФизическиеЛица_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ФизическиеЛица_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат = "Справочник.ФизическиеЛица";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ФизическиеЛица_Получение");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ФизическиеЛицаГруппа
Процедура ДобавитьПОД_Справочник_ФизическиеЛицаГруппа(ПравилаОбработкиДанных)
	ПравилоОбработки = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ФизическиеЛицаГруппа";
	ПравилоОбработки.ОбъектВыборкиФормат = "Справочник.ФизическиеЛицаГруппа";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ФизическиеЛицаГруппа");
КонецПроцедуры
#КонецОбласти
#КонецОбласти

#КонецОбласти
#Область ПКО
// Заполняет таблицу правил конвертации объектов.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаКонвертации - таблица значений, в которую добавляются правила. 
Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПКО_Документ_ВедомостьНаВозвратПрочихВыплат(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчик(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьНаВыплатуЗППеречислением_Заявка(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьПрочихДоходовВКассу(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВедомостьПрочихДоходовВКассу_УП_От(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВозвратСотрудникомЗадолженности(ПравилаКонвертации);
		ДобавитьПКО_Документ_ВыплатаДепонированнойЗарплаты_Касса(ПравилаКонвертации);
		ДобавитьПКО_Документ_ДепонированиеЗарплаты(ПравилаКонвертации);
		ДобавитьПКО_Документ_ДоговорЗаймаСотруднику_УП_От(ПравилаКонвертации);
		ДобавитьПКО_Документ_НачислениеОценочныхОбязательств_БК_ОТ(ПравилаКонвертации);
		ДобавитьПКО_Документ_НачислениеОценочныхОбязательствПоОтпускам(ПравилаКонвертации);
		ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете(ПравилаКонвертации);
		ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете_УП_От(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПеречислениеВзносовИОтчислений(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПеречислениеВзносовИОтчислений_УП_ОТ(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПлатежноеПоручение(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПлатежноеПоручение_УП_ОТ(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПлатежноеПоручениеПДПеречислением_Заявка(ПравилаКонвертации);
		ДобавитьПКО_Документ_РегистрацияПрочихВыплат(ПравилаКонвертации);
		ДобавитьПКО_Документ_РезервыПоОплатеТруда(ПравилаКонвертации);
		ДобавитьПКО_Документ_СведенияОНезачисленнойЗарплате(ПравилаКонвертации);
		ДобавитьПКО_Документ_СведенияОНезачисленныхВзносахОтчислениях(ПравилаКонвертации);
		ДобавитьПКО_Справочник_БанковскиеСчетаКонтрагентов(ПравилаКонвертации);
		ДобавитьПКО_Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры(ПравилаКонвертации);
		ДобавитьПКО_Справочник_БанковскиеСчетаОрганизаций(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Валюты(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидыДокументовФизическихЛиц_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидыПрочихВыплат(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ДокументыФизическихЛиц_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЗППроекты_КакБанковскиеСчета(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЗППроекты_КакКонтрагенты(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Кассы(ПравилаКонвертации);
		ДобавитьПКО_Справочник_КлассификаторБанков(ПравилаКонвертации);
		ДобавитьПКО_Справочник_КлассификаторСтранМира(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Контрагенты(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Контрагенты_ИзСтруктуры(ПравилаКонвертации);
		ДобавитьПКО_Справочник_НастройкиРасчетаРезервовПоОплатеТруда(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Организации(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Подразделения(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Подразделения_ИзСтруктуры(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ПодразделенияОрганизаций(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Пользователи(ПравилаКонвертации);
		ДобавитьПКО_Справочник_РегистрацииВНалоговомОргане(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Резервы(ПравилаКонвертации);
		ДобавитьПКО_Справочник_СпособыОтраженияЗарплатыВБухУчете(ПравилаКонвертации);
		ДобавитьПКО_Справочник_СтруктураПредприятия(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ФизическиеЛица(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ФизическоеЛицо_ИзСтруктуры(ПравилаКонвертации);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПКО_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_НачислениеОценочныхОбязательств_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_РезервыПоОплатеТруда_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Организации_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Пользователи_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ФизическиеЛица_Получение(ПравилаКонвертации);
	КонецЕсли;
	ДобавитьПКО_Справочник_ВидыРаботСотрудников(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ВидыРаботСотрудниковГруппа(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ДополнительныеРеквизиты(ПравилаКонвертации);
	ДобавитьПКО_Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ФизическиеЛицаГруппа(ПравилаКонвертации);
КонецПроцедуры

#Область Отправка
#Область Документ_ВедомостьНаВозвратПрочихВыплат
Процедура ДобавитьПКО_Документ_ВедомостьНаВозвратПрочихВыплат(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьНаВозвратПрочихВыплат";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьНаВозвратПрочихВыплат;
	ПравилоКонвертации.ОбъектФормата = "Документ.ВедомостьНаВозвратПрочихВыплат";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВозвратПрочихВыплат_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидПрочихВыплат";
	НоваяСтрока.СвойствоФормата = "ВидПрочихВыплат";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыПрочихВыплат";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДокументОснование";
	НоваяСтрока.СвойствоФормата = "ДокументОснование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаДокумента";
	НоваяСтрока.СвойствоФормата = "СуммаДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ПрочиеВыплаты", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ПрочиеВыплаты;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВозвратЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВозвратЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПериодВзаиморасчетов";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьНаВозвратПрочихВыплат_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежноеПоручениеВедомости.Ссылка.Контрагент КАК Контрагент,
		|	ПлатежноеПоручениеВедомости.Ссылка.БанковскийСчет КАК БанковскийСчет,
		|	ПлатежноеПоручениеВедомости.Ссылка.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
		|	ПлатежноеПоручениеВедомости.Ссылка.КодНазначенияПлатежа КАК КодНазначенияПлатежа,
		|	ПлатежноеПоручениеВедомости.Ссылка.НазначениеПлатежа КАК НазначениеПлатежа
		|ИЗ
		|	Документ.ВедомостьНаВозвратПрочихВыплат КАК ВедомостьНаВозвратПрочихВыплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеВедомости
		|		ПО (ВедомостьНаВозвратПрочихВыплат.ДокументОснование = ПлатежноеПоручениеВедомости.Ведомость)
		|ГДЕ
		|	ВедомостьНаВозвратПрочихВыплат.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			Пока Выборка.Следующий() Цикл
				ДанныеXDTO.Вставить("БанковскийСчетОрганизации", Выборка.БанковскийСчет);
				ДанныеXDTO.Вставить("БанковскийСчет", Выборка.БанковскийСчетКонтрагента);
				ДанныеXDTO.Вставить("НазначениеПлатежа", Выборка.НазначениеПлатежа);
				ДанныеXDTO.Вставить("КодНазначенияПлатежа", Выборка.КодНазначенияПлатежа);
			КонецЦикла;
		КонецЕсли; 
			
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Ссылка.Дата КАК ДатаВедомостиНаВозвратЗарплаты,
		|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Ссылка.Номер КАК НомерВедомостиНаВозвратЗарплаты,
		|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	СУММА(ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ВедомостьНаВозвратПрочихВыплат КАК ВедомостьНаВозвратПрочихВыплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВозвратПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты
		|		ПО (ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Ссылка = ВедомостьНаВозвратПрочихВыплат.Ссылка)
		|
		|ГДЕ
		|	ВедомостьНаВозвратПрочихВыплат.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ФизическоеЛицо,
		|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов,
	    |	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Ссылка.Дата,
		|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Ссылка.Номер";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
		
		ПрочиеВыплаты = Запрос.Выполнить().Выгрузить();
		
		ДанныеXDTO.Вставить("ПрочиеВыплаты",ПрочиеВыплаты);     
		
		ДанныеXDTO.Вставить("СуммаДокумента", ДанныеXDTO.ПрочиеВыплаты.Итог("Сумма"));
		
		ДанныеXDTO.Вставить("Валюта", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
		
		ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"П" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыВКассу
Процедура ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьНаВыплатуЗарплатыВКассу";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу;
	ПравилоКонвертации.ОбъектФормата = "Документ.РКОВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Касса";
	НоваяСтрока.СвойствоФормата = "Касса";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Кассы";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Депонент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентами.Ведомость КАК Ведомость,
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТДепонирования
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ВзаиморасчетыСДепонентами.Ведомость = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыВКассу.Номер КАК НомерВедомости,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	ВедомостьНаВыплатуЗарплатыВКассу.ПериодРегистрации КАК МесяцНачисления,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Подразделение КАК ПодразделениеОрганизации,
	|	СУММА(ВедомостьНаВыплатуЗарплатыВКассуЗарплата.КВыплате) КАК Сумма,
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.ФизическоеЛицо КАК Сотрудник,
	|	ЛОЖЬ КАК Депонент
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу КАК ВедомостьНаВыплатуЗарплатыВКассу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВКассу.Зарплата КАК ВедомостьНаВыплатуЗарплатыВКассуЗарплата
	|		ПО (ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Ссылка = ВедомостьНаВыплатуЗарплатыВКассу.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДепонирования КАК Депоненты
	|		ПО (Депоненты.Ведомость = ВедомостьНаВыплатуЗарплатыВКассу.Ссылка)
	|			И (Депоненты.ФизическоеЛицо = ВедомостьНаВыплатуЗарплатыВКассуЗарплата.ФизическоеЛицо)
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВКассу.Ссылка = &Ссылка
	|	И Депоненты.ФизическоеЛицо ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуЗарплатыВКассу.Номер,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Дата,
	|	ВедомостьНаВыплатуЗарплатыВКассу.ПериодРегистрации,
	|	ВедомостьНаВыплатуЗарплатыВКассу.Подразделение,
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.ФизическоеЛицо
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаПлатежа.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	
	//Статус, Валюта
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	Для Каждого Строка Из РасшифровкаПлатежа Цикл
		НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"К" + Прав(Строка.НомерВедомости, 5);
		Строка.НомерВедомостиНаВыплатуЗарплаты = НомерВедомостиНаВыплатуЗарплаты;
		Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
	КонецЦикла;
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
	ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"К" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыРаздатчик
Процедура ДобавитьПКО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчик(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьНаВыплатуЗарплатыРаздатчик";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыРаздатчиком;
	ПравилоКонвертации.ОбъектФормата = "Документ.АвансовыйОтчет";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчик_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Раздатчик";
	НоваяСтрока.СвойствоФормата = "ПодотчетноеЛицо";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Депонент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчик_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	//Статус, Валюта
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Номер КАК НомерВедомости,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Подразделение КАК ПодразделениеОрганизации,
	|	СУММА(ВедомостьНаВыплатуЗарплатыРаздатчикомЗарплата.КВыплате) КАК Сумма,
	|	ВедомостьНаВыплатуЗарплатыРаздатчикомЗарплата.ФизическоеЛицо КАК Сотрудник,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.ПериодРегистрации КАК МесяцНачисления,
	|	ЛОЖЬ КАК Депонент
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком КАК ВедомостьНаВыплатуЗарплатыРаздатчиком
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Зарплата КАК ВедомостьНаВыплатуЗарплатыРаздатчикомЗарплата
	|		ПО (ВедомостьНаВыплатуЗарплатыРаздатчикомЗарплата.Ссылка = ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка)
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Номер,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Дата,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.Подразделение,
	|	ВедомостьНаВыплатуЗарплатыРаздатчиком.ПериодРегистрации,
	|	ВедомостьНаВыплатуЗарплатыРаздатчикомЗарплата.ФизическоеЛицо";                           
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	РасшифровкаПлатежа.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	
	Для Каждого Строка Из РасшифровкаПлатежа Цикл
		НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"А" + Прав(Строка.НомерВедомости, 5);
		Строка.НомерВедомостиНаВыплатуЗарплаты = НомерВедомостиНаВыплатуЗарплаты;
		Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
	КонецЦикла;
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа",РасшифровкаПлатежа);
	
	ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП
Процедура ДобавитьПКО_Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Касса";
	НоваяСтрока.СвойствоФормата = "Касса";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Кассы";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		//Статус, Валюта
		ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
		
		//Подразделение
		Подразделение = УправленческоеПодразделениеВедомостиНаВыплатуЗП(ДанныеИБ);
		ДанныеXDTO.Вставить("Подразделение", ЗначениеВИнструкциюПКО(КомпонентыОбмена, Подразделение));
		
		//ЖелательнаяФормаОплатыНаличные, ЖелательнаяФормаОплатыБезналичные, ЖелательнаяФормаОплатыПлатежнаяКарта, УтвержденнаяФормаОплаты
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные", Истина);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные", Ложь);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
		ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты", "Наличная");
		
		//РасшифровкаПлатежа: Сумма, НомерВедомостиНаВыплатуЗарплаты, ДатаВедомостиНаВыплатуЗарплаты
		ЗаполнитьРасшифровкуПлатежаПоВедомости(ДанныеИБ, ДанныеXDTO);
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ
Процедура ДобавитьПКО_Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Касса";
	НоваяСтрока.СвойствоФормата = "Касса";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Кассы";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	// Статус, Валюта
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	//Подразделение
	//Подразделение = УправленческоеПодразделениеВедомостиНаВыплатуЗП(ДанныеИБ);
	//ДанныеXDTO.Вставить("Подразделение", ЗначениеВИнструкциюПКО(КомпонентыОбмена, Подразделение));
	
	// ЖелательнаяФормаОплатыНаличные, ЖелательнаяФормаОплатыБезналичные, ЖелательнаяФормаОплатыПлатежнаяКарта, УтвержденнаяФормаОплаты.
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные", Истина);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные", Ложь);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
	ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты", "Наличная");
	
	// РасшифровкаПлатежа: Сотрудник, Сумма, НомерВедомостиНаВыплатуЗарплаты, ДатаВедомостиНаВыплатуЗарплаты.
	ЗаполнитьРасшифровкуПлатежаПоВедомости(ДанныеИБ, ДанныеXDTO);
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗППеречислением_Заявка
Процедура ДобавитьПКО_Документ_ВедомостьНаВыплатуЗППеречислением_Заявка(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьНаВыплатуЗППеречислением_Заявка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ПлатежноеПоручение;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗППеречислением_Заявка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчет";
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодНазначенияПлатежа";
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьНаВыплатуЗППеречислением_Заявка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		//Статус, Валюта
		ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
		
		
		//ЖелательнаяФормаОплатыНаличные, ЖелательнаяФормаОплатыБезналичные, ЖелательнаяФормаОплатыПлатежнаяКарта, УтвержденнаяФормаОплаты
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные", Ложь);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные", Истина);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
		ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты", "Безналичная");
	
		//РасшифровкаПлатежа: Сотрудник, БанковскийСчет, Сумма, НомерВедомостиНаВыплатуЗарплаты, ДатаВедомостиНаВыплатуЗарплаты
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СУММА(ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.КВыплате) КАК Сумма,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо КАК Сотрудник,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемСостав.БанковскийСчет КАК БанковскийСчет,
		|	ПлатежноеПоручение.НомерРеестра КАК НомерВедомостиНаВыплатуЗарплаты,
		|	ПлатежноеПоручение.Дата КАК ДатаВедомостиНаВыплатуЗарплаты
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ПО (ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата КАК ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата
		|		ПО (ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Состав КАК ВедомостьНаВыплатуЗарплатыПеречислениемСостав
		|		ПО (ВедомостьНаВыплатуЗарплатыПеречислениемСостав.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|			И (ВедомостьНаВыплатуЗарплатыПеречислениемСостав.ИдентификаторСтроки = ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ИдентификаторСтроки)
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежноеПоручение.НомерРеестра,
		|	ПлатежноеПоручение.Дата,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемСостав.БанковскийСчет");
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ТаблицаРасшифровка = Запрос.Выполнить().Выгрузить();
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", ТаблицаРасшифровка);
	
	ДанныеXDTO.Вставить("Сумма", ТаблицаРасшифровка.Итог("Сумма"));
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От
Процедура ДобавитьПКО_Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыРаздатчиком;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	// Статус, Валюта
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	//Подразделение
	//Подразделение = УправленческоеПодразделениеВедомостиНаВыплатуЗП(ДанныеИБ);
	//ДанныеXDTO.Вставить("Подразделение", ЗначениеВИнструкциюПКО(КомпонентыОбмена, Подразделение));
	
	// ЖелательнаяФормаОплатыНаличные, ЖелательнаяФормаОплатыБезналичные, ЖелательнаяФормаОплатыПлатежнаяКарта, УтвержденнаяФормаОплаты.
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные", Истина);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные", Ложь);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
	ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты", "Наличная");
	
	// РасшифровкаПлатежа: Сумма, НомерВедомостиНаВыплатуЗарплаты, ДатаВедомостиНаВыплатуЗарплаты.
	ЗаполнитьРасшифровкуПлатежаПоВедомости(ДанныеИБ, ДанныеXDTO);
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьПрочихДоходовВКассу
Процедура ДобавитьПКО_Документ_ВедомостьПрочихДоходовВКассу(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьПрочихДоходовВКассу";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьПрочихДоходовВКассу;
	ПравилоКонвертации.ОбъектФормата = "Документ.РКОПрочаяВыдача";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьПрочихДоходовВКассу_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СпособВыплаты";
	НоваяСтрока.СвойствоФормата = "СпособВыплаты";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_СпособыВыплатыПрочихДоходов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПериодВзаиморасчетовВедомости";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьПрочихДоходовВКассу_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВедомостьПрочихДоходовВКассу.Номер КАК НомерВедомости,
	|	ВедомостьПрочихДоходовВКассу.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	ВедомостьПрочихДоходовВКассу.ПериодРегистрации КАК МесяцНачисления,
	|	СУММА(ВедомостьПрочихДоходовВКассуВыплаты.КВыплате) КАК Сумма,
	|	ВедомостьПрочихДоходовВКассуВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетовВедомости,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВедомостьПрочихДоходовВКассу.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение
	|			ТОГДА ВедомостьПрочихДоходовВКассу.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	КОНЕЦ КАК СтруктурноеПодразделение,
	|	ВедомостьПрочихДоходовВКассуВыплаты.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	Документ.ВедомостьПрочихДоходовВКассу КАК ВедомостьПрочихДоходовВКассу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовВКассу.Выплаты КАК ВедомостьПрочихДоходовВКассуВыплаты
	|		ПО (ВедомостьПрочихДоходовВКассуВыплаты.Ссылка = ВедомостьПрочихДоходовВКассу.Ссылка)
	|ГДЕ
	|	ВедомостьПрочихДоходовВКассу.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьПрочихДоходовВКассу.Номер,
	|	ВедомостьПрочихДоходовВКассу.Дата,
	|	ВедомостьПрочихДоходовВКассу.ПериодРегистрации,
	|	ВедомостьПрочихДоходовВКассуВыплаты.ПериодВзаиморасчетов,
	|	ВедомостьПрочихДоходовВКассу.Подразделение,
	|	ВедомостьПрочихДоходовВКассуВыплаты.ФизическоеЛицо";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	
	Если РасшифровкаПлатежа.Количество() > 0 Тогда
	  	Для Каждого Строка ИЗ  РасшифровкаПлатежа Цикл
			Строка.ФизическоеЛицо = ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЦикла;
	КонецЕсли;
	           
	//Статус, Валюта
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
	ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"П" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП
Процедура ДобавитьПКО_Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьПрочихДоходовВКассу;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		//Статус, Валюта
		ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
		
		//Подразделение
		Подразделение = УправленческоеПодразделениеВедомостиНаВыплатуЗП(ДанныеИБ,Истина);
		ДанныеXDTO.Вставить("Подразделение", ЗначениеВИнструкциюПКО(КомпонентыОбмена, Подразделение));
		
		//ЖелательнаяФормаОплатыНаличные, ЖелательнаяФормаОплатыБезналичные, ЖелательнаяФормаОплатыПлатежнаяКарта, УтвержденнаяФормаОплаты
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные", Истина);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные", Ложь);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
		ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты", "Наличная");
		
		//РасшифровкаПлатежа: Сумма, Соттрудник, НомерВедомостиНаВыплатуЗарплаты, ДатаВедомостиНаВыплатуЗарплаты
		ЗаполнитьРасшифровкуПлатежаПоВедомости(ДанныеИБ, ДанныеXDTO);
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьПрочихДоходовВКассу_УП_От
Процедура ДобавитьПКО_Документ_ВедомостьПрочихДоходовВКассу_УП_От(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВедомостьПрочихДоходовВКассу_УП_От";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВедомостьПрочихДоходовВКассу;
	ПравилоКонвертации.ОбъектФормата = "Документ.ВедомостьНаВыплатуЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВедомостьПрочихДоходовВКассу_УП_От_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаВедомости";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "НомерВедомости";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "ПериодВыплаты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаПоДокументу";
	НоваяСтрока.СвойствоФормата = "СуммаДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Комментарий";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособВыплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособРасчетов";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("Зарплата", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.Зарплата;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ИдентификаторСтроки";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_ВедомостьПрочихДоходовВКассу_УП_От_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ВедомостьПрочихДоходов_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки);
КонецПроцедуры
#КонецОбласти
#Область Документ_ВозвратСотрудникомЗадолженности
Процедура ДобавитьПКО_Документ_ВозвратСотрудникомЗадолженности(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВозвратСотрудникомЗадолженности";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВозвратСотрудникомЗадолженности;
	ПравилоКонвертации.ОбъектФормата = "Документ.ПКОРасчетыССотрудниками";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВозвратСотрудникомЗадолженности_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаДокумента";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидРасчетов";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ФизическоеЛицо";
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтатьяДДС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВозвратСотрудникомЗадолженности_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеXDTO.Вставить("Валюта", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
	ВидРасчетов = "Займы";
		
	ДанныеXDTO.Вставить("ВидРасчетов", ВидРасчетов);
	ДанныеXDTO.Вставить("Сотрудник", ФизическоеЛицоДляВыгрузки(ДанныеИБ.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации));
	
	ТабРасшифровка = Новый ТаблицаЗначений;
	ТабРасшифровка.Колонки.Добавить("Сумма");
	НоваяСтрока = ТабРасшифровка.Добавить();
	
	НоваяСтрока.Сумма = ДанныеИБ.СуммаДокумента;
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", ТабРасшифровка);
КонецПроцедуры
#КонецОбласти
#Область Документ_ВыплатаДепонированнойЗарплаты_Касса
Процедура ДобавитьПКО_Документ_ВыплатаДепонированнойЗарплаты_Касса(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ВыплатаДепонированнойЗарплаты_Касса";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ВыплатаДепонированнойЗарплаты;
	ПравилоКонвертации.ОбъектФормата = "Документ.РКОВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ВыплатаДепонированнойЗарплаты_Касса_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаДокумента";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Депонент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ВыплатаДепонированнойЗарплаты_Касса_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СУММА(ВыплатаДепонированнойЗарплатыДепоненты.Сумма) КАК Сумма,
	|	ВыплатаДепонированнойЗарплаты.ФизическоеЛицо КАК Сотрудник,
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ссылка.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ведомость.Подразделение КАК ПодразделениеОрганизации,
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ведомость.ПериодРегистрации КАК МесяцНачисления,
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ссылка.Номер КАК НомерВедомости,
	|	ИСТИНА КАК Депонент
	|ИЗ
	|	Документ.ВыплатаДепонированнойЗарплаты КАК ВыплатаДепонированнойЗарплаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыплатаДепонированнойЗарплаты.Депоненты КАК ВыплатаДепонированнойЗарплатыДепоненты
	|		ПО (ВыплатаДепонированнойЗарплатыДепоненты.Ссылка = ВыплатаДепонированнойЗарплаты.Ссылка)
	|ГДЕ
	|	ВыплатаДепонированнойЗарплаты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ссылка.Номер,
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ссылка.Дата,
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ведомость.Подразделение,
	|	ВыплатаДепонированнойЗарплатыДепоненты.Ведомость.ПериодРегистрации,
	|	ВыплатаДепонированнойЗарплаты.ФизическоеЛицо";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	РасшифровкаПлатежа.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	
	Для Каждого Строка Из РасшифровкаПлатежа Цикл
		НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"В" + Прав(Строка.НомерВедомости, 5);
		Строка.НомерВедомостиНаВыплатуЗарплаты = НомерВедомостиНаВыплатуЗарплаты;
		Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
	КонецЦикла;
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
	ДанныеXDTO.Вставить("Валюта", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты()));
	ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"В" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
КонецПроцедуры
#КонецОбласти
#Область Документ_ДепонированиеЗарплаты
Процедура ДобавитьПКО_Документ_ДепонированиеЗарплаты(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ДепонированиеЗарплаты";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ДепонированиеЗарплаты;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ДепонированиеЗарплаты_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Депонент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ДепонированиеЗарплаты_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеXDTO.Вставить("Валюта", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты()));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.Номер КАК НомерВедомости,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость КАК Ведомость,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.ПериодРегистрации КАК МесяцНачисления,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.Подразделение КАК ПодразделениеОрганизации,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК Сотрудник,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК Сумма,
	|	ИСТИНА КАК Депонент
	|ИЗ
	|	Документ.ДепонированиеЗарплаты.Депоненты КАК ДепонированиеЗарплатыДепоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ПО (ВзаиморасчетыССотрудниками.ФизическоеЛицо = ДепонированиеЗарплатыДепоненты.ФизическоеЛицо)
	|			И (ВзаиморасчетыССотрудниками.Регистратор = ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость)
	|ГДЕ
	|	ДепонированиеЗарплатыДепоненты.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.Дата,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.Номер,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.ПериодРегистрации,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость,
	|	ДепонированиеЗарплатыДепоненты.Ссылка.Ведомость.Подразделение,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	РасшифровкаПлатежа.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");
	
	Для Каждого Строка Из РасшифровкаПлатежа Цикл
	
		НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"Д" + Прав(Строка.НомерВедомости, 5);
		Строка.НомерВедомостиНаВыплатуЗарплаты = НомерВедомостиНаВыплатуЗарплаты;
		Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
	КонецЦикла;
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
	ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"Д" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5))
КонецПроцедуры
#КонецОбласти
#Область Документ_ДоговорЗаймаСотруднику_УП_От
Процедура ДобавитьПКО_Документ_ДоговорЗаймаСотруднику_УП_От(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ДоговорЗаймаСотруднику_УП_От";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ДоговорЗаймаСотруднику;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСРасчетыССотрудниками";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ФизическоеЛицо";
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидРасчетов";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Номер";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	// Статус, Валюта, ВидРасчетов
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	ДанныеXDTO.Вставить("ВидРасчетов", "Займы");
	
	//Сумма(расшифровка)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорЗаймаСотруднику.Сумма КАК Сумма
	|ИЗ
	|	Документ.ДоговорЗаймаСотруднику КАК ДоговорЗаймаСотруднику
	|ГДЕ
	|	ДоговорЗаймаСотруднику.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", Запрос.Выполнить().Выгрузить());
КонецПроцедуры
#КонецОбласти
#Область Документ_НачислениеОценочныхОбязательств_БК_ОТ
Процедура ДобавитьПКО_Документ_НачислениеОценочныхОбязательств_БК_ОТ(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_НачислениеОценочныхОбязательств_БК_ОТ";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам;
	ПравилоКонвертации.ОбъектФормата = "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_НачислениеОценочныхОбязательств_БК_ОТ_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ОценочныеОбязательства", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ОценочныеОбязательства;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерва";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОПВР";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОППВ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОтчисленияОСМС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_НачислениеОценочныхОбязательств_БК_ОТ_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		ПодчиненностьПодразделений = Новый ТаблицаЗначений;
		ПодчиненностьПодразделений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		ПодчиненностьПодразделений.Колонки.Добавить("ВышестоящееПодразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодчиненностьПодразделений.Подразделение КАК Подразделение,
		|	ПодчиненностьПодразделений.Подразделение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
		|ИЗ
		|	РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК ПодчиненностьПодразделений
		|ГДЕ
		|	ПодчиненностьПодразделений.ВышестоящееПодразделение.ОбособленноеПодразделение = ИСТИНА
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВышестоящееПодразделение)
		|ПО
		|	Подразделение,
		|	ОбособленноеПодразделение";
		
		Результат = Запрос.Выполнить();
		
		ИтогиПоВышестоящим = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаПоПодразделениям = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПодразделениям.Следующий() Цикл
			Если ВыборкаПоПодразделениям.ОбособленноеПодразделение Тогда
				НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
				НоваяСтрока.Подразделение = ВыборкаПоПодразделениям.Подразделение;
			    НоваяСтрока.ВышестоящееПодразделение = ВыборкаПоПодразделениям.Подразделение;
			Иначе
				ВыборкаОбособленноеПодразделение = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ВыборкаОбособленноеПодразделение.Следующий();
				
				Выборка = ВыборкаОбособленноеПодразделение.Выбрать();
				Уровень = 0;
				НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
				НоваяСтрока.Подразделение = ВыборкаОбособленноеПодразделение.Подразделение;
				Пока Выборка.Следующий() Цикл
					Если ВыборкаОбособленноеПодразделение.ВышестоящееПодразделение = 1 Тогда
						ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
					Иначе
						НайденнаяСтрока = ИтогиПоВышестоящим.Строки.Найти(Выборка.ВышестоящееПодразделение, "Подразделение");
						Если НайденнаяСтрока.ВышестоящееПодразделение > Уровень Тогда
							ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
							Уровень = НайденнаяСтрока.ВышестоящееПодразделение;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				НоваяСтрока.ВышестоящееПодразделение = ВышестоящееПодразделение;
			КонецЕсли;	
		КонецЦикла;
		
		Запрос = Новый Запрос();
		Запрос.Текст =	
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	РегистрацииВНалоговомОргане.Владелец КАК Владелец,
			|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_Регистрации
			|ИЗ
			|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.Организации)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
			|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
			|	РегистрацииВНалоговомОргане.Владелец,
			|	РегистрацииВНалоговомОргане.Ссылка
			|ИЗ
			|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
			|			&Дата,
			|			ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)
			|				И ВЫРАЗИТЬ(СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
			|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПодчиненностьПодразделений.Подразделение КАК Подразделение,
			|	ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
			|ПОМЕСТИТЬ ВТ_ТЗПодчиненностьПодразделений
			|ИЗ
			|	&ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПодчиненностьПодразделенийОрганизации.Подразделение КАК Подразделение,
			|	ПодчиненностьПодразделенийОрганизации.ВышестоящееПодразделение КАК ВышестоящееПодразделение
			|ПОМЕСТИТЬ ВТ_ПодчиненностьПодразделений
			|ИЗ
			|	ВТ_ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделенийОрганизации
			|ГДЕ
			|	ВЫРАЗИТЬ(ПодчиненностьПодразделенийОрганизации.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Регистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	ВТ_Регистрации.Владелец КАК Владелец,
			|	ВТ_ПодчиненностьПодразделений.Подразделение КАК Подразделение,
			|	ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
			|ПОМЕСТИТЬ ВТ_ПодразделенияСРегистрацией
			|ИЗ
			|	ВТ_ПодчиненностьПодразделений КАК ВТ_ПодчиненностьПодразделений
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
			|		ПО ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение = ВТ_Регистрации.СтруктурнаяЕдиница
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Подразделение КАК ПодразделениеОрганизации,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВФинансовомУчете,
			|	ВЫБОР
			|		КОГДА НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Подразделение.ОбособленноеПодразделение
			|			ТОГДА НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Подразделение
			|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
			|	КОНЕЦ КАК СтруктурноеПодразделение,
			|	ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение КАК ВышестоящееПодразделение,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерва КАК СуммаРезерва,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваСО КАК СуммаРезерваСО,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваСН КАК СуммаРезерваСН,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваОППВ КАК СуммаРезерваОППВ,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваОПВР КАК СуммаРезерваОПВР,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваОтчисленияОСМС КАК СуммаРезерваОтчисленияОСМС
			|ИЗ
			|	Документ.НачислениеОценочныхОбязательствПоОтпускам.ОценочныеОбязательстваПоСотрудникам КАК НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
			|		ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Подразделение)
			|ГДЕ
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Подразделение,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СпособОтраженияЗарплатыВБухучете,
			|	ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение,
			|	ВЫБОР
			|		КОГДА НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Подразделение.ОбособленноеПодразделение
			|			ТОГДА НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Подразделение
			|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
			|	КОНЕЦ,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.Сотрудник.ФизическоеЛицо,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерва,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваСО,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваСН,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваОППВ,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваОПВР,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СуммаРезерваОтчисленияОСМС
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПодразделениеОрганизации,
			|	НачислениеОценочныхОбязательствПоОтпускамОценочныеОбязательстваПоСотрудникам.СпособОтраженияЗарплатыВБухучете";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
		Запрос.УстановитьПараметр("Дата", ДанныеИБ.Дата);
		Запрос.УстановитьПараметр("ТЗПодчиненностьПодразделений", ПодчиненностьПодразделений);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// ОценочныеОбязательства
		ТаблицаОценочныеОбязательства = РезультатыЗапроса[4].Выгрузить();
		
		Для Каждого Строка Из ТаблицаОценочныеОбязательства Цикл
			Строка.ФизическоеЛицо = ФизическоеЛицоДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЦикла;
	
		ТаблицаОценочныеОбязательства.Колонки.Добавить("Подразделение");
		ЗаполнитьПодразделениеПоУмолчанию(ТаблицаОценочныеОбязательства);
			
		ДанныеXDTO.Вставить("ОценочныеОбязательства", ТаблицаОценочныеОбязательства);
			
		Номер = Лев(ДанныеИБ.Номер, 5) +"Р" + Прав(ДанныеИБ.Номер, 5);
		ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Номер);
КонецПроцедуры
#КонецОбласти
#Область Документ_НачислениеОценочныхОбязательствПоОтпускам
Процедура ДобавитьПКО_Документ_НачислениеОценочныхОбязательствПоОтпускам(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_НачислениеОценочныхОбязательствПоОтпускам";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам;
	ПравилоКонвертации.ОбъектФормата = "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДоляРасходов";
	НоваяСтрока.СвойствоФормата = "ДоляРасходов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КорректировкаОбязательств";
	НоваяСтрока.СвойствоФормата = "КорректировкаОбязательств";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ОценочныеОбязательства", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ОценочныеОбязательства;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерва";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваНУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОПВР";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОППВ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОтчисленияОСМС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСтраховыхВзносов";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСтраховыхВзносовНУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
		|	ОценочныеОбязательства.МестоВСтруктуреПредприятия КАК Подразделение,
		|	ОценочныеОбязательства.Подразделение КАК ПодразделениеОрганизации,
		|	ОценочныеОбязательства.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВФинансовомУчете,
		|	ОценочныеОбязательства.СуммаРезерва КАК СуммаРезерва,
		|	ОценочныеОбязательства.СуммаРезерваНУ КАК СуммаРезерваНУ,
		|	ОценочныеОбязательства.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносов,
		|	ОценочныеОбязательства.СуммаРезерваСтраховыхВзносовНУ КАК СуммаРезерваСтраховыхВзносовНУ,
		|	ОценочныеОбязательства.СуммаРезерваСО КАК СуммаРезерваСО,
		|	ОценочныеОбязательства.СуммаРезерваСН КАК СуммаРезерваСН,
		|	ОценочныеОбязательства.СуммаРезерваОППВ КАК СуммаРезерваОППВ,
		|	ОценочныеОбязательства.СуммаРезерваОПВР КАК СуммаРезерваОПВР,
		|	ОценочныеОбязательства.СуммаРезерваОтчисленияОСМС КАК СуммаРезерваОтчисленияОСМС
		|ИЗ
		|	Документ.НачислениеОценочныхОбязательствПоОтпускам.ОценочныеОбязательства КАК ОценочныеОбязательства
		|ГДЕ
		|	ОценочныеОбязательства.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ОценочныеОбязательства = Запрос.Выполнить().Выгрузить();
	//ОценочныеОбязательства.Колонки.Добавить("Подразделение");
	ЗаполнитьПодразделениеПоУмолчанию(ОценочныеОбязательства);
	ДанныеXDTO.Вставить("ОценочныеОбязательства", ОценочныеОбязательства);
КонецПроцедуры
#КонецОбласти
#Область Документ_ОтражениеЗарплатыВБухучете
Процедура ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ОтражениеЗарплатыВБухучете";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ОтражениеЗарплатыВБухучете;
	ПравилоКонвертации.ОбъектФормата = "Документ.ОтражениеЗарплатыВФинансовомУчете";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ОтражениеЗарплатыВБухучете_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бухгалтер";
	НоваяСтрока.СвойствоФормата = "Бухгалтер";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("НачисленнаяЗарплатаИВзносы", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.НачисленнаяЗарплатаИВзносы;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидНачисленияОплатыТрудаДляНУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ЕП";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ООСМС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ОПВР";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ОППВ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Резерв";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Резервы";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РезервБУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РезервНУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ПеняПоВзносамИОтчислениям", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ПеняПоВзносамИОтчислениям;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РегламентированныеУдержания", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РегламентированныеУдержания;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("УдержаннаяЗарплата", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.УдержаннаяЗарплата;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидИсполнительногоДокумента";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаДействияИсполнительногоЛиста";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаИсполнительногоЛиста";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаОкончанияИсполнительногоЛиста";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "КонтрагентИсполнительногоЛиста";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерИсполнительногоЛиста";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПлатежныйАгентИсполнительногоЛиста";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РаботникОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РеквизитыИсполнительногоДокумента";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_ОтражениеЗарплатыВБухучете_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
		
	Номер = Лев(ДанныеИБ.Номер, 5) +"Н" + Прав(ДанныеИБ.Номер, 5);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Номер);
	
	ПодчиненностьПодразделений = Новый ТаблицаЗначений;
	ПодчиненностьПодразделений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ПодчиненностьПодразделений.Колонки.Добавить("ВышестоящееПодразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодчиненностьПодразделений.Подразделение КАК Подразделение,
	|	ПодчиненностьПодразделений.Подразделение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
	|ИЗ
	|	РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК ПодчиненностьПодразделений
	|ГДЕ
	|	ПодчиненностьПодразделений.ВышестоящееПодразделение.ОбособленноеПодразделение = ИСТИНА
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВышестоящееПодразделение)
	|ПО
	|	Подразделение,
	|	ОбособленноеПодразделение";
	
	Результат = Запрос.Выполнить();
	
	ИтогиПоВышестоящим = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаПоПодразделениям = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		Если ВыборкаПоПодразделениям.ОбособленноеПодразделение Тогда
			НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
			НоваяСтрока.Подразделение = ВыборкаПоПодразделениям.Подразделение;
		    НоваяСтрока.ВышестоящееПодразделение = ВыборкаПоПодразделениям.Подразделение;
		Иначе
			ВыборкаОбособленноеПодразделение = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ВыборкаОбособленноеПодразделение.Следующий();
			
			Выборка = ВыборкаОбособленноеПодразделение.Выбрать();
			Уровень = 0;
			НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
			НоваяСтрока.Подразделение = ВыборкаОбособленноеПодразделение.Подразделение;
			Пока Выборка.Следующий() Цикл
				Если ВыборкаОбособленноеПодразделение.ВышестоящееПодразделение = 1 Тогда
					ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
				Иначе
					НайденнаяСтрока = ИтогиПоВышестоящим.Строки.Найти(Выборка.ВышестоящееПодразделение, "Подразделение");
					Если НайденнаяСтрока.ВышестоящееПодразделение > Уровень Тогда
						ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
						Уровень = НайденнаяСтрока.ВышестоящееПодразделение;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			НоваяСтрока.ВышестоящееПодразделение = ВышестоящееПодразделение;
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст =	
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	РегистрацииВНалоговомОргане.Владелец КАК Владелец,
		|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Регистрации
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.Организации)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
		|	РегистрацииВНалоговомОргане.Владелец,
		|	РегистрацииВНалоговомОргане.Ссылка
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|			&Дата,
		|			ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И ВЫРАЗИТЬ(СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодчиненностьПодразделений.Подразделение КАК Подразделение,
		|	ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
		|ПОМЕСТИТЬ ВТ_ТЗПодчиненностьПодразделений
		|ИЗ
		|	&ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодчиненностьПодразделенийОрганизации.Подразделение КАК Подразделение,
		|	ПодчиненностьПодразделенийОрганизации.ВышестоящееПодразделение КАК ВышестоящееПодразделение
		|ПОМЕСТИТЬ ВТ_ПодчиненностьПодразделений
		|ИЗ
		|	ВТ_ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделенийОрганизации
		|ГДЕ
		|	ВЫРАЗИТЬ(ПодчиненностьПодразделенийОрганизации.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Регистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВТ_Регистрации.Владелец КАК Владелец,
		|	ВТ_ПодчиненностьПодразделений.Подразделение КАК Подразделение,
		|	ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
		|ПОМЕСТИТЬ ВТ_ПодразделенияСРегистрацией
		|ИЗ
		|	ВТ_ПодчиненностьПодразделений КАК ВТ_ПодчиненностьПодразделений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
		|		ПО ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение = ВТ_Регистрации.СтруктурнаяЕдиница
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленнаяЗарплатаИВзносы.Подразделение КАК ПодразделениеОрганизации,
		|	НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперацииСсылка,
		|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВФинансовомУчете,
		|	СУММА(НачисленнаяЗарплатаИВзносы.Сумма) КАК Сумма,
		|	СУММА(НачисленнаяЗарплатаИВзносы.СН) КАК СН,
		|	СУММА(НачисленнаяЗарплатаИВзносы.СО) КАК СО,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОППВ) КАК ОППВ,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ОПВР) КАК ОПВР,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ООСМС) КАК ООСМС,
		|	СУММА(НачисленнаяЗарплатаИВзносы.ЕП) КАК ЕП,
		|	ВЫБОР
		|		КОГДА НачисленнаяЗарплатаИВзносы.Подразделение.ОбособленноеПодразделение
		|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
		|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурноеПодразделение,
		|	ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение КАК ВышестоящееПодразделение,
		|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленнаяЗарплатаИВзносы.Резерв КАК Резерв,
		|	НачисленнаяЗарплатаИВзносы.РезервБУ КАК РезервБУ,
		|	НачисленнаяЗарплатаИВзносы.РезервНУ КАК РезервНУ
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.НачисленнаяЗарплатаИВзносы КАК НачисленнаяЗарплатаИВзносы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
		|		ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = НачисленнаяЗарплатаИВзносы.Подразделение)
		|ГДЕ
		|	НачисленнаяЗарплатаИВзносы.Ссылка = &Ссылка
		|	И НЕ НачисленнаяЗарплатаИВзносы.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.Депонирование), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.СписаниеДепонента))
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленнаяЗарплатаИВзносы.Подразделение,
		|	НачисленнаяЗарплатаИВзносы.ВидОперации,
		|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете,
		|	ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение,
		|	ВЫБОР
		|		КОГДА НачисленнаяЗарплатаИВзносы.Подразделение.ОбособленноеПодразделение
		|			ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
		|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
		|	КОНЕЦ,
		|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
		|	НачисленнаяЗарплатаИВзносы.Резерв,
		|	НачисленнаяЗарплатаИВзносы.РезервБУ,
		|	НачисленнаяЗарплатаИВзносы.РезервНУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодразделениеОрганизации,
		|	ВидОперацииСсылка,
		|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдержаннаяЗарплата.Подразделение КАК Подразделение,
		|	УдержаннаяЗарплата.ВидОперации КАК ВидОперацииСсылка,
		|	УдержаннаяЗарплата.Контрагент КАК Контрагент,
		|	СУММА(УдержаннаяЗарплата.Сумма) КАК Сумма,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	УдержаннаяЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА УдержаннаяЗарплата.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПрочиеУдержания),ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозмещениеУщерба),ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму))
		|			ТОГДА УдержаннаяЗарплата.ФизическоеЛицо
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	КОНЕЦ КАК РаботникОрганизации,
		|	УдержаннаяЗарплата.ДокументОснование КАК ДокументОснование,
		|	ИсполнительныйЛист.Дата КАК ДатаИсполнительногоЛиста,
		|	ИсполнительныйЛист.Номер КАК НомерИсполнительногоЛиста,
		|	ИсполнительныйЛист.ДатаДействия КАК ДатаДействияИсполнительногоЛиста,
		|	ИсполнительныйЛист.ДатаОкончания КАК ДатаОкончанияИсполнительногоЛиста,
		|	ИсполнительныйЛист.ВидИсполнительногоДокумента КАК ВидИсполнительногоДокументаСсылка,
		|	ВЫБОР
		|		КОГДА ИсполнительныйЛист.ПлатежныйАгент = УсловияУдержанияПоИсполнительномуДокументу.ПлатежныйАгент
		|			ТОГДА ИсполнительныйЛист.ПлатежныйАгент
		|		ИНАЧЕ УсловияУдержанияПоИсполнительномуДокументу.ПлатежныйАгент
		|	КОНЕЦ КАК ПлатежныйАгентИсполнительногоЛиста,
		|	ВЫРАЗИТЬ(ИсполнительныйЛист.РеквизитыИсполнительногоДокумента КАК Строка(500)) КАК РеквизитыИсполнительногоДокумента,
		|	ИсполнительныйЛист.Получатель КАК КонтрагентИсполнительногоЛиста
		|ПОМЕСТИТЬ ВТ_УдержаннаяЗарплата
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.УдержаннаяЗарплата КАК УдержаннаяЗарплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ПО (ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = УдержаннаяЗарплата.Подразделение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.СрезПоследних(&Дата, ) КАК УсловияУдержанияПоИсполнительномуДокументу
		|			ПО ИсполнительныйЛист.Ссылка = УсловияУдержанияПоИсполнительномуДокументу.ИсполнительныйДокумент
		|		ПО (ИсполнительныйЛист.Ссылка = УдержаннаяЗарплата.ДокументОснование)
		|ГДЕ
		|	УдержаннаяЗарплата.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УдержаннаяЗарплата.ВидОперации,
		|	УдержаннаяЗарплата.Контрагент,
		|	УдержаннаяЗарплата.Подразделение,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
		|	УдержаннаяЗарплата.ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА УдержаннаяЗарплата.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПрочиеУдержания),ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозмещениеУщерба),ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеЗаОтпуск), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.УдержаниеНеизрасходованныхПодотчетныхСумм), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПогашениеЗаймов), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ПроцентыПоЗайму))
		|			ТОГДА УдержаннаяЗарплата.ФизическоеЛицо
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	КОНЕЦ,
		|	УдержаннаяЗарплата.ДокументОснование,
		|	ИсполнительныйЛист.Дата,
		|	ИсполнительныйЛист.Номер,
		|	ИсполнительныйЛист.ДатаДействия,
		|	ИсполнительныйЛист.ДатаОкончания,
		|	ИсполнительныйЛист.ВидИсполнительногоДокумента,
		|	ВЫБОР
		|		КОГДА ИсполнительныйЛист.ПлатежныйАгент = УсловияУдержанияПоИсполнительномуДокументу.ПлатежныйАгент
		|			ТОГДА ИсполнительныйЛист.ПлатежныйАгент
		|		ИНАЧЕ УсловияУдержанияПоИсполнительномуДокументу.ПлатежныйАгент
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(ИсполнительныйЛист.РеквизитыИсполнительногоДокумента КАК Строка(500)),
		|	ИсполнительныйЛист.Получатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УдержаннаяЗарплата.Подразделение КАК ПодразделениеОрганизации,
		|	ВТ_УдержаннаяЗарплата.ВидОперацииСсылка КАК ВидОперацииСсылка,
		|	ВТ_УдержаннаяЗарплата.Контрагент КАК Контрагент,
		|	ВТ_УдержаннаяЗарплата.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВТ_УдержаннаяЗарплата.Подразделение.ОбособленноеПодразделение
		|			ТОГДА ВТ_УдержаннаяЗарплата.Подразделение
		|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурноеПодразделение,
		|	ВТ_УдержаннаяЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТ_УдержаннаяЗарплата.РаботникОрганизации КАК РаботникОрганизации,
		|	ВТ_УдержаннаяЗарплата.ДатаИсполнительногоЛиста КАК ДатаИсполнительногоЛиста,
		|	ВТ_УдержаннаяЗарплата.НомерИсполнительногоЛиста КАК НомерИсполнительногоЛиста,
		|	ВТ_УдержаннаяЗарплата.ДатаДействияИсполнительногоЛиста КАК ДатаДействияИсполнительногоЛиста,
		|	ВТ_УдержаннаяЗарплата.ДатаОкончанияИсполнительногоЛиста КАК ДатаОкончанияИсполнительногоЛиста,
		|	ВТ_УдержаннаяЗарплата.ВидИсполнительногоДокументаСсылка КАК ВидИсполнительногоДокументаСсылка,
		|	ВТ_УдержаннаяЗарплата.РеквизитыИсполнительногоДокумента КАК РеквизитыИсполнительногоДокумента,
		|	ВТ_УдержаннаяЗарплата.КонтрагентИсполнительногоЛиста КАК КонтрагентИсполнительногоЛиста,
		|	ВТ_УдержаннаяЗарплата.ПлатежныйАгентИсполнительногоЛиста КАК ПлатежныйАгентИсполнительногоЛиста
		|ИЗ
		|	ВТ_УдержаннаяЗарплата КАК ВТ_УдержаннаяЗарплата
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
		|		ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = ВТ_УдержаннаяЗарплата.Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегламентированныеУдержания.Подразделение КАК ПодразделениеОрганизации,
		|	РегламентированныеУдержания.ВидОперацииНалогиВзносы КАК ВидОперацииСсылка,
		|	СУММА(РегламентированныеУдержания.СуммаНалогаВзноса) КАК Сумма,
		|	ВЫБОР
		|		КОГДА РегламентированныеУдержания.Подразделение.ОбособленноеПодразделение
		|			ТОГДА РегламентированныеУдержания.Подразделение
		|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурноеПодразделение,
		|	РегламентированныеУдержания.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.РегламентированныеУдержания КАК РегламентированныеУдержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
		|		ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = РегламентированныеУдержания.Подразделение)
		|ГДЕ
		|	РегламентированныеУдержания.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РегламентированныеУдержания.Подразделение,
		|	РегламентированныеУдержания.ВидОперацииНалогиВзносы,
		|	ВЫБОР
		|		КОГДА РегламентированныеУдержания.Подразделение.ОбособленноеПодразделение
		|			ТОГДА РегламентированныеУдержания.Подразделение
		|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
		|	КОНЕЦ,
		|	РегламентированныеУдержания.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеняПоВзносамИОтчислениям.Подразделение КАК Подразделение,
		|	ПеняПоВзносамИОтчислениям.ВидОперации КАК ВидОперацииСсылка,
		|	СУММА(ПеняПоВзносамИОтчислениям.Сумма) КАК Сумма,
		|	ПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	ПеняПоВзносамИОтчислениям.ВидПлатежа КАК ВидПлатежаСсылка,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПеняПоВзносамИОтчислениям.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_Пеня
		|ИЗ
		|	Документ.ОтражениеЗарплатыВБухучете.ПеняПоВзносамИОтчислениям КАК ПеняПоВзносамИОтчислениям
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ПО (ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = ПеняПоВзносамИОтчислениям.Подразделение)
		|ГДЕ
		|	ПеняПоВзносамИОтчислениям.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеняПоВзносамИОтчислениям.Подразделение,
		|	ПеняПоВзносамИОтчислениям.ВидОперации,
		|	ПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете,
		|	ПеняПоВзносамИОтчислениям.ВидПлатежа,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
		|	ПеняПоВзносамИОтчислениям.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Пеня.Подразделение КАК ПодразделениеОрганизации,
		|	ВТ_Пеня.ВидОперацииСсылка КАК ВидОперацииСсылка,
		|	ВТ_Пеня.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВФинансовомУчете,
		|	ВТ_Пеня.ВидПлатежаСсылка КАК ВидПлатежаСсылка,
		|	ВТ_Пеня.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВТ_Пеня.Подразделение.ОбособленноеПодразделение
		|			ТОГДА ВТ_Пеня.Подразделение
		|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
		|	КОНЕЦ КАК СтруктурноеПодразделение,
		|	ВТ_Пеня.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТ_Пеня КАК ВТ_Пеня
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
		|		ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = ВТ_Пеня.Подразделение)";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("Дата", ДанныеИБ.Дата);
	Запрос.УстановитьПараметр("ТЗПодчиненностьПодразделений", ПодчиненностьПодразделений);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// НачисленнаяЗарплатаИВзносы
	ТаблицаНачисленнаяЗарплатаИВзносы = РезультатыЗапроса[4].Выгрузить();
	
	Для Каждого Строка Из ТаблицаНачисленнаяЗарплатаИВзносы Цикл 
		Если Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ДоходыКонтрагентов
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ВыплатыБывшимСотрудникам
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.Дивиденды Тогда 
			Строка.ФизическоеЛицо = ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		Иначе
			Строка.ФизическоеЛицо = ФизическоеЛицоДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаНачисленнаяЗарплатаИВзносы, "ВидОперации");
	
	ДанныеXDTO.Вставить("НачисленнаяЗарплатаИВзносы", ТаблицаНачисленнаяЗарплатаИВзносы);
	
	// УдержаннаяЗарплата
	ТаблицаУдержаннаяЗарплата = РезультатыЗапроса[6].Выгрузить();
	Для Каждого Строка Из ТаблицаУдержаннаяЗарплата Цикл
		Если Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ВознаграждениеПлатежногоАгентаКонтрагенты Тогда
			Строка.ФизическоеЛицо = ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		Иначе
			Строка.ФизическоеЛицо = ФизическоеЛицоДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЕсли;
	КонецЦикла;
	
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаУдержаннаяЗарплата, "ВидОперации");
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаУдержаннаяЗарплата, "ВидИсполнительногоДокумента");
	
	ДанныеXDTO.Вставить("УдержаннаяЗарплата", ТаблицаУдержаннаяЗарплата);
	
	//РегламентированныеУдержания
	ТаблицаРегламентированныеУдержания = РезультатыЗапроса[7].Выгрузить();
	Для Каждого Строка Из ТаблицаРегламентированныеУдержания Цикл 
		Если Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ИПНДоходыКонтрагентов
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ОПВДоходыКонтрагентов
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ОПВРасчетыСБывшимиСотрудниками
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.СОДоходыКонтрагентов
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ВОСМСДоходыКонтрагентов
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ВОСМСРасчетыСБывшимиСотрудниками
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ИПНДивиденды
				ИЛИ Строка.ВидОперацииСсылка = Перечисления.ВидыОперацийПоЗарплате.ИПНРасчетыСБывшимиСотрудниками Тогда
			Строка.ФизическоеЛицо = ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		Иначе
			Строка.ФизическоеЛицо = ФизическоеЛицоДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаРегламентированныеУдержания.Колонки.Добавить("Подразделение");
	ЗаполнитьПодразделениеПоУмолчанию(ТаблицаРегламентированныеУдержания);
	
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаРегламентированныеУдержания, "ВидОперации");
	
	ДанныеXDTO.Вставить("РегламентированныеУдержания", ТаблицаРегламентированныеУдержания);
	
	// ПеняПоВзносамИОтчислениям
	ТаблицаПеняПоВзносамИОтчислениям = РезультатыЗапроса[9].Выгрузить();
	Для Каждого Строка Из ТаблицаПеняПоВзносамИОтчислениям Цикл
		Строка.ФизическоеЛицо = ФизическоеЛицоДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
	КонецЦикла;
	
	ТаблицаПеняПоВзносамИОтчислениям.Колонки.Добавить("Подразделение");
	ЗаполнитьПодразделениеПоУмолчанию(ТаблицаПеняПоВзносамИОтчислениям);
	
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаПеняПоВзносамИОтчислениям, "ВидОперации");
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаПеняПоВзносамИОтчислениям, "ВидПлатежа");
	
	ДанныеXDTO.Вставить("ПеняПоВзносамИОтчислениям", ТаблицаПеняПоВзносамИОтчислениям);
КонецПроцедуры
#КонецОбласти
#Область Документ_ОтражениеЗарплатыВБухучете_УП_От
Процедура ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете_УП_От(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ОтражениеЗарплатыВБухучете_УП_От";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ОтражениеЗарплатыВБухучете;
	ПравилоКонвертации.ОбъектФормата = "Документ.ОтражениеЗарплатыВФинансовомУчете";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ОтражениеЗарплатыВБухучете_УП_От_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бухгалтер";
	НоваяСтрока.СвойствоФормата = "Бухгалтер";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("НачисленнаяЗарплатаИВзносы", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.НачисленнаяЗарплатаИВзносы;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидНачисленияОплатыТрудаДляНУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ЕП";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ООСМС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ОПВР";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ОППВ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РегистрацияВНалоговомОргане";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_РегистрацииВНалоговомОргане";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Резерв";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Резервы";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РезервБУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РезервНУ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ПеняПоВзносамИОтчислениям", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ПеняПоВзносамИОтчислениям;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РегламентированныеУдержания", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РегламентированныеУдержания;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "РегистрацияВНалоговомОргане";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_РегистрацииВНалоговомОргане";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("УдержаннаяЗарплата", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.УдержаннаяЗарплата;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_ОтражениеЗарплатыВБухучете_УП_От_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		ПодчиненностьПодразделений = Новый ТаблицаЗначений;
		ПодчиненностьПодразделений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		ПодчиненностьПодразделений.Колонки.Добавить("ВышестоящееПодразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодчиненностьПодразделений.Подразделение КАК Подразделение,
		|	ПодчиненностьПодразделений.Подразделение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
		|ИЗ
		|	РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК ПодчиненностьПодразделений
		|ГДЕ
		|	ПодчиненностьПодразделений.ВышестоящееПодразделение.ОбособленноеПодразделение = ИСТИНА
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВышестоящееПодразделение)
		|ПО
		|	Подразделение,
		|	ОбособленноеПодразделение";
		
		Результат = Запрос.Выполнить();
		
		ИтогиПоВышестоящим = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаПоПодразделениям = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПодразделениям.Следующий() Цикл
			Если ВыборкаПоПодразделениям.ОбособленноеПодразделение Тогда
				НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
				НоваяСтрока.Подразделение = ВыборкаПоПодразделениям.Подразделение;
			    НоваяСтрока.ВышестоящееПодразделение = ВыборкаПоПодразделениям.Подразделение;
			Иначе
				ВыборкаОбособленноеПодразделение = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ВыборкаОбособленноеПодразделение.Следующий();
				
				Выборка = ВыборкаОбособленноеПодразделение.Выбрать();
				Уровень = 0;
				НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
				НоваяСтрока.Подразделение = ВыборкаОбособленноеПодразделение.Подразделение;
				Пока Выборка.Следующий() Цикл
					Если ВыборкаОбособленноеПодразделение.ВышестоящееПодразделение = 1 Тогда
						ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
					Иначе
						НайденнаяСтрока = ИтогиПоВышестоящим.Строки.Найти(Выборка.ВышестоящееПодразделение, "Подразделение");
						Если НайденнаяСтрока.ВышестоящееПодразделение > Уровень Тогда
							ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
							Уровень = НайденнаяСтрока.ВышестоящееПодразделение;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				НоваяСтрока.ВышестоящееПодразделение = ВышестоящееПодразделение;
			КонецЕсли;	
		КонецЦикла;
		
		Запрос = Новый Запрос();
		Запрос.Текст =	
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	        |   РегистрацииВНалоговомОргане.Владелец КАК Владелец,
	        |   РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_Регистрации
	        |ИЗ
	        |   РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.Организации)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
	        |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	        |       ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
	        |   РегистрацииВНалоговомОргане.Владелец,
	        |   РегистрацииВНалоговомОргане.Ссылка
	        |ИЗ
	        |   РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
	        |           &Дата,
	        |           ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)
	        |               И ВЫРАЗИТЬ(СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
	        |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	        |       ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   ПодчиненностьПодразделений.Подразделение КАК Подразделение,
	        |   ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
	        |ПОМЕСТИТЬ ВТ_ТЗПодчиненностьПодразделений
	        |ИЗ
	        |   &ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделений
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   ПодчиненностьПодразделенийОрганизации.Подразделение КАК Подразделение,
	        |   ПодчиненностьПодразделенийОрганизации.ВышестоящееПодразделение КАК ВышестоящееПодразделение
	        |ПОМЕСТИТЬ ВТ_ПодчиненностьПодразделений
	        |ИЗ
	        |   ВТ_ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделенийОрганизации
	        |ГДЕ
	        |   ВЫРАЗИТЬ(ПодчиненностьПодразделенийОрганизации.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение = ЛОЖЬ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   ВТ_Регистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	        |   ВТ_Регистрации.Владелец КАК Владелец,
	        |   ВТ_ПодчиненностьПодразделений.Подразделение КАК Подразделение,
	        |   ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
	        |ПОМЕСТИТЬ ВТ_ПодразделенияСРегистрацией
	        |ИЗ
	        |   ВТ_ПодчиненностьПодразделений КАК ВТ_ПодчиненностьПодразделений
	        |       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
	        |       ПО ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение = ВТ_Регистрации.СтруктурнаяЕдиница
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   НачисленнаяЗарплатаИВзносы.Подразделение КАК ПодразделениеОрганизации,
	        |   НачисленнаяЗарплатаИВзносы.МестоВСтруктуреПредприятия КАК Подразделение,
	        |   НачисленнаяЗарплатаИВзносы.ВидОперации КАК ВидОперацииСсылка,
	        |   НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВФинансовомУчете,
	        |   СУММА(НачисленнаяЗарплатаИВзносы.Сумма) КАК Сумма,
	        |   СУММА(НачисленнаяЗарплатаИВзносы.СН) КАК СН,
	        |   СУММА(НачисленнаяЗарплатаИВзносы.СО) КАК СО,
	        |   СУММА(НачисленнаяЗарплатаИВзносы.ОППВ) КАК ОППВ,
	        |   СУММА(НачисленнаяЗарплатаИВзносы.ОПВР) КАК ОПВР,
	        |   СУММА(НачисленнаяЗарплатаИВзносы.ООСМС) КАК ООСМС,
	        |   СУММА(НачисленнаяЗарплатаИВзносы.ЕП) КАК ЕП,
	        |   НачисленнаяЗарплатаИВзносы.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	        |   НачисленнаяЗарплатаИВзносы.Резерв КАК Резерв,
	        |   НачисленнаяЗарплатаИВзносы.РезервБУ КАК РезервБУ,
	        |   НачисленнаяЗарплатаИВзносы.РезервНУ КАК РезервНУ,
	        |   ВЫБОР
	        |       КОГДА НачисленнаяЗарплатаИВзносы.Подразделение.ОбособленноеПодразделение
	        |           ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	        |       ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
	        |   КОНЕЦ КАК СтруктурноеПодразделение,
	        |   ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение КАК ВышестоящееПодразделение,
	        |   НачисленнаяЗарплатаИВзносы.ФизическоеЛицо КАК ФизическоеЛицо
	        |ИЗ
	        |   Документ.ОтражениеЗарплатыВБухучете.НачисленнаяЗарплатаИВзносы КАК НачисленнаяЗарплатаИВзносы
	        |       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
	        |       ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = НачисленнаяЗарплатаИВзносы.Подразделение)
	        |ГДЕ
	        |   НачисленнаяЗарплатаИВзносы.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |   НачисленнаяЗарплатаИВзносы.Подразделение,
	        |   НачисленнаяЗарплатаИВзносы.МестоВСтруктуреПредприятия,
	        |   НачисленнаяЗарплатаИВзносы.ВидОперации,
	        |   НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете,
	        |   НачисленнаяЗарплатаИВзносы.РегистрацияВНалоговомОргане,
	        |   ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение,
	        |   НачисленнаяЗарплатаИВзносы.Резерв,
	        |   НачисленнаяЗарплатаИВзносы.РезервБУ,
	        |   НачисленнаяЗарплатаИВзносы.РезервНУ,
	        |   ВЫБОР
	        |       КОГДА НачисленнаяЗарплатаИВзносы.Подразделение.ОбособленноеПодразделение
	        |           ТОГДА НачисленнаяЗарплатаИВзносы.Подразделение
	        |       ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
	        |   КОНЕЦ,
	        |   НачисленнаяЗарплатаИВзносы.ФизическоеЛицо
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |   ПодразделениеОрганизации,
	        |   ВидОперацииСсылка,
	        |   НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   УдержаннаяЗарплата.Подразделение КАК ПодразделениеОрганизации,
	        |   УдержаннаяЗарплата.МестоВСтруктуреПредприятия КАК Подразделение,
	        |   УдержаннаяЗарплата.ВидОперации КАК ВидОперацииСсылка,
	        |   УдержаннаяЗарплата.Контрагент КАК Контрагент,
	        |   СУММА(УдержаннаяЗарплата.Сумма) КАК Сумма,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	        |   УдержаннаяЗарплата.ФизическоеЛицо КАК ФизическоеЛицо
	        |ПОМЕСТИТЬ ВТ_УдержаннаяЗарплата
	        |ИЗ
	        |   Документ.ОтражениеЗарплатыВБухучете.УдержаннаяЗарплата КАК УдержаннаяЗарплата
	        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
	        |       ПО (ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = УдержаннаяЗарплата.Подразделение)
	        |ГДЕ
	        |   УдержаннаяЗарплата.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |   УдержаннаяЗарплата.ВидОперации,
	        |   УдержаннаяЗарплата.Контрагент,
	        |   УдержаннаяЗарплата.Подразделение,
	        |   УдержаннаяЗарплата.МестоВСтруктуреПредприятия,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
	        |   УдержаннаяЗарплата.ФизическоеЛицо
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   ВТ_УдержаннаяЗарплата.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	        |   ВТ_УдержаннаяЗарплата.Подразделение КАК Подразделение,
	        |   ВТ_УдержаннаяЗарплата.ВидОперацииСсылка КАК ВидОперацииСсылка,
	        |   ВТ_УдержаннаяЗарплата.Контрагент КАК Контрагент,
	        |   ВТ_УдержаннаяЗарплата.Сумма КАК Сумма,
	        |   ВЫБОР
	        |       КОГДА ВТ_УдержаннаяЗарплата.ПодразделениеОрганизации.ОбособленноеПодразделение
	        |           ТОГДА ВТ_УдержаннаяЗарплата.ПодразделениеОрганизации
	        |       ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
	        |   КОНЕЦ КАК СтруктурноеПодразделение,
	        |   ВТ_УдержаннаяЗарплата.ФизическоеЛицо КАК ФизическоеЛицо
	        |ИЗ
	        |   ВТ_УдержаннаяЗарплата КАК ВТ_УдержаннаяЗарплата
	        |       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
	        |       ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = ВТ_УдержаннаяЗарплата.Подразделение)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   РегламентированныеУдержания.Подразделение КАК ПодразделениеОрганизации,
	        |   РегламентированныеУдержания.МестоВСтруктуреПредприятия КАК Подразделение,
	        |   РегламентированныеУдержания.ВидОперацииНалогиВзносы КАК ВидОперацииСсылка,
	        |   СУММА(РегламентированныеУдержания.СуммаНалогаВзноса) КАК Сумма,
	        |   РегламентированныеУдержания.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	        |   ВЫБОР
	        |       КОГДА РегламентированныеУдержания.Подразделение.ОбособленноеПодразделение
	        |           ТОГДА РегламентированныеУдержания.Подразделение
	        |       ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
	        |   КОНЕЦ КАК СтруктурноеПодразделение,
	        |   РегламентированныеУдержания.ФизическоеЛицо КАК ФизическоеЛицо
	        |ИЗ
	        |   Документ.ОтражениеЗарплатыВБухучете.РегламентированныеУдержания КАК РегламентированныеУдержания
	        |       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
	        |       ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = РегламентированныеУдержания.Подразделение)
	        |ГДЕ
	        |   РегламентированныеУдержания.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |   РегламентированныеУдержания.Подразделение,
	        |   РегламентированныеУдержания.МестоВСтруктуреПредприятия,
		    |   РегламентированныеУдержания.РегистрацияВНалоговомОргане,
	        |   РегламентированныеУдержания.ВидОперацииНалогиВзносы,
	        |   ВЫБОР
	        |       КОГДА РегламентированныеУдержания.Подразделение.ОбособленноеПодразделение
	        |           ТОГДА РегламентированныеУдержания.Подразделение
	        |       ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
	        |   КОНЕЦ,
	        |   РегламентированныеУдержания.ФизическоеЛицо
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   ПеняПоВзносамИОтчислениям.Подразделение КАК ПодразделениеОрганизации,
	        |   ПеняПоВзносамИОтчислениям.МестоВСтруктуреПредприятия КАК Подразделение,
	        |   ПеняПоВзносамИОтчислениям.ВидОперации КАК ВидОперацииСсылка,
	        |   СУММА(ПеняПоВзносамИОтчислениям.Сумма) КАК Сумма,
	        |   ПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	        |   ПеняПоВзносамИОтчислениям.ВидПлатежа КАК ВидПлатежаСсылка,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	        |   ПеняПоВзносамИОтчислениям.ФизическоеЛицо КАК ФизическоеЛицо
	        |ПОМЕСТИТЬ ВТ_Пеня
	        |ИЗ
	        |   Документ.ОтражениеЗарплатыВБухучете.ПеняПоВзносамИОтчислениям КАК ПеняПоВзносамИОтчислениям
	        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
	        |       ПО (ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = ПеняПоВзносамИОтчислениям.Подразделение)
	        |ГДЕ
	        |   ПеняПоВзносамИОтчислениям.Ссылка = &Ссылка
	        |
	        |СГРУППИРОВАТЬ ПО
	        |   ПеняПоВзносамИОтчислениям.Подразделение,
	        |   ПеняПоВзносамИОтчислениям.МестоВСтруктуреПредприятия,
	       	|   ПеняПоВзносамИОтчислениям.ВидОперации,
	        |   ПеняПоВзносамИОтчислениям.СпособОтраженияЗарплатыВБухучете,
	        |   ПеняПоВзносамИОтчислениям.ВидПлатежа,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане,
	        |   ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
	        |   ПеняПоВзносамИОтчислениям.ФизическоеЛицо
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |   ВТ_Пеня.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	        |   ВТ_Пеня.Подразделение КАК Подразделение,
	        |   ВТ_Пеня.ВидОперацииСсылка КАК ВидОперацииСсылка,
	        |   ВТ_Пеня.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВФинансовомУчете,
	        |   ВТ_Пеня.ВидПлатежаСсылка КАК ВидПлатежаСсылка,
	        |   ВТ_Пеня.Сумма КАК Сумма,
	        |   ВТ_Пеня.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	        |   ВЫБОР
	        |       КОГДА ВТ_Пеня.ПодразделениеОрганизации.ОбособленноеПодразделение
	        |           ТОГДА ВТ_Пеня.ПодразделениеОрганизации
	        |       ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
	        |   КОНЕЦ КАК СтруктурноеПодразделение,
	        |   ВТ_Пеня.ФизическоеЛицо КАК ФизическоеЛицо
	        |ИЗ
	        |   ВТ_Пеня КАК ВТ_Пеня
	        |       ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
	        |       ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = ВТ_Пеня.ПодразделениеОрганизации)";
				
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
		Запрос.УстановитьПараметр("Дата", ДанныеИБ.Дата);
		Запрос.УстановитьПараметр("ТЗПодчиненностьПодразделений", ПодчиненностьПодразделений);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// НачисленнаяЗарплатаИВзносы
		ТаблицаНачисленнаяЗарплатаИВзносы = РезультатыЗапроса[4].Выгрузить();
	
		ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаНачисленнаяЗарплатаИВзносы, "ВидОперации");
		
		ДанныеXDTO.Вставить("НачисленнаяЗарплатаИВзносы", ТаблицаНачисленнаяЗарплатаИВзносы);
		
		// УдержаннаяЗарплата
		ТаблицаУдержаннаяЗарплата = РезультатыЗапроса[6].Выгрузить();
			
		ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаУдержаннаяЗарплата, "ВидОперации");
		
		ДанныеXDTO.Вставить("УдержаннаяЗарплата", ТаблицаУдержаннаяЗарплата);
		
		//РегламентированныеУдержания
		ТаблицаРегламентированныеУдержания = РезультатыЗапроса[7].Выгрузить();
	
		ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаРегламентированныеУдержания, "ВидОперации");
		
		ДанныеXDTO.Вставить("РегламентированныеУдержания", ТаблицаРегламентированныеУдержания);
		
		// ПеняПоВзносамИОтчислениям
		ТаблицаПеняПоВзносамИОтчислениям = РезультатыЗапроса[9].Выгрузить();
	
		ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаПеняПоВзносамИОтчислениям, "ВидОперации");
		ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаПеняПоВзносамИОтчислениям, "ВидПлатежа");
		
		ДанныеXDTO.Вставить("ПеняПоВзносамИОтчислениям", ТаблицаПеняПоВзносамИОтчислениям);
КонецПроцедуры
#КонецОбласти
#Область Документ_ПеречислениеВзносовИОтчислений
Процедура ДобавитьПКО_Документ_ПеречислениеВзносовИОтчислений(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ПеречислениеВзносовИОтчислений";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ПеречислениеВзносовИОтчислений;
	ПравилоКонвертации.ОбъектФормата = "Документ.СБДСПеречислениеВзносовИОтчислений";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПеречислениеВзносовИОтчислений_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчет";
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаВыписки";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодНазначенияПлатежа";
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ФактическийПлательщик";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидДохода";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВключаетВОСМС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВключаетИПН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВключаетООСМС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВключаетОПВ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВключаетОПВР";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВключаетСО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПериодВзаиморасчетовВедомости";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ПеречислениеВзносовИОтчислений_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		//Статус, Валюта
		ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Номер КАК НомерВедомости,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ПериодРегистрации КАК МесяцНачисления,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидНалогаВзносаОтчисления КАК ВидОперацииСсылка,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Подразделение КАК ПодразделениеОрганизации,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидПлатежа КАК ВидПлатежаСсылка,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо КАК Сотрудник,
			|	СУММА(ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.НалогВзнос) КАК Сумма,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.МесяцПериода КАК ПериодВзаиморасчетовВедомости, 
			|	СУММА(ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.СуммаПлатежа) КАК СуммаПлатежа,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетОПВ КАК ВключаетОПВ,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетВОСМС КАК ВключаетВОСМС,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетИПН КАК ВключаетИПН,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетСО КАК ВключаетСО,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетООСМС КАК ВключаетООСМС,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидДохода КАК ВидДоходаСсылка,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетОПВР КАК ВключаетОПВР
			|ИЗ
			|	Документ.ПеречислениеВзносовИОтчислений КАК ПеречислениеВзносовИОтчислений
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеречислениеВзносовИОтчислений.ВедомостиНаПеречислениеВзносовИОтчислений КАК ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений
			|		ПО (ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений.Ссылка = ПеречислениеВзносовИОтчислений.Ссылка)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления
			|		ПО (ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка = ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений.Ведомость)
			|ГДЕ
			|	ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Дата,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ПериодРегистрации,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидНалогаВзносаОтчисления,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Подразделение,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидПлатежа,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.МесяцПериода, 
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Номер,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетОПВ,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетВОСМС,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетИПН,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетСО,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетООСМС,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидДохода,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ВключаетОПВР
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо.Фамилия,
			|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо.Имя,
			|	ПериодВзаиморасчетовВедомости";	  
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
		
		РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
		РасшифровкаПлатежа.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");
		РасшифровкаПлатежа.Колонки.Добавить("ВидДохода");
		
		Для Каждого Строка Из РасшифровкаПлатежа Цикл
		   
		   	Если Строка.ВидДоходаСсылка = Справочники.ВидыДоходов.ДоходыОтРаботодателя 
		   		ИЛИ Строка.ВидДоходаСсылка = Справочники.ВидыДоходов.ПустаяСсылка() Тогда
				Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
			Иначе 
				Строка.Сотрудник = ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
			КонецЕсли;
			
			НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"В" + Прав(Строка.НомерВедомости, 5);
			Строка.НомерВедомостиНаВыплатуЗарплаты = НомерВедомостиНаВыплатуЗарплаты;
	        Строка.ВидДохода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ВидДоходаСсылка, "Наименование");
		КонецЦикла;
		
		ДобавитьИдентификаторПеречисленияПоСсылке(РасшифровкаПлатежа, "ВидОперации");
		ДобавитьИдентификаторПеречисленияПоСсылке(РасшифровкаПлатежа, "ВидПлатежа");
		
		ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
		
		ДанныеXDTO.Вставить("Валюта", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
		
		ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"В" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
		
		Если ТипЗнч(ДанныеИБ.ФактическийПлательщик) = Тип("СправочникСсылка.Организации") Тогда
		    ДанныеXDTO.Вставить("ФактическийПлательщик", Новый Структура("Значение, ИмяПКО", ДанныеИБ.ФактическийПлательщик, "Справочник_Организации"));
		Иначе
		    ДанныеXDTO.Вставить("ФактическийПлательщик", Новый Структура("Значение, ИмяПКО", ДанныеИБ.ФактическийПлательщик, "Справочник_ПодразделенияОрганизаций"));
		КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ПеречислениеВзносовИОтчислений_УП_ОТ
Процедура ДобавитьПКО_Документ_ПеречислениеВзносовИОтчислений_УП_ОТ(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ПеречислениеВзносовИОтчислений_УП_ОТ";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ПеречислениеВзносовИОтчислений;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСПеречислениеВзносовИОтчислений";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПеречислениеВзносовИОтчислений_УП_ОТ_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчет";
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодНазначенияПлатежа";
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ПеречислениеВзносовИОтчислений_УП_ОТ_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	// Статус, Валюта.
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные",       Ложь);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные",    Истина);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
	ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты",              "Безналичная");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Номер КАК НомерВедомостиНаВыплатуЗарплаты,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидНалогаВзносаОтчисления КАК ВидОперацииСсылка,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидПлатежа КАК ВидПлатежаСсылка,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо КАК Сотрудник,
		|	СУММА(ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.НалогВзнос) КАК Сумма
		|ИЗ
		|	Документ.ПеречислениеВзносовИОтчислений КАК ПеречислениеВзносовИОтчислений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеречислениеВзносовИОтчислений.ВедомостиНаПеречислениеВзносовИОтчислений КАК ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений
		|		ПО (ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений.Ссылка = ПеречислениеВзносовИОтчислений.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления
		|		ПО (ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка = ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений.Ведомость)
		|ГДЕ
		|	ПеречислениеВзносовИОтчисленийВедомостиНаПеречислениеВзносовИОтчислений.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Дата,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидНалогаВзносаОтчисления,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.ВидПлатежа,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.ФизическоеЛицо,
		|	ВедомостьНаПеречислениеВзносовОтчисленийНалогиВзносыОтчисления.Ссылка.Номер");
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ТаблицаРасшифровка = Запрос.Выполнить().Выгрузить();
	
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаРасшифровка, "ВидОперации");
	ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаРасшифровка, "ВидПлатежа");
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", ТаблицаРасшифровка);
	
	ДанныеXDTO.Вставить("Сумма", ТаблицаРасшифровка.Итог("Сумма"));
КонецПроцедуры
#КонецОбласти
#Область Документ_ПлатежноеПоручение
Процедура ДобавитьПКО_Документ_ПлатежноеПоручение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ПлатежноеПоручение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ПлатежноеПоручение;
	ПравилоКонвертации.ОбъектФормата = "Документ.СБДСПеречислениеЗаработнойПлаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПлатежноеПоручение_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчет";
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидОперации";
	НоваяСтрока.СвойствоФормата = "ВидОперацииПлатежногоПоручения";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ВидыОперацийПлатежногоПоручения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаВыписки";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодНазначенияПлатежа";
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ФактическийПлательщик";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Банк";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КлассификаторБанков";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидПрочихВыплат";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыПрочихВыплат";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПериодВзаиморасчетовВедомости";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособВыплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_СпособыВыплатыПрочихДоходов";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ПлатежноеПоручение_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
	        Возврат;
	    КонецЕсли;
	    
	    //Статус, Валюта
	    ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	    
	    //Сумма,
	    //РасшифровкаПлатежа: БанковскийСчет, Сумма, НомерВедомостиНаВыплатуЗарплаты, ДатаВедомостиНаВыплатуЗарплаты
	    Запрос = Новый Запрос(
	   "ВЫБРАТЬ
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Номер КАК НомерВедомости,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.ПериодРегистрации КАК ПериодВзаиморасчетовВедомости,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Подразделение КАК ПодразделениеОрганизации,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.ФизическоеЛицо КАК Сотрудник,
		|	СУММА(ВедомостьНаВыплатуЗарплатыВБанкЗарплата.КВыплате) КАК Сумма,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.ЗарплатныйПроект.Банк КАК Банк,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка КАК Ведомость,
		|	ЗНАЧЕНИЕ(Справочник.ВидыПрочихВыплат.ПустаяСсылка) КАК ВидПрочихВыплат,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.ПериодРегистрации КАК МесяцНачисления,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение
		|			ТОГДА ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ КАК СтруктурноеПодразделение,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыПрочихДоходов.ПустаяСсылка) КАК СпособВыплаты,
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка) КАК БанковскийСчет
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ПО (ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВБанк.Зарплата КАК ВедомостьНаВыплатуЗарплатыВБанкЗарплата
		|		ПО (ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Номер,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Дата,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.ПериодРегистрации,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.ЗарплатныйПроект.Банк,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.ФизическоеЛицо,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.Подразделение,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка,
		|	ВедомостьНаВыплатуЗарплатыВБанкЗарплата.Ссылка.ПериодРегистрации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Номер,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Дата,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.ПериодРегистрации,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Подразделение,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо,
		|	СУММА(ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.КВыплате),
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.БанковскийСчет.Банк,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ВидыПрочихВыплат.ПустаяСсылка),
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение
		|			ТОГДА ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыПрочихДоходов.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ПО (ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата КАК ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата
		|		ПО (ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Номер,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Дата,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.ПериодРегистрации,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.Подразделение,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.ФизическоеЛицо,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.БанковскийСчет.Банк,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка,
		|	ВедомостьНаВыплатуЗарплатыПеречислениемЗарплата.Ссылка.ПериодРегистрации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Номер,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Дата,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.ПериодВзаиморасчетов,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Подразделение,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизическоеЛицо,
		|	СУММА(ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Сумма),
		|	ПлатежноеПоручение.БанковскийСчет.Банк,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.ВидПрочихВыплат,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение
		|			ТОГДА ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.СпособыВыплатыПрочихДоходов.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаКонтрагентов.ПустаяСсылка)
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеВедомостиПрочие
		|		ПО (ПлатежноеПоручениеВедомостиПрочие.Ссылка = ПлатежноеПоручение.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты
		|		ПО (ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка = ПлатежноеПоручениеВедомостиПрочие.Ведомость)
		|ГДЕ
		|	ПлатежноеПоручениеВедомостиПрочие.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Номер,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Дата,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизическоеЛицо,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.Подразделение,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.ВидПрочихВыплат,
		|	ПлатежноеПоручение.БанковскийСчет.Банк,
		|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка.ПериодВзаиморасчетов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Номер,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Дата,
		|	ВедомостьПрочихДоходовВБанкВыплаты.ПериодВзаиморасчетов,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Подразделение,
		|	ВедомостьПрочихДоходовВБанкВыплаты.ФизическоеЛицо,
		|	СУММА(ВедомостьПрочихДоходовВБанкВыплаты.КВыплате),
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.ЗарплатныйПроект.Банк,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ВидыПрочихВыплат.ПустаяСсылка),
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение
		|			ТОГДА ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.СпособВыплаты,
		|	ВедомостьПрочихДоходовВБанкВыплаты.НомерЛицевогоСчета
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ПО (ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовВБанк.Выплаты КАК ВедомостьПрочихДоходовВБанкВыплаты
		|		ПО (ВедомостьПрочихДоходовВБанкВыплаты.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Номер,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Дата,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.ПериодРегистрации,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.Подразделение,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.ЗарплатныйПроект.Банк,
		|	ВедомостьПрочихДоходовВБанкВыплаты.ФизическоеЛицо,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка,
		|	ВедомостьПрочихДоходовВБанкВыплаты.Ссылка.СпособВыплаты,
		|	ВедомостьПрочихДоходовВБанкВыплаты.НомерЛицевогоСчета,
		|	ВедомостьПрочихДоходовВБанкВыплаты.ПериодВзаиморасчетов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Номер,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Дата,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.ПериодВзаиморасчетов,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Подразделение,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.ФизическоеЛицо,
		|	СУММА(ВедомостьПрочихДоходовПеречислениемВыплаты.КВыплате),
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Банк,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ВидыПрочихВыплат.ПустаяСсылка),
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.ПериодРегистрации,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение
		|			ТОГДА ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.СпособВыплаты,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.БанковскийСчет
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ПО (ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовПеречислением.Выплаты КАК ВедомостьПрочихДоходовПеречислениемВыплаты
		|		ПО (ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Номер,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Дата,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Подразделение,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.ПериодРегистрации,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.ФизическоеЛицо,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.БанковскийСчет.Банк,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.Банк,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.Ссылка.СпособВыплаты,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.БанковскийСчет,
		|	ВедомостьПрочихДоходовПеречислениемВыплаты.ПериодВзаиморасчетов");		
	    Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	    
	    РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	    РасшифровкаПлатежа.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");  
	    
	    РасшифровкаПлатежаТЗ = Новый ТаблицаЗначений;
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("НомерВедомостиНаВыплатуЗарплаты");   
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("ДатаВедомостиНаВыплатуЗарплаты", Новый ОписаниеТипов("Дата"));   
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("ПериодВзаиморасчетовВедомости", Новый ОписаниеТипов("Дата"));   
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("Сотрудник",  Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));   
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("Банк",  Новый ОписаниеТипов("СправочникСсылка.КлассификаторБанков"));  
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));  
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("МесяцНачисления",  Новый ОписаниеТипов("Дата"));  
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("СпособВыплаты",  Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВыплатыПрочихДоходов"));  
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("БанковскийСчет");  
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("ПодразделениеОрганизации",  Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));   
	    РасшифровкаПлатежаТЗ.Колонки.Добавить("СтруктурноеПодразделение",  Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));   
	    
	    ИтоговаяСумма = 0;
	    
	    Для Каждого Строка Из РасшифровкаПлатежа Цикл
	        Если ТипЗнч(Строка.Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
	            НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"С" + Прав(Строка.НомерВедомости, 5);
	        ИначеЕсли ТипЗнч(Строка.Ведомость) = Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда
	            НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"П" + Прав(Строка.НомерВедомости, 5);
	        ИначеЕсли ТипЗнч(Строка.Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
	            НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"Д" + Прав(Строка.НомерВедомости, 5);
	        ИначеЕсли ТипЗнч(Строка.Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
	            НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"К" + Прав(Строка.НомерВедомости, 5);
	        Иначе
	            НомерВедомостиНаВыплатуЗарплаты = Лев(Строка.НомерВедомости, 5) +"Б" + Прав(Строка.НомерВедомости, 5);
	        КонецЕсли; 
	        
	        Если ТипЗнч(Строка.Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк")
	            ИЛИ ТипЗнч(Строка.Ведомость) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда 
	            
	            СтрокаРасшифровкаПлатежа = РасшифровкаПлатежаТЗ.Добавить();           
	            
	            СтрокаРасшифровкаПлатежа.НомерВедомостиНаВыплатуЗарплаты = НомерВедомостиНаВыплатуЗарплаты; 
	            СтрокаРасшифровкаПлатежа.ДатаВедомостиНаВыплатуЗарплаты = Строка.ДатаВедомостиНаВыплатуЗарплаты; 
	            СтрокаРасшифровкаПлатежа.ПериодВзаиморасчетовВедомости = Строка.ПериодВзаиморасчетовВедомости; 
	            СтрокаРасшифровкаПлатежа.Сотрудник = ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации); 
	            СтрокаРасшифровкаПлатежа.Сумма = Строка.Сумма; 
	            СтрокаРасшифровкаПлатежа.Банк = Строка.Банк; 
	            СтрокаРасшифровкаПлатежа.МесяцНачисления = Строка.МесяцНачисления; 
	            СтрокаРасшифровкаПлатежа.СпособВыплаты = Строка.СпособВыплаты; 
	            СтрокаРасшифровкаПлатежа.ПодразделениеОрганизации = Строка.ПодразделениеОрганизации; 
	            СтрокаРасшифровкаПлатежа.СтруктурноеПодразделение = Строка.СтруктурноеПодразделение; 
	            
	            ВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы = ПолучитьВыгружатьФизЛицаПоНезарплатныеДоходы(КомпонентыОбмена.ПараметрыКонвертации);
	            Если ВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы Тогда
	                СтруктураБанковскийСчет = Новый Структура;
	                СтруктураБанковскийСчет.Вставить("Банк", Строка.Банк);
	                СтруктураБанковскийСчет.Вставить("Ссылка", Строка.Сотрудник);
	                СтруктураБанковскийСчет.Вставить("Наименование",  ?(ТипЗнч(Строка.БанковскийСчет) = Тип("Строка"), 
	                Строка.БанковскийСчет, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.БанковскийСчет, "Наименование")));
	                	СтруктураБанковскийСчет.Вставить("Владелец", ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации));
	                СтруктураБанковскийСчет.Вставить("НомерСчета", ?(ТипЗнч(Строка.БанковскийСчет) = Тип("Строка"), 
	                Строка.БанковскийСчет, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.БанковскийСчет, "НомерСчета")));
	                
	                СтрокаРасшифровкаПлатежа.БанковскийСчет = Новый Структура("Значение, ИмяПКО", СтруктураБанковскийСчет, "Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры"); 
	            КонецЕсли;
	            ИтоговаяСумма = ИтоговаяСумма + Строка.Сумма; 
	            
	        Иначе
	            Строка.НомерВедомостиНаВыплатуЗарплаты = НомерВедомостиНаВыплатуЗарплаты;
	            Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
	            
	        КонецЕсли;
	        
	    КонецЦикла;
	    
	    Если РасшифровкаПлатежаТЗ.Количество() > 0 Тогда
	        ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежаТЗ);
	        ДанныеXDTO.Вставить("Сумма", ИтоговаяСумма);
	    Иначе
	        ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);   
	        ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
	    КонецЕсли;
	    
	    ДанныеXDTO.Вставить("Валюта", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
	    
	    ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"Б" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
	    
	    Если ТипЗнч(ДанныеИБ.ФактическийПлательщик) = Тип("СправочникСсылка.Организации") Тогда
	        ДанныеXDTO.Вставить("ФактическийПлательщик", Новый Структура("Значение, ИмяПКО", ДанныеИБ.ФактическийПлательщик, "Справочник_Организации"));
	    Иначе
	        ДанныеXDTO.Вставить("ФактическийПлательщик", Новый Структура("Значение, ИмяПКО", ДанныеИБ.ФактическийПлательщик, "Справочник_ПодразделенияОрганизаций"));
	    КонецЕсли
КонецПроцедуры
#КонецОбласти
#Область Документ_ПлатежноеПоручение_УП_ОТ
Процедура ДобавитьПКО_Документ_ПлатежноеПоручение_УП_ОТ(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ПлатежноеПоручение_УП_ОТ";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ПлатежноеПоручение;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПлатежноеПоручение_УП_ОТ_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчет";
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодНазначенияПлатежа";
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ПлатежноеПоручение_УП_ОТ_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	// Статус, Валюта.
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные",       Ложь);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные",    Истина);
	ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
	ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты",              "Безналичная");
	
	Запрос = Новый Запрос(
	" ВЫБРАТЬ
	|	 	СУММА(ВЫБОР
	|	 			КОГДА ВедомостьПрочихДоходовВБанк.Номер ЕСТЬ NULL
	|	 				ТОГДА ВедомостьНаВыплатуЗарплатыВБанк.СуммаПоДокументу
	|	 			ИНАЧЕ ВедомостьПрочихДоходовВБанк.СуммаПоДокументу
	|	 		КОНЕЦ) КАК Сумма,
	|	 	ПлатежноеПоручение.НомерРеестра КАК НомерВедомостиНаВыплатуЗарплаты,
	|	 	ПлатежноеПоручение.Дата КАК ДатаВедомостиНаВыплатуЗарплаты
	|	 ИЗ
	|	 	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|	 		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
	|	 		ПО (ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка)
	|	 		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплатыВБанк
	|	 		ПО (ВедомостьНаВыплатуЗарплатыВБанк.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
	|	 		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовВБанк КАК ВедомостьПрочихДоходовВБанк
	|	 		ПО (ВедомостьПрочихДоходовВБанк.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
	|	 ГДЕ
	|	 	ПлатежноеПоручениеВедомости.Ссылка = &Ссылка
	|	 
	|	 СГРУППИРОВАТЬ ПО
	|	 	ПлатежноеПоручение.НомерРеестра,
	|	 	ПлатежноеПоручение.Дата");
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ТаблицаРасшифровка = Запрос.Выполнить().Выгрузить();
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", ТаблицаРасшифровка);
	
	ДанныеXDTO.Вставить("Сумма", ТаблицаРасшифровка.Итог("Сумма"));
КонецПроцедуры
#КонецОбласти
#Область Документ_ПлатежноеПоручениеПДПеречислением_Заявка
Процедура ДобавитьПКО_Документ_ПлатежноеПоручениеПДПеречислением_Заявка(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ПлатежноеПоручениеПДПеречислением_Заявка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ПлатежноеПоручение;
	ПравилоКонвертации.ОбъектФормата = "Документ.ЗаявкаНаРасходДСВыплатаЗарплаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПлатежноеПоручениеПДПеречислением_Заявка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчет";
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "БанковскийСчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "КрайнийСрокПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "УтвержденнаяДатаПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодНазначенияПлатежа";
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Автор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "КтоЗаявил";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыБезналичные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыНаличные";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЖелательнаяФормаОплатыПлатежнаяКарта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Статус";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "УтвержденнаяФормаОплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВыплатуЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ПлатежноеПоручениеПДПеречислением_Заявка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		//Статус, Валюта
		ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
			
		//ЖелательнаяФормаОплатыНаличные, ЖелательнаяФормаОплатыБезналичные, ЖелательнаяФормаОплатыПлатежнаяКарта, УтвержденнаяФормаОплаты
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыНаличные", Ложь);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыБезналичные", Истина);
		ДанныеXDTO.Вставить("ЖелательнаяФормаОплатыПлатежнаяКарта", Ложь);
		ДанныеXDTO.Вставить("УтвержденнаяФормаОплаты", "Безналичная");
		
		//РасшифровкаПлатежа: Сотрудник, БанковскийСчет, Сумма, НомерВедомостиНаВыплатуЗарплаты, ДатаВедомостиНаВыплатуЗарплаты
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СУММА(ВедомостьПрочихДоходовПеречислением.КВыплате) КАК Сумма,
		|	ВедомостьПрочихДоходовПеречислением.ФизическоеЛицо КАК Сотрудник,
		|	ВедомостьПрочихДоходовПеречислениемСостав.БанковскийСчет КАК БанковскийСчет,
		|	ПлатежноеПоручение.НомерРеестра КАК НомерВедомостиНаВыплатуЗарплаты,
		|	ПлатежноеПоручение.Дата КАК ДатаВедомостиНаВыплатуЗарплаты
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ПО (ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовПеречислением.Выплаты КАК ВедомостьПрочихДоходовПеречислением
		|		ПО (ВедомостьПрочихДоходовПеречислением.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовПеречислением.Состав КАК ВедомостьПрочихДоходовПеречислениемСостав
		|		ПО (ВедомостьПрочихДоходовПеречислениемСостав.Ссылка = ПлатежноеПоручениеВедомости.Ведомость)
		|			И (ВедомостьПрочихДоходовПеречислениемСостав.ИдентификаторСтроки = ВедомостьПрочихДоходовПеречислением.ИдентификаторСтроки)
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежноеПоручение.НомерРеестра,
		|	ПлатежноеПоручение.Дата,
		|	ВедомостьПрочихДоходовПеречислением.ФизическоеЛицо,
		|	ВедомостьПрочихДоходовПеречислениемСостав.БанковскийСчет");
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ТаблицаРасшифровка = Запрос.Выполнить().Выгрузить();
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", ТаблицаРасшифровка);
	
	ДанныеXDTO.Вставить("Сумма", ТаблицаРасшифровка.Итог("Сумма"));
КонецПроцедуры
#КонецОбласти
#Область Документ_РегистрацияПрочихВыплат
Процедура ДобавитьПКО_Документ_РегистрацияПрочихВыплат(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_РегистрацияПрочихВыплат";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.РегистрацияПрочихВыплат;
	ПравилоКонвертации.ОбъектФормата = "Документ.РегистрацияПрочихВыплат";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_РегистрацияПрочихВыплат_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидПрочихВыплат";
	НоваяСтрока.СвойствоФормата = "ВидПрочихВыплат";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыПрочихВыплат";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СпособОтраженияВРеглУчете";
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ПрочиеВыплаты", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ПрочиеВыплаты;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПериодВзаиморасчетов";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_РегистрацияПрочихВыплат_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РегистрацияПрочихВыплатПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РегистрацияПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	СУММА(РегистрацияПрочихВыплатПрочиеВыплаты.СуммаНачисления) КАК СуммаНачисления,
	|	РегистрацияПрочихВыплатПрочиеВыплаты.СпособОтраженияВРеглУчете КАК СпособОтраженияЗарплатыВФинансовомУчете
	|ИЗ
	|	Документ.РегистрацияПрочихВыплат КАК РегистрацияПрочихВыплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихВыплат.ПрочиеВыплаты КАК РегистрацияПрочихВыплатПрочиеВыплаты
	|		ПО (РегистрацияПрочихВыплатПрочиеВыплаты.Ссылка = РегистрацияПрочихВыплат.Ссылка)
	|
	|ГДЕ
	|	РегистрацияПрочихВыплат.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияПрочихВыплатПрочиеВыплаты.ФизическоеЛицо,
	|	РегистрацияПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов,
	|	РегистрацияПрочихВыплатПрочиеВыплаты.СпособОтраженияВРеглУчете";                           
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ПрочиеВыплаты = Запрос.Выполнить().Выгрузить();
	
	ДанныеXDTO.Вставить("ПрочиеВыплаты",ПрочиеВыплаты);
КонецПроцедуры
#КонецОбласти
#Область Документ_РезервыПоОплатеТруда
Процедура ДобавитьПКО_Документ_РезервыПоОплатеТруда(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_РезервыПоОплатеТруда";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.РезервыПоОплатеТруда;
	ПравилоКонвертации.ОбъектФормата = "Документ.РезервыПоОплатеТруда";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_РезервыПоОплатеТруда_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бухгалтер";
	НоваяСтрока.СвойствоФормата = "Бухгалтер";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидОперации";
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ВидыОперацийРезервовПоОплатеТруда";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "МесяцНачисления";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Резерв";
	НоваяСтрока.СвойствоФормата = "Резерв";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Резервы";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ОценочныеОбязательства", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ОценочныеОбязательства;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерва";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОПВР";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОППВ";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваОтчисленияОСМС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СуммаРезерваСО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Документ_РезервыПоОплатеТруда_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		ПодчиненностьПодразделений = Новый ТаблицаЗначений;
		ПодчиненностьПодразделений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		ПодчиненностьПодразделений.Колонки.Добавить("ВышестоящееПодразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодчиненностьПодразделений.Подразделение КАК Подразделение,
		|	ПодчиненностьПодразделений.Подразделение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
		|ИЗ
		|	РегистрСведений.ПодчиненностьПодразделенийОрганизаций КАК ПодчиненностьПодразделений
		|ГДЕ
		|	ПодчиненностьПодразделений.ВышестоящееПодразделение.ОбособленноеПодразделение = ИСТИНА
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВышестоящееПодразделение)
		|ПО
		|	Подразделение,
		|	ОбособленноеПодразделение";
		
		Результат = Запрос.Выполнить();
		
		ИтогиПоВышестоящим = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ВыборкаПоПодразделениям = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПодразделениям.Следующий() Цикл
			Если ВыборкаПоПодразделениям.ОбособленноеПодразделение Тогда
				НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
				НоваяСтрока.Подразделение = ВыборкаПоПодразделениям.Подразделение;
			    НоваяСтрока.ВышестоящееПодразделение = ВыборкаПоПодразделениям.Подразделение;
			Иначе
				ВыборкаОбособленноеПодразделение = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ВыборкаОбособленноеПодразделение.Следующий();
				
				Выборка = ВыборкаОбособленноеПодразделение.Выбрать();
				Уровень = 0;
				НоваяСтрока = ПодчиненностьПодразделений.Добавить(); 
				НоваяСтрока.Подразделение = ВыборкаОбособленноеПодразделение.Подразделение;
				Пока Выборка.Следующий() Цикл
					Если ВыборкаОбособленноеПодразделение.ВышестоящееПодразделение = 1 Тогда
						ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
					Иначе
						НайденнаяСтрока = ИтогиПоВышестоящим.Строки.Найти(Выборка.ВышестоящееПодразделение, "Подразделение");
						Если НайденнаяСтрока.ВышестоящееПодразделение > Уровень Тогда
							ВышестоящееПодразделение = Выборка.ВышестоящееПодразделение;
							Уровень = НайденнаяСтрока.ВышестоящееПодразделение;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				НоваяСтрока.ВышестоящееПодразделение = ВышестоящееПодразделение;
			КонецЕсли;	
		КонецЦикла;
		
		Запрос = Новый Запрос();
		Запрос.Текст =	
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	РегистрацииВНалоговомОргане.Владелец КАК Владелец,
			|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВТ_Регистрации
			|ИЗ
			|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.Организации)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
			|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница,
			|	РегистрацииВНалоговомОргане.Владелец,
			|	РегистрацииВНалоговомОргане.Ссылка
			|ИЗ
			|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
			|			&Дата,
			|			ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)
			|				И ВЫРАЗИТЬ(СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
			|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПодчиненностьПодразделений.Подразделение КАК Подразделение,
			|	ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
			|ПОМЕСТИТЬ ВТ_ТЗПодчиненностьПодразделений
			|ИЗ
			|	&ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПодчиненностьПодразделенийОрганизации.Подразделение КАК Подразделение,
			|	ПодчиненностьПодразделенийОрганизации.ВышестоящееПодразделение КАК ВышестоящееПодразделение
			|ПОМЕСТИТЬ ВТ_ПодчиненностьПодразделений
			|ИЗ
			|	ВТ_ТЗПодчиненностьПодразделений КАК ПодчиненностьПодразделенийОрганизации
			|ГДЕ
			|	ВЫРАЗИТЬ(ПодчиненностьПодразделенийОрганизации.Подразделение КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Регистрации.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	ВТ_Регистрации.Владелец КАК Владелец,
			|	ВТ_ПодчиненностьПодразделений.Подразделение КАК Подразделение,
			|	ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение КАК ВышестоящееПодразделение
			|ПОМЕСТИТЬ ВТ_ПодразделенияСРегистрацией
			|ИЗ
			|	ВТ_ПодчиненностьПодразделений КАК ВТ_ПодчиненностьПодразделений
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регистрации КАК ВТ_Регистрации
			|		ПО ВТ_ПодчиненностьПодразделений.ВышестоящееПодразделение = ВТ_Регистрации.СтруктурнаяЕдиница
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Подразделение КАК ПодразделениеОрганизации,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВФинансовомУчете,
			|	ВЫБОР
			|		КОГДА РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Подразделение.ОбособленноеПодразделение
			|			ТОГДА РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Подразделение
			|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
			|	КОНЕЦ КАК СтруктурноеПодразделение,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.МестоВСтруктуреПредприятия КАК Подразделение,
			|	ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение КАК ВышестоящееПодразделение,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерва КАК СуммаРезерва,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваСО КАК СуммаРезерваСО,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваСН КАК СуммаРезерваСН,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваОППВ КАК СуммаРезерваОППВ,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваОПВР КАК СуммаРезерваОПВР,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваОтчисленияОСМС КАК СуммаРезерваОтчисленияОСМС
			|ИЗ
			|	Документ.РезервыПоОплатеТруда.ОценочныеОбязательстваПоСотрудникам КАК РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодразделенияСРегистрацией КАК ВТ_ПодразделенияСРегистрацией
			|		ПО (ВТ_ПодразделенияСРегистрацией.Подразделение = РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Подразделение)
			|ГДЕ
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Подразделение,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.МестоВСтруктуреПредприятия,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СпособОтраженияЗарплатыВБухучете,
			|	ВТ_ПодразделенияСРегистрацией.ВышестоящееПодразделение,
			|	ВЫБОР
			|		КОГДА РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Подразделение.ОбособленноеПодразделение
			|			ТОГДА РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Подразделение
			|		ИНАЧЕ ВТ_ПодразделенияСРегистрацией.СтруктурнаяЕдиница
			|	КОНЕЦ,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.Сотрудник.ФизическоеЛицо,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерва,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваСО,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваСН,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваОППВ,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваОПВР,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СуммаРезерваОтчисленияОСМС
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПодразделениеОрганизации,
			|	РезервыПоОплатеТрудаОценочныеОбязательстваПоСотрудникам.СпособОтраженияЗарплатыВБухучете";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
		Запрос.УстановитьПараметр("Дата", ДанныеИБ.Дата);
		Запрос.УстановитьПараметр("ТЗПодчиненностьПодразделений", ПодчиненностьПодразделений);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		// ОценочныеОбязательства
		ТаблицаОценочныеОбязательства = РезультатыЗапроса[4].Выгрузить();
		
		Для Каждого Строка Из ТаблицаОценочныеОбязательства Цикл
			Строка.ФизическоеЛицо = ФизическоеЛицоДляВыгрузки(Строка.ФизическоеЛицо, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЦикла;
	
		//ТаблицаОценочныеОбязательства.Колонки.Добавить("Подразделение");
		//ЗаполнитьПодразделениеПоУмолчанию(ТаблицаОценочныеОбязательства);
			
		ДанныеXDTO.Вставить("ОценочныеОбязательства", ТаблицаОценочныеОбязательства);
			
		Номер = Лев(ДанныеИБ.Номер, 5) +"Р" + Прав(ДанныеИБ.Номер, 5);
		ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Номер);
КонецПроцедуры
#КонецОбласти
#Область Документ_СведенияОНезачисленнойЗарплате
Процедура ДобавитьПКО_Документ_СведенияОНезачисленнойЗарплате(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_СведенияОНезачисленнойЗарплате";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.СведенияОНезачисленнойЗарплате;
	ПравилоКонвертации.ОбъектФормата = "Документ.ПБДСВозвратЗаработнойПлаты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_СведенияОНезачисленнойЗарплате_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаВыписки";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВозвратЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВозвратЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_СведенияОНезачисленнойЗарплате_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлатежноеПоручениеВедомости.Ссылка.Контрагент КАК Контрагент,
	|	ПлатежноеПоручениеВедомости.Ссылка.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежноеПоручениеВедомости.Ссылка.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ПлатежноеПоручениеВедомости.Ссылка.КодНазначенияПлатежа КАК КодНазначенияПлатежа,
	|	ПлатежноеПоручениеВедомости.Ссылка.НазначениеПлатежа КАК НазначениеПлатежа
	|ИЗ
	|	Документ.СведенияОНезачисленнойЗарплате КАК СведенияОНезачисленнойЗарплате
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
	|		ПО (СведенияОНезачисленнойЗарплате.Ведомость = ПлатежноеПоручениеВедомости.Ведомость)
	|ГДЕ
	|	СведенияОНезачисленнойЗарплате.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			ДанныеXDTO.Вставить("Контрагент", Выборка.Контрагент);
			ДанныеXDTO.Вставить("БанковскийСчетОрганизации", Выборка.БанковскийСчет);
			ДанныеXDTO.Вставить("БанковскийСчет", Выборка.БанковскийСчетКонтрагента);
			ДанныеXDTO.Вставить("НазначениеПлатежа", Выборка.НазначениеПлатежа);
			ДанныеXDTO.Вставить("КодНазначенияПлатежа", Выборка.КодНазначенияПлатежа);
		КонецЦикла;
	КонецЕсли; 
	
	//Статус, Валюта
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	ФизическиеЛица = ДанныеИБ.Сотрудники.ВыгрузитьКолонку("ФизическоеЛицо");
	
	//Сумма,
	//РасшифровкаПлатежа: Сумма, НомерВедомостиНаВозвратЗарплаты, ДатаВедомостиНаВозвратЗарплаты, Сотрудник 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", ДанныеИБ.Ведомость);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗарплатаКВыплате.Регистратор.Номер КАК НомерВедомости,
		|	ЗарплатаКВыплате.Регистратор.Дата КАК ДатаВедомостиНаВозвратЗарплаты,
		|	ЗарплатаКВыплате.Подразделение КАК ПодразделениеОрганизации,
		|	ЗарплатаКВыплате.Период КАК МесяцНачисления,
		|	СУММА(ЗарплатаКВыплате.СуммаКВыплате) КАК Сумма,
		|	ЗарплатаКВыплате.ФизическоеЛицо КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
		|ГДЕ
		|	ЗарплатаКВыплате.Регистратор = &Ведомость
		|	И ЗарплатаКВыплате.ФизическоеЛицо В(&ФизическиеЛица)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗарплатаКВыплате.Регистратор.Номер,
		|	ЗарплатаКВыплате.Регистратор.Дата,
		|	ЗарплатаКВыплате.Подразделение,
		|	ЗарплатаКВыплате.Период,
		|	ЗарплатаКВыплате.ФизическоеЛицо";
	
	РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	РасшифровкаПлатежа.Колонки.Добавить("НомерВедомостиНаВозвратЗарплаты");
	
	Для Каждого Строка Из РасшифровкаПлатежа Цикл
		Если ТипЗнч(ДанныеИБ.Ведомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
			НомерВедомостиНаВозвратЗарплаты = Лев(Строка.НомерВедомости, 5) +"С" + Прав(Строка.НомерВедомости, 5);
		Иначе
			НомерВедомостиНаВозвратЗарплаты = Лев(Строка.НомерВедомости, 5) +"Б" + Прав(Строка.НомерВедомости, 5);
		КонецЕсли;
		Строка.НомерВедомостиНаВозвратЗарплаты = НомерВедомостиНаВозвратЗарплаты;
		Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
	КонецЦикла; 
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
	ДанныеXDTO.Вставить("Валюта", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
	
	ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"Б" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
КонецПроцедуры
#КонецОбласти
#Область Документ_СведенияОНезачисленныхВзносахОтчислениях
Процедура ДобавитьПКО_Документ_СведенияОНезачисленныхВзносахОтчислениях(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_СведенияОНезачисленныхВзносахОтчислениях";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.СведенияОНезачисленныхВзносахОтчислениях;
	ПравилоКонвертации.ОбъектФормата = "Документ.ПБДСВозвратВзносовИОтчислений";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаВыписки";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.СвойствоФормата = "СтруктурноеПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчет";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "БанковскийСчетОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_БанковскиеСчетаОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВходящегоДокумента";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "КодНазначенияПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("РасшифровкаПлатежа", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.РасшифровкаПлатежа;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидДохода";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидОперации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидПлатежа";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВедомостиНаВозвратЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "МесяцНачисления";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерВедомостиНаВозвратЗарплаты";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ПодразделениеОрганизации";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеречислениеВзносовИОтчислений.Ссылка.Контрагент КАК Контрагент,
	|	ПеречислениеВзносовИОтчислений.Ссылка.БанковскийСчет КАК БанковскийСчет,
	|	ПеречислениеВзносовИОтчислений.Ссылка.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ПеречислениеВзносовИОтчислений.Ссылка.КодНазначенияПлатежа КАК КодНазначенияПлатежа,
	|	ПеречислениеВзносовИОтчислений.Ссылка.НазначениеПлатежа КАК НазначениеПлатежа
	|ИЗ
	|	Документ.СведенияОНезачисленныхВзносахОтчислениях КАК СведенияОНезачисленныхВзносахОтчислениях
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеречислениеВзносовИОтчислений.ВедомостиНаПеречислениеВзносовИОтчислений КАК ПеречислениеВзносовИОтчислений
	|		ПО СведенияОНезачисленныхВзносахОтчислениях.Ведомость = ПеречислениеВзносовИОтчислений.Ведомость
	|ГДЕ
	|	СведенияОНезачисленныхВзносахОтчислениях.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			ДанныеXDTO.Вставить("Контрагент", Выборка.Контрагент);
			ДанныеXDTO.Вставить("БанковскийСчетОрганизации", Выборка.БанковскийСчет);
			ДанныеXDTO.Вставить("БанковскийСчет", Выборка.БанковскийСчетКонтрагента);
			ДанныеXDTO.Вставить("НазначениеПлатежа", Выборка.НазначениеПлатежа);
			ДанныеXDTO.Вставить("КодНазначенияПлатежа", Выборка.КодНазначенияПлатежа);
		КонецЦикла;
	КонецЕсли;
	
	//Статус, Валюта
	ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO);
	
	ФизическиеЛица = ДанныеИБ.Сотрудники.ВыгрузитьКолонку("ФизическоеЛицо");
	
	//Сумма,
	//РасшифровкаПлатежа: Сумма, НомерВедомостиНаВозвратЗарплаты, ДатаВедомостиНаВозвратЗарплаты, Сотрудник, Месяц начисления
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ведомость", ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор.Номер КАК НомерВедомостиНаВозвратЗарплаты,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор.Дата КАК ДатаВедомостиНаВозвратЗарплаты,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор.Подразделение КАК ПодразделениеОрганизации,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ПериодРегистрации КАК МесяцНачисления,
	|	СУММА(-НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.НалогВзнос) КАК Сумма,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидНалогаВзносаОтчисления КАК ВидОперацииСсылка,
	|	ВЫБОР
	|		КОГДА НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
	|		ИНАЧЕ НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидДохода
	|	КОНЕЦ КАК ВидДоходаСсылка,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидПлатежа КАК ВидПлатежаСсылка,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ФизическоеЛицо КАК Сотрудник
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами КАК НалогиВзносыОтчисленияРасчетыСБюджетомИФондами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеВзносовОтчислений КАК ВедомостьНаПеречислениеВзносовОтчислений
	|		ПО (ВЫРАЗИТЬ(НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор КАК Документ.СведенияОНезачисленныхВзносахОтчислениях).Ведомость = ВедомостьНаПеречислениеВзносовОтчислений.Ссылка)
	|ГДЕ
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор = &Ведомость
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор.Номер,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор.Дата,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Регистратор.Подразделение,
	|	ВедомостьНаПеречислениеВзносовОтчислений.ПериодРегистрации,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидНалогаВзносаОтчисления,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидДохода,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ВидПлатежа,
	|	НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ФизическоеЛицо";
	
	РасшифровкаПлатежа = Запрос.Выполнить().Выгрузить();
	РасшифровкаПлатежа.Колонки.Добавить("ВидДохода");
	
	Для Каждого Строка Из РасшифровкаПлатежа Цикл
	   	Если Строка.ВидДоходаСсылка = Справочники.ВидыДоходов.ДоходыОтРаботодателя 
	   		ИЛИ Строка.ВидДоходаСсылка = Справочники.ВидыДоходов.ПустаяСсылка() Тогда
			Строка.Сотрудник = ФизическоеЛицоДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
		Иначе 
			Строка.Сотрудник = ФизЛицоНезарплатныеДоходыДляВыгрузки(Строка.Сотрудник, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЕсли;
		НомерВедомостиНаВозвратЗарплаты = Лев(Строка.НомерВедомостиНаВозвратЗарплаты, 5) +"В" + Прав(Строка.НомерВедомостиНаВозвратЗарплаты, 5);
		Строка.НомерВедомостиНаВозвратЗарплаты = НомерВедомостиНаВозвратЗарплаты;
	    Строка.ВидДохода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ВидДоходаСсылка, "Наименование");
	КонецЦикла;
	
	ДобавитьИдентификаторПеречисленияПоСсылке(РасшифровкаПлатежа, "ВидОперации");
	ДобавитьИдентификаторПеречисленияПоСсылке(РасшифровкаПлатежа, "ВидПлатежа");
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
	ДанныеXDTO.Вставить("Валюта", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
	
	ДанныеXDTO.Вставить("Сумма", ДанныеXDTO.РасшифровкаПлатежа.Итог("Сумма"));
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", Лев(ДанныеXDTO.КлючевыеСвойства.Номер, 5) +"В" + Прав(ДанныеXDTO.КлючевыеСвойства.Номер, 5));
КонецПроцедуры
#КонецОбласти
#Область Справочник_БанковскиеСчетаКонтрагентов
Процедура ДобавитьПКО_Справочник_БанковскиеСчетаКонтрагентов(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_БанковскиеСчетаКонтрагентов";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.БанковскиеСчетаКонтрагентов;
	ПравилоКонвертации.ОбъектФормата = "Справочник.БанковскиеСчета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_БанковскиеСчетаКонтрагентов_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Банк";
	НоваяСтрока.СвойствоФормата = "Банк";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КлассификаторБанков";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ВалютаДенежныхСредств";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагенты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерСчета";
	НоваяСтрока.СвойствоФормата = "НомерСчета";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Справочник_БанковскиеСчетаКонтрагентов_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Инструкция = Новый Структура("Значение, ИмяПКО");
	Инструкция.Значение = ДанныеИБ.Владелец;
	Если ТипЗнч(ДанныеИБ.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		Инструкция.ИмяПКО = "Справочник_Контрагенты";
	ИначеЕсли ТипЗнч(ДанныеИБ.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Инструкция.ИмяПКО = "Справочник_ФизическиеЛица";
	КонецЕсли;
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("Владелец", Инструкция);
	
	Если СтрДлина(ДанныеИБ.НомерСчета) >  20 Тогда
		// Обход ограничения на длину номера счета в формате.
		НомерСчета = Лев(ДанныеИБ.НомерСчета,20);
		Если СтекВыгрузки.Количество() = 1 Тогда
			ДанныеXDTO.КлючевыеСвойства.НомерСчета = НомерСчета;
		Иначе
			ДанныеXDTO.НомерСчета = НомерСчета;
		КонецЕсли;
	КонецЕсли;	
	
	ДанныеXDTO.Вставить("ВалютаДенежныхСредств", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры
Процедура ДобавитьПКО_Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры";
	ПравилоКонвертации.ОбъектДанных = Неопределено;
	ПравилоКонвертации.ОбъектФормата = "Справочник.БанковскиеСчета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Банк";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КлассификаторБанков";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ВалютаДенежныхСредств";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Наименование";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерСчета";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Инструкция = Новый Структура("Значение, ИмяПКО");
	Инструкция.Значение = ДанныеИБ.Владелец;
	Если ТипЗнч(ДанныеИБ.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		Инструкция.ИмяПКО = "Справочник_Контрагенты";
	ИначеЕсли ТипЗнч(ДанныеИБ.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Инструкция.ИмяПКО = "Справочник_ФизическиеЛица";
	КонецЕсли;
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("Владелец", Инструкция);
	
	Если СтрДлина(ДанныеИБ.НомерСчета) >  20 Тогда
		// Обход ограничения на длину номера счета в формате.
		НомерСчета = Лев(ДанныеИБ.НомерСчета,20);
		Если СтекВыгрузки.Количество() = 1 Тогда
			ДанныеXDTO.КлючевыеСвойства.НомерСчета = НомерСчета;
		Иначе
			ДанныеXDTO.НомерСчета = НомерСчета;
		КонецЕсли;
	КонецЕсли;	
	
	ДанныеXDTO.Вставить("ВалютаДенежныхСредств", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_БанковскиеСчетаОрганизаций
Процедура ДобавитьПКО_Справочник_БанковскиеСчетаОрганизаций(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_БанковскиеСчетаОрганизаций";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.БанковскиеСчетаОрганизаций;
	ПравилоКонвертации.ОбъектФормата = "Справочник.БанковскиеСчета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_БанковскиеСчетаОрганизаций_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Банк";
	НоваяСтрока.СвойствоФормата = "Банк";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КлассификаторБанков";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ВалютаДенежныхСредств";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерСчета";
	НоваяСтрока.СвойствоФормата = "НомерСчета";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Справочник_БанковскиеСчетаОрганизаций_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Инструкция = Новый Структура("Значение, ИмяПКО");
	Инструкция.Значение = ДанныеИБ.Владелец;
	Если ТипЗнч(ДанныеИБ.Владелец) = Тип("СправочникСсылка.Организации") Тогда
		Инструкция.ИмяПКО = "Справочник_Организации";
	КонецЕсли;
	ДанныеXDTO.КлючевыеСвойства.Вставить("Владелец", Инструкция);
	
	Если СтрДлина(ДанныеИБ.НомерСчета) >  20 Тогда
		// Обход ограничение на длину номера счета в формате.
		НомерСчета = Лев(ДанныеИБ.НомерСчета,20);
		Если СтекВыгрузки.Количество() = 1 Тогда
			ДанныеXDTO.КлючевыеСвойства.НомерСчета = НомерСчета;
		Иначе
			ДанныеXDTO.НомерСчета = НомерСчета;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеXDTO.Вставить("ВалютаДенежныхСредств", ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты());
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Валюты
Процедура ДобавитьПКО_Справочник_Валюты(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Валюты";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Валюты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Валюты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПараметрыПрописиНаРусском";
	НоваяСтрока.СвойствоФормата = "ПараметрыПрописиНаРусском";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыДокументовФизическихЛиц_Отправка
Процедура ДобавитьПКО_Справочник_ВидыДокументовФизическихЛиц_Отправка(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидыДокументовФизическихЛиц_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыДокументовФизическихЛиц;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыДокументовФизическихЛиц";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыПрочихВыплат
Процедура ДобавитьПКО_Справочник_ВидыПрочихВыплат(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидыПрочихВыплат";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыПрочихВыплат;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыПрочихВыплат";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СпособОтраженияВРеглУчете";
	НоваяСтрока.СвойствоФормата = "СпособОтраженияЗарплатыВФинансовомУчете";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчете";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ДокументыФизическихЛиц_Отправка
Процедура ДобавитьПКО_Справочник_ДокументыФизическихЛиц_Отправка(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ДокументыФизическихЛиц_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ДокументыФизическихЛиц";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ДокументыФизическихЛиц_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидДокументаОтбор";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыДокументовФизическихЛиц_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ПериодОтбор";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицоОтбор";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("Записи", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.Записи;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ВидДокумента";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыДокументовФизическихЛиц_Отправка";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ДатаВыдачи";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "КемВыдан";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "КодПодразделения";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Номер";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Период";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Представление";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Серия";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "СрокДействия";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";

КонецПроцедуры

Процедура ПКО_Справочник_ДокументыФизическихЛиц_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеXDTO.Вставить("ПериодОтбор",         ДанныеИБ.Отбор.Период.Значение);
	ДанныеXDTO.Вставить("ФизическоеЛицоОтбор", ДанныеИБ.Отбор.Физлицо.Значение);
	ДанныеXDTO.Вставить("ВидДокументаОтбор",   ДанныеИБ.Отбор.ВидДокумента.Значение);
	
	ТаблицаЗаписи = ДанныеИБ.Выгрузить();
	ТаблицаЗаписи.Колонки.Добавить("ФизическоеЛицо");
	
	Для Каждого СтрокаЗаписи Из ТаблицаЗаписи Цикл
		СтрокаЗаписи.ФизическоеЛицо = СтрокаЗаписи.Физлицо;
	КонецЦикла;
	
	ДанныеXDTO.Вставить("Записи", ТаблицаЗаписи);
КонецПроцедуры
#КонецОбласти
#Область Справочник_ЗППроекты_КакБанковскиеСчета
Процедура ДобавитьПКО_Справочник_ЗППроекты_КакБанковскиеСчета(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЗППроекты_КакБанковскиеСчета";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЗарплатныеПроекты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.БанковскиеСчета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ЗППроекты_КакБанковскиеСчета_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Банк";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КлассификаторБанков";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ВалютаДенежныхСредств";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Наименование";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НомерСчета";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Справочник_ЗППроекты_КакБанковскиеСчета_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	СтруктураСвойств = Неопределено;
	Если СтекВыгрузки.Количество() > 1 Тогда
		СтруктураСвойств = ДанныеXDTO;
	Иначе
		СтруктураСвойств = ДанныеXDTO.КлючевыеСвойства;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗарплатныеПроекты.Банк КАК Банк,
	|	ЗарплатныеПроекты.РасчетныйСчет КАК РасчетныйСчет,
	|	ЕСТЬNULL(ЗарплатныеПроекты.Банк.Код, """") КАК БИКБанка,
	|	ЕСТЬNULL(ЗарплатныеПроекты.Банк.ИНН, """") КАК ИННБанка,
	|	ЕСТЬNULL(ЗарплатныеПроекты.Банк.Наименование, """") КАК НаименованиеБанка
	|ИЗ
	|	Справочник.ЗарплатныеПроекты КАК ЗарплатныеПроекты
	|ГДЕ
	|	ЗарплатныеПроекты.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаСчета = ДанныеИБ.Валюта;
	Если Не ЗначениеЗаполнено(ВалютаСчета) Тогда
		ВалютаСчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	КонецЕсли;
	
	СтрокаНаименования = "";
	Если Выборка.Следующий() Тогда
		СтруктураСвойств.Вставить("Банк", Выборка.Банк);
		СтруктураСвойств.Вставить("НомерСчета", ?(Выборка.РасчетныйСчет = "                    ", "11111111111111111111",Выборка.РасчетныйСчет));
		
		СтруктураКонтрагент = Новый Структура;
		СтруктураКонтрагент.Вставить("Ссылка", Выборка.Банк);
		СтруктураКонтрагент.Вставить("ИНН", Выборка.ИННБанка);
		СтруктураКонтрагент.Вставить("Наименование", Выборка.НаименованиеБанка);
		СтруктураКонтрагент.Вставить("НаименованиеПолное", Выборка.НаименованиеБанка);
		СтруктураКонтрагент.Вставить("ЮридическоеФизическоеЛицо", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
		
		СтруктураСвойств.Вставить("Владелец", Новый Структура("Значение, ИмяПКО", СтруктураКонтрагент, "Справочник_Контрагенты_ИзСтруктуры"));
		
		СтрокаНаименования = Прав(СокрЛП(Выборка.РасчетныйСчет), 4) 
			+ ?(Не ПустаяСтрока(Выборка.НаименованиеБанка), " в " + Выборка.НаименованиеБанка, "")
			+ " (" + Строка(ВалютаСчета) + ")";
		СтрокаНаименования = Лев(СтрокаНаименования, 150);
	КонецЕсли;
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеXDTO.Вставить("ВалютаДенежныхСредств", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ВалютаСчета));
	ДанныеXDTO.Вставить("Наименование", СтрокаНаименования);
КонецПроцедуры
#КонецОбласти
#Область Справочник_ЗППроекты_КакКонтрагенты
Процедура ДобавитьПКО_Справочник_ЗППроекты_КакКонтрагенты(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЗППроекты_КакКонтрагенты";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЗарплатныеПроекты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Контрагенты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ЗППроекты_КакКонтрагенты_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ИНН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Наименование";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЮридическоеФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ЮридическоеФизическоеЛицо";

КонецПроцедуры

Процедура ПКО_Справочник_ЗППроекты_КакКонтрагенты_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	СтруктураСвойств = Неопределено;
	Если СтекВыгрузки.Количество() > 1 Тогда
		СтруктураСвойств = ДанныеXDTO;
	Иначе
		СтруктураСвойств = ДанныеXDTO.КлючевыеСвойства;
	КонецЕсли;
	
	СтруктураСвойств.Вставить("Ссылка", ДанныеИБ.Банк);
	СтруктураСвойств.Вставить("ЮридическоеФизическоеЛицо", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлассификаторБанков.ИНН КАК ИНН,
	|	КлассификаторБанков.Наименование КАК Наименование,
	|	КлассификаторБанков.Наименование КАК НаименованиеПолное
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Банк);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураСвойств.Вставить("ИНН", Выборка.ИНН);
		СтруктураСвойств.Вставить("Наименование", Выборка.Наименование);
		СтруктураСвойств.Вставить("НаименованиеПолное", Выборка.НаименованиеПолное);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Кассы
Процедура ДобавитьПКО_Справочник_Кассы(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Кассы";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Кассы;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Кассы";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Кассы_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Валюта";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Валюты";

КонецПроцедуры

Процедура ПКО_Справочник_Кассы_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеXDTO.Вставить("Валюта", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты()));
КонецПроцедуры
#КонецОбласти
#Область Справочник_КлассификаторБанков
Процедура ДобавитьПКО_Справочник_КлассификаторБанков(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_КлассификаторБанков";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.КлассификаторБанков;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Банки";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Адрес";
	НоваяСтрока.СвойствоФормата = "Адрес";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Город";
	НоваяСтрока.СвойствоФормата = "Город";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "БИК";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры
#КонецОбласти
#Область Справочник_КлассификаторСтранМира
Процедура ДобавитьПКО_Справочник_КлассификаторСтранМира(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_КлассификаторСтранМира";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.СтраныМира;
	ПравилоКонвертации.ОбъектФормата = "Справочник.СтраныМира";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодАльфа2";
	НоваяСтрока.СвойствоФормата = "КодАльфа2";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодАльфа3";
	НоваяСтрока.СвойствоФормата = "КодАльфа3";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

КонецПроцедуры
#КонецОбласти
#Область Справочник_Контрагенты
Процедура ДобавитьПКО_Справочник_Контрагенты(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Контрагенты";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Контрагенты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Контрагенты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КБЕ";
	НоваяСтрока.СвойствоФормата = "КБЕ";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодПоОКПО";
	НоваяСтрока.СвойствоФормата = "ОКПО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СтранаРегистрации";
	НоваяСтрока.СвойствоФормата = "СтранаРегистрации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КлассификаторСтранМира";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЮридическоеФизическоеЛицо";
	НоваяСтрока.СвойствоФормата = "ЮридическоеФизическоеЛицо";

КонецПроцедуры
#КонецОбласти
#Область Справочник_Контрагенты_ИзСтруктуры
Процедура ДобавитьПКО_Справочник_Контрагенты_ИзСтруктуры(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Контрагенты_ИзСтруктуры";
	ПравилоКонвертации.ОбъектДанных = Неопределено;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Контрагенты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Контрагенты_ИзСтруктуры_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ИНН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Наименование";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ЮридическоеФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ЮридическоеФизическоеЛицо";

КонецПроцедуры

Процедура ПКО_Справочник_Контрагенты_ИзСтруктуры_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	СтруктураСвойств = Неопределено;
	Если СтекВыгрузки.Количество() > 1 Тогда
		СтруктураСвойств = ДанныеXDTO;
	Иначе
		СтруктураСвойств = ДанныеXDTO.КлючевыеСвойства;
	КонецЕсли;
	
	Для Каждого ТекСвойство Из ДанныеИБ Цикл
		СтруктураСвойств.Вставить(ТекСвойство.Ключ, ТекСвойство.Значение);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Область Справочник_НастройкиРасчетаРезервовПоОплатеТруда
Процедура ДобавитьПКО_Справочник_НастройкиРасчетаРезервовПоОплатеТруда(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_НастройкиРасчетаРезервовПоОплатеТруда";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.НастройкиРасчетаРезервовПоОплатеТруда;
	ПравилоКонвертации.ОбъектФормата = "Справочник.НастройкиРасчетаРезервовПоОплатеТруда";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидРезерва";
	НоваяСтрока.СвойствоФормата = "ВидРезерва";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ВидыРезервовПоОплатеТруда";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КонецПериода";
	НоваяСтрока.СвойствоФормата = "КонецПериода";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НачалоПериода";
	НоваяСтрока.СвойствоФормата = "НачалоПериода";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НормативОтчисленийВРезерв";
	НоваяСтрока.СвойствоФормата = "НормативОтчисленийВРезерв";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПредельнаяВеличинаОтчисленийВРезервНУ";
	НоваяСтрока.СвойствоФормата = "ПредельнаяВеличинаОтчисленийВРезервНУ";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Резерв";
	НоваяСтрока.СвойствоФормата = "Резерв";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Резервы";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ФормироватьРезервНУ";
	НоваяСтрока.СвойствоФормата = "ФормироватьРезервОтпусковНУ";

КонецПроцедуры
#КонецОбласти
#Область Справочник_Организации
Процедура ДобавитьПКО_Справочник_Организации(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Организации";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Организации;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Организации";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Организации_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ГоловнаяОрганизация";
	НоваяСтрока.СвойствоФормата = "ГоловнаяОрганизация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИндивидуальныйПредприниматель";
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КБЕ";
	НоваяСтрока.СвойствоФормата = "КБЕ";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодПоОКПО";
	НоваяСтрока.СвойствоФормата = "ОКПО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеСокращенное";
	НоваяСтрока.СвойствоФормата = "НаименованиеСокращенное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Префикс";
	НоваяСтрока.СвойствоФормата = "Префикс";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "РегистрацияВНалоговомОргане";
	НоваяСтрока.СвойствоФормата = "РегистрацияВНалоговомОргане";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_РегистрацииВНалоговомОргане";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СтранаРегистрации";
	НоваяСтрока.СвойствоФормата = "СтранаРегистрации";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КлассификаторСтранМира";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЮридическоеФизическоеЛицо";
	НоваяСтрока.СвойствоФормата = "ЮридическоеФизическоеЛицо";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ЮридическоеФизическоеЛицо";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ДополнительныеРеквизиты", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ДополнительныеРеквизиты;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ЗначениеСвойства";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Свойство";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ДополнительныеРеквизиты";

КонецПроцедуры

Процедура ПКО_Справочник_Организации_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	СтруктураКлючевыхСвойств = ДанныеXDTO.КлючевыеСвойства;
	Если СтекВыгрузки.Количество() > 1 Тогда
		СтруктураКлючевыхСвойств = ДанныеXDTO;
	КонецЕсли;
	
	КодОКАТО = "";
	Если ЗначениеЗаполнено(ДанныеИБ.РегистрацияВНалоговомОргане) Тогда
		РеквизитыРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.РегистрацияВНалоговомОргане, "КодПоОКАТО");
		
		КодОКАТО = РеквизитыРегистрации.КодПоОКАТО;
	КонецЕсли;
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
	
	ДанныеXDTO.Вставить("ОКАТО", КодОКАТО);  
	 
	КодПоОКПО = "";
	Если ЗначениеЗаполнено(ДанныеИБ.КодПоОКПО) Тогда
		
		КодПоОКПО = Прав(ДанныеИБ.КодПоОКПО, 12);;
	КонецЕсли;
	ДанныеXDTO.Вставить("ОКПО", КодПоОКПО);
КонецПроцедуры
#КонецОбласти
#Область Справочник_Подразделения
Процедура ДобавитьПКО_Справочник_Подразделения(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Подразделения";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ПодразделенияОрганизаций;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Подразделения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "ВышестоящееПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Подразделения";

КонецПроцедуры
#КонецОбласти
#Область Справочник_Подразделения_ИзСтруктуры
Процедура ДобавитьПКО_Справочник_Подразделения_ИзСтруктуры(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Подразделения_ИзСтруктуры";
	ПравилоКонвертации.ОбъектДанных = Неопределено;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Подразделения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ПодразделенияОрганизаций
Процедура ДобавитьПКО_Справочник_ПодразделенияОрганизаций(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ПодразделенияОрганизаций";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ПодразделенияОрганизаций;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ПодразделенияОрганизаций";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ПодразделенияОрганизаций_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОбособленноеПодразделение";
	НоваяСтрока.СвойствоФормата = "ОбособленноеПодразделение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ПодразделенияОрганизаций";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ИНН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Справочник_ПодразделенияОрганизаций_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если ДанныеИБ.ОбособленноеПодразделение Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка,
		|	ПодразделенияОрганизаций.РегистрацияВНалоговомОргане.ИНН КАК ИНН,
		|	ПодразделенияОрганизаций.РегистрацияВНалоговомОргане.НаименованиеОбособленногоПодразделения КАК НаименованиеПолное
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Ссылка = &Ссылка";
			
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
		Результат = Запрос.Выполнить().Выгрузить();
	
		Если Результат.Количество() > 0 Тогда
			ДанныеXDTO.КлючевыеСвойства.Вставить("ИНН", Результат[0].ИНН);
			ДанныеXDTO.Вставить("НаименованиеПолное", Результат[0].НаименованиеПолное);
		Иначе
			ДанныеXDTO.КлючевыеСвойства.Вставить("ИНН", "");
			ДанныеXDTO.Вставить("НаименованиеПолное", "");
		КонецЕсли;
	Иначе
		ДанныеXDTO.КлючевыеСвойства.Вставить("ИНН", "");
		ДанныеXDTO.Вставить("НаименованиеПолное", "");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Пользователи
Процедура ДобавитьПКО_Справочник_Пользователи(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Пользователи";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Пользователи;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Пользователи";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Пользователи_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ФизическоеЛицо";
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ДополнительныеРеквизиты", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ДополнительныеРеквизиты;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "ЗначениеСвойства";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Свойство";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ДополнительныеРеквизиты";

КонецПроцедуры

Процедура ПКО_Справочник_Пользователи_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		ДанныеXDTO.Вставить("ФизическоеЛицо", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ДанныеИБ.ФизическоеЛицо));
		Возврат;
	КонецЕсли;
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("ФизическоеЛицо", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ДанныеИБ.ФизическоеЛицо));
	
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
КонецПроцедуры
#КонецОбласти
#Область Справочник_РегистрацииВНалоговомОргане
Процедура ДобавитьПКО_Справочник_РегистрацииВНалоговомОргане(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_РегистрацииВНалоговомОргане";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.РегистрацииВНалоговомОргане;
	ПравилоКонвертации.ОбъектФормата = "Справочник.РегистрацииВНалоговомОргане";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_РегистрацииВНалоговомОргане_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "КодНалоговогоОргана";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодПоОКАТО";
	НоваяСтрока.СвойствоФормата = "ОКАТО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "КраткоеНаименованиеНалоговогоОргана";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеИФНС";
	НоваяСтрока.СвойствоФормата = "НаименованиеИФНС";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеОбособленногоПодразделения";
	НоваяСтрока.СвойствоФормата = "НаименованиеОбособленногоПодразделения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Представитель";
	НоваяСтрока.СвойствоФормата = "Представитель";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Справочник_РегистрацииВНалоговомОргане_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	//Если СвойствоФорматаОбмена(КомпонентыОбмена, "КлючевыеСвойстваРегистрацияВНалоговомОргане.Организация")
	//	И СтекВыгрузки.Количество() = 1 Тогда	
	//	ДанныеXDTO.КлючевыеСвойства.Вставить("Организация", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ДанныеИБ.Владелец));
	//Иначе
	//	ДанныеXDTO.Вставить("Организация", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ДанныеИБ.Владелец));
	//КонецЕсли;
	
	ПредставительИнструкция = ЗначениеВИнструкциюПКО(КомпонентыОбмена, ДанныеИБ.Представитель);
	Если Не ПредставительИнструкция = Неопределено Тогда
		ДанныеXDTO.Вставить("Представитель", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ДанныеИБ.Представитель));
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Резервы
Процедура ДобавитьПКО_Справочник_Резервы(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Резервы";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Резервы;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Резервы";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры
#КонецОбласти
#Область Справочник_СпособыОтраженияЗарплатыВБухУчете
Процедура ДобавитьПКО_Справочник_СпособыОтраженияЗарплатыВБухУчете(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.СпособыОтраженияЗарплатыВБухУчете;
	ПравилоКонвертации.ОбъектФормата = "Справочник.СпособыОтраженияЗарплатыВФинансовомУчете";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Группа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа";

КонецПроцедуры
#КонецОбласти
#Область Справочник_СтруктураПредприятия
Процедура ДобавитьПКО_Справочник_СтруктураПредприятия(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_СтруктураПредприятия";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.СтруктураПредприятия;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Подразделения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "ВышестоящееПодразделение";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтруктураПредприятия";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ФизическиеЛица
Процедура ДобавитьПКО_Справочник_ФизическиеЛица(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ФизическиеЛица";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ФизическиеЛица;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ФизическиеЛица";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ФизическиеЛица_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаРождения";
	НоваяСтрока.СвойствоФормата = "ДатаРождения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Пол";
	НоваяСтрока.СвойствоФормата = "Пол";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ПолФизическогоЛица";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Группа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛицаГруппа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ФИО";
	НоваяСтрока.СвойствоФормата = "ФИО";
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ДанныеФИО", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ДанныеФИО;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Имя";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "НачалоПериода";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Отчество";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоФормата = "Фамилия";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Справочник_ФизическиеЛица_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	#Область ФИО
	ДанныеXDTO.КлючевыеСвойства.Вставить("ФИО");
	
	Если ДанныеИБ.Метаданные().Реквизиты.Найти("ФИО") <> Неопределено Тогда
		ДанныеXDTO.КлючевыеСвойства.ФИО = ДанныеИБ.ФИО;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеXDTO.КлючевыеСвойства.ФИО) Тогда
		ДанныеXDTO.КлючевыеСвойства.ФИО = ДанныеИБ.Наименование;
	КонецЕсли;
	#КонецОбласти
	
	ВыгрузитьПодробныеДанныеФИО(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
КонецПроцедуры
#КонецОбласти
#Область Справочник_ФизическоеЛицо_ИзСтруктуры
Процедура ДобавитьПКО_Справочник_ФизическоеЛицо_ИзСтруктуры(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ФизическоеЛицо_ИзСтруктуры";
	ПравилоКонвертации.ОбъектДанных = Неопределено;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ФизическиеЛица";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Имя";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ИНН";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Отчество";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "Фамилия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоФормата = "ФИО";

КонецПроцедуры
#КонецОбласти
#КонецОбласти
#Область Получение
#Область Документ_ДанныеДляРасчетаЗарплаты_УП_Получение
Процедура ДобавитьПКО_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ДанныеДляРасчетаЗарплаты_УП_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ДанныеДляРасчетаЗарплаты;
	ПравилоКонвертации.ОбъектФормата = "Документ.ВыработкаСотрудников";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных = "ОтложеннаяОбработка_ДанныеДляРасчетаЗарплаты";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидДокумента";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Период";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подразделение";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Проведен";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	ПравилоКонвертации.СвойстваТабличныхЧастей.Вставить("ВыполненныеРаботы", ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации());
	СвойстваТЧ = ПравилоКонвертации.СвойстваТабличныхЧастей.ВыполненныеРаботы;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидРабот";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыРаботСотрудников";
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОбъемВыполненныхРабот";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Период";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Расценка";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сотрудник";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = СвойстваТЧ.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	ПравилоКонвертации.ПоляПоиска.Добавить("Дата,Номер");
КонецПроцедуры

Процедура ПКО_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	ПолученныеДанные.Проведен = Истина;
	ПолученныеДанные.Период   = КонецМесяца(ПолученныеДанные.Дата);
	
	
	ПравилоКонвертацииФизЛица_Получение = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_ФизическиеЛица_Получение", "ИмяПКО");
	
	ВыполненныеРаботыXDTO = Неопределено;
	Если ДанныеXDTO.Свойство("ВыполненныеРаботы", ВыполненныеРаботыXDTO)
		И ЗначениеЗаполнено(ВыполненныеРаботыXDTO)
		И Не ПравилоКонвертацииФизЛица_Получение = Неопределено Тогда
		
		ВыполненныеРаботыXDTO.Колонки.Добавить("ФизическоеЛицоСсылка", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		
		Для Каждого СтрокаВыполненныеРаботыXDTO Из ВыполненныеРаботыXDTO Цикл
			СтрокаВыполненныеРаботыXDTO.ФизическоеЛицоСсылка = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена,
				СтрокаВыполненныеРаботыXDTO.ФизическоеЛицо, ПравилоКонвертацииФизЛица_Получение, "ПолучитьСсылку");
		КонецЦикла;
		
		ТаблицаСотрудники = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ВыполненныеРаботыXDTO.ВыгрузитьКолонку("ФизическоеЛицоСсылка"), Ложь, ПолученныеДанные.Организация, ПолученныеДанные.Дата);
		
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(
			Ложь,
			ТаблицаСотрудники.ВыгрузитьКолонку("Сотрудник"),
			"МестоВСтруктуреПредприятия, Подразделение",
			КонецМесяца(ПолученныеДанные.Дата));
		
		Подразделение = Неопределено;
		ПропуститьПодразделение = Ложь;
		
		ВыполненныеРаботы = Новый Массив;
		ФизическиеЛица    = Новый Массив;
		
		Для Каждого СтрокаВыполненныеРаботыXDTO Из ВыполненныеРаботыXDTO Цикл
			СтрокаВыполненныеРаботы = Новый Структура;
		
			СтрокаСотрудники = ТаблицаСотрудники.Найти(СтрокаВыполненныеРаботыXDTO.ФизическоеЛицоСсылка, "ФизическоеЛицо");
			Если Не СтрокаСотрудники = Неопределено Тогда
				СтрокаВыполненныеРаботы.Вставить("Сотрудник", СтрокаСотрудники.Сотрудник);
				
				Если Не ПропуститьПодразделение Тогда
					СтрокаКадровыеДанные = КадровыеДанные.Найти(СтрокаВыполненныеРаботы.Сотрудник, "Сотрудник");
					Если Не СтрокаКадровыеДанные = Неопределено Тогда
						Если Подразделение = Неопределено Тогда
							Подразделение = СтрокаКадровыеДанные.Подразделение;
						ИначеЕсли Не Подразделение = СтрокаКадровыеДанные.Подразделение Тогда
							Подразделение = Неопределено;
							ПропуститьПодразделение = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаВыполненныеРаботы.Вставить("Период", ПолученныеДанные.Дата);
			СтрокаВыполненныеРаботы.Вставить("ВидРабот", Новый Структура("ИмяПКО, Значение", "Справочник_ВидыРаботСотрудников", СтрокаВыполненныеРаботыXDTO.ВидРабот));
			СтрокаВыполненныеРаботы.Вставить("ОбъемВыполненныхРабот", СтрокаВыполненныеРаботыXDTO.Количество);
			СтрокаВыполненныеРаботы.Вставить("Расценка", СтрокаВыполненныеРаботыXDTO.Расценка);
			СтрокаВыполненныеРаботы.Вставить("Сумма", СтрокаВыполненныеРаботыXDTO.Сумма);
			
			СтрокаФизическиеЛица = Новый Структура;
			СтрокаФизическиеЛица.Вставить("ФизическоеЛицо", СтрокаВыполненныеРаботыXDTO.ФизическоеЛицоСсылка);
			
			ВыполненныеРаботы.Добавить(СтрокаВыполненныеРаботы);
			ФизическиеЛица.Добавить(СтрокаФизическиеЛица);
		КонецЦикла;
		
		Если ВыполненныеРаботы.Количество() > 0 Тогда
			ПолученныеДанные.ДополнительныеСвойства.Вставить("ВыполненныеРаботы", ВыполненныеРаботы);
		КонецЕсли;
		
		Если ФизическиеЛица.Количество() > 0 Тогда
			ПолученныеДанные.ДополнительныеСвойства.Вставить("ФизическиеЛица", ФизическиеЛица);
		КонецЕсли;	
		
		Если Не ПропуститьПодразделение
			И Не Подразделение = Неопределено Тогда
					
			ПолученныеДанные.Подразделение = Подразделение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_НачислениеОценочныхОбязательств_Получение
Процедура ДобавитьПКО_Документ_НачислениеОценочныхОбязательств_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_НачислениеОценочныхОбязательств_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам;
	ПравилоКонвертации.ОбъектФормата = "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_НачислениеОценочныхОбязательств_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бухгалтер";
	НоваяСтрока.СвойствоФормата = "Бухгалтер";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОбязательстваОтраженыВБухучете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_НачислениеОценочныхОбязательств_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ЗначениеЗаполнено(ПолученныеДанные.Бухгалтер) Тогда
		ПолученныеДанные.ОбязательстваОтраженыВБухучете = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ОтражениеЗарплатыВБухучете_Получение
Процедура ДобавитьПКО_Документ_ОтражениеЗарплатыВБухучете_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_ОтражениеЗарплатыВБухучете_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ОтражениеЗарплатыВБухучете;
	ПравилоКонвертации.ОбъектФормата = "Документ.ОтражениеЗарплатыВФинансовомУчете";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_ОтражениеЗарплатыВБухучете_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бухгалтер";
	НоваяСтрока.СвойствоФормата = "Бухгалтер";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодРегистрации";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗарплатаОтраженаВБухучете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_ОтражениеЗарплатыВБухучете_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ЗначениеЗаполнено(ПолученныеДанные.Бухгалтер) Тогда
		ПолученныеДанные.ЗарплатаОтраженаВБухучете = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_РезервыПоОплатеТруда_Получение
Процедура ДобавитьПКО_Документ_РезервыПоОплатеТруда_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_РезервыПоОплатеТруда_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.РезервыПоОплатеТруда;
	ПравилоКонвертации.ОбъектФормата = "Документ.РезервыПоОплатеТруда";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_РезервыПоОплатеТруда_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бухгалтер";
	НоваяСтрока.СвойствоФормата = "Бухгалтер";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "Дата";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "МесяцНачисления";
	НоваяСтрока.СвойствоФормата = "ПериодРегистрации";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "Номер";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Ответственный";
	НоваяСтрока.СвойствоФормата = "Ответственный";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Пользователи_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОбязательстваОтраженыВБухучете";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

Процедура ПКО_Документ_РезервыПоОплатеТруда_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ЗначениеЗаполнено(ПолученныеДанные.Бухгалтер) Тогда
		ПолученныеДанные.ОбязательстваОтраженыВБухучете = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Организации_Получение
Процедура ДобавитьПКО_Справочник_Организации_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Организации_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Организации;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Организации";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_Организации_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Организации_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ГоловнаяОрганизация";
	НоваяСтрока.СвойствоФормата = "ГоловнаяОрганизация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организации_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодПоОКПО";
	НоваяСтрока.СвойствоФормата = "ОКПО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЮридическоеФизическоеЛицо";
	НоваяСтрока.СвойствоФормата = "ЮридическоеФизическоеЛицо";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ЮридическоеФизическоеЛицо";

КонецПроцедуры

Процедура ПКО_Справочник_Организации_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	Если Не ДанныеXDTO.Свойство("КонтактнаяИнформация")
		Или Не ЗначениеЗаполнено(ДанныеXDTO.КонтактнаяИнформация) Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПКО_Справочник_Организации_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если Не ЗначениеЗаполнено(ПолученныеДанные.ГоловнаяОрганизация) Тогда
		ПолученныеДанные.ГоловнаяОрганизация = ПолученныеДанные.Ссылка;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Пользователи_Получение
Процедура ДобавитьПКО_Справочник_Пользователи_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Пользователи_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Пользователи;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Пользователи";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ФизическоеЛицо";
	НоваяСтрока.СвойствоФормата = "ФизическоеЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛица_Получение";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ФизическиеЛица_Получение
Процедура ДобавитьПКО_Справочник_ФизическиеЛица_Получение(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ФизическиеЛица_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ФизическиеЛица;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ФизическиеЛица";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ФизическиеЛица_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаРождения";
	НоваяСтрока.СвойствоФормата = "ДатаРождения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "ФИО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Пол";
	НоваяСтрока.СвойствоФормата = "Пол";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Перечисление_ПолФизическогоЛица";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Группа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ФизическиеЛицаГруппа";

	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН,ЭтоГруппа");
	ПравилоКонвертации.ПоляПоиска.Добавить("ДатаРождения,ФИО,ЭтоГруппа");
	ПравилоКонвертации.ПоляПоиска.Добавить("ФИО,ЭтоГруппа");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование,ЭтоГруппа");
КонецПроцедуры

Процедура ПКО_Справочник_ФизическиеЛица_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если НЕ ЗначениеЗаполнено(ПолученныеДанные.ФИО) Тогда
		ПолученныеДанные.ФИО = ПолученныеДанные.Наименование;
	КонецЕсли;
	ФизЛицоСсылка = ?(ДанныеИБ = Неопределено, ПолученныеДанные.ПолучитьСсылкуНового(), ДанныеИБ.Ссылка);
	ЗагрузитьПодробныеДанныеФИО(КомпонентыОбмена, ПолученныеДанные, ФизЛицоСсылка);
КонецПроцедуры
#КонецОбласти
#КонецОбласти
#Область ОтправкаИПолучение
#Область Справочник_ВидыРаботСотрудников
Процедура ДобавитьПКО_Справочник_ВидыРаботСотрудников(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидыРаботСотрудников";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыРаботСотрудников;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыРаботСотрудников";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "КодВПрограмме";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Группа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыРаботСотрудниковГруппа";

	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыРаботСотрудниковГруппа
Процедура ДобавитьПКО_Справочник_ВидыРаботСотрудниковГруппа(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидыРаботСотрудниковГруппа";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыРаботСотрудников;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыРаботСотрудниковГруппа";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "КодВПрограмме";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Группа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидыРаботСотрудниковГруппа";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ДополнительныеРеквизиты
Процедура ДобавитьПКО_Справочник_ДополнительныеРеквизиты(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ДополнительныеРеквизиты";
	ПравилоКонвертации.ОбъектДанных = Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ДополнительныеРеквизиты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ДополнительныеРеквизиты_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВладелецДополнительныхЗначений";
	НоваяСтрока.СвойствоФормата = "ВладелецДополнительныхЗначений";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ДополнительныеРеквизиты";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДополнительныеЗначенияИспользуются";
	НоваяСтрока.СвойствоФормата = "ДополнительныеЗначенияИспользуются";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДополнительныеЗначенияСВесом";
	НоваяСтрока.СвойствоФормата = "ДополнительныеЗначенияСВесом";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Заголовок";
	НоваяСтрока.СвойствоФормата = "Заголовок";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗаголовокФормыВыбораЗначения";
	НоваяСтрока.СвойствоФормата = "ЗаголовокФормыВыбораЗначения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗаголовокФормыЗначения";
	НоваяСтрока.СвойствоФормата = "ЗаголовокФормыЗначения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗаполнятьОбязательно";
	НоваяСтрока.СвойствоФормата = "ЗаполнятьОбязательно";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Комментарий";
	НоваяСтрока.СвойствоФормата = "Комментарий";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "МногострочноеПолеВвода";
	НоваяСтрока.СвойствоФормата = "МногострочноеПолеВвода";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подсказка";
	НоваяСтрока.СвойствоФормата = "Подсказка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ФорматСвойства";
	НоваяСтрока.СвойствоФормата = "ФорматСвойства";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЭтоДополнительноеСведение";
	НоваяСтрока.СвойствоФормата = "ЭтоДополнительноеСведение";

	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры

Процедура ПКО_Справочник_ДополнительныеРеквизиты_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если НЕ ЗначениеЗаполнено(ПолученныеДанные.Заголовок) Тогда
		ПолученныеДанные.Заголовок = ПолученныеДанные.Наименование;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа
Процедура ДобавитьПКО_Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.СпособыОтраженияЗарплатыВБухУчете;
	ПравилоКонвертации.ОбъектФормата = "Справочник.СпособыОтраженияЗарплатыВФинансовомУчетеГруппа";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Истина;
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Группа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СпособыОтраженияЗарплатыВБухУчетеГруппа";

КонецПроцедуры
#КонецОбласти
#Область Справочник_ФизическиеЛицаГруппа
Процедура ДобавитьПКО_Справочник_ФизическиеЛицаГруппа(ПравилаКонвертации)

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ФизическиеЛицаГруппа";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ФизическиеЛица;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ФизическиеЛицаГруппа";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Истина;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры
#КонецОбласти
#КонецОбласти

#КонецОбласти
#Область ПКПД
// Заполняет таблицу правил конвертации предопределенных данных.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаКонвертации - таблица значений, в которую будут добавлены правила. 
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		// Перечисление_ВидыОперацийПлатежногоПоручения.
		ПравилоКонвертации = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД = "Перечисление_ВидыОперацийПлатежногоПоручения";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВидыОперацийПлатежногоПоручения;
		ПравилоКонвертации.ТипXDTO = "ВидыОперацийПлатежногоПоручения";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты, "ПеречислениеЗарплаты");
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат, "ПеречислениеПрочихВыплат");
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов, "ПеречислениеПрочихДоходов");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// Перечисление_ВидыОперацийРезервовПоОплатеТруда.
		ПравилоКонвертации = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД = "Перечисление_ВидыОперацийРезервовПоОплатеТруда";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВидыОперацийРезервовПоОплатеТруда;
		ПравилоКонвертации.ТипXDTO = "ВидыОперацийРезервовПоОплатеТруда";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыОперацийРезервовПоОплатеТруда.Инвентаризация, "Инвентаризация");
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыОперацийРезервовПоОплатеТруда.Корректировка, "Корректировка");
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыОперацийРезервовПоОплатеТруда.Начисление, "Начисление");
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыОперацийРезервовПоОплатеТруда.Списание, "Списание");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// Перечисление_ВидыРезервовПоОплатеТруда.
		ПравилоКонвертации = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД = "Перечисление_ВидыРезервовПоОплатеТруда";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ВидыРезервовПоОплатеТруда;
		ПравилоКонвертации.ТипXDTO = "ВидыРезервовПоОплатеТруда";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыРезервовПоОплатеТруда.ГодоваяПремия, "ГодоваяПремия");
		ЗначенияДляОтправки.Вставить(Перечисления.ВидыРезервовПоОплатеТруда.Отпуск, "Отпуск");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	
		// Перечисление_СпособыВыплатыПрочихДоходов.
		ПравилоКонвертации = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД = "Перечисление_СпособыВыплатыПрочихДоходов";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СпособыВыплатыПрочихДоходов;
		ПравилоКонвертации.ТипXDTO = "СпособыВыплатыПрочихДоходов";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.СпособыВыплатыПрочихДоходов.ВыплатаПрочихДоходов, "ВыплатаПрочихДоходов");
		ЗначенияДляОтправки.Вставить(Перечисления.СпособыВыплатыПрочихДоходов.ВыплатыБывшимСотрудникам, "ВыплатыБывшимСотрудникам");
		ЗначенияДляОтправки.Вставить(Перечисления.СпособыВыплатыПрочихДоходов.Дивиденды, "Дивиденды");
		ЗначенияДляОтправки.Вставить(Перечисления.СпособыВыплатыПрочихДоходов.ДивидендыСотрудникам, "ДивидендыСотрудникам");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	КонецЕсли;

	// Перечисление_ПолФизическогоЛица.
	ПравилоКонвертации = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД = "Перечисление_ПолФизическогоЛица";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ПолФизическогоЛица;
	ПравилоКонвертации.ТипXDTO = "Пол";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ПолФизическогоЛица.Женский, "Женский");
	ЗначенияДляОтправки.Вставить(Перечисления.ПолФизическогоЛица.Мужской, "Мужской");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Женский", Перечисления.ПолФизическогоЛица.Женский);
	ЗначенияДляПолучения.Вставить("Мужской", Перечисления.ПолФизическогоЛица.Мужской);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

	// Перечисление_ЮридическоеФизическоеЛицо.
	ПравилоКонвертации = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД = "Перечисление_ЮридическоеФизическоеЛицо";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ЮридическоеФизическоеЛицо;
	ПравилоКонвертации.ТипXDTO = "ЮридическоеФизическоеЛицо";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо, "ФизическоеЛицо");
	ЗначенияДляОтправки.Вставить(Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, "ЮридическоеЛицо");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("ФизическоеЛицо", Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	ЗначенияДляПолучения.Вставить("ЮридическоеЛицо", Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

КонецПроцедуры

#КонецОбласти
#Область Алгоритмы


Процедура ВедомостьПрочихДоходов_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		
		Зарплата = ДанныеИБ.Состав.Выгрузить();
		Зарплата.Колонки.ИдентификаторСтроки.Имя = "ИдентификаторСтрокиУИ";
		Зарплата.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
		Зарплата.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		
		КВыплате = ДанныеИБ.Выплаты.Выгрузить();
		
		ДополнитьТаблицуЗарплатаВедомости(Зарплата, КВыплате);
		ДанныеXDTO.Вставить("Зарплата", Зарплата);
		
		ПередаватьВзысканныеСуммы = Ложь;
		Если ТипЗнч(ДанныеИБ.Ссылка) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
			ПередаватьВзысканныеСуммы = Истина;
			ДанныеXDTO.Вставить("СпособВыплаты", "ПеречислениемНаСчета");
		ИначеЕсли ТипЗнч(ДанныеИБ.Ссылка) = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
			ПередаватьВзысканныеСуммы = Истина;
			ДанныеXDTO.Вставить("СпособВыплаты", "ЧерезБанк");
		Иначе
			ДанныеXDTO.Вставить("СпособВыплаты", "ЧерезКассу");
		КонецЕсли;
			
		СпособРасчетов = "";
		Если ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.ВыплатаПрочихДоходов
			Или ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.ВыплатыБывшимСотрудникам Тогда
			СпособРасчетов = ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.СпособыРасчетовСФизическимиЛицами.РасчетыСКонтрагентами);
		ИначеЕсли ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.ДивидендыСотрудникам Тогда
			СпособРасчетов = ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.СпособыРасчетовСФизическимиЛицами.ОплатаТруда);
		ИначеЕсли ДанныеИБ.СпособВыплаты = Перечисления.СпособыВыплатыПрочихДоходов.Дивиденды Тогда
			СпособРасчетов = ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.СпособыРасчетовСФизическимиЛицами.Дивиденды);
		КонецЕсли;
		
		ДанныеXDTO.Вставить("СпособРасчетов", СпособРасчетов);
КонецПроцедуры
Функция ВерсияФорматаЧислом(СтрокаВерсии)
	Если Не ЗначениеЗаполнено(СтрокаВерсии) Или СтрокаВерсии = "1.0.beta" Тогда
		Возврат 0;
	КонецЕсли;
	
	ВерсияФорматаЧислом = 0;
	
	РазрядыВерсии = СтрРазделить(СтрокаВерсии, ".");
	Если РазрядыВерсии.Количество() <> 2 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии);
	КонецЕсли;
	
	МножительРазряда = 10000;
	Для ИндексРазрядаОбратный = 0 По 1 Цикл
		ВерсияФорматаЧислом = ВерсияФорматаЧислом + Число(РазрядыВерсии[ИндексРазрядаОбратный])*МножительРазряда;
		МножительРазряда = МножительРазряда / 100;
	КонецЦикла;
	Возврат ВерсияФорматаЧислом;
КонецФункции
Функция ВидДокументаСдельныеРаботы(КомпонентыОбмена, ОрганизацияСсылка)
	Результат = Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты.ПустаяСсылка();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВидыДокументовВводДанныхДляРасчетаЗарплаты.Ссылка КАК ВидДокумента,
	|	ВЫБОР
	|		КОГДА ВидыДокументовВводДанныхДляРасчетаЗарплаты.Организация = &Организация
	|			ТОГДА 3
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ШаблоныВводаИсходныхДанных КАК Таблица_ШаблоныВводаИсходныхДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты КАК ВидыДокументовВводДанныхДляРасчетаЗарплаты
	|		ПО (Таблица_ШаблоныВводаИсходныхДанных.Шаблон = ВидыДокументовВводДанныхДляРасчетаЗарплаты.Ссылка)
	|ГДЕ
	|	Таблица_ШаблоныВводаИсходныхДанных.Ссылка = &УзелОбмена
	|	И (ВидыДокументовВводДанныхДляРасчетаЗарплаты.Организация = &Организация
	|			ИЛИ ВидыДокументовВводДанныхДляРасчетаЗарплаты.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыДокументовВводДанныхДляРасчетаЗарплаты.Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыДокументовВводДанныхДляРасчетаЗарплаты.Организация = &Организация
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты КАК ВидыДокументовВводДанныхДляРасчетаЗарплаты
	|ГДЕ
	|	ВидыДокументовВводДанныхДляРасчетаЗарплаты.ВидыРаботЗаполняютсяВДокументе
	|	И НЕ ВидыДокументовВводДанныхДляРасчетаЗарплаты.ВыполненныеРаботыРаспределяютсяПоСотрудникам
	|	И НЕ ВидыДокументовВводДанныхДляРасчетаЗарплаты.ВыполненныеРаботыВводятсяСводно
	|	И НЕ ВидыДокументовВводДанныхДляРасчетаЗарплаты.ПометкаУдаления
	|	И (ВидыДокументовВводДанныхДляРасчетаЗарплаты.Организация = &Организация
	|			ИЛИ ВидыДокументовВводДанныхДляРасчетаЗарплаты.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ");
	Запрос.УстановитьПараметр("УзелОбмена", КомпонентыОбмена.УзелКорреспондента);
	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ВидДокумента;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
Процедура ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, ЕстьДопРеквизиты = Ложь)
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		Возврат;
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.0") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДопРеквизитов = Новый ТаблицаЗначений;
	ТаблицаДопРеквизитов.Колонки.Добавить("Свойство");
	ТаблицаДопРеквизитов.Колонки.Добавить("ЗначениеСвойства");
	
	
	Если ЕстьДопРеквизиты Тогда
		ВыгрузкаДопРеквизитовИзТаблицыЗначений(КомпонентыОбмена, ДанныеИБ.ДополнительныеРеквизиты, ТаблицаДопРеквизитов);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Свойство КАК Свойство,
	|	Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения
	|ГДЕ Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	ДанныеИБДополнительныеРеквизиты = Запрос.Выполнить().Выгрузить();
	
	ВыгрузкаДопРеквизитовИзТаблицыЗначений(КомпонентыОбмена, ДанныеИБДополнительныеРеквизиты, ТаблицаДопРеквизитов);
	
	Если ТаблицаДопРеквизитов.КОличество() > 0 Тогда
		ДанныеXDTO.Вставить("ДополнительныеРеквизиты", ТаблицаДопРеквизитов);
	КонецЕсли;
КонецПроцедуры
Процедура ВыгрузитьПодробныеДанныеФИО(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO)
	Если СвойствоФорматаОбмена(КомпонентыОбмена, "Справочник.ФизическиеЛица.ДанныеФИО") Тогда
		// Выгрузка данных о ФИО.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Период КАК НачалоПериода,
		|	Фамилия,
		|	Имя,
		|	Отчество
		|ИЗ РегистрСведений.ФИОФизическихЛиц
		|ГДЕ ФизическоеЛицо = &ФизическоеЛицо";
		Запрос.УстановитьПараметр("ФизическоеЛицо", ДанныеИБ.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ДанныеXDTO.Вставить("ДанныеФИО", РезультатЗапроса.Выгрузить());
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ВыгрузкаДопРеквизитовИзТаблицыЗначений(КомпонентыОбмена, ДанныеИБДополнительныеРеквизиты, ТаблицаДопРеквизитов)
	Для Каждого СтрокаТЧ ИЗ ДанныеИБДополнительныеРеквизиты Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Свойство)
			Или Не ЗначениеЗаполнено(СтрокаТЧ.Значение) Тогда
			
			Продолжить;						
		КонецЕсли;
		
		ТипЗначенияСвойства = ТипЗнч(СтрокаТЧ.Значение);
		ЗначениеСвойства = Неопределено;
		
		ЗначениеСвойства = ЗначениеВИнструкциюПКО(КомпонентыОбмена, СтрокаТЧ.Значение);
		
		Если ЗначениеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = ТаблицаДопРеквизитов.Добавить();
		НовСтрока.Свойство			= СтрокаТЧ.Свойство;
		НовСтрока.ЗначениеСвойства	= ЗначениеСвойства;
		
	КонецЦикла;
КонецПроцедуры
Процедура ДобавитьИдентификаторПеречисленияПоСсылке(ТаблицаДанные, ИмяКолонки)
	ТаблицаДанные.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Строка"));
	
	Для Каждого СтрокаДанные Из ТаблицаДанные Цикл
		// для перечислений XMLСтрока возвращает идентификатор значения, как он задан в конфигураторе
		СтрокаДанные[ИмяКолонки] = XMLСтрока(СтрокаДанные[ИмяКолонки + "Ссылка"]);
	КонецЦикла;
КонецПроцедуры
Процедура ДополнитьТаблицуЗарплатаВедомости(Зарплата, КВыплате)
	Отбор = Новый Структура("ИдентификаторСтроки");
		КВыплате.Индексы.Добавить("ИдентификаторСтроки");
		СтрокиКУдалению = Новый Массив;
		Для каждого СтрокаТЗ Из Зарплата Цикл
			Отбор.ИдентификаторСтроки = СтрокаТЗ.ИдентификаторСтрокиУИ;
			СтрокаТЗ.ИдентификаторСтроки = Строка(СтрокаТЗ.ИдентификаторСтрокиУИ);
			НайденныеСтроки = КВыплате.НайтиСтроки(Отбор);
			Для каждого СтрокаКВыплате Из НайденныеСтроки Цикл
				СтрокаТЗ.Сумма = СтрокаТЗ.Сумма + СтрокаКВыплате.КВыплате;
			КонецЦикла;
			Если СтрокаТЗ.Сумма = 0 Тогда
				СтрокиКУдалению.Добавить(СтрокаТЗ);
			КонецЕсли;
		КонецЦикла;
		Для каждого СтрокаТЗ Из СтрокиКУдалению Цикл
			Зарплата.Удалить(СтрокаТЗ);
		КонецЦикла;
КонецПроцедуры
Функция ЕстьСуммаКВыплата(ДанныеИБ, ВедомостьПрочихДоходов)
	Зарплата = ДанныеИБ.Состав.Выгрузить();
		Зарплата.Колонки.ИдентификаторСтроки.Имя = "ИдентификаторСтрокиУИ";
		Зарплата.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
		Зарплата.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		Если ВедомостьПрочихДоходов Тогда
			КВыплате = ДанныеИБ.Выплаты.Выгрузить();
		Иначе
			КВыплате = ДанныеИБ.Зарплата.Выгрузить();
		КонецЕсли;
		ДополнитьТаблицуЗарплатаВедомости(Зарплата, КВыплате);
		
		Возврат (Зарплата.Количество() > 0);
КонецФункции
Процедура ЗагрузитьПодробныеДанныеФИО(КомпонентыОбмена, ПолученныеДанные, ФизЛицоСсылка)
	Если СвойствоФорматаОбмена(КомпонентыОбмена, "Справочник.ФизическиеЛица.ДанныеФИО")
		И ПолученныеДанные.ДополнительныеСвойства.Свойство("ПодробныеДанныеФИО") Тогда	
		
		НаборЗаписейФИО = РегистрыСведений.ФИОФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписейФИО.Отбор.ФизическоеЛицо.Установить(ФизЛицоСсылка);
		Для Каждого СтрокаФИО Из ПолученныеДанные.ДополнительныеСвойства.ПодробныеДанныеФИО Цикл
			НовЗапись = НаборЗаписейФИО.Добавить();
			ЗаполнитьЗначенияСвойств(НовЗапись, СтрокаФИО);
			НовЗапись.ФизическоеЛицо = ФизЛицоСсылка;
			НовЗапись.Период = СтрокаФИО.НачалоПериода;
		КонецЦикла;
		НаборЗаписейФИО.ОбменДанными.Загрузка = Истина;
		НаборЗаписейФИО.Записать();
		
	Иначе 
		// Запись ФИО по наименованию физ.лица.
		ФИОСтрокой = ПолученныеДанные.Наименование;
		//++ НЕ УТ
		ФИОСтрокой = ПолученныеДанные.ФИО;
		//-- НЕ УТ
		СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИОСтрокой);
		ДанныеФИО = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(,Новый Структура("ФизическоеЛицо", ФизЛицоСсылка));
		Если ДанныеФИО.Количество() > 0 
			И ДанныеФИО[0].Фамилия = СтруктураФИО.Фамилия
			И ДанныеФИО[0].Имя = СтруктураФИО.Имя
			И ДанныеФИО[0].Отчество = СтруктураФИО.Отчество Тогда
			Возврат;
		КонецЕсли;
		НаборЗаписейФИО = РегистрыСведений.ФИОФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписейФИО.Отбор.ФизическоеЛицо.Установить(ФизЛицоСсылка);
	
		Если СтруктураФИО.Фамилия = Неопределено 
			И СтруктураФИО.Имя = Неопределено
			И СтруктураФИО.Отчество = Неопределено Тогда
			НаборЗаписейФИО.Записать();
			Возврат;
		КонецЕсли;
		НовЗапись = НаборЗаписейФИО.Добавить();
		ЗаполнитьЗначенияСвойств(НовЗапись, СтруктураФИО, "Фамилия, Имя, Отчество");
		НовЗапись.ФизическоеЛицо = ФизЛицоСсылка;
		НовЗапись.Период = ТекущаяДатаСеанса();
		
		НаборЗаписейФИО.ОбменДанными.Загрузка = Истина;
		НаборЗаписейФИО.Записать();
	КонецЕсли;
КонецПроцедуры
Процедура ЗаполнитьОбщиеДанныеЗаявкиНаРасходДС(КомпонентыОбмена, ДанныеXDTO)
	ДанныеXDTO.Вставить("Валюта", ЗначениеВИнструкциюПКО(КомпонентыОбмена, ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты()));
	ДанныеXDTO.Вставить("Статус", "НеСогласована");
КонецПроцедуры
Процедура ЗаполнитьПодразделениеПоУмолчанию(ТаблицаДанные)
	Для Каждого СтрокаДанные Из ТаблицаДанные Цикл
	    Если СтрокаДанные.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка()
	        ИЛИ СтрокаДанные.Подразделение = Неопределено Тогда
	        
	        ПодразделениеПоУмолчанию = Новый Структура;
	        ПодразделениеПоУмолчанию.Вставить("Наименование", "Подразделение по умолчанию");
	        
	        СтрокаДанные["Подразделение"] = Новый Структура("Значение, ИмяПКО",
	        ПодразделениеПоУмолчанию, "Справочник_Подразделения_ИзСтруктуры"); 
	    Иначе
	    	СтрокаДанные.Подразделение = Новый Структура("Значение, ИмяПКО",
							СтрокаДанные.Подразделение, "Справочник_СтруктураПредприятия"); 
	    КонецЕсли;
	КонецЦикла;
КонецПроцедуры
Процедура ЗаполнитьРасшифровкуПлатежаПоВедомости(ДанныеИБ, ДанныеXDTO)
	ВидВедомости = ДанныеИБ.Метаданные().ПолноеИмя();
	
	Если ВидВедомости = "Документ.ВедомостьНаВыплатуЗарплатыПеречислением" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВедомостьЗарплата.ФизическоеЛицо КАК Сотрудник,
		|	ВедомостьЗарплата.БанковскийСчет КАК БанковскийСчет,	
		|	Ведомость.Номер КАК НомерВедомостиНаВыплатуЗарплаты,
		|	Ведомость.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
		|	СУММА(ВедомостьЗарплата.КВыплате + ВедомостьЗарплата.КомпенсацияЗаЗадержкуЗарплаты) КАК Сумма
		|ИЗ
		|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением КАК Ведомость
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата КАК ВедомостьЗарплата
		|		ПО ВедомостьЗарплата.Ссылка = Ведомость.Ссылка
		|ГДЕ
		|	Ведомость.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьЗарплата.ФизическоеЛицо,
		|	ВедомостьЗарплата.БанковскийСчет,
		|	Ведомость.Номер,
		|	Ведомость.Дата";
	ИначеЕсли ВидВедомости = "Документ.ВедомостьПрочихДоходовВКассу" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВедомостьВыплаты.ФизическоеЛицо КАК Сотрудник,
		|	Ведомость.Номер КАК НомерВедомостиНаВыплатуЗарплаты,
		|	Ведомость.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
		|	СУММА(ВедомостьВыплаты.КВыплате) КАК Сумма
		|ИЗ
		|	Документ.ВедомостьПрочихДоходовВКассу КАК Ведомость
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовВКассу.Выплаты КАК ВедомостьВыплаты
		|		ПО ВедомостьВыплаты.Ссылка = Ведомость.Ссылка
		|ГДЕ
		|	Ведомость.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьВыплаты.ФизическоеЛицо,
		|	Ведомость.Номер,
		|	Ведомость.Дата";
	ИначеЕсли ВидВедомости = "Документ.ВедомостьПрочихДоходовПеречислением" Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВедомостьВыплаты.ФизическоеЛицо КАК Сотрудник,
		|	ВедомостьСостав.БанковскийСчет КАК БанковскийСчет,
		|	Ведомость.Номер КАК НомерВедомостиНаВыплатуЗарплаты,
		|	Ведомость.Дата КАК ДатаВедомостиНаВыплатуЗарплаты,
		|	СУММА(ВедомостьВыплаты.КВыплате) КАК Сумма
		|ИЗ
		|	Документ.ВедомостьПрочихДоходовПеречислением КАК Ведомость
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовПеречислением.Выплаты КАК ВедомостьВыплаты
		|		ПО (ВедомостьВыплаты.Ссылка = Ведомость.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьПрочихДоходовПеречислением.Состав КАК ВедомостьСостав
		|		ПО (ВедомостьВыплаты.Ссылка = ВедомостьСостав.Ссылка)
		|			И (ВедомостьВыплаты.ИдентификаторСтроки = ВедомостьСостав.ИдентификаторСтроки)
		|ГДЕ
		|	Ведомость.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВедомостьВыплаты.ФизическоеЛицо,
		|	ВедомостьСостав.БанковскийСчет,
		|	Ведомость.Номер,
		|	Ведомость.Дата"
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Ведомость.СуммаПоДокументу КАК Сумма,
		|	Ведомость.Номер КАК НомерВедомостиНаВыплатуЗарплаты,
		|	Ведомость.Дата КАК ДатаВедомостиНаВыплатуЗарплаты
		|ИЗ
		|	&ДокументВедомостьНаВыплатуЗарплаты КАК Ведомость
		|ГДЕ
		|	Ведомость.Ссылка = &Ссылка";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументВедомостьНаВыплатуЗарплаты", ВидВедомости);
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ДанныеXDTO.Вставить("РасшифровкаПлатежа", Запрос.Выполнить().Выгрузить());
КонецПроцедуры
Функция ЗначениеВИнструкциюПКО(КомпонентыОбмена, Значение, ЭтоПростойТип = Ложь, ПравилоНайдено = Ложь)
	// Параметры:
	// КомпонентыОбмена - структура компонентов обмена в рамках текущего сеанса;
	// Значение - значение, которое необходимо поместить в свойство объекта XDTO;
	// ЭтоПростойТип - исходящий параметр. Указывает, является ли тип переданного значения примитивным (Число, Строка, Булево, Дата);
	// ПравилоНайдено - определяет, было ли найдено правило конвертации. Если правило найдено, но Результат = Неопределено, значит, было найдено более одного ПКО для значения.
	Результат = Неопределено;
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЭтоОтправка		= (КомпонентыОбмена.НаправлениеОбмена = "Отправка");
	ЭтоПолучение	= (КомпонентыОбмена.НаправлениеОбмена = "Получение");
	
	ТипЗначенияСвойства = ТипЗнч(Значение);
	
	Если ЭтоПолучение
		И ТипЗнч(Значение) = Тип("Структура")
		И Значение.Свойство("Ссылка") Тогда
		
		ТипЗначенияСвойства = Значение.Ссылка.ТипЗначенияXDTO;
	ИначеЕсли ТипЗнч(Значение) = Тип("Структура")
		И Значение.Свойство("ИмяПКО") Тогда
		
		Возврат Новый Структура("Значение, ИмяПКО", Значение, Значение.ИмяПКО);
	КонецЕсли;
	
	Если ТипЗначенияСвойства = Тип("Число") 
		Или ТипЗначенияСвойства = Тип("Строка")
		Или ТипЗначенияСвойства = Тип("Булево")
		Или ТипЗначенияСвойства = Тип("Дата") Тогда
		
		Результат = Значение;
		ЭтоПростойТип = Истина;
	Иначе
		СтрокиПКО = Новый Массив;
		
		Если ЭтоОтправка Тогда	
			СтрокиПКО = КомпонентыОбмена.ПравилаКонвертацииОбъектов.НайтиСтроки(Новый Структура("ТипДанных", ТипЗначенияСвойства));
		КонецЕсли;
		
		Если ЭтоПолучение Тогда
			СтрокиПКО = КомпонентыОбмена.ПравилаКонвертацииОбъектов.НайтиСтроки(Новый Структура("ТипСсылкиXDTO", ТипЗначенияСвойства));
		КонецЕсли;
	
		// Ищем только однозначное соответствие.
		// Если правил будет найдено больше одного, считаем, что конвертация не выполнена.
		ЭтоГруппа = Неопределено;
				
		Для Каждого СтрокаПКО Из СтрокиПКО Цикл
			Если ЭтоОтправка Тогда
				Если СтрокаПКО.ЭтоСправочник Тогда
					Если ЭтоГруппа = Неопределено
						И СтрокаПКО.ОбъектДанных.Иерархический
						И СтрокаПКО.ОбъектДанных.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
						ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "ЭтоГруппа");
					Иначе
						ЭтоГруппа = Ложь;
					КонецЕсли;
					
					Если ЭтоГруппа
							И Не СтрокаПКО.ПравилоДляГруппыСправочника
						Или Не ЭтоГруппа
							И СтрокаПКО.ПравилоДляГруппыСправочника Тогда
						
						Продолжить;					
					КонецЕсли;			
				Иначе
					// Прочие варианты проверок						
				КонецЕсли;
			КонецЕсли;
			
			Если ПравилоНайдено Тогда
				Результат = Неопределено;
				Прервать;
			Иначе
				Результат = Новый Структура("Значение, ИмяПКО", Значение, СтрокаПКО.ИмяПКО);
				ПравилоНайдено = Истина;
			КонецЕсли;		
		КонецЦикла;			
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
Процедура ОтложеннаяОбработка_ДанныеДляРасчетаЗарплаты(КомпонентыОбмена, Объект)
	Если Не ЗначениеЗаполнено(Объект.ВидДокумента) Тогда
		Объект.ВидДокумента = ВидДокументаСдельныеРаботы(КомпонентыОбмена, Объект.Организация);
	КонецЕсли;
	
	Расценки = Объект.ВыполненныеРаботы.Выгрузить();
	Расценки.Свернуть("ВидРабот, Расценка");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Расценки.ВидРабот,
	|	Расценки.Расценка
	|ПОМЕСТИТЬ РасценкиВДокументе
	|ИЗ
	|	&Расценки КАК Расценки
	|ГДЕ
	|	Расценки.Расценка > 0
	|;
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	РасценкиВДокументе.ВидРабот КАК ВидРабот,
	|	РасценкиВДокументе.Расценка КАК Расценка
	|ИЗ
	|	РасценкиВДокументе КАК РасценкиВДокументе
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиРаботСотрудников.СрезПоследних(&Дата, ) КАК РасценкиРаботСотрудниковСрезПоследних
	|		ПО РасценкиРаботСотрудниковСрезПоследних.ВидРабот = РасценкиВДокументе.ВидРабот
	|ГДЕ
	|	РасценкиВДокументе.Расценка <> ЕСТЬNULL(РасценкиРаботСотрудниковСрезПоследних.Расценка, 0)");
	Запрос.УстановитьПараметр("Расценки", Расценки);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.РасценкиРаботСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидРабот.Установить(Выборка.ВидРабот);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
КонецПроцедуры
Процедура ОтложеннаяОбработка_ФизЛица(Объект, КомпонентыОбмена)
	Если НЕ ЗначениеЗаполнено(Объект.ГруппаДоступа) Тогда
		Объект.ГруппаДоступа = ЭлементПоУмолчанию_ГруппаДоступаФизЛица(КомпонентыОбмена.ПараметрыКонвертации);
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьВыгружатьФизЛицаПоНезарплатныеДоходы(ПараметрыКонвертации)
	Возврат ПараметрыКонвертации.ВыгружатьСДетализациейПоФизЛицамНезарплатныеДоходы;
КонецФункции
Функция СвойствоФорматаОбмена(КомпонентыОбмена, ИмяСвойства)
	Результат = Ложь;
	
	Если ИмяСвойства = "Справочник.ФизическиеЛица.ДанныеФИО" Тогда
		Результат = (ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.3"));
	КонецЕсли;
	
	Возврат Результат;
КонецФункции
Функция УправленческоеПодразделениеВедомостиНаВыплатуЗП(ДанныеИБ, ЭтоВедомостьПрочихДоходов = Ложь)
	Подразделение = Неопределено;
		
		ВидВедомости = ДанныеИБ.Метаданные().ПолноеИмя();
		
		Если Не ЭтоВедомостьПрочихДоходов Тогда
			КадровыеДанныеТЧ = КадровыйУчет.КадровыеДанныеСотрудников(
				Ложь,
				ДанныеИБ.Зарплата.ВыгрузитьКолонку("Сотрудник"),
				"МестоВСтруктуреПредприятия",
				КонецМесяца(ДанныеИБ.ПериодРегистрации));
				
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Т.ФизическоеЛицо,
			|	Т.Сотрудник,
			|	Т.МестоВСтруктуреПредприятия
			|ПОМЕСТИТЬ КадровыеДанные
			|ИЗ
			|	&КадровыеДанные КАК Т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(КадровыеДанные.МестоВСтруктуреПредприятия, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(СтруктураПредприятия.Ссылка, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
			|		ИНАЧЕ КадровыеДанные.МестоВСтруктуреПредприятия
			|	КОНЕЦ КАК Подразделение
			|ИЗ
			|	&ДокументВедомостьНаВыплату_Зарплата КАК Зарплата
			|		ЛЕВОЕ СОЕДИНЕНИЕ КадровыеДанные КАК КадровыеДанные
			|		ПО (КадровыеДанные.Сотрудник = Зарплата.Сотрудник)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|		ПО (СтруктураПредприятия.Источник = Зарплата.Подразделение)
			|ГДЕ
			|	Зарплата.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(КадровыеДанные.МестоВСтруктуреПредприятия, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(СтруктураПредприятия.Ссылка, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
			|		ИНАЧЕ КадровыеДанные.МестоВСтруктуреПредприятия
			|	КОНЕЦ";
		
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументВедомостьНаВыплату_Зарплата", ВидВедомости + ".Зарплата");
		
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
			Запрос.УстановитьПараметр("КадровыеДанные", КадровыеДанныеТЧ);
		
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() = 1 Тогда
				Выборка.Следующий();
				Если Не Выборка.Подразделение.Пустая() Тогда
					Подразделение = Выборка.Подразделение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Подразделение = Неопределено Тогда
			// Подразделение бухгалтера или расчетчика
			ФизЛицоДляПодразделения = Неопределено;
			
			Если Не ДанныеИБ.Бухгалтер.Пустая() Тогда
				ФизЛицоДляПодразделения = ДанныеИБ.Бухгалтер;
			Иначе
				ФизЛицоДляПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.Ответственный, "ФизическоеЛицо");
			КонецЕсли;
			
			СписокФизЛиц = Новый Массив;
			СписокФизЛиц.Добавить(ФизЛицоДляПодразделения);
			ТаблицаСотрудники = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизЛиц, Ложь, ДанныеИБ.Организация, КонецМесяца(ДанныеИБ.ПериодРегистрации));
			
			КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(
				Ложь,
				ТаблицаСотрудники.ВыгрузитьКолонку("Сотрудник"),
				"МестоВСтруктуреПредприятия, Подразделение",
				КонецМесяца(ДанныеИБ.ПериодРегистрации));
				
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Т.ФизическоеЛицо,
			|	Т.Сотрудник,
			|	Т.Подразделение,
			|	Т.МестоВСтруктуреПредприятия
			|ПОМЕСТИТЬ КадровыеДанные
			|ИЗ
			|	&КадровыеДанные КАК Т
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(КадровыеДанные.МестоВСтруктуреПредприятия, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
			|			ТОГДА ЕСТЬNULL(СтруктураПредприятия.Ссылка, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))
			|		ИНАЧЕ КадровыеДанные.МестоВСтруктуреПредприятия
			|	КОНЕЦ КАК Подразделение
			|ИЗ
			|	КадровыеДанные КАК КадровыеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|		ПО (СтруктураПредприятия.Источник = КадровыеДанные.Подразделение)");
			Запрос.УстановитьПараметр("КадровыеДанные", КадровыеДанные);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий()
				И Не Выборка.Подразделение.Пустая() Тогда
				Подразделение = Выборка.Подразделение;
			КонецЕсли;
		
		КонецЕсли;
		
		Возврат Подразделение;
КонецФункции
Функция ФизическоеЛицоДляВыгрузки(ФизЛицоИсходное, ПараметрыКонвертации)
	Если ПараметрыКонвертации.ВыгружатьСДетализациейПоФизическимЛицам = ЛОЖЬ Тогда
		// отправляем пустое физ.лицо
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе
		Возврат ФизЛицоИсходное;
	КонецЕсли;
КонецФункции
Функция ФизЛицоНезарплатныеДоходыДляВыгрузки(ФизЛицоИсходное, ПараметрыКонвертации)
	ВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы = ПолучитьВыгружатьФизЛицаПоНезарплатныеДоходы(ПараметрыКонвертации);
	Если ВыгружатьСДетализациейПоФизическимЛицамНезарплатныеДоходы = ЛОЖЬ Тогда
		// отправляем пустое физ.лицо
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();
	Иначе
		Возврат ФизЛицоИсходное;
	КонецЕсли;
КонецФункции
Функция ЭлементПоУмолчанию_ГруппаДоступаФизЛица(ПараметрыКонвертации)
	ГруппаДоступа = Неопределено;
	Если ПараметрыКонвертации.ГруппаДоступаФизЛицПоУмолчанию = Неопределено Тогда
		
		НеобходимоСоздатьЭлемент = Ложь;
		
		НаименованиеЭлементаДляОбменаПоУмолчанию = НСтр("ru='Группа доступа по умолчанию'");
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2
		|	ГруппыДоступаФизЛиц.Ссылка КАК ГруппаДоступаФизЛица,
		|	ВЫБОР
		|		КОГДА ГруппыДоступаФизЛиц.Наименование = &НаименованиеЭлементаДляОбменаПоУмолчанию
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЭлементПоУмолчаниюДляОбмена
		|ИЗ
		|	Справочник.ГруппыДоступаФизическихЛиц КАК ГруппыДоступаФизЛиц
		|ГДЕ
		|	НЕ ГруппыДоступаФизЛиц.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоЭлементПоУмолчаниюДляОбмена УБЫВ");
		
		Запрос.УстановитьПараметр("НаименованиеЭлементаДляОбменаПоУмолчанию", НаименованиеЭлементаДляОбменаПоУмолчанию);
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество() = 1 Или Выборка.ЭтоЭлементПоУмолчаниюДляОбмена Тогда
				ГруппаДоступа = Выборка.ГруппаДоступаФизЛица;
			Иначе
				НеобходимоСоздатьЭлемент = Истина;
			КонецЕсли;
		Иначе
			НеобходимоСоздатьЭлемент = Истина;
		КонецЕсли;
		
		// Создание элемента для обмена с заданными параметрами
		Если НеобходимоСоздатьЭлемент Тогда
			
			ГруппаДоступаОбъект = Справочники.ГруппыДоступаФизическихЛиц.СоздатьЭлемент();
			ГруппаДоступаОбъект.Наименование = НаименованиеЭлементаДляОбменаПоУмолчанию;
			
			Попытка
				ГруппаДоступаОбъект.Записать();
				ГруппаДоступа = ГруппаДоступаОбъект.Ссылка;
			Исключение
				ГруппаДоступа = Справочники.ГруппыДоступаФизическихЛиц.ПустаяСсылка();
			КонецПопытки
		КонецЕсли;
		
		ПараметрыКонвертации.ГруппаДоступаФизЛицПоУмолчанию = ГруппаДоступа;
		
	Иначе
		ГруппаДоступа = ПараметрыКонвертации.ГруппаДоступаФизЛицПоУмолчанию;
	КонецЕсли;
	
	Возврат ГруппаДоступа;
КонецФункции

#КонецОбласти
#Область Параметры
// Заполняет параметры конвертации.
//
// Параметры:
//  ПараметрыКонвертации - структура, в которую добавляются параметры конвертации.
Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
	ПараметрыКонвертации.Вставить("ВыгружатьСДетализациейПоФизическимЛицам");
	ПараметрыКонвертации.Вставить("ОтправлятьВедомостиКакЗаявки");
	ПараметрыКонвертации.Вставить("ВыгружатьСДетализациейПоФизЛицамНезарплатныеДоходы");
КонецПроцедуры

#КонецОбласти
#Область ОбщегоНазначения
// Процедура-обертка, выполняет запуск указанной в параметрах процедуры модуля менеджера обмена через формат.
//
// Параметры:
//  ИмяПроцедуры - строка.
//  СтруктураПараметров - структура, содержащая передаваемые параметры.
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
	Если ИмяПроцедуры = "ПОД_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОбработке" Тогда 
		ПОД_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком_ПриОбработке" Тогда 
		ПОД_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ВедомостьПрочихДоходовВКассу_ПриОбработке" Тогда 
		ПОД_Документ_ВедомостьПрочихДоходовВКассу_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ВозвратСотрудникомЗадолженности_ПриОбработке" Тогда 
		ПОД_Документ_ВозвратСотрудникомЗадолженности_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ВыплатаДепонированнойЗарплаты_ПриОбработке" Тогда 
		ПОД_Документ_ВыплатаДепонированнойЗарплаты_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОбработке" Тогда 
		ПОД_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОбработке" Тогда 
		ПОД_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ОтражениеЗарплатыВБухучете_ПриОбработке" Тогда 
		ПОД_Документ_ОтражениеЗарплатыВБухучете_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ПеречислениеВзносовИОтчислений_ПриОбработке" Тогда 
		ПОД_Документ_ПеречислениеВзносовИОтчислений_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ПлатежноеПоручение_ПриОбработке" Тогда 
		ПОД_Документ_ПлатежноеПоручение_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_СведенияОНезачисленнойЗарплате_ПриОбработке" Тогда 
		ПОД_Документ_СведенияОНезачисленнойЗарплате_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОбработке" Тогда 
		ПОД_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Справочник_ВидыРаботСотрудников_Отправка_ПриОбработке" Тогда 
		ПОД_Справочник_ВидыРаботСотрудников_Отправка_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Справочник_ДокументыФизическихЛиц_Отправка_ПриОбработке" Тогда 
		ПОД_Справочник_ДокументыФизическихЛиц_Отправка_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Справочник_ЗППроекты_Отправка_ПриОбработке" Тогда 
		ПОД_Справочник_ЗППроекты_Отправка_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Справочник_СпособыОтраженияЗарплатыВБухУчете_ПриОбработке" Тогда 
		ПОД_Справочник_СпособыОтраженияЗарплатыВБухУчете_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Справочник_ФизическиеЛица_ПриОбработке" Тогда 
		ПОД_Справочник_ФизическиеЛица_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриОбработке" Тогда 
		ПОД_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьНаВозвратПрочихВыплат_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьНаВозвратПрочихВыплат_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьНаВыплатуЗарплатыВКассу_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчик_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчик_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_Заявка_УП_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьНаВыплатуЗПВКассу_УП_ОТ_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьНаВыплатуЗППеречислением_Заявка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьНаВыплатуЗППеречислением_Заявка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьНаВыплатуЗПРаздатчиком_УП_От_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьПрочихДоходовВКассу_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьПрочихДоходовВКассу_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьПрочихДоходовВКассу_Заявка_УП_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВедомостьПрочихДоходовВКассу_УП_От_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВедомостьПрочихДоходовВКассу_УП_От_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВозвратСотрудникомЗадолженности_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВозвратСотрудникомЗадолженности_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ВыплатаДепонированнойЗарплаты_Касса_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ВыплатаДепонированнойЗарплаты_Касса_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ДепонированиеЗарплаты_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ДепонированиеЗарплаты_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ДоговорЗаймаСотруднику_УП_От_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_НачислениеОценочныхОбязательств_БК_ОТ_ПриОтправкеДанных" Тогда 
		ПКО_Документ_НачислениеОценочныхОбязательств_БК_ОТ_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОтправкеДанных" Тогда 
		ПКО_Документ_НачислениеОценочныхОбязательствПоОтпускам_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ОтражениеЗарплатыВБухучете_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ОтражениеЗарплатыВБухучете_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ОтражениеЗарплатыВБухучете_УП_От_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ОтражениеЗарплатыВБухучете_УП_От_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПеречислениеВзносовИОтчислений_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПеречислениеВзносовИОтчислений_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПеречислениеВзносовИОтчислений_УП_ОТ_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПеречислениеВзносовИОтчислений_УП_ОТ_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПлатежноеПоручение_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПлатежноеПоручение_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПлатежноеПоручение_УП_ОТ_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПлатежноеПоручение_УП_ОТ_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПлатежноеПоручениеПДПеречислением_Заявка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПлатежноеПоручениеПДПеречислением_Заявка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_РегистрацияПрочихВыплат_ПриОтправкеДанных" Тогда 
		ПКО_Документ_РегистрацияПрочихВыплат_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_РезервыПоОплатеТруда_ПриОтправкеДанных" Тогда 
		ПКО_Документ_РезервыПоОплатеТруда_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_СведенияОНезачисленнойЗарплате_ПриОтправкеДанных" Тогда 
		ПКО_Документ_СведенияОНезачисленнойЗарплате_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОтправкеДанных" Тогда 
		ПКО_Документ_СведенияОНезачисленныхВзносахОтчислениях_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_БанковскиеСчетаКонтрагентов_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_БанковскиеСчетаКонтрагентов_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_БанковскиеСчетаКонтрагентовИзСтруктуры_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_БанковскиеСчетаОрганизаций_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_БанковскиеСчетаОрганизаций_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ДокументыФизическихЛиц_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ДокументыФизическихЛиц_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ЗППроекты_КакБанковскиеСчета_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ЗППроекты_КакБанковскиеСчета_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ЗППроекты_КакКонтрагенты_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ЗППроекты_КакКонтрагенты_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Кассы_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_Кассы_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Контрагенты_ИзСтруктуры_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_Контрагенты_ИзСтруктуры_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Организации_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_Организации_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ПодразделенияОрганизаций_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ПодразделенияОрганизаций_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Пользователи_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_Пользователи_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_РегистрацииВНалоговомОргане_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_РегистрацииВНалоговомОргане_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ФизическиеЛица_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ФизическиеЛица_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Документ_ДанныеДляРасчетаЗарплаты_УП_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_НачислениеОценочныхОбязательств_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_НачислениеОценочныхОбязательств_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ОтражениеЗарплатыВБухучете_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_ОтражениеЗарплатыВБухучете_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_РезервыПоОплатеТруда_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_РезервыПоОплатеТруда_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Организации_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Справочник_Организации_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Организации_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_Организации_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ФизическиеЛица_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_ФизическиеЛица_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ДополнительныеРеквизиты_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_ДополнительныеРеквизиты_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ОтложеннаяОбработка_ДанныеДляРасчетаЗарплаты" Тогда 
		ОтложеннаяОбработка_ДанныеДляРасчетаЗарплаты(
			Параметры.КомпонентыОбмена, Параметры.Объект);
	ИначеЕсли ИмяПроцедуры = "ОтложеннаяОбработка_ФизЛица" Тогда 
		ОтложеннаяОбработка_ФизЛица(
			Параметры.Объект, Параметры.КомпонентыОбмена);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
