#Область СлужебныйПрограммныйИнтерфейс

//См. РасчетЗарплатыРасширенный.СоздатьДанныеДляПроведенияНачисленияЗарплаты
Процедура ДополнитьПоляСтруктурыДляПроведения(ПоляСтруктуры) Экспорт
	
	ПоляСтруктуры = ПоляСтруктуры + ",
		|НалогиВзносыОтчисления,
		|ДоходыНеПодлежащиеНалогообложению,
		|ВычетыИПН,
		|КомпонентыЕП";
	
КонецПроцедуры

//См. РасчетЗарплатыРасширенный.СоздатьДанныеДляПроведенияНачисленияЗарплаты
Процедура ДополнитьОписаниеДанныхДляПроведения(ДанныеДляПроведения) Экспорт
	
	ДанныеДляПроведения.Вставить("СведенияОбИсчисленииНалоговВзносовОтчислений");
	ДанныеДляПроведения.Вставить("НалогиВзносыОтчисленияРасчетыСБюджетомИФондами");
	ДанныеДляПроведения.Вставить("СведенияОНеоблагаемыхДоходахФизическихЛиц");
	ДанныеДляПроведения.Вставить("СведенияОбИсчисленииВычетовИПН");
	ДанныеДляПроведения.Вставить("ЕПКомпоненты");
	
КонецПроцедуры

//См. РасчетЗарплатыРасширенный.ОписаниеДанныхДляЗаполненияТаблицДокумента
Процедура ДополнитьОписаниеДанныхДляЗаполненияТаблицДокумента(ДанныеЗаполнения) Экспорт
	
	ДанныеЗаполнения.Вставить("НалогиВзносыОтчисления",Новый ТаблицаЗначений);
	ДанныеЗаполнения.Вставить("ДоходыНеПодлежащиеНалогообложению",Новый ТаблицаЗначений);
	ДанныеЗаполнения.Вставить("ВычетыИПН",Новый ТаблицаЗначений);
	ДанныеЗаполнения.Вставить("КомпонентыЕП",Новый ТаблицаЗначений);
	
КонецПроцедуры

// Обход очистки нескольких или всех (Ctrl + A) строк в документах прочих доходов ЗУП РФ
Процедура ОчиститьДанныеНВОВДокументахПрочихДоходов(Объект, РежимЗаписи) Экспорт

	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;	
	КонецЕсли;

	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";	
	Иначе
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.РегистрацияПрочихДоходов")
		 ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ВыплатаБывшимСотрудникам") Тогда
		 
		 ИмяТабличнойЧастиПоиска = "НачисленияУдержанияВзносы";	
		 ИмяПоляПоиска = "ФизическоеЛицо";
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект." + ИмяДокументаДивиденды) Тогда
		
		Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
			
			ИмяТабличнойЧастиПоиска = "Начисления";	
			ИмяПоляПоиска = "Акционер";
			
		Иначе
			
			ИмяТабличнойЧастиПоиска = "ФизическиеЛица";	
			ИмяПоляПоиска = "ФизическоеЛицо";
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура(ИмяПоляПоиска);
	
	ФизическиеЛицаПрошедшиеПроверку = Новый Массив;
	
	ФизическиеЛицаКУдалению = Новый Массив;
	
	Если Объект.НалогиВзносыОтчисления.Количество() > 0 Тогда 
		
		Для Каждого СтрокаНВО Из Объект.НалогиВзносыОтчисления Цикл
			
			Если ФизическиеЛицаПрошедшиеПроверку.Найти(СтрокаНВО.ФизическоеЛицо) = Неопределено Тогда
				
				ФизическиеЛицаПрошедшиеПроверку.Добавить(СтрокаНВО.ФизическоеЛицо);
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
			СтруктураОтбора[ИмяПоляПоиска] = СтрокаНВО.ФизическоеЛицо;
			МассивСтрокНВО = Объект[ИмяТабличнойЧастиПоиска].НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрокНВО.Количество() = 0 Тогда
				
				ФизическиеЛицаКУдалению.Добавить(СтрокаНВО.ФизическоеЛицо);
				
			КонецЕсли;
			
		КонецЦикла;
	
	    СтруктураПоискаДНПН = Новый Структура("ФизическоеЛицо");

		Для Каждого ФизическоеЛицо Из ФизическиеЛицаКУдалению Цикл
			
			СтруктураПоискаДНПН.ФизическоеЛицо = ФизическоеЛицо;
	        МассивСтрокНеоблагаемые = Объект.ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(СтруктураПоискаДНПН);
			
			Если МассивСтрокНеоблагаемые.Количество() > 0 Тогда
				
				Для Каждого СтрокаНеоблагаемые Из МассивСтрокНеоблагаемые Цикл
					Объект.ДоходыНеПодлежащиеНалогообложению.Удалить(СтрокаНеоблагаемые);	
				КонецЦикла;
				
			КонецЕсли;
			
			УчетНалоговВзносовОтчисленийРасширенный.УдалитьДанныеПоНалогамВзносамОтчислениямФизическоголица(Объект, ФизическоеЛицо);
			
		КонецЦикла;
		
	Иначе
		
		Объект.ДоходыНеПодлежащиеНалогообложению.Очистить();
		Объект.ВычетыИПН.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьНалогиВзносыОтчисления(ОкончательныйРасчетЗарплаты, НаборыЗаписей,Организация,ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, Начисления, ДоговорыПодряда, УдалитьВТ, ИсправленныйДокумент = Неопределено, ДоходыНеПодлежащиеНалогообложению = Неопределено) Экспорт
	
	РезультатРасчетаНалоговВзносовОтчислений = РезультатРасчетаНалоговВзносовОтчислений(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты, ДоходыНеПодлежащиеНалогообложению);
	
	Возврат РезультатРасчетаНалоговВзносовОтчислений;
	
КонецФункции

Функция СформироватьСведенияОДоходах(ОкончательныйРасчетЗарплаты, НаборыЗаписей,Организация,ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, Начисления, ДоговорыПодряда, УдалитьВТ, ИсправленныйДокумент = Неопределено) Экспорт
	
	СоздатьВТНачисленияДляРассчетаНалоговВзносовОтчислений(Начисления, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка, ИсправленныйДокумент);
	СоздатьВТДоговорыПодрядаДляРассчетаНалоговВзносовОтчислений(ДоговорыПодряда, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка);
	
	УчетНалоговВзносовОтчислений.СформироватьСведенияОДоходах(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты, НаборыЗаписей);
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОДоходахФизическихЛиц, Истина);
	
	УчетНалоговВзносовОтчислений.ПодготовитьДанныеДляРасчетаНалоговВзносов(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	// Расчитать необлагаемые доходы начислений
	ДоходыНеПодлежащиеНалогообложению = УчетНалоговВзносовОтчислений.РассчитатьНеоблагаемыеДоходы(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	ЗарплатаКадры.СоздатьВТПоНаборуЗаписей(МенеджерВременныхТаблиц, НаборыЗаписей.СведенияОНеоблагаемыхДоходахФизическихЛиц, Истина);

	Возврат ДоходыНеПодлежащиеНалогообложению;
	
КонецФункции 

Процедура СоздатьВТНачисленияДляРассчетаНалоговВзносовОтчислений(Начисления, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка, ИсправленныйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Начисления", Начисления);
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	Если ЗначениеЗаполнено(ИсправленныйДокумент) Тогда
		Запрос.УстановитьПараметр("ИсправленныйДокумент", ИсправленныйДокумент);
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("ИсправленныйДокумент", МетаданныеДокумента) Тогда
		ИсправленныйДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка,"ИсправленныйДокумент");
		Если ЗначениеЗаполнено(ИсправленныйДокументСсылка) Тогда
			Запрос.УстановитьПараметр("ИсправленныйДокумент", ИсправленныйДокументСсылка);
		Иначе 
			Запрос.УстановитьПараметр("ИсправленныйДокумент", Документы[МетаданныеДокумента.Имя].ПустаяСсылка())
		КонецЕсли;
	Иначе	
		Запрос.УстановитьПараметр("ИсправленныйДокумент", Документы[МетаданныеДокумента.Имя].ПустаяСсылка())
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.Начисление КАК Начисление,
	|	Начисления.ДатаНачала КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА Начисления.Сторно
	|				ИЛИ Начисления.ФиксСторно
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Сторно,
	|	Начисления.СторнируемыйДокумент КАК СторнируемыйДокумент,
	|	Начисления.Результат КАК СуммаДохода,
	|	Начисления.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТНачисленияТаблица
	|ИЗ
	|	&Начисления КАК Начисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисленияТаблица.Сотрудник КАК Сотрудник,
	|	ВТНачисленияТаблица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТНачисленияТаблица.Начисление КАК Начисление,
	|	ВТНачисленияТаблица.ДатаНачала КАК ДатаНачала,
	|	ВТНачисленияТаблица.Сторно КАК Сторно,
	|	ВТНачисленияТаблица.СторнируемыйДокумент КАК СторнируемыйДокумент,
	|	ВТНачисленияТаблица.СуммаДохода КАК СуммаДохода,
	|	&ИсправленныйДокумент КАК ИсправленныйДокумент,
	|	ВТНачисленияТаблица.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	ВТНачисленияТаблица КАК ВТНачисленияТаблица";
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТНачисленияТаблица");
	УдалитьВТ.Добавить("ВТНачисления");
	
КонецПроцедуры

Процедура СоздатьВТДоговорыПодрядаДляРассчетаНалоговВзносовОтчислений(ДоговорыПодряда, МенеджерВременныхТаблиц, УдалитьВТ, ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДоговорыПодряда", ДоговорыПодряда);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияПоДоговорам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияПоДоговорам.Результат КАК Сумма,
	|	НачисленияПоДоговорам.Подразделение,
	|	НачисленияПоДоговорам.Сотрудник,
	|	НачисленияПоДоговорам.ВидДохода
	|ПОМЕСТИТЬ ВТНачисленияПоДоговорам
	|ИЗ
	|	&ДоговорыПодряда КАК НачисленияПоДоговорам";
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТНачисленияПоДоговорам");
	
КонецПроцедуры

Функция РезультатРасчетаНалоговВзносовОтчислений(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина, ДоходыНеПодлежащиеНалогообложению = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// ОПВ
	РезультатРасчетаОПВ = РезультатРасчетаОПВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	Если ЗарплатаКадрыРКПовтИсп.ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления) Тогда
		
		Если ЗарплатаКадрыРКПовтИсп.ПрименятьВычетОПВиВОСМСДляГПХ(ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация), МесяцНачисления) Тогда
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ТолькоДоходОтНалоговогоАгента", Истина);
			УчетНалоговВзносовОтчислений.РассчитатьВОСМСПосле2020(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты,, ДополнительныеПараметры);	
			ДополнительныеПараметры.Удалить("ТолькоДоходОтНалоговогоАгента");
		КонецЕсли;		
		
		Если ОкончательныйРасчетЗарплаты Тогда
			РезультатРасчетаСО = РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		ИначеЕсли Тип("ДокументСсылка.НачислениеПоДоговорам") = ТипЗнч(ДокументСсылка) Тогда
			РезультатРасчетаСО = РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		КонецЕсли;
		
		РезультатРасчетаИПН = РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		РезультатРасчетаВОСМС = РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);

	Иначе
		
		РезультатРасчетаВОСМС = РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);

		Если ОкончательныйРасчетЗарплаты Тогда
			РезультатРасчетаСО = РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		ИначеЕсли Тип("ДокументСсылка.НачислениеПоДоговорам") = ТипЗнч(ДокументСсылка) Тогда
			РезультатРасчетаСО = РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		КонецЕсли;

		РезультатРасчетаИПН = РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);

	КонецЕсли;
		
	НалогиВзносыОтчисления = РезультатРасчетаИПН.ИПН.СкопироватьКолонки();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатРасчетаИПН.ИПН, НалогиВзносыОтчисления);
	
	УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаОПВ.ОПВ, НалогиВзносыОтчисления);
	
	Если РезультатРасчетаВОСМС <> Неопределено Тогда
		УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаВОСМС.ВОСМС, НалогиВзносыОтчисления);
	КонецЕсли;	

	// Налоги, взносы и отчисления за счет работодателя расчитываются 
	// только при окончательном расчете начислений
	// только в документе "Начисление зарплаты" и "Увольнение"
	Если ОкончательныйРасчетЗарплаты Тогда
		// СО
		УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаСО.СО, НалогиВзносыОтчисления);
		// СН
		РезультатРасчетаСН = РезультатРасчетаСН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаСН.СН, НалогиВзносыОтчисления);
		// ОППВ
		Если ПолучитьФункциональнуюОпцию("ПлательщикОППВЗарплатаКадры", Новый Структура("Организация", Организация)) Тогда
			РезультатРасчетаОППВ = РезультатРасчетаОППВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
			УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаОППВ.ОППВ, НалогиВзносыОтчисления);
		КонецЕсли;
		//ООСМС
		РезультатРасчетаООСМС = РезультатРасчетаООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		Если РезультатРасчетаООСМС <> Неопределено Тогда
			УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаООСМС.ООСМС, НалогиВзносыОтчисления);
		КонецЕсли;
		// ОПВР
		РезультатРасчетаОПВР = РезультатРасчетаОПВР(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		Если РезультатРасчетаОПВР <> Неопределено Тогда
			УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаОПВР.ОПВР, НалогиВзносыОтчисления);
		КонецЕсли;

	ИначеЕсли Тип("ДокументСсылка.НачислениеПоДоговорам") = ТипЗнч(ДокументСсылка) Тогда
		
		// СО
		УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаСО.СО, НалогиВзносыОтчисления);
		
	КонецЕсли;
	
	// ЕП
	ПорядокОбложенияДоходовРаботников = ЗарплатаКадрыРКПовтИсп.ПорядокОбложенияДоходовРаботников(Организация, МесяцНачисления);
	
	Если ПорядокОбложенияДоходовРаботников = Перечисления.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж Тогда
		
		РезультатРасчетаЕП = РезультатРасчетаЕП(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
		
		Если РезультатРасчетаЕП <> Неопределено Тогда
			УчетНалоговВзносовОтчислений.ДополнитьТаблицуНалогиВзносыОтчисления(РезультатРасчетаЕП.ЕП, НалогиВзносыОтчисления, РезультатРасчетаЕП.КомпонентыЕП);
		КонецЕсли;
		
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
	// Упорядочим таблицу налогов, взносов и отчислений по тем же правилам, что и начисления (для этого получаем основных сотрудников).
	Физлица = ОбщегоНазначения.ВыгрузитьКолонку(НалогиВзносыОтчисления, "ФизическоеЛицо", Истина);
	СотрудникиФизическиеЛица = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(Физлица, Истина, Организация, МесяцНачисления);
	Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(СотрудникиФизическиеЛица, "Сотрудник", Истина);
	
	// По основным сотрудникам запрашиваем сведения о рабочих местах на конец месяца.
	МенеджерВТУпорядочивания = Новый МенеджерВременныхТаблиц;
	КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеСотрудников(МенеджерВТУпорядочивания, Истина, Сотрудники, "Подразделение,Должность", КонецМесяца(МесяцНачисления));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровыеДанныеСотрудников.Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадровыеДанныеСотрудников.Подразделение,
	|	КадровыеДанныеСотрудников.Должность,
	|	Должности.РеквизитДопУпорядочивания КАК ПорядокДолжности,
	|	Подразделения.РеквизитДопУпорядочивания КАК ПорядокПодразделения,
	|	Сотрудники.Наименование
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО (Должности.Ссылка = КадровыеДанныеСотрудников.Должность)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК Подразделения
	|		ПО (Подразделения.Ссылка = КадровыеДанныеСотрудников.Подразделение)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО (Сотрудники.Ссылка = КадровыеДанныеСотрудников.Сотрудник)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокДолжности,
	|	ПорядокПодразделения,
	|	Сотрудники.Наименование";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТУпорядочивания;
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПорядокПоФизическимЛицам = Новый Соответствие;
	Порядок = 0;
	Пока Выборка.Следующий() Цикл
		ПорядокПоФизическимЛицам.Вставить(Выборка.ФизическоеЛицо, Порядок);
		Порядок = Порядок + 1;
	КонецЦикла;

    // Добавляем колонки, для обновления изменяемых строк документов
    НалогиВзносыОтчисления.Колонки.Добавить("ФиксРасчет", Новый ОписаниеТипов("Булево"));
	НалогиВзносыОтчисления.Колонки.Добавить("ФиксСтрока", Новый ОписаниеТипов("Булево"));

	// На основе полученного соответствия сортируем строки таблицы.
	НалогиВзносыОтчисления.Колонки.Добавить("ПорядокСтрок");
	Для Каждого Строка Из НалогиВзносыОтчисления Цикл
		Строка.ПорядокСтрок = ПорядокПоФизическимЛицам[Строка.ФизическоеЛицо];
	КонецЦикла;
	НалогиВзносыОтчисления.Сортировать("ПорядокСтрок,МесяцНалоговогоПериода,Подразделение,ВидНалогаВзносаОтчисления");

	СтруктураВозврата = Новый Структура("НалогиВзносыОтчисления, ДоходыНеПодлежащиеНалогообложению, ВычетыИПН, КомпонентыЕП");
	СтруктураВозврата.НалогиВзносыОтчисления = НалогиВзносыОтчисления;
	СтруктураВозврата.ДоходыНеПодлежащиеНалогообложению = ДоходыНеПодлежащиеНалогообложению;
	
	Если НЕ РезультатРасчетаЕП = Неопределено Тогда
		СтруктураВозврата.КомпонентыЕП = РезультатРасчетаЕП.КомпонентыЕП;
	КонецЕсли;
	СтруктураВозврата.ВычетыИПН = РезультатРасчетаИПН.ВычетыИПН;
		
	Возврат СтруктураВозврата;
	
КонецФункции

Функция РезультатРасчетаОПВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ОПВ
	РезультатРасчетаОПВ = УчетНалоговВзносовОтчислений.РезультатРасчетаОПВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаОПВ;
	
КонецФункции

Функция РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ИПН
	РезультатРасчетаИПН = УчетНалоговВзносовОтчислений.РезультатРасчетаИПН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаИПН;
	
КонецФункции

Функция РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем СО
	РезультатРасчетаСО = УчетНалоговВзносовОтчислений.РезультатРасчетаСО(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаСО;
	
КонецФункции

Функция РезультатРасчетаСН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем СН
	РезультатРасчетаСН = УчетНалоговВзносовОтчислений.РезультатРасчетаСН(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатРасчетаСН;
	
КонецФункции

Функция РезультатРасчетаОППВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ОППВ
	РезультатРасчетаОППВ = УчетНалоговВзносовОтчислений.РезультатРасчетаОППВ(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаОППВ;
	
КонецФункции

Функция РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ВОСМС
	РезультатРасчетаВОСМС = УчетНалоговВзносовОтчислений.РезультатРасчетаВОСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаВОСМС;
	
КонецФункции

Функция РезультатРасчетаООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ООСМС
	РезультатРасчетаООСМС = УчетНалоговВзносовОтчислений.РезультатРасчетаООСМС(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаООСМС;
	
КонецФункции

Функция РезультатРасчетаЕП(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ЕП
	РезультатРасчетаЕП = УчетНалоговВзносовОтчислений.РезультатРасчетаЕП(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаЕП;
	
КонецФункции

Функция РезультатРасчетаОПВР(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Рассчитываем ОПВР
	РезультатРасчетаОПВР = УчетНалоговВзносовОтчислений.РезультатРасчетаОПВР(Организация, ДокументСсылка, МенеджерВременныхТаблиц, МесяцНачисления, ОкончательныйРасчетЗарплаты);
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат РезультатРасчетаОПВР;
	
КонецФункции

//См. РасчетЗарплатыРасширенный.СодержимоеДокументаРасчетаЗарплаты
Процедура ДополнитьСодержимоеДокументаРасчетаЗарплаты(СодержимоеДокумента) Экспорт
	
	СодержимоеДокумента.Вставить("НалогиВзносыОтчисления", ПустаяТаблицаНалогиВзносыОтчисления());
	СодержимоеДокумента.Вставить("ДоходыНеПодлежащиеНалогообложению", ПустаяТаблицаДоходыНеПодлежащиеНалогообложению());
	СодержимоеДокумента.Вставить("ВычетыИПН", ПустаяТаблицаВычетыИПН());
	СодержимоеДокумента.Вставить("КомпонентыЕП", ПустаяТаблицаКомпонентыЕП());
	
КонецПроцедуры

Функция ОписаниеТиповЧисло()

	ОписаниеТиповЧисло = Новый Структура;
	ОписаниеТиповЧисло.Вставить("ТипЧисло15_2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло7_2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 2)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло15_3", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло7_0", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 0)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло10_0", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	ОписаниеТиповЧисло.Вставить("ТипЧисло12_2", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 2)));
	
	Возврат ОписаниеТиповЧисло;

КонецФункции

Функция ПустаяТаблицаНалогиВзносыОтчисления() Экспорт
	
	ОписаниеТиповЧисло = ОписаниеТиповЧисло();
	
	ТаблицаНалогиВзносыОтчисления = Новый ТаблицаЗначений;
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ВидДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходов")); 
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений")); 
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ОблагаемыйДоход", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("НеоблагаемыйДоход", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("НалогВзнос", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("НалогВзносСПревышения", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ОбъектИсчисления", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("РазрешенныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ПримененныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ПримененнаяЛьгота", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ПрочиеВычеты", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ФиксРасчет", Новый ОписаниеТипов("Булево"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ФиксСтрока", Новый ОписаниеТипов("Булево"));
	ТаблицаНалогиВзносыОтчисления.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", ОписаниеТиповЧисло.ТипЧисло7_0);
	
	Возврат ТаблицаНалогиВзносыОтчисления;
	
КонецФункции

Функция ПустаяТаблицаДоходыНеПодлежащиеНалогообложению() Экспорт
	
	ОписаниеТиповЧисло = ОписаниеТиповЧисло();
	
	МассивТиповНачислений = Новый Массив;
	МассивТиповНачислений.Добавить(Тип("ПланВидовРасчетаСсылка.Начисления"));
	МассивТиповНачислений.Добавить(Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам"));
	МассивТиповНачислений.Добавить(Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц"));
	МассивТиповНачислений.Добавить(Тип("СправочникСсылка.ВидыДивидендов"));

	ТаблицаДоходыНеПодлежащиеНалогообложению = Новый ТаблицаЗначений;
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов("Дата"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ДоходНеПодлежащийНалогообложению", Новый ОписаниеТипов("СправочникСсылка.ДоходыНеПодлежащиеНалогообложениюЧастично")); 
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ВидНалогаВзносаОтчисления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалоговВзносовОтчислений")); 
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("Начисление", Новый ОписаниеТипов(МассивТиповНачислений)); 
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("СуммаДохода", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("НеоблагаемыйДоход", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ФиксРасчет", Новый ОписаниеТипов("Булево"));
	ТаблицаДоходыНеПодлежащиеНалогообложению.Колонки.Добавить("ФиксСтрока", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаДоходыНеПодлежащиеНалогообложению;
	
КонецФункции

Функция ПустаяТаблицаВычетыИПН() Экспорт
	
	ОписаниеТиповЧисло = ОписаниеТиповЧисло();
	
	ТаблицаВычетыИПН = Новый ТаблицаЗначений;
	ТаблицаВычетыИПН.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", ОписаниеТиповЧисло.ТипЧисло7_0);
	ТаблицаВычетыИПН.Колонки.Добавить("ВидВычетаИПН", Новый ОписаниеТипов("СправочникСсылка.ВидыВычетовИПН"));
	ТаблицаВычетыИПН.Колонки.Добавить("РазрешенныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаВычетыИПН.Колонки.Добавить("ПримененныйВычет", ОписаниеТиповЧисло.ТипЧисло15_2);
    // Добавляем колонки, для обновления изменяемых строк документов
    ТаблицаВычетыИПН.Колонки.Добавить("ФиксРасчет", Новый ОписаниеТипов("Булево"));
	ТаблицаВычетыИПН.Колонки.Добавить("ФиксСтрока", Новый ОписаниеТипов("Булево"));
	
	Возврат ТаблицаВычетыИПН;
	
КонецФункции

Функция ПустаяТаблицаКомпонентыЕП() Экспорт
	
	ОписаниеТиповЧисло = ОписаниеТиповЧисло();
	
	ТаблицаКомпонентыЕП = Новый ТаблицаЗначений;
	ТаблицаКомпонентыЕП.Колонки.Добавить("ИдентификаторСтрокиНалогиВзносыОтчисления", ОписаниеТиповЧисло.ТипЧисло7_0);
	ТаблицаКомпонентыЕП.Колонки.Добавить("ОПВ", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаКомпонентыЕП.Колонки.Добавить("ИПН", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаКомпонентыЕП.Колонки.Добавить("ВОСМС", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаКомпонентыЕП.Колонки.Добавить("СО", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаКомпонентыЕП.Колонки.Добавить("ООСМС", ОписаниеТиповЧисло.ТипЧисло15_2);
	ТаблицаКомпонентыЕП.Колонки.Добавить("ОПВР", ОписаниеТиповЧисло.ТипЧисло15_2);
	
	Возврат ТаблицаКомпонентыЕП;
	
КонецФункции

Функция СведенияОНалогахВзносахОтчислениях(Форма, ВидНалогаВзносаОтчисления, ФизическоеЛицо = Неопределено, ПутьКДаннымАдресРаспределенияРезультатовВХранилище = Неопределено, ТаблицаНачислений= Неопределено) Экспорт
	
	ДанныеОНалогеВзносеОтчислении = Новый Структура;
	
	СтруктураОтбора = Новый Структура("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	КоллекцияСтрокОПВ = Форма.Объект.НалогиВзносыОтчисления.Выгрузить(СтруктураОтбора);
	
	ДанныеОНалогеВзносеОтчислении.Вставить("НалогиВзносыОтчисления", КоллекцияСтрокОПВ);
	
	Если ПутьКДаннымАдресРаспределенияРезультатовВХранилище <> Неопределено Тогда
		ДанныеОНалогеВзносеОтчислении.Вставить("АдресРаспределенияРезультатовВХранилище", Форма[ПутьКДаннымАдресРаспределенияРезультатовВХранилище]);
	КонецЕсли; 
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеОНалогеВзносеОтчислении, Форма.УникальныйИдентификатор);
	
КонецФункции

Функция ВычетыИПН(Форма, ПутьКДаннымАдресРаспределенияРезультатовВХранилище = Неопределено, ТаблицаНачислений= Неопределено) Экспорт
	
	ВычетыИПН = Новый Структура;
	
	ТаблицаВычетыИПН = Форма.Объект.ВычетыИПН.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаВычетыИПН", ТаблицаВычетыИПН);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления,
	|	ТаблицаВычетыИПН.ВидВычетаИПН,
	|	ТаблицаВычетыИПН.РазрешенныйВычет,
	|	ТаблицаВычетыИПН.ПримененныйВычет,
	|	ТаблицаВычетыИПН.ФиксСтрока,
	|	ТаблицаВычетыИПН.ФиксРасчет
	|ПОМЕСТИТЬ ВТ_ТаблицаВычетыИПН
	|ИЗ
	|	&ТаблицаВычетыИПН КАК ТаблицаВычетыИПН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления,
	|	ВычетыИПН.ВидВычетаИПН,
	|	ВычетыИПН.РазрешенныйВычет,
	|	ВычетыИПН.ПримененныйВычет,
	|	ВычетыИПН.ФиксСтрока,
	|	ВычетыИПН.ФиксРасчет
	|ИЗ
	|	ВТ_ТаблицаВычетыИПН КАК ВычетыИПН";
	
	ВычетыИПН.Вставить("ВычетыИПН",Запрос.Выполнить().Выгрузить());
	
	
	Возврат ПоместитьВоВременноеХранилище(ВычетыИПН, Форма.УникальныйИдентификатор);
	
КонецФункции

Функция КомпонентыЕП(Форма, ПутьКДаннымАдресРаспределенияРезультатовВХранилище = Неопределено, ТаблицаНачислений = Неопределено) Экспорт
	
	КомпонентыЕП = Новый Структура;
	
	ТаблицаКомпонентыЕП = Форма.Объект.КомпонентыЕП.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКомпонентыЕП", ТаблицаКомпонентыЕП);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаКомпонентыЕП.ИдентификаторСтрокиНалогиВзносыОтчисления,
	|	ТаблицаКомпонентыЕП.ОПВ,
	|	ТаблицаКомпонентыЕП.ИПН,
	|	ТаблицаКомпонентыЕП.ВОСМС,
	|	ТаблицаКомпонентыЕП.СО,
	|	ТаблицаКомпонентыЕП.ООСМС,
	|	ТаблицаКомпонентыЕП.ОПВР,
	|	ТаблицаКомпонентыЕП.ФиксСтрока,
	|	ТаблицаКомпонентыЕП.ФиксРасчет
	|ПОМЕСТИТЬ ВТ_ТаблицаКомпонентыЕП
	|ИЗ
	|	&ТаблицаКомпонентыЕП КАК ТаблицаКомпонентыЕП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомпонентыЕП.ИдентификаторСтрокиНалогиВзносыОтчисления,
	|	КомпонентыЕП.ОПВ,
	|	КомпонентыЕП.ИПН,
	|	КомпонентыЕП.ВОСМС,
	|	КомпонентыЕП.СО,
	|	КомпонентыЕП.ООСМС,
	|	КомпонентыЕП.ОПВР,
	|	КомпонентыЕП.ФиксСтрока,
	|	КомпонентыЕП.ФиксРасчет
	|ИЗ
	|	ВТ_ТаблицаКомпонентыЕП КАК КомпонентыЕП";
	
	КомпонентыЕП.Вставить("КомпонентыЕП",Запрос.Выполнить().Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(КомпонентыЕП, Форма.УникальныйИдентификатор);
	
КонецФункции

Функция ДоходыНеПодлежащиеНалогообложению(Форма, ВидНалогаВзносаОтчисления = Неопределено) Экспорт
	
	ДоходыНеПодлежащиеНалогообложению = Новый Структура;
	
	ТаблицаВычетыДоходыНеПодлежащиеНалогообложению = Форма.Объект.ДоходыНеПодлежащиеНалогообложению.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДоходыНеПодлежащиеНалогообложению", ТаблицаВычетыДоходыНеПодлежащиеНалогообложению);
	Если ВидНалогаВзносаОтчисления = Неопределено Тогда
		БезОтбораПоВиду = Истина;
		Запрос.УстановитьПараметр("БезОтбораПоВиду", БезОтбораПоВиду);
	Иначе
		БезОтбораПоВиду = Ложь;
		Запрос.УстановитьПараметр("БезОтбораПоВиду", БезОтбораПоВиду);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.Подразделение,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ДоходНеПодлежащийНалогообложению,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.Начисление,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.СуммаДохода,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ФиксСтрока,
	|	ТаблицаДоходыНеПодлежащиеНалогообложению.ФиксРасчет
	|ПОМЕСТИТЬ ВТ_ТаблицаДоходыНеПодлежащиеНалогообложению
	|ИЗ
	|	&ТаблицаДоходыНеПодлежащиеНалогообложению КАК ТаблицаДоходыНеПодлежащиеНалогообложению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыНеПодлежащиеНалогообложению.Подразделение,
	|	ДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо,
	|	ДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода,
	|	ДоходыНеПодлежащиеНалогообложению.ДоходНеПодлежащийНалогообложению,
	|	ДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления,
	|	ДоходыНеПодлежащиеНалогообложению.Начисление,
	|	ДоходыНеПодлежащиеНалогообложению.СуммаДохода,
	|	ДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход,
	|	ДоходыНеПодлежащиеНалогообложению.ФиксСтрока,
	|	ДоходыНеПодлежащиеНалогообложению.ФиксРасчет
	|ИЗ
	|	ВТ_ТаблицаДоходыНеПодлежащиеНалогообложению КАК ДоходыНеПодлежащиеНалогообложению
	|ГДЕ 
	|	ДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
	|	ИЛИ &БезОтбораПоВиду";
	
	ДоходыНеПодлежащиеНалогообложению.Вставить("ДоходыНеПодлежащиеНалогообложению", Запрос.Выполнить().Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(ДоходыНеПодлежащиеНалогообложению, Форма.УникальныйИдентификатор);
	
КонецФункции

Процедура УдалитьДанныеПоНалогамВзносамОтчислениямФизическоголица(Объект, ФизическоеЛицо) Экспорт
	
	СтрокиНалогиВзносыОтчисления = Объект.НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Для Каждого СтрокаНалогиВзносыОтчисления Из СтрокиНалогиВзносыОтчисления Цикл
		
		СтрокиВычетовИПН = Объект.ВычетыИПН.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаНалогиВзносыОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления));
			
		Для Каждого СтрокаВычетов Из СтрокиВычетовИПН Цикл
			Объект.ВычетыИПН.Удалить(СтрокаВычетов);
		КонецЦикла;
		
		Объект.НалогиВзносыОтчисления.Удалить(СтрокаНалогиВзносыОтчисления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДанныеПоНалогамВзносамОтчислениямПоИдентификатору(Объект, ИдентификаторСтрокиНалогиВзносыОтчисления) Экспорт
	
	СтрокиВычетовИПН = Объект.ВычетыИПН.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторСтрокиНалогиВзносыОтчисления));
		
	Для Каждого СтрокаВычетов Из СтрокиВычетовИПН Цикл
		Объект.ВычетыИПН.Удалить(СтрокаВычетов);
	КонецЦикла;
	
КонецПроцедуры

Процедура НалогиВзносыОтчисленияДанныеВМенеджераРасчета(ТаблицаНалогиВзносыОтчисления, ТаблицаВычетыИПН, ТаблицаДоходыНеПодлежащиеНалогообложению, МенеджерРасчета, Отбор = Неопределено, ПозицииВставки = Неопределено, ДанныеРезультатовРаспределения = Неопределено) Экспорт
	
	НалогиВзносыОтчисления = МенеджерРасчета.Зарплата.НалогиВзносыОтчисления;
	СтрокиРасчетаНалогиВзносыОтчисления = Новый Массив;
	СтрокиРасчетаВычетыИПН = Новый Массив;
	СтрокиРасчетаДоходыНеПодлежащиеНалогообложению = Новый Массив;
	ИдентификаторыСтрокФизическихЛицНВО = Новый Соответствие;
	ИдентификаторыСтрокФизическихЛицДНП = Новый Соответствие;
	
	Для Каждого СтрокаФормы Из ТаблицаНалогиВзносыОтчисления Цикл
		
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РасчетЗарплатыРасширенныйКлиентСервер.ДобавитьИдентификаторСтрокиСотрудника(ИдентификаторыСтрокФизическихЛицНВО, СтрокаФормы.ФизическоеЛицо, СтрокаФормы.ПолучитьИдентификатор());
			СтрокиРасчетаНалогиВзносыОтчисления.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаФормы.ИдентификаторСтрокиНалогиВзносыОтчисления);
		СтрокиВычетыИПН = ТаблицаВычетыИПН.НайтиСтроки(СтруктураПоиска);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиРасчетаВычетыИПН, СтрокиВычетыИПН);
		ЗаполнитьЗначенияСвойств(МенеджерРасчета.Зарплата.НалогиВзносыОтчисления.Добавить(), СтрокаФормы);
		Для Каждого СтрокаВычетов Из СтрокиВычетыИПН Цикл
			ЗаполнитьЗначенияСвойств(МенеджерРасчета.Зарплата.ВычетыИПН.Добавить(), СтрокаВычетов);
		КонецЦикла;
		
	КонецЦикла;
		
	Если ПозицииВставки <> Неопределено Тогда	
		ПозицииВставки.Вставить("НалогиВзносыОтчисления", ИдентификаторыСтрокФизическихЛицНВО);
	КонецЕсли;
	
	Для Каждого СтрокаФормы Из ТаблицаДоходыНеПодлежащиеНалогообложению Цикл
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РасчетЗарплатыРасширенныйКлиентСервер.ДобавитьИдентификаторСтрокиСотрудника(ИдентификаторыСтрокФизическихЛицДНП, СтрокаФормы.ФизическоеЛицо, СтрокаФормы.ПолучитьИдентификатор());
			СтрокиРасчетаДоходыНеПодлежащиеНалогообложению.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МенеджерРасчета.Зарплата.ДоходыНеПодлежащиеНалогообложению.Добавить(), СтрокаФормы);
	КонецЦикла;
	
	Если ПозицииВставки <> Неопределено Тогда	
		ПозицииВставки.Вставить("ДоходыНеПодлежащиеНалогообложению", ИдентификаторыСтрокФизическихЛицДНП);
	КонецЕсли;
	
	УдалитьСтрокиРасчета(ТаблицаНалогиВзносыОтчисления, СтрокиРасчетаНалогиВзносыОтчисления, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаВычетыИПН, СтрокиРасчетаВычетыИПН, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаДоходыНеПодлежащиеНалогообложению, СтрокиРасчетаДоходыНеПодлежащиеНалогообложению, Отбор = Неопределено);
	
КонецПроцедуры

Функция ОписаниеКолонокТаблицыНВО(ТаблицаИсточник) Экспорт
	Если ТипЗнч(ТаблицаИсточник) = Тип("ТаблицаЗначений") Тогда
		 Колонки = ТаблицаИсточник.Колонки
	Иначе
		 Колонки = ТаблицаИсточник.Выгрузить().Колонки
	КонецЕсли;
	КолонкиПоиска = "";
	КолонкиСвязиТаблиц = "";
	КолонкиСуммирования = "";
	Для каждого ОписаниеКолонки Из Колонки Цикл
		ТипыКолонки = ОписаниеКолонки.ТипЗначения;
		Если ОписаниеКолонки.Имя = "НомерСтроки" Или ОписаниеКолонки.Имя = "ФизическоеЛицо" Или ОписаниеКолонки.Имя = "МесяцНалоговогоПериода" Или ОписаниеКолонки.Имя = "ВидНалогаВзносаОтчисления" Или ОписаниеКолонки.Имя = "ДоходНеПодлежащийНалогообложению" Или ОписаниеКолонки.Имя = "ФиксСтрока" Или ОписаниеКолонки.Имя = "ФиксРасчет" Тогда
			КолонкиСвязиТаблиц = КолонкиСвязиТаблиц + ?(Не ЗначениеЗаполнено(КолонкиСвязиТаблиц),"",",") + ОписаниеКолонки.Имя;
		ИначеЕсли СтрНачинаетсяС(НРег(ОписаниеКолонки.Имя),"удалить") Тогда
		ИначеЕсли ТипыКолонки.СодержитТип(Тип("Число")) Тогда
			КолонкиСуммирования = КолонкиСуммирования + ?(Не ЗначениеЗаполнено(КолонкиСуммирования),"",",") + ОписаниеКолонки.Имя;
		Иначе
			КолонкиПоиска = КолонкиПоиска + ?(Не ЗначениеЗаполнено(КолонкиПоиска),"",",") + ОписаниеКолонки.Имя;
			КолонкиСвязиТаблиц = КолонкиСвязиТаблиц + ?(Не ЗначениеЗаполнено(КолонкиСвязиТаблиц),"",",") + ОписаниеКолонки.Имя;
		КонецЕсли;
	КонецЦикла; 
	Возврат Новый Структура("КолонкиПоиска,КолонкиСуммирования,КолонкиСвязиТаблиц",КолонкиПоиска,КолонкиСуммирования,КолонкиСвязиТаблиц)
КонецФункции

Функция ОписаниеКолонокТаблицыДНПН(ТаблицаИсточник) Экспорт
	Если ТипЗнч(ТаблицаИсточник) = Тип("ТаблицаЗначений") Тогда
		 Колонки = ТаблицаИсточник.Колонки
	Иначе
		 Колонки = ТаблицаИсточник.Выгрузить().Колонки
	КонецЕсли;
	КолонкиПоиска = "";
	КолонкиСвязиТаблиц = "";
	КолонкиСуммирования = "";
	Для каждого ОписаниеКолонки Из Колонки Цикл
		ТипыКолонки = ОписаниеКолонки.ТипЗначения;
		Если ОписаниеКолонки.Имя = "ИдентификаторСтрокиНалогиВзносыОтчисления" Или ОписаниеКолонки.Имя = "ФиксСтрока" Или ОписаниеКолонки.Имя = "ФиксРасчет" Тогда
			КолонкиСвязиТаблиц = КолонкиСвязиТаблиц + ?(Не ЗначениеЗаполнено(КолонкиСвязиТаблиц),"",",") + ОписаниеКолонки.Имя;
		ИначеЕсли СтрНачинаетсяС(НРег(ОписаниеКолонки.Имя),"удалить") Тогда
		ИначеЕсли ТипыКолонки.СодержитТип(Тип("Число")) Тогда
			КолонкиСуммирования = КолонкиСуммирования + ?(Не ЗначениеЗаполнено(КолонкиСуммирования),"",",") + ОписаниеКолонки.Имя;
		Иначе
			КолонкиПоиска = КолонкиПоиска + ?(Не ЗначениеЗаполнено(КолонкиПоиска),"",",") + ОписаниеКолонки.Имя;
			КолонкиСвязиТаблиц = КолонкиСвязиТаблиц + ?(Не ЗначениеЗаполнено(КолонкиСвязиТаблиц),"",",") + ОписаниеКолонки.Имя;
		КонецЕсли;
	КонецЦикла; 
	Возврат Новый Структура("КолонкиПоиска,КолонкиСуммирования,КолонкиСвязиТаблиц",КолонкиПоиска,КолонкиСуммирования,КолонкиСвязиТаблиц)
КонецФункции

Функция ЕстьДанныеВСтроке(СтрокаКоллекции, ИменаРесурсов)
	Для каждого ИмяРесурса Из ИменаРесурсов Цикл
		Если ЗначениеЗаполнено(СтрокаКоллекции[ИмяРесурса]) Тогда
			Возврат Истина	
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь	
КонецФункции

Функция ТаблицаНВО(ТаблицаИсточник, ОписаниеКолонок) Экспорт
	
	Если ТаблицаИсточник.Количество() = 1 Тогда
		Возврат ТаблицаИсточник.Скопировать()
	КонецЕсли;
	
	ТаблицаРезультат = ТаблицаИсточник.СкопироватьКолонки();
	СтруктураПоиска = Новый Структура(ОписаниеКолонок.КолонкиСвязиТаблиц);
	КопияТаблицы = ТаблицаИсточник.Скопировать();
	КопияТаблицы.Свернуть(ОписаниеКолонок.КолонкиСвязиТаблиц, ОписаниеКолонок.КолонкиСуммирования);
	ИменаКолонокСуммирования = СтрРазделить(ОписаниеКолонок.КолонкиСуммирования, ",", Ложь);
	Для каждого СтрокаТЗ Из КопияТаблицы Цикл
		Если ЕстьДанныеВСтроке(СтрокаТЗ, ИменаКолонокСуммирования) Тогда
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЗ);
			СтрокиДанных = ТаблицаИсточник.НайтиСтроки(СтруктураПоиска);
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультат
	
КонецФункции

Процедура РасчетЗарплатыНалогиВзносыОтчисленияВДанныеФормы(ДанныеДляЗаполнения, Объект, ПозицииВставки = Неопределено) Экспорт
	
	ИспользуютсяКомпонентыЕП = (НЕ ДанныеДляЗаполнения.КомпонентыЕП = Неопределено);

    // НалогиВзносыОтчисления, ВычетыИПН
	МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(Объект.НалогиВзносыОтчисления) + 1;
    ТаблицаНВО = Объект.НалогиВзносыОтчисления;
    ТаблицаИсточникНВО = ДанныеДляЗаполнения.НалогиВзносыОтчисления;
	
	ОписаниеКолонок = ОписаниеКолонокТаблицыНВО(ТаблицаИсточникНВО);

	ИсточникСИндексами = ТаблицаИсточникНВО.Скопировать();
	ИсточникСИндексами.Индексы.Добавить(ОписаниеКолонок.КолонкиСвязиТаблиц);
	ИсточникСИндексами.Индексы.Добавить(ОписаниеКолонок.КолонкиПоиска);
	НВО = ТаблицаНВО(ИсточникСИндексами, ОписаниеКолонок);
	ПозицииФизическихЛицНВО = Неопределено;
	ПозицииДоходыНеПодлежащиеНалогообложению = Неопределено;
	ПозицииВычетовИПН = Неопределено;
	ПозицииКомпонентовЕП = Неопределено;
	СоответствиеОбходовФизическихЛиц = Неопределено;	
	
	Если ПозицииВставки <> Неопределено Тогда
		Если Не ПозицииВставки.Свойство("НалогиВзносыОтчисления", ПозицииФизическихЛицНВО) Тогда
			ПозицииФизическихЛицНВО = Новый Соответствие;
			ПозицииВставки.Вставить("НалогиВзносыОтчисления", ПозицииФизическихЛицНВО);
		КонецЕсли;
		Если Не ПозицииВставки.Свойство("ДоходыНеПодлежащиеНалогообложению", ПозицииДоходыНеПодлежащиеНалогообложению) Тогда
    		ПозицииДоходыНеПодлежащиеНалогообложению = Новый Соответствие;
    		ПозицииВставки.Вставить("ДоходыНеПодлежащиеНалогообложению", ПозицииДоходыНеПодлежащиеНалогообложению);
        КонецЕсли;
		Если Не ПозицииВставки.Свойство("ВычетыИПН", ПозицииВычетовИПН) Тогда
			ПозицииВычетовИПН = Новый Соответствие;
			ПозицииВставки.Вставить("ВычетыИПН", ПозицииВычетовИПН);
		КонецЕсли;
		Если Не ПозицииВставки.Свойство("КомпонентыЕП", ПозицииКомпонентовЕП) Тогда
			ПозицииКомпонентовЕП = Новый Соответствие;
			ПозицииВставки.Вставить("КомпонентыЕП", ПозицииКомпонентовЕП);
		КонецЕсли;
		СоответствиеОбходовФизическихЛиц = Новый Соответствие;
	КонецЕсли;

	Для Каждого СтрокаИсточник Из НВО Цикл
		
		ИдентификаторПоискаВычетов = СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления;

		СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
		ОбходТаблицыИдентификаторов = РасчетЗарплатыРасширенныйФормы.ОбходТаблицыИдентификаторов(СоответствиеОбходовФизическихЛиц, ПозицииФизическихЛицНВО, СтрокаИсточник.ФизическоеЛицо);
		СтрокаНВО = РасчетЗарплатыРасширенныйКлиентСервер.СтрокаТаблицыПоНачальнойПозиции(ТаблицаНВО, ОбходТаблицыИдентификаторов);

		Если СтрокаИсточник.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН
			ИЛИ СтрокаИсточник.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда

			ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторПоискаВычетов);
			МассивСтрокВычетыИПН = ДанныеДляЗаполнения.ВычетыИПН.НайтиСтроки(ПараметрыОтбора);
			
			Если ИспользуютсяКомпонентыЕП Тогда
				ПараметрыОтбора = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторПоискаВычетов);
				МассивСтрокКомпонентыЕП = ДанныеДляЗаполнения.КомпонентыЕП.НайтиСтроки(ПараметрыОтбора);
			КонецЕсли;
			
			СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления;
			
			СтрокаНалогиВзносыОтчисленияВДанныеФормы(СтрокаНВО, СтрокаИсточник, МассивСтрокВычетыИПН, Объект,, ПозицииВычетовИПН);
			
			Если ИспользуютсяКомпонентыЕП Тогда
				СтрокаНалогиВзносыОтчисленияВДанныеФормы(СтрокаНВО, СтрокаИсточник, МассивСтрокКомпонентыЕП, Объект, "КомпонентыЕП", ПозицииКомпонентовЕП);
			КонецЕсли;
			
		Иначе
			
			ЗаполнитьЗначенияСвойств(СтрокаНВО, СтрокаИсточник);
			
		КонецЕсли;
		
		МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления + 1;

	КонецЦикла;
	
	РасчетЗарплатыРасширенныйФормы.УдалитьНеактуальныеСтрокиФормы(ТаблицаНВО, СоответствиеОбходовФизическихЛиц, ПозицииФизическихЛицНВО);


	// ДоходыНеПодлежащиеНалогообложению
    ТаблицаДНПН = Объект.ДоходыНеПодлежащиеНалогообложению;
    ТаблицаИсточникДНПН = ДанныеДляЗаполнения.ДоходыНеПодлежащиеНалогообложению;

	ОписаниеКолонок = ОписаниеКолонокТаблицыДНПН(ТаблицаИсточникДНПН);
	ИсточникСИндексами = ТаблицаИсточникДНПН.Скопировать();
	ИсточникСИндексами.Индексы.Добавить(ОписаниеКолонок.КолонкиСвязиТаблиц);
	ИсточникСИндексами.Индексы.Добавить(ОписаниеКолонок.КолонкиПоиска);
	ДНПН = ТаблицаНВО(ИсточникСИндексами, ОписаниеКолонок);
	
	Если СоответствиеОбходовФизическихЛиц <> Неопределено Тогда
        СоответствиеОбходовФизическихЛиц = Новый Соответствие;	    
    КонецЕсли;	

	Для Каждого СтрокаИсточник Из ДНПН Цикл
		
		ОбходТаблицыИдентификаторов = РасчетЗарплатыРасширенныйФормы.ОбходТаблицыИдентификаторов(СоответствиеОбходовФизическихЛиц, ПозицииДоходыНеПодлежащиеНалогообложению, СтрокаИсточник.ФизическоеЛицо);
		СтрокаДНПН = РасчетЗарплатыРасширенныйКлиентСервер.СтрокаТаблицыПоНачальнойПозиции(ТаблицаДНПН, ОбходТаблицыИдентификаторов);

		ЗаполнитьЗначенияСвойств(СтрокаДНПН, СтрокаИсточник);

	КонецЦикла;
	
	РасчетЗарплатыРасширенныйФормы.УдалитьНеактуальныеСтрокиФормы(ТаблицаДНПН, СоответствиеОбходовФизическихЛиц, ПозицииДоходыНеПодлежащиеНалогообложению);
	
КонецПроцедуры

Процедура НалогиВзносыОтчисленияВДанныеМенеджераРасчета(ТаблицаНалогиВзносыОтчисления, ТаблицаВычетыИПН, ТаблицаДоходыНеПодлежащиеНалогообложению, МенеджерРасчета, Отбор = Неопределено, ПозицииВставки = Неопределено, ТаблицаКомпонентыЕП = Неопределено) Экспорт
	
	НалогиВзносыОтчисления = МенеджерРасчета.Зарплата.НалогиВзносыОтчисления;
	ДоходыНеПодлежащиеНалогообложению = МенеджерРасчета.Зарплата.ДоходыНеПодлежащиеНалогообложению;
	
	СтрокиРасчетаНалогиВзносыОтчисления = Новый Массив;
	СтрокиРасчетаВычетыИПН = Новый Массив;
	СтрокиРасчетаКомпонентыЕП = Новый Массив;
	ПозицииСотрудников = Новый Соответствие;
	ИдентификаторыСтрокФизическихЛиц = Новый Соответствие;
	
	Для Каждого СтрокаФормы Из ТаблицаНалогиВзносыОтчисления Цикл
		
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РасчетЗарплатыРасширенныйКлиентСервер.ДобавитьИдентификаторСтрокиСотрудника(ИдентификаторыСтрокФизическихЛиц, СтрокаФормы.ФизическоеЛицо, СтрокаФормы.ПолучитьИдентификатор());
			СтрокиРасчетаНалогиВзносыОтчисления.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", СтрокаФормы.ИдентификаторСтрокиНалогиВзносыОтчисления);
		СтрокиПримененныеВычеты = ТаблицаВычетыИПН.НайтиСтроки(СтруктураПоиска);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиРасчетаВычетыИПН, СтрокиПримененныеВычеты);
		Если НЕ ТаблицаКомпонентыЕП = Неопределено Тогда
			СтрокиКомпоненты = ТаблицаКомпонентыЕП.НайтиСтроки(СтруктураПоиска);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиРасчетаКомпонентыЕП, СтрокиКомпоненты);
		КонецЕсли;
		СтрокаНалогиВзносыОтчисленияВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаФормы, СтрокиПримененныеВычеты);
		
	КонецЦикла;
	
	ИдентификаторыСтрокФизическихЛиц.Очистить();
	
	Если ПозицииВставки <> Неопределено Тогда
		ПозицииВставки.Вставить("НалогиВзносыОтчисления", ПозицииСотрудников);
	КонецЕсли;
	
	СтрокиРасчетаДоходыНеПодлежащиеНалогообложению = Новый Массив;
	ПозицииСотрудников = Новый Соответствие;
	
	Для Каждого СтрокаФормы Из ТаблицаДоходыНеПодлежащиеНалогообложению Цикл
		
		Если Отбор <> Неопределено Тогда
			ФизическоеЛицо = Отбор.ФизическиеЛицаОтбор[СтрокаФормы.ФизическоеЛицо];
			Если ФизическоеЛицо = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РасчетЗарплатыРасширенныйКлиентСервер.ДобавитьИдентификаторСтрокиСотрудника(ИдентификаторыСтрокФизическихЛиц, СтрокаФормы.ФизическоеЛицо, СтрокаФормы.ПолучитьИдентификатор());
			СтрокиРасчетаДоходыНеПодлежащиеНалогообложению.Добавить(СтрокаФормы);
			
		КонецЕсли;
		
		СтрокаДоходыНеПодлежащиеНалогообложениюВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаФормы);
		
	КонецЦикла;
	
	Если ПозицииВставки <> Неопределено Тогда
		ПозицииВставки.Вставить("ДоходыНеПодлежащиеНалогообложению", ПозицииСотрудников);
	КонецЕсли;
	
	УдалитьСтрокиРасчета(ТаблицаНалогиВзносыОтчисления, СтрокиРасчетаНалогиВзносыОтчисления, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаДоходыНеПодлежащиеНалогообложению, СтрокиРасчетаДоходыНеПодлежащиеНалогообложению, Отбор = Неопределено);
	УдалитьСтрокиРасчета(ТаблицаВычетыИПН, СтрокиРасчетаВычетыИПН, Отбор = Неопределено);
	Если НЕ ТаблицаКомпонентыЕП = Неопределено Тогда
		УдалитьСтрокиРасчета(ТаблицаКомпонентыЕП, СтрокиРасчетаКомпонентыЕП, Отбор = Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура СтрокаНалогиВзносыОтчисленияВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаИсточник, СтрокиПримененныеВычеты) Экспорт
	
	СтрокаПриемник = МенеджерРасчета.Зарплата.НалогиВзносыОтчисления.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
   	Для Каждого СтрокаВычета Из СтрокиПримененныеВычеты Цикл
        СтрокаПриемник = МенеджерРасчета.Зарплата.ВычетыИПН.Добавить();
        ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаВычета); 
	КонецЦикла;
	
КонецПроцедуры

Процедура СтрокаДоходыНеПодлежащиеНалогообложениюВДанныеМенеджераРасчета(МенеджерРасчета, СтрокаИсточник) Экспорт
	
	СтрокаПриемник = МенеджерРасчета.Зарплата.ДоходыНеПодлежащиеНалогообложению.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
	
КонецПроцедуры

Процедура СтрокаНалогиВзносыОтчисленияВДанныеФормы(СтрокаНалогиВзносыОтчисления, СтрокаИсточник, МассивСтрок, Объект, ИмяТаблицы = "ВычетыИПН", ПозицииДанных = Неопределено)
	
	ЗаполнитьЗначенияСвойств(СтрокаНалогиВзносыОтчисления, СтрокаИсточник);
	
	Для Каждого СтрокаИсточникМассив Из МассивСтрок Цикл
		СтрокаДанных = Объект[ИмяТаблицы].Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаИсточникМассив);
		СтрокаДанных.ИдентификаторСтрокиНалогиВзносыОтчисления = СтрокаИсточник.ИдентификаторСтрокиНалогиВзносыОтчисления;
		Если ПозицииДанных <> Неопределено Тогда
			РасчетЗарплатыРасширенныйКлиентСервер.ДобавитьИдентификаторСтрокиСотрудника(
				ПозицииДанных, СтрокаИсточник.ФизическоеЛицо, СтрокаДанных.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСтрокиРасчета(Таблица, СтрокиРасчета, ПолноеУдаление = Ложь)
	
	Если ПолноеУдаление Тогда
		Таблица.Очистить();
	Иначе
		Для Каждого СтрокаУдаления Из СтрокиРасчета Цикл
			Таблица.Удалить(СтрокаУдаления);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеВычеты(Форма, ИмяМесяцНачисления = "МесяцНачисления", ДобавлятьРеквизитыФормы = Истина) Экспорт
	
	ДатаКонтроля = '2018-01-01';
	ДатаПримененияКорректировкиДохода = '2019-01-01';
	ДатаПрекращенияКорректировкиДохода = '2026-01-01';
	ДатаПрогрессивнойШкалыИПН2026 = '2026-01-01';
	
	Объект = Форма.Объект;
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаКонтроля;
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияРазрешенныйВычет");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПримененныйВычет");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПрочиеВычеты");
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ГруппаОтбораИли = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ГруппаОтбораИ = ГруппаОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаКонтроля;

	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаПримененияКорректировкиДохода;

	ЭлементОтбора = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаПрекращенияКорректировкиДохода;

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПримененнаяЛьгота");

	//
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаКонтроля;
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПредставлениеПримененныеВычеты");
	
	//
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления");
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ИПН");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПредставлениеПримененныеВычеты");

	// НалогиВзносыОтчисленияНалогВзносСПревышения
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ГруппаОтбораИли = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ЭлементОтбора = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяМесяцНачисления);
	ЭлементОтбора.ПравоеЗначение = ДатаПрогрессивнойШкалыИПН2026;

	ЭлементОтбора = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НалогиВзносыОтчисления.ВидНалогаВзносаОтчисления");
	ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ИПН");

	ЭлементОтбора = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НалогиВзносыОтчисления.НалогВзносСПревышения");
	ЭлементОтбора.ПравоеЗначение = 0;

	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияНалогВзносСПревышения");
	// НалогиВзносыОтчисленияНалогВзносСПревышения

	// ЕП
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОрганизацияПорядокОбложенияДоходовРаботников");
	ЭлементОтбора.ПравоеЗначение = Перечисления.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж;
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияРазрешенныйВычет");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПримененныйВычет");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПрочиеВычеты");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПредставлениеПримененныеВычеты");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПредставлениеРазрешенныеВычеты");
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить(); 
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НалогиВзносыОтчисленияПримененнаяЛьгота");
	
КонецПроцедуры

// Формирует сторно записи отменяющие движения исправленного документа по регистрам подсистемы.
//
// Параметры:
//  Движения				 - КоллекцияДвижений, Структура	 - Коллекция движений в которую будут добавлены сторно записи.
//  ИсправленныйДокумент	 - ДокументСсылка				 - Документ, записи которого необходимо сторнировать.
//  ПараметрыИсправления	 - Структура					 - Свойства см. в описании функции СторнироватьПоУчетам модулей менеджеров документов.
//  ИсключаемыйРегистратор	 - ДокументСсылка				 - Документ, движения которого не следует учитывать при расчете движений.
//  Записывать				 - Булево						 - Если Истина, то наборы будут записаны сразу, если Ложь, то наборам будет установлен признак Записывать = Истина.
//
Процедура СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент, ПараметрыИсправления = Неопределено, ИсключаемыйРегистратор = Неопределено, Записывать = Ложь) Экспорт
	
	ИмяУчета = "УчетНалоговВзносовОтчисленийРасширенный";
	МетаданныеРегистров = МетаданныеРегистровПодсистемы();
	
	ДвиженияВСтруктуре = ТипЗнч(Движения) = Тип("Структура");
	Набор = Неопределено;
	
	Для Каждого МетаданныеРегистра Из МетаданныеРегистров Цикл
		
		ИмяРегистра = МетаданныеРегистра.Имя;
		
		Если ДвиженияВСтруктуре Тогда
			Движения.Свойство(ИмяРегистра, Набор);
		Иначе
			Набор = Движения.Найти(ИмяРегистра);
		КонецЕсли;
		
		Если Набор = Неопределено Или Не ИсправлениеДокументовЗарплатаКадры.ИзолироватьУчетом(Набор, ИмяУчета) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоРегистрНакопления(МетаданныеРегистра) Тогда
			ИсправлениеДокументовЗарплатаКадры.СторнироватьДвиженияВРегистреНакопления(Набор, ИсправленныйДокумент, МетаданныеРегистра, Записывать);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьУдержанныеНалогиВзносы(Документ, Отказ) Экспорт
	
	Если Документ.Метаданные().ТабличныеЧасти.Найти("НалогиВзносы") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НалогиВзносы.ФизическоеЛицо,
	|	НалогиВзносы.МесяцНалоговогоПериода,
	|	НалогиВзносы.РегистрацияВНалоговомОргане,
	|	НалогиВзносы.ВидНалогаВзносаОтчисления,
	|	НалогиВзносы.ВидДохода,
	|	НалогиВзносы.НалогВзнос
	|ПОМЕСТИТЬ ВТ_ДокументНалогиВзносы
	|ИЗ
	|	#Документ КАК НалогиВзносы
	|ГДЕ
	|	НалогиВзносы.Ссылка = &Ссылка";
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#Документ", Документ.Метаданные().ПолноеИмя() + ".НалогиВзносы");
	Запрос.Выполнить();
	
	УчетНалоговВзносовОтчислений.СформироватьУдержаниеНалогиВзносыПоВременнойТаблице(Документ.Движения, Отказ, Документ.Организация, Документ.ПериодРегистрации, МенеджерВременныхТаблиц, Истина);
	
КонецПроцедуры

Процедура УстановитьПараметрыВыбораСотрудниковВДокументахПредоставленияВычетов(Форма, ИмяЭлементаСотрудник) Экспорт
	
	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлементаСотрудник);
	Если ЭлементФормы <> Неопределено Тогда
		
		ОтборУстановлен = Ложь;
		
		ПараметрыВыбора = Новый Массив(ЭлементФормы.ПараметрыВыбора);
		Для каждого ПараметрВыбора Из ПараметрыВыбора Цикл
			
			Если ВРег(ПараметрВыбора.Имя) = ВРег("Отбор.Роль") Тогда
				
				ОтборУстановлен = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ОтборУстановлен Тогда
			
			РолиСотрудника = Новый Массив;
			РолиСотрудника.Добавить(Перечисления.РолиФизическихЛиц.Сотрудник);
			РолиСотрудника.Добавить(Перечисления.РолиФизическихЛиц.БывшийСотрудник);
			РолиСотрудника.Добавить(Перечисления.РолиФизическихЛиц.ПрочийПолучательДоходов);
			
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Роль", Новый ФиксированныйМассив(РолиСотрудника)));
			
			ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНазначениеПлатежаСервер(Контрагент, БанковскийСчетКонтрагента, ВедомостиНаПеречисление, НазначениеПлатежа, КодНазначенияПлатежа, СуммаДокумента = 0, ВидОперации = Неопределено) Экспорт
	
	ОбменСБанкамиПоЗарплатнымПроектамПереопределяемый.ЗаполнитьНазначениеПлатежа(Контрагент, БанковскийСчетКонтрагента, ВедомостиНаПеречисление, НазначениеПлатежа, КодНазначенияПлатежа, СуммаДокумента, ВидОперации);
	
КонецПроцедуры

Процедура ЗаменитьСтрокиНалогиВзносыОтчисления(ОбновляемаяКоллекцияНВО, ОбновляемаяКоллекцияВычетыИПН, ОбновляемаяКоллекцияДНН, ПараметрыДанных, КонтролируемыеПоля, ОписаниеДокумента, ОтборСтрок = Неопределено, СохранятьИсправления = Истина, КлючевыеКолонки = "ФизическоеЛицо", ОбновляемаяКоллекцияКомпонентыЕП = Неопределено) Экспорт
	
	НалогиВзносыОтчисления = ПараметрыДанных.НалогиВзносыОтчисления;
	ВычетыИПН = ПараметрыДанных.ВычетыИПН;
	ДоходыНеПодлежащиеНалогообложению = ПараметрыДанных.ДоходыНеПодлежащиеНалогообложению;
	КомпонентыЕП = Неопределено;
	
	Если НЕ ОписаниеДокумента.КомпонентыЕПИмя = Неопределено Тогда
		КомпонентыЕП = ПараметрыДанных.КомпонентыЕП;	
	КонецЕсли;
	
	Если НЕ ОтборСтрок = Неопределено
		И ОтборСтрок.Свойство("ВидНалогаВзносаОтчисления") Тогда
		
		ВидНалогаВзносаОтчисления = ОтборСтрок.ВидНалогаВзносаОтчисления;
		
	Иначе
		
		ВидНалогаВзносаОтчисления = Неопределено;
		
	КонецЕсли;
	
	МаксимальныйИдентификаторСтрокиНВО = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(ОбновляемаяКоллекцияНВО);
	
	// Заполняем строки идентификатором увеличенным на единицу, относительно максимального.
	УчетНалоговВзносовОтчислений.НазначитьИдентификаторыНовымСтрокамТаблицамНалогиВзносыОтчисленияИВычетыИПН(
		МаксимальныйИдентификаторСтрокиНВО + 1, НалогиВзносыОтчисления, ВычетыИПН, КомпонентыЕП);
			
	УсловияЗаменыСтрок = Неопределено;
	
	// Сохранение идентификаторов заменяемых строк НалогиВзносыОтчисления.
	ИдентификаторыСтрокНВО = Новый Массив;
	
	Если ОтборСтрок = Неопределено Тогда
		ЗаменяемыеСтрокиНВО = ОбновляемаяКоллекцияНВО;
	Иначе
		ЗаменяемыеСтрокиНВО = РасчетЗарплатыРасширенный.НайтиСтрокиОтборПоМассиву(ОбновляемаяКоллекцияНВО, "ФизическоеЛицо", ОтборСтрок.ФизическоеЛицо);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИдентификаторыСтрокНВО, 
		ОбщегоНазначения.ВыгрузитьКолонку(ЗаменяемыеСтрокиНВО, "ИдентификаторСтрокиНалогиВзносыОтчисления"));
		
	// Обновление строк таблицы НалогиВзносыОтчисления.
	Если СохранятьИсправления Тогда
		УсловияЗаменыСтрок = РасчетЗарплатыРасширенный.УсловияЗаменыСтрокКонтролируемымиПолями(КонтролируемыеПоля, ОписаниеДокумента.НалогиВзносыОтчисленияИмя);
	КонецЕсли;
	
	// Таблица ПримененныеВычеты, является расширением строк таблицы НалогиВзносыОтчисления,
	// поэтому замена строк в таблицы ПримененныеВычеты, должна выполняться на тех же условиях, что
	// и замена строк таблицы НалогиВзносыОтчисления.
	
	// Сбор информации об идентификаторах строка НалогиВзносыОтчисления принимающих участие в замене.
	ИдентификаторыСтрокНВОУчаствующихВЗамене = ОбщегоНазначения.ВыгрузитьКолонку(ЗаменяемыеСтрокиНВО, "ИдентификаторСтрокиНалогиВзносыОтчисления");
	
	РасчетЗарплатыРасширенный.ЗаменитьСтрокиНаНовыеДанные(ОбновляемаяКоллекцияНВО, НалогиВзносыОтчисления, КлючевыеКолонки, УсловияЗаменыСтрок, ОтборСтрок);
	
	Если НЕ ОписаниеДокумента.ВычетыИПНИмя = Неопределено
		И ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН Тогда
		
		// Удаление из коллекции ИдентификаторыСтрокНВОУчаствующихВЗамене, идентификаторов
		// строк, не подвергшихся замене, добавление в коллекцию идентификаторов 
		// новых строк НалогиВзносыОтчисления.
		
		Если ОтборСтрок = Неопределено Тогда
			ЗаменяемыеСтрокиНВО = ОбновляемаяКоллекцияНВО;
		Иначе
			ЗаменяемыеСтрокиНВО = РасчетЗарплатыРасширенный.НайтиСтрокиОтборПоМассиву(ОбновляемаяКоллекцияНВО, "ФизическоеЛицо", ОтборСтрок.ФизическоеЛицо);
		КонецЕсли;
		
		ОбновленныеИдентификаторыСтрокНВОУчаствующихВЗамене = ОбщегоНазначения.ВыгрузитьКолонку(ЗаменяемыеСтрокиНВО, "ИдентификаторСтрокиНалогиВзносыОтчисления");
		Для каждого ИдентификаторСтрокиНВО Из ОбновленныеИдентификаторыСтрокНВОУчаствующихВЗамене Цикл
			
			ИндексЭлемента = ИдентификаторыСтрокНВОУчаствующихВЗамене.Найти(ИдентификаторСтрокиНВО);
			Если ИндексЭлемента = Неопределено Тогда
				ИдентификаторыСтрокНВОУчаствующихВЗамене.Добавить(ИдентификаторСтрокиНВО);
			Иначе
				ИдентификаторыСтрокНВОУчаствующихВЗамене.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
			
		// Обновление строк таблицы ПримененныеВычеты.
		РасчетЗарплатыРасширенный.ЗаменитьСтрокиНаНовыеДанные(
			ОбновляемаяКоллекцияВычетыИПН, 
			ВычетыИПН, 
			"ИдентификаторСтрокиНалогиВзносыОтчисления", , 
			Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторыСтрокНВОУчаствующихВЗамене));
			
	КонецЕсли;
	
	Если НЕ ОписаниеДокумента.КомпонентыЕПИмя = Неопределено
		И ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда

		// Удаление из коллекции ИдентификаторыСтрокНВОУчаствующихВЗамене, идентификаторов
		// строк, не подвергшихся замене, добавление в коллекцию идентификаторов 
		// новых строк НалогиВзносыОтчисления.
		
		Если ОтборСтрок = Неопределено Тогда
			ЗаменяемыеСтрокиНВО = ОбновляемаяКоллекцияНВО;
		Иначе
			ЗаменяемыеСтрокиНВО = РасчетЗарплатыРасширенный.НайтиСтрокиОтборПоМассиву(ОбновляемаяКоллекцияНВО, "ФизическоеЛицо", ОтборСтрок.ФизическоеЛицо);
		КонецЕсли;
		
		ОбновленныеИдентификаторыСтрокНВОУчаствующихВЗамене = ОбщегоНазначения.ВыгрузитьКолонку(ЗаменяемыеСтрокиНВО, "ИдентификаторСтрокиНалогиВзносыОтчисления");
		Для каждого ИдентификаторСтрокиНВО Из ОбновленныеИдентификаторыСтрокНВОУчаствующихВЗамене Цикл
			
			ИндексЭлемента = ИдентификаторыСтрокНВОУчаствующихВЗамене.Найти(ИдентификаторСтрокиНВО);
			Если ИндексЭлемента = Неопределено Тогда
				ИдентификаторыСтрокНВОУчаствующихВЗамене.Добавить(ИдентификаторСтрокиНВО);
			Иначе
				ИдентификаторыСтрокНВОУчаствующихВЗамене.Удалить(ИндексЭлемента);
			КонецЕсли;
			
		КонецЦикла;
			
		Если НЕ КомпонентыЕП = Неопределено Тогда	
			// Обновление строк таблицы КомпонентыЕП.
			РасчетЗарплатыРасширенный.ЗаменитьСтрокиНаНовыеДанные(
				ОбновляемаяКоллекцияКомпонентыЕП, 
				КомпонентыЕП, 
				"ИдентификаторСтрокиНалогиВзносыОтчисления", , 
				Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторыСтрокНВОУчаствующихВЗамене));
		КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ ОписаниеДокумента.ДоходыНеПодлежащиеНалогообложениюИмя = Неопределено Тогда
		
		// Удаление из коллекции ИдентификаторыСтрокНВОУчаствующихВЗамене, идентификаторов
		// строк, не подвергшихся замене, добавление в коллекцию идентификаторов 
		// новых строк НалогиВзносыОтчисления.
		
		// Обновление строк таблицы ДоходыНеПодлежащиеНалогообложениюИмя.
		РасчетЗарплатыРасширенный.ЗаменитьСтрокиНаНовыеДанные(
			ОбновляемаяКоллекцияДНН, 
			ДоходыНеПодлежащиеНалогообложению,
            КлючевыеКолонки, ,
            ОтборСтрок);
			
	КонецЕсли;
	
КонецПроцедуры

Функция КонтролируемыеПоляДляФиксацииРезультатов() Экспорт

	НалогиВзносыОтчисленияФиксРасчет = Новый Массив;
	НалогиВзносыОтчисленияФиксРасчет.Добавить("Налог");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ЗачтеноАвансовыхПлатежей");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("НалогКЗачетуВозврату");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичный");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичныйКодВычета");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичныйКЗачетуВозврату");
	НалогиВзносыОтчисленияФиксРасчет.Добавить("ПримененныйВычетЛичныйКЗачетуВозвратуКодВычета");

	НалогиВзносыОтчисленияФиксСтрока = Новый Массив;
	НалогиВзносыОтчисленияФиксСтрока.Добавить("ФизическоеЛицо");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("МесяцНалоговогоПериода");
	НалогиВзносыОтчисленияФиксСтрока.Добавить("Подразделение");
	
	Возврат Новый Структура("ФиксРасчет, ФиксСтрока", НалогиВзносыОтчисленияФиксРасчет, НалогиВзносыОтчисленияФиксСтрока)
	
КонецФункции

Процедура ЗаполнитьТаблицуСтавкиНалоговВзносовОтчисленийДляОценочныхОбязательств(ТаблицаСтавкиНалоговВзносовОтчислений, Организация,ПериодРегистрации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Заполняем ставки
    УчетНалоговВзносовОтчислений.ЗаполнитьТаблицуСтавкиНалоговВзносовОтчисленийДляОценочныхОбязательств(ТаблицаСтавкиНалоговВзносовОтчислений, Организация, ПериодРегистрации);
	
	УстановитьПривилегированныйРежим(Ложь);
			
КонецПроцедуры

Процедура ПроверитьЗаполнениеИсправленногоДокумента(Объект, ПроверяемыеРеквизиты, Отказ, ПолеПериодРегистрации, ПериодРегистрацииИсправленногоДокумента) Экспорт
	
	Если ПериодРегистрацииИсправленногоДокумента <> НеОпределено Тогда
		
		ПорядокОбложенияДоходовРаботников = ЗарплатаКадрыРКПовтИсп.ПорядокОбложенияДоходовРаботников(Объект.Организация, Объект[ПолеПериодРегистрации]);
		
		Если ПорядокОбложенияДоходовРаботников = Перечисления.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж Тогда
		
			// Если допустимо исправление в текущем периоде
			Если НЕ ПериодРегистрацииИсправленногоДокумента = Объект[ПолеПериодРегистрации] Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'При едином платеже не рекомендуется производить исправление в последующих периодах. Если единый платеж за исправляемый период был перечислен, данные корректировок документа-исправления могут отличаться от фактического распределения сумм Госкорпорацией'"),
					Формат(ПериодРегистрацииИсправленногоДокумента, "ДФ='ММММ гггг'"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ПолеПериодРегистрации);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьСтатусРезидентства(МесяцНачисления, СотрудникФизическоеЛицо)
	
	Если ТипЗнч(СотрудникФизическоеЛицо) = Тип("СправочникСсылка.Сотрудники") Тогда
		ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникФизическоеЛицо, "ФизическоеЛицо");	
	Иначе
		ФизическоеЛицо = СотрудникФизическоеЛицо;	
	КонецЕсли;
	
	СтатусФизическихЛицКакНалогоплательщиков = РегистрыСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(МесяцНачисления, Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	
	Если СтатусФизическихЛицКакНалогоплательщиков.Количество() > 0 Тогда
		Статус = СтатусФизическихЛицКакНалогоплательщиков[0].Статус;
	Иначе
		Статус = Перечисления.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка();
	КонецЕсли;
		
	Возврат Статус;
		
КонецФункции

Процедура ПроставитьРегистрациюВНалоговомОрганеВТаблице(Организация, ТаблицаДанных, ДатаАктуальности) Экспорт

	Если ТаблицаДанных.Колонки.Найти("Подразделение") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаДанных.Колонки.Найти("РегистрацияВНалоговомОргане") = Неопределено Тогда
		ТаблицаДанных.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	КонецЕсли;
	
	СоответствиеПодразделенийИРегистраций = ПолучитьРегистрацииПодразделенийВНалоговомОргане(ТаблицаДанных.ВыгрузитьКолонку("Подразделение"), ДатаАктуальности);
	РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, ДатаАктуальности);
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		УчетНалоговВзносовОтчислений.ПроставитьРегистрациюВНалоговомОрганеВСтроке(СтрокаДанных, СоответствиеПодразделенийИРегистраций.Получить(СтрокаДанных.Подразделение), РегистрацияВНалоговомОргане);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьРегистрацииПодразделенийВНалоговомОргане(Подразделения, ДатаАктуальности = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		ДатаАктуальности = '00010101'
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("МассивСсылок", Подразделения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК Ссылка,
	|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане
	|ИЗ
	|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&ДатаАктуальности, СтруктурнаяЕдиница В (&МассивСсылок)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних";
	
	СоответствиеРегистраций = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеРегистраций.Вставить(Выборка.Ссылка, Выборка.РегистрацияВНалоговомОргане);		
	КонецЦикла;	
	Возврат СоответствиеРегистраций;
КонецФункции	

#КонецОбласти

#Область РедактированиеВФормахДокументов

Процедура ОбъектПриЧтенииНаСервере(Форма, Организация, МесяцНачисления, ДобавлятьЭлементыФормы = Истина, ДобавлятьРеквизитыФормы = Истина, ОтложенноеИзменение = Ложь) Экспорт
	
	Объект = Форма.Объект;
	
	ПорядокОбложенияДоходовРаботников = ЗарплатаКадрыРКПовтИсп.ПорядокОбложенияДоходовРаботников(Организация, МесяцНачисления);
	
	Сотрудник = Неопределено;
	
	Если Форма.Объект.Свойство("Сотрудник", Сотрудник) Тогда
		
		Нерезидент = (ПолучитьСтатусРезидентства(МесяцНачисления, Сотрудник) = Перечисления.СтатусыФизическихЛицНалогоплательщиков.Нерезидент);
		Форма.Нерезидент = Нерезидент;
		
	КонецЕсли;
	
	// Доозначиваем то, что не означили в случае отложенного создания.
	Форма.ОрганизацияПорядокОбложенияДоходовРаботников = ПорядокОбложенияДоходовРаботников;

КонецПроцедуры

Процедура ОбработатьИзменениеОрганизации(Форма, Организация, МесяцНачисления) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРасчетЗарплатыРасширенная") Тогда 
		Возврат;
	КонецЕсли;
	
	ПорядокОбложенияДоходовРаботников = ЗарплатаКадрыРКПовтИсп.ПорядокОбложенияДоходовРаботников(Организация, МесяцНачисления);
	
	// Доозначиваем то, что не означили в случае отложенного создания.
	Форма.ОрганизацияПорядокОбложенияДоходовРаботников = ПорядокОбложенияДоходовРаботников;
	
КонецПроцедуры

Процедура ОбработатьИзменениеМесяцНачисления(Форма, Организация, МесяцНачисления) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРасчетЗарплатыРасширенная") Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Сотрудник = Неопределено;
	
	Если Форма.Объект.Свойство("Сотрудник", Сотрудник) Тогда
		
		Нерезидент = (ПолучитьСтатусРезидентства(МесяцНачисления, Сотрудник) = Перечисления.СтатусыФизическихЛицНалогоплательщиков.Нерезидент);
		Форма.Нерезидент = Нерезидент;
		
	КонецЕсли;
	
	ПорядокОбложенияДоходовРаботников = ЗарплатаКадрыРКПовтИсп.ПорядокОбложенияДоходовРаботников(Организация, МесяцНачисления);
	
	// Доозначиваем то, что не означили в случае отложенного создания.
	Форма.ОрганизацияПорядокОбложенияДоходовРаботников = ПорядокОбложенияДоходовРаботников;
	
КонецПроцедуры

Процедура ОбработатьИзменениеСотрудника(Форма, МесяцНачисления) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРасчетЗарплатыРасширенная") Тогда 
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Сотрудник = Неопределено;
	
	Если Форма.Объект.Свойство("Сотрудник", Сотрудник) Тогда
		
		Нерезидент = (ПолучитьСтатусРезидентства(МесяцНачисления, Сотрудник) = Перечисления.СтатусыФизическихЛицНалогоплательщиков.Нерезидент);
		Форма.Нерезидент = Нерезидент;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункцииИПроцедуры

Функция МетаданныеРегистровПодсистемы()
	
	Регистры = Новый Массив;
	Регистры.Добавить(Метаданные.РегистрыНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОДоходахФизическихЛиц);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц);
	Регистры.Добавить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииВычетовИПН);
	
	Возврат Регистры;
	
КонецФункции

#КонецОбласти