
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Перечисления.РежимыДистанционнойРаботы.ПустаяСсылка(), НСтр("ru = 'Работа по месту нахождения работодателя'"));
	ДанныеВыбора.Добавить(Перечисления.РежимыДистанционнойРаботы.КомбинированнаяДистанционнаяРабота);
	ДанныеВыбора.Добавить(Перечисления.РежимыДистанционнойРаботы.ДистанционнаяРабота);
	
КонецПроцедуры
