#Область ПрограммныйИнтерфейс

#Область ФункцииОбщегоНазначения

// см. Отчетность1ССервер.Отчетность1С_ЗаписатьЗначениеJSON()
Функция Отчетность1С_ЗаписатьЗначениеJSON(Значение) Экспорт	
	Возврат Отчетность1ССервер.Отчетность1С_ЗаписатьЗначениеJSON(Значение);	
КонецФункции

// см. Отчетность1ССервер.Отчетность1С_ПрочитатьЗначениеJSON()
Функция Отчетность1С_ПрочитатьЗначениеJSON(Значение) Экспорт	
	Возврат Отчетность1ССервер.Отчетность1С_ПрочитатьЗначениеJSON(Значение);	
КонецФункции

#КонецОбласти 

#Область ПроверкаФЛК

// см. Отчетность1ССервер.ОтправитьДанныеНаВалидацию()
Функция ОтправитьДанныеНаВалидацию(СтруктураПараметров, УникальныйИдентификатор) Экспорт
	Возврат Отчетность1ССервер.ОтправитьДанныеНаВалидацию(СтруктураПараметров, УникальныйИдентификатор);
КонецФункции

// см. Отчетность1ССервер.ПолучитьРезультатВалидации()
Функция ПолучитьРезультатВалидации(СтруктураПараметров, УникальныйИдентификатор) Экспорт
	Возврат Отчетность1ССервер.ПолучитьРезультатВалидации(СтруктураПараметров, УникальныйИдентификатор);
КонецФункции

#КонецОбласти

#Область Отправка

// см. Отчетность1ССервер.ОтправитьТранспортныйЗапросОтчетность1С()
Функция ОтправитьТранспортныйЗапрос(ДополнительныеПараметры, ИдентификаторФормы = "") Экспорт
	Возврат Отчетность1ССервер.ОтправитьТранспортныйЗапрос(ДополнительныеПараметры, ИдентификаторФормы);
КонецФункции

#КонецОбласти

#Область ОбновитьСтатус

// см. Отчетность1ССервер.СформироватьУведомление()
Функция СформироватьУведомление(Уведомление) Экспорт	
	Возврат Отчетность1ССервер.СформироватьУведомление(Уведомление);	
КонецФункции

#КонецОбласти

#Область Криптобиблиотека

// Определяет, какой тип провайдера используется в ИБ.
//
// Возвращаемое значение:
//  Булево
Функция ИспользоватьВнешнююКриптографиюДляКомпоненты() Экспорт
    
    ТипПровайдераКриптографии = КриптографияВызовСервера.ПолучитьТипПровайдераКриптографии();
    
    Если ТипПровайдераКриптографии = Перечисления.ТипПровайдераКриптографии.Kalkan Тогда
        Возврат Истина;
    Иначе
        Возврат Ложь;
    КонецЕсли;
    
КонецФункции

// см. КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте()
Функция ВыполнятьКриптографическиеОперацииНаКлиенте() Экспорт
    Возврат КриптографияВызовСервера.ВыполнятьКриптографическиеОперацииНаКлиенте();   
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. описание метода глобального контекста ЗаписьЖурналаРегистрации() 
Процедура СоздатьЗаписьЖурналаРегистрации(
	ИмяСобытия, 
	УровеньСтрокой = "", 
	ОбъектМетаданных = Неопределено, 
	Данные = Неопределено, 
	Комментарий = "", 
	РежимТранзакции = Неопределено) Экспорт
	
	Если УровеньСтрокой = "Информация" Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;	
	ИначеЕсли УровеньСтрокой = "Ошибка" Тогда
		Уровень = УровеньЖурналаРегистрации.Ошибка;	
	ИначеЕсли УровеньСтрокой = "Предупреждение" Тогда
		Уровень = УровеньЖурналаРегистрации.Предупреждение;	
	ИначеЕсли УровеньСтрокой = "Примечание" Тогда
		Уровень = УровеньЖурналаРегистрации.Примечание;	
	Иначе
		Уровень = УровеньЖурналаРегистрации.Информация;	
	КонецЕсли;	
		
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции); 
	
КонецПроцедуры

#КонецОбласти