
Функция ЭтоКонфигурацияЗарплатногоУчета() Экспорт 
	
	Возврат (Метаданные.Имя = "ЗарплатаИУправлениеПерсоналомДляКазахстана")
			ИЛИ (Метаданные.Имя = "ЗарплатаИУправлениеПерсоналомКОРПДляКазахстана");
	
КонецФункции

Функция РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок(Организация, Период) Экспорт

	Возврат УчетСреднегоЗаработкаРК.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок(Организация, Период);
	
КонецФункции

Функция ВариантУчетаКадровыхПерестановок(Организация, Период) Экспорт

	Возврат УчетСреднегоЗаработкаРК.ВариантУчетаКадровыхПерестановок(Организация, Период);

КонецФункции

Функция МаксимальныйПриоритетВычетаИПН() Экспорт 
	
	Возврат Справочники.ВидыВычетовИПН.МаксимальныйПриоритет();
	
КонецФункции

Функция ПрименятьКорректировкуПрочихНалоговВзносовОтчислений(Организация, Период) Экспорт
	
	Если Период >= Дата(2021, 1, 1) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений = УчетнаяПолитикаНУ[0].НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений;
	КонецЕсли;
	
	Возврат НЕ НеПрименятьКорректировкуПрочихНалоговВзносовОтчислений;
	
КонецФункции

Функция ПрименятьВычетВОСМСДляФизическихЛицИГПХ(Организация, Период) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ПрименятьВычетВОСМСДляФизическихЛицИГПХ = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьВычетВОСМСДляФизическихЛицИГПХ = УчетнаяПолитикаНУ[0].ПрименятьВычетВОСМСДляФизическихЛицИГПХ;
	КонецЕсли;
	
	Возврат ПрименятьВычетВОСМСДляФизическихЛицИГПХ;
	
КонецФункции

Функция ПрименятьВычетОПВиВОСМСДляГПХ(Организация, Период) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ПрименятьВычетОПВиВОСМСДляГПХ = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПрименятьВычетОПВиВОСМСДляГПХ = УчетнаяПолитикаНУ[0].ПрименятьВычетОПВиВОСМСДляГПХ;
	КонецЕсли;
	
	Возврат ПрименятьВычетОПВиВОСМСДляГПХ;
	
КонецФункции

Функция ПредоставлятьВычетВМесяцеОтсутствияДохода(Организация, Период) Экспорт
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ПредоставлятьВычетВМесяцеОтсутствияДохода = Ложь;
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПредоставлятьВычетВМесяцеОтсутствияДохода = УчетнаяПолитикаНУ[0].ПредоставлятьВычетВМесяцеОтсутствияДохода;
	КонецЕсли;
	
	Возврат ПредоставлятьВычетВМесяцеОтсутствияДохода;
	
КонецФункции

Функция ДеньУвольненияЯвляетсяРабочимДнем(Организация, Период) Экспорт
	
	УчетнаяПолитикаЗарплатаКадры = РегистрыСведений.УчетнаяПолитикаЗарплатаКадры.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ДеньУвольненияЯвляетсяРабочимДнем = Истина;
	Если УчетнаяПолитикаЗарплатаКадры.Количество() > 0 Тогда
		ДеньУвольненияЯвляетсяРабочимДнем = УчетнаяПолитикаЗарплатаКадры[0].ДеньУвольненияЯвляетсяРабочимДнем;
	КонецЕсли;
	
	Возврат ДеньУвольненияЯвляетсяРабочимДнем;
	
КонецФункции

Функция ПорядокОбложенияДоходовРаботников(Организация, Период) Экспорт
	
	Если Период < Дата(2023, 1, 1) Тогда
		
		Возврат Перечисления.ПорядокОбложенияДоходовРаботников.ПустаяСсылка();
		
	КонецЕсли;
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));
	ПорядокОбложенияДоходовРаботников = Перечисления.ПорядокОбложенияДоходовРаботников.ПустаяСсылка();
	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ПорядокОбложенияДоходовРаботников = УчетнаяПолитикаНУ[0].ПорядокОбложенияДоходовРаботников;
	КонецЕсли;
	
	Возврат ПорядокОбложенияДоходовРаботников;
	
КонецФункции

Функция КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя(Организация, Период) Экспорт
	
	КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));

	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя;
	КонецЕсли;
	
	Возврат КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя;
	
КонецФункции

Функция КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника(Организация, Период) Экспорт
	
	КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));

	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника;
	КонецЕсли;
	
	Возврат КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника;
	
КонецФункции

Функция ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу(Организация, Период) Экспорт
	
	ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = Ложь;
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));

	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу = УчетнаяПолитикаНУ[0].ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу;
	КонецЕсли;
	
	Возврат ОтражатьУдержаниеНалоговИВзносовПропорциональноВыплаченномуДоходу;
	
КонецФункции

Функция СистемаНалогообложения(Организация, Период) Экспорт
	
	СистемаНалогообложения = Перечисления.СистемыНалогообложения.ПустаяСсылка();
	
	УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(Период, Новый Структура("Организация", Организация));

	Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
		СистемаНалогообложения = УчетнаяПолитикаНУ[0].СистемаНалогообложения;
	КонецЕсли;
	
	Возврат СистемаНалогообложения;
	
КонецФункции
