
#Область ПрограммныйИнтерфейс

// Отправляет сообщение пользователю с возможностью указать данные и контекст сообщения.
// Параметры:
//  ТекстСообщенияПользователю – Строка – текст сообщения, которое нужно отобразить пользователю.
//  КлючДанных – Произвольный – идентификатор данных, связанных с сообщением.
//  Поле – Строка – имя поля, связанного с сообщением.
//  ПутьКДанным – Строка – путь к данным, на которые ссылается сообщение.
//  Отказ – Булево – указывает, должно ли сообщение приводить к отказу выполнения действия.
//
Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю, КлючДанных, Поле, ПутьКДанным, Отказ);
	
КонецПроцедуры

#Область ОтключениеСервернойКриптографииы

// Определяет, нужно ли показывать оповещения для серверной криптографии.
//
// Возвращаемое значение:
//   Булево – Всегда возвращает Истина.
//
Функция ПоказыватьОповещенияСервернаяКриптография() Экспорт
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти