
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Заголовок,ФизическоеЛицоСсылка");
	
	ЗначениеВРеквизитФормы(СотрудникиФормы.ФизическоеЛицоФормыСотрудника(ФизическоеЛицоСсылка), "ФизическоеЛицо");
	
	СозданиеНового = Параметры.СозданиеНового И НЕ ЗначениеЗаполнено(ФизическоеЛицо.Ссылка);
	
	СотрудникиФормы.ПрочитатьДанныеИзХранилищаВФорму(
		ЭтаФорма,
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(ИмяФормы),
		Параметры.АдресВХранилище);
		
	ПроинициализироватьФорму();
					
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СотрудникиКлиент.ЗарегистрироватьОткрытиеФормы(ЭтаФорма, ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СотрудникиКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ОтредактированаИстория" И ФизическоеЛицоСсылка = Источник Тогда
		Если Параметр.ИмяРегистра = "СведенияОбИнвалидностиФизическихЛиц" Тогда
			Если СведенияОбИнвалидностиФизическихЛицНаборЗаписейПрочитан Тогда
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
					ЭтаФорма,
					ФизическоеЛицоСсылка,
					ИмяСобытия,
					Параметр,
					Источник);
				ОбновитьПолеСведенияОбИнвалидностиПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
			КонецЕсли;
		ИначеЕсли Параметр.ИмяРегистра = "СведенияОФизическихЛицахУчастникахВОВ" Тогда
			Если СведенияОФизическихЛицахУчастникахВОВНаборЗаписейПрочитан Тогда
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
					ЭтаФорма,
					ФизическоеЛицоСсылка,
					ИмяСобытия,
					Параметр,
					Источник);
				ОбновитьПолеСведенияОбУчастникахВОВПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
			КонецЕсли;
		ИначеЕсли Параметр.ИмяРегистра = "СведенияОПенсионномОбеспеченииФизическихЛиц" Тогда
			Если СведенияОПенсионномОбеспеченииФизическихЛицНаборЗаписейПрочитан Тогда
				РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
					ЭтаФорма,
					ФизическоеЛицоСсылка,
					ИмяСобытия,
					Параметр,
					Источник);
				ОбновитьПолеСведенияОПенсионномОбеспеченииПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц", ФизическоеЛицоСсылка, Отказ);
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ", ФизическоеЛицоСсылка, Отказ);
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц", ФизическоеЛицоСсылка, Отказ);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицИстория(Команда)
	
	СотрудникиКлиент.ОткрытьФормуРедактированияИстории("СведенияОбИнвалидностиФизическихЛиц", ФизическоеЛицоСсылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВИстория(Команда)
	
	СотрудникиКлиент.ОткрытьФормуРедактированияИстории("СведенияОФизическихЛицахУчастникахВОВ", ФизическоеЛицоСсылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицИстория(Команда)
	
	СотрудникиКлиент.ОткрытьФормуРедактированияИстории("СведенияОПенсионномОбеспеченииФизическихЛиц", ФизическоеЛицоСсылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	СохранитьИЗакрытьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроинициализироватьФорму()	
	
	Если СведенияОбИнвалидностиФизическихЛицПрежняя = Неопределено Тогда
		РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц", ФизическоеЛицоСсылка);
	КонецЕсли; 
	ОбновитьПолеСведенияОбИнвалидностиПериод(ЭтаФорма, ТекущаяДатаСеанса()); 
	ОбновитьПолеСведенияОбИнвалидностиДатаРегистрацииИзменений(ЭтотОбъект);
	
	ДоступностьИсичисленияОПВ = СведенияОбИнвалидностиФизическихЛиц.ОтношениеКИнвалидности = ПредопределенноеЗначение("Перечисление.ОтношениеКИнвалидности.Инвалид")
						И Не ЗначениеЗаполнено(СведенияОбИнвалидностиФизическихЛиц.СрокДействияСправки) 
						И (СведенияОбИнвалидностиФизическихЛиц.ГруппаИнвалидности = Перечисления.ГруппыИнвалидности.Первая 
							ИЛИ СведенияОбИнвалидностиФизическихЛиц.ГруппаИнвалидности = Перечисления.ГруппыИнвалидности.Вторая);
						
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СведенияОбИнвалидностиФизическихЛицИсчислятьОПВ", "Доступность", ДоступностьИсичисленияОПВ);
	
	Если СведенияОФизическихЛицахУчастникахВОВПрежняя = Неопределено Тогда
		РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ", ФизическоеЛицоСсылка);
	КонецЕсли;
	ОбновитьПолеСведенияОбУчастникахВОВПериод(ЭтаФорма, ТекущаяДатаСеанса());
	ОбновитьПолеСведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзменений(ЭтотОбъект);
	
	Если СведенияОПенсионномОбеспеченииФизическихЛицПрежняя = Неопределено Тогда
		РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц", ФизическоеЛицоСсылка);
	КонецЕсли;
	ОбновитьПолеСведенияОПенсионномОбеспеченииПериод(ЭтаФорма, ТекущаяДатаСеанса());
	ОбновитьПолеСведенияОПенсионномОбеспеченииДатаРегистрацииИзменений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Отказ, ОповещениеЗавершения = Неопределено) Экспорт
	
	Если Не Модифицированность Тогда
		Если ОповещениеЗавершения <> Неопределено Тогда 
			ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
		КонецЕсли;
		Возврат;
	КонецЕсли; 
	
	Если Не СозданиеНового Тогда
		ЗапроситьРежимИзмененияИнвалидности(Отказ, ОповещениеЗавершения);
	Иначе 
		СохранитьДанныеЗавершение(Отказ, ОповещениеЗавершения);
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеЗавершение(Отказ, ОповещениеЗавершения) Экспорт  
	
	Если Не Отказ Тогда
		
		Если ПроверитьЗаполнение() Тогда
			
			Возвращаемыйпараметр = Новый Структура;
			Возвращаемыйпараметр.Вставить("ИмяФормы", ИмяФормы);
			Возвращаемыйпараметр.Вставить("АдресВХранилище", АдресДанныхДополнительнойФормыНаСервере(СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(ИмяФормы)));
			
			Оповестить(
				"ИзмененыДанныеДополнительнойФормы",
				Возвращаемыйпараметр,
				ВладелецФормы);
			
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	СохранитьИЗакрытьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиенте(ЗакрытьФорму = Истина) Экспорт 

	Если НЕ ТолькоПросмотр Тогда
		ТекущийЭлемент = Элементы.ФормаОк;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура("ЗакрытьФорму", ЗакрытьФорму);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрытьНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьДанные(Ложь, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиентеЗавершение(Отказ, ДополнительныеПараметры) Экспорт 

	Если Не Отказ И Открыта() Тогда
		
		Модифицированность = Ложь;
		Если ДополнительныеПараметры.ЗакрытьФорму Тогда
			Закрыть();
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСведенияОбИнвалидностиПериод(Форма, ДатаСеанса) Экспорт
	
	// Не обязательно заполнение поля Период если данные по умолчанию и при этом 
	// записи о сведениях об инвалидности еще нет.
	Если ЗарплатаКадрыКлиентСервер.СведенияОбИнвалидностиПоУмолчанию(Форма.СведенияОбИнвалидностиФизическихЛиц) И 
		НЕ ЗначениеЗаполнено(Форма.СведенияОбИнвалидностиФизическихЛицПрежняя.Период) Тогда
		Если ЗначениеЗаполнено(Форма.СведенияОбИнвалидностиФизическихЛиц.Период) Тогда
			Форма.СведенияОбИнвалидностиФизическихЛиц.Период = '00010101';
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(Форма.СведенияОбИнвалидностиФизическихЛиц.Период) Тогда
			Если ЗначениеЗаполнено(Форма.СведенияОбИнвалидностиФизическихЛиц.ДатаВыдачи) Тогда
				Форма.СведенияОбИнвалидностиФизическихЛиц.Период = НачалоМесяца(Форма.СведенияОбИнвалидностиФизическихЛиц.ДатаВыдачи);
			Иначе
				Форма.СведенияОбИнвалидностиФизическихЛиц.Период = НачалоМесяца(ДатаСеанса);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	ОбновитьПолеСведенияОбИнвалидностиДатаРегистрацииИзменений(Форма);
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "СведенияОбИнвалидностиФизическихЛиц", Форма.ФизическоеЛицоСсылка);
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СведенияОбИнвалидностиФизическихЛиц.Период", "СведенияОбИнвалидностиФизическихЛицПериодСтрокой");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСведенияОбИнвалидностиДатаРегистрацииИзменений(Форма) Экспорт
	
	Форма.Элементы.СведенияОбИнвалидностиФизическихЛицНаборЗаписейДатаРегистрацииИзмененийСтрокой.АвтоОтметкаНезаполненного = Истина;
	
	// Не обязательно заполнение поля Период если данные по умолчанию и при этом 
	// записи о сведениях об инвалидности еще нет.
	Если ЗарплатаКадрыКлиентСервер.СведенияОбИнвалидностиПоУмолчанию(Форма.СведенияОбИнвалидностиФизическихЛиц) И 
		НЕ ЗначениеЗаполнено(Форма.СведенияОбИнвалидностиФизическихЛицПрежняя.Период) Тогда
		
		Форма.Элементы.СведенияОбИнвалидностиФизическихЛицНаборЗаписейДатаРегистрацииИзмененийСтрокой.АвтоОтметкаНезаполненного = Ложь;
		Если ЗначениеЗаполнено(Форма.СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений) Тогда
			Форма.СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений = '00010101';
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(Форма.СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений) Тогда
			Форма.СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений = НачалоМесяца(Форма.СведенияОбИнвалидностиФизическихЛиц.Период);
		КонецЕсли; 
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОбИнвалидностиФизическихДатаРегистрацииИзмененийСтрокой");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СведенияОбУчастникахВОВПоУмолчанию(СведенияОбУчастникахВОВ)
	Возврат (НЕ ЗначениеЗаполнено(СведенияОбУчастникахВОВ.Статус))
		И (НЕ ЗначениеЗаполнено(СведенияОбУчастникахВОВ.ДатаВыдачи))
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСведенияОбУчастникахВОВПериод(Форма, ДатаСеанса) Экспорт
	
	// Не обязательно заполнение поля Период если данные по умолчанию и при этом 
	// записи о сведениях об участии в ВОВ еще нет.
	Если СведенияОбУчастникахВОВПоУмолчанию(Форма.СведенияОФизическихЛицахУчастникахВОВ) И 
		НЕ ЗначениеЗаполнено(Форма.СведенияОФизическихЛицахУчастникахВОВПрежняя.Период) Тогда
		Если ЗначениеЗаполнено(Форма.СведенияОФизическихЛицахУчастникахВОВ.Период) Тогда
			Форма.СведенияОФизическихЛицахУчастникахВОВ.Период = '00010101';
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(Форма.СведенияОФизическихЛицахУчастникахВОВ.Период) Тогда
			Если ЗначениеЗаполнено(Форма.СведенияОФизическихЛицахУчастникахВОВ.ДатаВыдачи) Тогда
				Форма.СведенияОФизическихЛицахУчастникахВОВ.Период = НачалоМесяца(Форма.СведенияОФизическихЛицахУчастникахВОВ.ДатаВыдачи);
			Иначе
				Форма.СведенияОФизическихЛицахУчастникахВОВ.Период = НачалоМесяца(ДатаСеанса);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	ОбновитьПолеСведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзменений(Форма);
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "СведенияОФизическихЛицахУчастникахВОВ", Форма.ФизическоеЛицоСсылка);
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СведенияОФизическихЛицахУчастникахВОВ.Период", "СведенияОФизическихЛицахУчастникахВОВПериодСтрокой");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзменений(Форма) Экспорт
	
	Форма.Элементы.СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокой.АвтоОтметкаНезаполненного = Истина;
	
	Если НЕ ЗначениеЗаполнено(Форма.СведенияОФизическихЛицахУчастникахВОВ.Период) Тогда
		
		Форма.Элементы.СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокой.АвтоОтметкаНезаполненного = Ложь;
		Если ЗначениеЗаполнено(Форма.СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений) Тогда
			Форма.СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений = '00010101';
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(Форма.СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений) Тогда
			Форма.СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений = НачалоМесяца(Форма.СведенияОФизическихЛицахУчастникахВОВ.Период);
		КонецЕсли; 
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений", "СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокой");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СведенияОПенсионномОбеспеченииПоУмолчанию(СведенияОПенсионномОбеспечении)
	Возврат (НЕ СведенияОПенсионномОбеспечении.ПенсионерПоВозрасту)
		И (НЕ СведенияОПенсионномОбеспечении.ПенсионерПоВыслугеЛет)
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСведенияОПенсионномОбеспеченииПериод(Форма, ДатаСеанса) Экспорт
	
	// Не обязательно заполнение поля Период если данные по умолчанию и при этом 
	// записи о сведениях о пенсионном обеспечении еще нет.
	Если СведенияОПенсионномОбеспеченииПоУмолчанию(Форма.СведенияОПенсионномОбеспеченииФизическихЛиц) И 
		НЕ ЗначениеЗаполнено(Форма.СведенияОПенсионномОбеспеченииФизическихЛицПрежняя.Период) Тогда
		Если ЗначениеЗаполнено(Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.Период) Тогда
			Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.Период = '00010101';
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.Период) Тогда
			Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.Период = НачалоМесяца(ДатаСеанса);
		КонецЕсли; 
	КонецЕсли;
	
	ОбновитьПолеСведенияОПенсионномОбеспеченииДатаРегистрацииИзменений(Форма);
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "СведенияОПенсионномОбеспеченииФизическихЛиц", Форма.ФизическоеЛицоСсылка);
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СведенияОПенсионномОбеспеченииФизическихЛиц.Период", "СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокой");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеСведенияОПенсионномОбеспеченииДатаРегистрацииИзменений(Форма) Экспорт
	
	Форма.Элементы.СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокой.АвтоОтметкаНезаполненного = Истина;
	
	Если НЕ ЗначениеЗаполнено(Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.Период) Тогда
		
		Форма.Элементы.СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокой.АвтоОтметкаНезаполненного = Ложь;
		Если ЗначениеЗаполнено(Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений) Тогда
			Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений = '00010101';
		КонецЕсли; 
	Иначе
		Если НЕ ЗначениеЗаполнено(Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений) Тогда
			Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений = НачалоМесяца(Форма.СведенияОПенсионномОбеспеченииФизическихЛиц.Период);
		КонецЕсли; 
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияИнвалидности(Отказ, ОповещениеЗавершения) Экспорт 
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстКнопкиДа = НСтр("ru = 'Изменились сведения об инвалидности'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru =  'При редактировании изменены сведения об инвалидности.
						|Если исправлена прежняя запись об инвалидности (она была ошибочной), нажмите ""Исправлена ошибка"".
						|Если у сотрудника изменилась инвалидность с %1, нажмите'") + " ""%2""",
			Формат(СведенияОбИнвалидностиФизическихЛиц.Период, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	Оповещение = Новый ОписаниеОповещения("ЗапроситьРежимИзмененияСведенийУчастниковВОВ", ЭтотОбъект, ОповещениеЗавершения);		
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц", ТекстВопроса, ТекстКнопкиДа, Отказ, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияСведенийУчастниковВОВ(Отказ, ОповещениеЗавершения) Экспорт 
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстКнопкиДа = НСтр("ru = 'Изменился статус участника ВОВ'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru =  'При редактировании изменен статус участника ВОВ.
						|Если исправлена прежняя запись об участнике ВОВ (она была ошибочной), нажмите ""Исправлена ошибка"".
						|Если у сотрудника изменился статус с %1, нажмите'") + " ""%2""",
			Формат(СведенияОФизическихЛицахУчастникахВОВ.Период, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	Оповещение = Новый ОписаниеОповещения("ЗапроситьРежимИзмененияСведенийОПенсионномОбеспечении", ЭтотОбъект, ОповещениеЗавершения);		
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ", ТекстВопроса, ТекстКнопкиДа, Отказ, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияСведенийОПенсионномОбеспечении(Отказ, ОповещениеЗавершения) Экспорт 
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстКнопкиДа = НСтр("ru = 'Изменились данные о пенсионном обеспечении'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru =  'При редактировании изменились данные о пенсионном обеспечении.
						|Если исправлена прежняя запись о пенсионном обеспечении (она была ошибочной), нажмите ""Исправлена ошибка"".
						|Если у сотрудника изменился статус с %1, нажмите'") + " ""%2""",
			Формат(СведенияОФизическихЛицахУчастникахВОВ.Период, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	Оповещение = Новый ОписаниеОповещения("СохранитьДанныеЗавершение", ЭтотОбъект, ОповещениеЗавершения);		
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц", ТекстВопроса, ТекстКнопкиДа, Отказ, Оповещение);
	
КонецПроцедуры

&НаСервере
Функция АдресДанныхДополнительнойФормыНаСервере(ОписаниеДополнительнойФормы)
	
	Возврат СотрудникиФормы.АдресДанныхДополнительнойФормы(ОписаниеДополнительнойФормы, ЭтаФорма);
	
КонецФункции

#КонецОбласти

#Область РедактированиеСведенийОбИнвалидности

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицДатаВыдачиПриИзменении(Элемент)
	
	ОбновитьПолеСведенияОбИнвалидностиПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицСрокДействияСправкиПриИзменении(Элемент)
	
	ОбновитьПолеСведенияОбИнвалидностиПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	ОбработатьПризнакИсчислятьОПВ();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицИнвалидностьПриИзменении(Элемент)
	
	ОбновитьПолеСведенияОбИнвалидностиПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	ОбработатьПризнакИсчислятьОПВ();
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицГруппаИнвалидностиПриИзменении(Элемент)
	ОбновитьПолеСведенияОбИнвалидностиПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	ОбработатьПризнакИсчислятьОПВ();
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицПериодСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц.Период", "СведенияОбИнвалидностиФизическихЛицПериодСтрокой", Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц.Период", "СведенияОбИнвалидностиФизическихЛицПериодСтрокой", ,);
	
КонецПроцедуры	

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц.Период", "СведенияОбИнвалидностиФизическихЛицПериодСтрокой", Направление, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицДатаРегистрацииИзмененийСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОбИнвалидностиФизическихДатаРегистрацииИзмененийСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицДатаРегистрацииИзмененийСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОбИнвалидностиФизическихДатаРегистрацииИзмененийСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицДатаРегистрацииИзмененийСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "СведенияОбИнвалидностиФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОбИнвалидностиФизическихДатаРегистрацииИзмененийСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицДатаРегистрацииИзмененийСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбИнвалидностиФизическихЛицДатаРегистрацииИзмененийСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПризнакИсчислятьОПВ()
	
	ДоступностьИсичисленияОПВ = СведенияОбИнвалидностиФизическихЛиц.ОтношениеКИнвалидности = ПредопределенноеЗначение("Перечисление.ОтношениеКИнвалидности.Инвалид")
						И НЕ ЗначениеЗаполнено(СведенияОбИнвалидностиФизическихЛиц.СрокДействияСправки) 
						И (СведенияОбИнвалидностиФизическихЛиц.ГруппаИнвалидности = ПредопределенноеЗначение("Перечисление.ГруппыИнвалидности.Первая") 
							ИЛИ СведенияОбИнвалидностиФизическихЛиц.ГруппаИнвалидности = ПредопределенноеЗначение("Перечисление.ГруппыИнвалидности.Вторая"));
							
	Если НЕ ДоступностьИсичисленияОПВ И СведенияОбИнвалидностиФизическихЛиц.ИсчислятьОПВ Тогда
		СведенияОбИнвалидностиФизическихЛиц.ИсчислятьОПВ = Ложь;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СведенияОбИнвалидностиФизическихЛицИсчислятьОПВ", "Доступность", ДоступностьИсичисленияОПВ);

КонецПроцедуры

#КонецОбласти

#Область РедактированиеСведенийОбУчастникахВОВ

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВСтатусПриИзменении(Элемент)
	ОбновитьПолеСведенияОбУчастникахВОВПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВДатаВыдачиПриИзменении(Элемент)
	ОбновитьПолеСведенияОбУчастникахВОВПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВПериодСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ.Период", "СведенияОФизическихЛицахУчастникахВОВПериодСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ.Период", "СведенияОФизическихЛицахУчастникахВОВПериодСтрокой", ,);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ.Период", "СведенияОФизическихЛицахУчастникахВОВПериодСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений", "СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений", "СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "СведенияОФизическихЛицахУчастникахВОВ.ДатаРегистрацииИзменений", "СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОФизическихЛицахУчастникахВОВДатаРегистрацииИзмененийСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область РедактированиеСведенийОПенсионномОбеспечении

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицПенсионерПоВозрастуПриИзменении(Элемент)
	ОбновитьПолеСведенияОПенсионномОбеспеченииПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицПенсионерПоВыслугеЛетПриИзменении(Элемент)
	ОбновитьПолеСведенияОПенсионномОбеспеченииПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц.Период", "СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокой", Модифицированность);
	ОбновитьПолеСведенияОПенсионномОбеспеченииДатаРегистрацииИзменений(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц.Период", "СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокой", ,);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц.Период", "СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокой", Направление, Модифицированность);
	ОбновитьПолеСведенияОПенсионномОбеспеченииДатаРегистрацииИзменений(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицЛицДатаРегистрацииИзмененийСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "СведенияОПенсионномОбеспеченииФизическихЛиц.ДатаРегистрацииИзменений", "СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПенсионномОбеспеченииФизическихЛицДатаРегистрацииИзмененийСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Функция ЗаблокироватьОбъектВФормеВладельце() Экспорт
	
	ИмяФормыВладельца = ЭтотОбъект.ВладелецФормы.ИмяФормы;
	Если Найти(ИмяФормыВладельца, "ФизическиеЛица") > 0 Тогда
		Возврат СотрудникиКлиент.ЗаблокироватьОбъектВФормеВладельцеДополнительнойФормы(ЭтотОбъект, Ложь);
	ИначеЕсли Найти(ИмяФормыВладельца, "Сотрудники") > 0 Тогда
		Возврат СотрудникиКлиент.ЗаблокироватьОбъектВФормеВладельцеДополнительнойФормы(ЭтотОбъект, Истина);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
