////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаиморасчеты с сотрудниками ВХО".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ЕстьОплатаПоВедомостиТекст(Ведомость, ТекстЗапроса) Экспорт
	
	МетаданныеДокумента = Ведомость.Метаданные();
	ИспользоватьЭОИ = Ложь;
	ЕстьРеквизитЗарплатныйПроект = ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗарплатныйПроект", МетаданныеДокумента);
	
	Если ЕстьРеквизитЗарплатныйПроект Тогда
		ЗарплатныйПроект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ведомость, "ЗарплатныйПроект");
		ИспользоватьЭОИ = ОбменСБанкамиПоЗарплатнымПроектам.ИспользоватьЭОИСБанком(ЗарплатныйПроект);
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныйОбменСБанкамиПоЗарплатнымПроектам")
		ИЛИ НЕ ИспользоватьЭОИ Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПлатежноеПоручениеВедомости.Ссылка КАК ДокументПодтверждение
		|ИЗ
		|	Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка
		|ГДЕ
		|	ПлатежноеПоручениеВедомости.Ведомость = &Ведомость
		|	И ПлатежноеПоручение.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПлатежноеПоручениеВедомостиПрочие.Ссылка КАК ДокументПодтверждение
		|ИЗ
		|	Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеВедомостиПрочие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО ПлатежноеПоручениеВедомостиПрочие.Ссылка = ПлатежноеПоручение.Ссылка
		|ГДЕ
		|	ПлатежноеПоручениеВедомостиПрочие.Ведомость = &Ведомость
		|	И ПлатежноеПоручение.Проведен";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция СписокОплатТекст(Форма, ТекстЗапроса) Экспорт

	МетаданныеДокумента = Форма.Объект.Ссылка.Метаданные();
	ИспользоватьЭОИ = Ложь;
	ЕстьРеквизитЗарплатныйПроект = ОбщегоНазначения.ЕстьРеквизитОбъекта("ЗарплатныйПроект", МетаданныеДокумента);
	
	Если ЕстьРеквизитЗарплатныйПроект Тогда
		ЗарплатныйПроект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.Ссылка, "ЗарплатныйПроект");
		ИспользоватьЭОИ = ОбменСБанкамиПоЗарплатнымПроектам.ИспользоватьЭОИСБанком(ЗарплатныйПроект);
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныйОбменСБанкамиПоЗарплатнымПроектам")
		ИЛИ НЕ ИспользоватьЭОИ Тогда
		
		Если Не ПравоДоступа("Чтение", Метаданные.Документы.ПлатежноеПоручение) Тогда
			Возврат ТекстЗапроса;
		КонецЕсли;	
		
		ИмяВедомости = МетаданныеДокумента.Имя;
		ИмяТЧ = "Зарплата";
		
		Если ИмяВедомости = "ВедомостьНаПеречислениеПрочихВыплат" Тогда
			
			ИмяТЧ = "ПрочиеВыплаты";
			
		ИначеЕсли ИмяВедомости = "ВедомостьПрочихДоходовВБанк"
			 ИЛИ ИмяВедомости = "ВедомостьПрочихДоходовПеречислением"
			 ИЛИ ИмяВедомости = "ВедомостьПрочихДоходовВКассу" Тогда
			
			ИмяТЧ = "Выплаты";
			
		КонецЕсли;		
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПлатежноеПоручениеВедомости.Ссылка КАК Регистратор,
			|	ДанныеВедомости.ФизическоеЛицо КАК ФизЛицо
			|ИЗ
			|	Документ.ПлатежноеПоручение.Ведомости КАК ПлатежноеПоручениеВедомости
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			|		ПО ПлатежноеПоручениеВедомости.Ссылка = ПлатежноеПоручение.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + ИмяВедомости + "." + ИмяТЧ + " КАК ДанныеВедомости
			|		ПО ПлатежноеПоручениеВедомости.Ведомость = ДанныеВедомости.Ссылка
			|ГДЕ
			|	ПлатежноеПоручениеВедомости.Ведомость = &Ведомость
			|	И ПлатежноеПоручение.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПлатежноеПоручениеВедомостиПрочие.Ссылка,
			|	ДанныеВедомости.ФизическоеЛицо
			|ИЗ
			|	Документ.ПлатежноеПоручение.ВедомостиПрочие КАК ПлатежноеПоручениеВедомостиПрочие
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
			|		ПО ПлатежноеПоручениеВедомостиПрочие.Ссылка = ПлатежноеПоручение.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ." + ИмяВедомости + "." + ИмяТЧ + " КАК ДанныеВедомости
			|		ПО ПлатежноеПоручениеВедомостиПрочие.Ведомость = ДанныеВедомости.Ссылка
			|ГДЕ
			|	ПлатежноеПоручениеВедомостиПрочие.Ведомость = &Ведомость
			|	И ПлатежноеПоручение.Проведен
			|
			|УПОРЯДОЧИТЬ ПО
			|	Регистратор,
			|	ФизЛицо";
		
	Иначе
		
		Возврат ТекстЗапроса;
		
	КонецЕсли;

	Возврат ТекстЗапроса;
	
КонецФункции	

Процедура ЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭД) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПеречислениеВзносовИОтчислений") Тогда
		РеквизитыИсточника = Новый Структура("Организация, БанковскийСчет");
		РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, РеквизитыИсточника);
        ПараметрыЭД.Направление = Перечисления.НаправленияЭДО.Исходящий;
		ПараметрыЭД.Организация = РеквизитыИсточника.Организация;
		ПараметрыЭД.Банк        = РеквизитыИсточника.БанковскийСчет.Банк;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
    Обработчик = Обработчики.Добавить();
    Обработчик.Версия = "3.1.2.19";
    Обработчик.Процедура = "ВзаиморасчетыССотрудникамиВХОЗУПК.ОбновлениеВидПлатежаПеречислениеНалоговВБюджет";
    Обработчик.Идентификатор   = Новый УникальныйИдентификатор("ba90ea6f-bef8-4677-9e25-6ab979770e69");
    Обработчик.РежимВыполнения = "Отложенно";
    Обработчик.Комментарий = НСтр("ru = 'Заполнение вида платежа в документе ""Перечисление налогов в бюджет""'");
	
КонецПроцедуры	

Процедура ОбновлениеВидПлатежаПеречислениеНалоговВБюджет(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ 
		|	ПеречислениеНалоговВБюджет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеречислениеНалоговВБюджет КАК ПеречислениеНалоговВБюджет
		|ГДЕ
		|	ПеречислениеНалоговВБюджет.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПеречислениеНалоговВБюджет", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();

		ДокументОбъект.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

#КонецОбласти
