#Область СлужебныеПроцедурыИФункции

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ПеречислениеВзносовИОтчислений);
	СписокОбъектов.Добавить(Документы.ПеречислениеНалоговВБюджет);
	
КонецПроцедуры

#Область ДатыЗапретаИзмененияДанных

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеречислениеВзносовИОтчислений", "Дата", "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеречислениеНалоговВБюджет", 	"Дата", "НДФЛ", "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	 Описание = Описание + "
		|Документ.ПеречислениеВзносовИОтчислений.Чтение.Организации
		|Документ.ПеречислениеВзносовИОтчислений.Изменение.Организации
		//|Справочник.ПеречислениеВзносовИОтчисленийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ПеречислениеВзносовИОтчисленийПрисоединенныеФайлы.Чтение.Организации
		//|Справочник.ПеречислениеВзносовИОтчисленийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ПеречислениеВзносовИОтчисленийПрисоединенныеФайлы.Изменение.Организации
		|Документ.ПеречислениеНалоговВБюджет.Чтение.Организации
		|Документ.ПеречислениеНалоговВБюджет.Изменение.Организации
		//|Справочник.ПеречислениеНалоговВБюджетПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ПеречислениеНалоговВБюджетПрисоединенныеФайлы.Чтение.Организации
		//|Справочник.ПеречислениеНалоговВБюджетПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ПеречислениеНалоговВБюджетПрисоединенныеФайлы.Изменение.Организации";

КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ПеречислениеВзносовИОтчисленийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПеречислениеНалоговВБюджетПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ПеречислениеВзносовИОтчислений, Истина);
	Списки.Вставить(Метаданные.Документы.ПеречислениеНалоговВБюджет, Истина);
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт

КонецПроцедуры

Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт

	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "31fd379c-ccc2-4c4a-acef-f3282a08e6ae", Метаданные.Документы.ПеречислениеВзносовИОтчислений);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "9ee2a137-49e9-43df-8d78-73d31ad3b465", Метаданные.Документы.ПеречислениеНалоговВБюджет);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

