#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ИдентификаторПодразделенияИБ", ИдентификаторПодразделенияИБ);
	ПодразделенияФРМО = Неопределено;
	Если Параметры.Свойство("ПодразделенияФРМО", ПодразделенияФРМО) Тогда 
		Для Каждого ТекущееПодразделение Из ПодразделенияФРМО Цикл 
			НовоеПодразделение = Подразделения.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПодразделение, ТекущееПодразделение);
			НовоеПодразделение.ЭтоОтделениеИлиКабинет = Ложь;
			Для Каждого ЭлементСтруктурыПодразделения Из ТекущееПодразделение.СтруктураПодразделения Цикл 
				НовыйЭлементСтруктурыПодразделения = НовоеПодразделение.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлементСтруктурыПодразделения, ЭлементСтруктурыПодразделения);
				НовыйЭлементСтруктурыПодразделения.ЭтоОтделениеИлиКабинет = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыбореПодразделения();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОповеститьОВыбореПодразделения()
	
	ТекущиеДанные = Элементы.Подразделения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемаяСтруктура = Новый Структура;
	ПередаваемаяСтруктура.Вставить("ИдентификаторПодразделенияИБ", ИдентификаторПодразделенияИБ);
	
	ДочерниеЭлементы = ТекущиеДанные.ПолучитьЭлементы();
	Если ДочерниеЭлементы.Количество()=0 Тогда
		РодительскийЭлемент = ТекущиеДанные.ПолучитьРодителя();
		Если РодительскийЭлемент<>Неопределено И ТекущиеДанные.ЭтоОтделениеИлиКабинет Тогда 
			ПередаваемаяСтруктура.Вставить("Наименование", РодительскийЭлемент.Наименование);
			ПередаваемаяСтруктура.Вставить("Идентификатор", РодительскийЭлемент.Идентификатор);
			ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", ТекущиеДанные.Наименование);
			ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", ТекущиеДанные.Идентификатор);
		Иначе 
			ПередаваемаяСтруктура.Вставить("Наименование", ТекущиеДанные.Наименование);
			ПередаваемаяСтруктура.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
			ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", "");
			ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", "");
		КонецЕсли;
	Иначе 
		ПередаваемаяСтруктура.Вставить("Наименование", ТекущиеДанные.Наименование);
		ПередаваемаяСтруктура.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
		ПередаваемаяСтруктура.Вставить("ДополнительноеНаименование", "");
		ПередаваемаяСтруктура.Вставить("ДополнительныйИдентификатор", "");
	КонецЕсли;
	
	Закрыть(ПередаваемаяСтруктура);
	
КонецПроцедуры
