#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьСправочникКатегорииЛицПолучаетелейЛьготИПН();
	
КонецПроцедуры

Процедура ЗаполнитьСправочникКатегорииЛицПолучаетелейЛьготИПН() Экспорт
	
   	ОписаниеЭлемента = ОписаниеЭлементаКатегорияЛицПолучаетелейЛьготИПН();
	ОписаниеЭлемента.Наименование = "Участники ВОВ и приравненные к ним лица";
	СоздатьЭлементКатегорияЛицПолучаетелейЛьготИПН(ОписаниеЭлемента);
	
   	ОписаниеЭлемента = ОписаниеЭлементаКатегорияЛицПолучаетелейЛьготИПН();
	ОписаниеЭлемента.Наименование = "Лица с инвалидностью I, II групп";
	СоздатьЭлементКатегорияЛицПолучаетелейЛьготИПН(ОписаниеЭлемента);
	
   	ОписаниеЭлемента = ОписаниеЭлементаКатегорияЛицПолучаетелейЛьготИПН();
	ОписаниеЭлемента.Наименование = "Лица с инвалидностью III группы";
	СоздатьЭлементКатегорияЛицПолучаетелейЛьготИПН(ОписаниеЭлемента);
	
	ОписаниеЭлемента = ОписаниеЭлементаКатегорияЛицПолучаетелейЛьготИПН();
	ОписаниеЭлемента.Наименование = "Родители, опекуны лица, имеющего категорию инвалидности с детства";
	СоздатьЭлементКатегорияЛицПолучаетелейЛьготИПН(ОписаниеЭлемента);

КонецПроцедуры

Функция ОписаниеЭлементаКатегорияЛицПолучаетелейЛьготИПН()
	Возврат Новый Структура("Наименование");	
КонецФункции	

Процедура СоздатьЭлементКатегорияЛицПолучаетелейЛьготИПН(ОписаниеЭлемента)
	
	Если ЗначениеЗаполнено(ОписаниеЭлемента.Наименование) Тогда
		
		СсылкаНаОбъект =  Справочники.КатегорииЛицПолучателейЛьготИПН.НайтиПоНаименованию(ОписаниеЭлемента.Наименование); 
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Элемент = СсылкаНаОбъект.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.КатегорииЛицПолучателейЛьготИПН.СоздатьЭлемент();
		КонецЕсли;
		
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Элемент, ОписаниеЭлемента);
	Элемент.Записать();
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли