#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьКоэффициентыСтавкиРефинансированияНБ();
	
КонецПроцедуры

Процедура ЗаполнитьКоэффициентыСтавкиРефинансированияНБ() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.СоздатьНаборЗаписей();
	// обновляем коэффициенты ставок рефинансирования для базы в целом (установленные пользователем не трогаем)
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());

	// с 1 января 2015
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВ,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.ОППВ,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыНалоговВзносовОтчислений.СО,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1);
	
	// С 1 июля 2017
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20170701', Перечисления.ВидыНалоговВзносовОтчислений.ООСМС,	2.5);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20170701', Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,	2.5);
	
	// с 1 января 2018
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВ,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ОППВ,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.СО,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ООСМС,	1.25);
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20180101', Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС,	1.25);

	// с 1 мая 2020
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20200501', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1.25);

	// с 1 января 2024
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20240101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, 1.25);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, Период, ВидНалогаВзносаОтчисления, Коэффициент)
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
	НоваяЗапись.Коэффициент = Коэффициент;
	
КонецПроцедуры

Процедура ОбновитьСведенияКоэффициентыСтавкиРефинансированияНБ2020() Экспорт

	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.СоздатьНаборЗаписей();
	
	// с 1 января 2015
	НаборЗаписей.Отбор.Период.Установить('20150101');
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
	
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20150101', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1);
	
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей.Очистить();
	
	// с 1 мая 2020
	НаборЗаписей.Отбор.Период.Установить('20200501');
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
	
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20200501', Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты, 1.25);
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

Процедура ОбновитьСведенияКоэффициентыСтавкиРефинансированияНБ2024() Экспорт

	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ.СоздатьНаборЗаписей();
	
	// с 1 января 2024
	НаборЗаписей.Отбор.Период.Установить('20240101');
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
	
	ДобавитьКоэффициентыСтавкиРефинансированияНБ(НаборЗаписей, '20240101', Перечисления.ВидыНалоговВзносовОтчислений.ОПВР, 1.25);
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли