
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект Цикл
		
		Если НЕ Строка.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок Тогда
			НайденнаяСтрока = ПроверяемыеРеквизиты.Найти("ВариантУчетаКадровыхПерестановок");
			Если НайденнаяСтрока <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(НайденнаяСтрока);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект Цикл
		
		Если Строка.РассчитыватьКоэффициентИндексацииВПределахКадровыхПерестановок И НЕ ЗначениеЗаполнено(Строка.ВариантУчетаКадровыхПерестановок) Тогда
			СообщениеОбОшибке = НСтр("ru = 'При установке признака ""Учитывать кадровые изменения"" необходимо указать ""Вариант учета кадровых перестановок""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		КонецЕсли;
		
		// периодичность регистра месяца, согласно разъяснениям расчет можно было производить раньше вступления Единых правил, в связи с чем в месяце вступления целиком позволяем рассчитать по новому
		ДатаИзмененияЕдиныхПравил2024 = НачалоМесяца(УчетСреднегоЗаработкаРК.ДатаИзмененияЕдиныхПравил2024());
		Если Строка.Период < ДатаИзмененияЕдиныхПравил2024 И ЗначениеЗаполнено(Строка.УчетРабочегоВремениДляСуммированногоУчета) Тогда
			СообщениеОбОшибке = НСтр("ru = 'Настройку ""Порядок учета рабочего времени (в периоде события для суммированного учета)"" необходимо заполнять с %1""'");
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОбОшибке, Формат(НачалоМесяца(ДатаИзмененияЕдиныхПравил2024), "ДЛФ=DD"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли