
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Если Параметры.Ключ = РегистрыСведений.КодыСтрокДекларацииПоИПНиСН.ПустойКлюч() Тогда
		Запись.Период = НачалоКвартала(ТекущаяДата());	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодСтрокиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПериодДекларации", Запись.Период);
	ПараметрыФормы.Вставить("КодСтроки", Запись.КодСтроки);
	ОткрытьФорму("РегистрСведений.КодыСтрокДекларацииПоИПНиСН.Форма.ПодборКодовСтрок", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КодСтрокиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запись.КодСтроки = ВыбранноеЗначение; 
КонецПроцедуры

#КонецОбласти
