#Область ПрограммныйИнтерфейс

#Область ФункцииОбщегоНазначения

// см. ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла()
Функция РазложитьПолноеИмяФайла(Знач ПолноеИмяФайла, ЭтоКаталог = Ложь) Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайла, ЭтоКаталог);
КонецФункции

// Формирует имя файла для выгрузки данных в формате JSON.
//
// Параметры:
//  ДополнительныеПараметры – Структура:
//   * СтруктураРеквизитовФормы – Структура, содержащая данные формы:
//       - мВыбраннаяФорма – Строка, полное имя формы регламентированной отчетности;
//       - мГод – Число или строка, указывающая год отчетности.
//
// Возвращаемое значение:
//  Строка – Сформированное имя файла
Функция СФормироватьИмяФайла_ВыгрузкаJSON(ДополнительныеПараметры) Экспорт

	ПолноеИмяФормы = ДополнительныеПараметры.СтруктураРеквизитовФормы.мВыбраннаяФорма;
	ПрефиксКодФормы = Прав(ПолноеИмяФормы, 7);
	ИмяФормыОтчетность1С = СтрЗаменить(ПолноеИмяФормы, ПрефиксКодФормы, "");
	ИмяФормыОтчетность1С = СтрЗаменить(ИмяФормыОтчетность1С, "Отчета", "");
	
	ИмяФайла = ИмяФормыОтчетность1С + "_"+ ПрефиксКодФормы + "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".json";
	
	Возврат ИмяФайла;

КонецФункции

// Формирует текстовое сообщение о сохранении файла выгрузки регламентированного отчета в формате JSON.
//
// Параметры:
//  СтруктураФайла – Структура:
//   * Имя – Строка, имя сформированного файла;
//   * Путь – Строка, путь к каталогу, в котором сохранен файл.
//
// Возвращаемое значение:
//  Строка – Текст сообщения вида:
//   "Файл выгрузки регламентированного отчета "<ИмяФайла>" сохранен в каталог "<Путь>"."
Функция СформироватьТекстСообщения_ВыгрузкаJSON(СтруктураФайла) Экспорт
	Возврат ПодставитьПараметрыВСтроку(НСтр("ru='Файл выгрузки регламентированного отчета ""%1"" сохранен в каталог ""%2"".'"),СтруктураФайла.Имя, СтруктураФайла.Путь);
КонецФункции

// см. СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку()
Функция ПодставитьПараметрыВСтроку(Знач ШаблонСтроки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки, Параметр1, Параметр2, Параметр3, 
																	Параметр4, Параметр5, Параметр6,
	 																Параметр7, Параметр8, Параметр9);
	
КонецФункции
																
#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
