#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		НалогообложениеНачислений.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.Дивиденды");
		РедактированиеПериодическихСведений.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	КонецЕсли;
	
	Элементы.НалогообложениеНачисленийВидДохода.СписокВыбора.ЗагрузитьЗначения(Справочники.ВидыДоходов.ВидыДивидендов());
	
	ПроинициализироватьФорму();
	ПолучитьПризнакиУчета(НалогообложениеНачислений.ВидДохода);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьСпособовОблажения();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНалогообложениеНачислений(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПараметрыЗаписи.Свойство("ПроверкаПередЗаписьюВыполнена") Тогда 
		Отказ = Истина;
		ЗаписатьНаКлиенте(Ложь);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ВедущийОбъект = Источник;
	РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(ЭтаФорма, ВедущийОбъект, ИмяСобытия, Параметр, Источник);
	Если Параметры.Свойство("ИмяРегистра") И Параметр.ИмяРегистра = "НалогообложениеНачислений" Тогда
		ПолучитьПризнакиУчета(НалогообложениеНачислений.ВидДохода);
		ОбновитьВидимостьСпособовОблажения();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область НалогооблажениеНачислений

&НаКлиенте
Процедура НалогообложениеНачисленийСпособОбложенияИПНПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПНПриИзменении(Элемент)
	ОбновитьВидимостьСпособовОблажения();
	ОбновитьОтображениеПолейВводаНалогооблаженияНачислений();
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНачисленийПериодПриИзменении(Элемент)
	НалогообложениеНачислений.Период = НачалоМесяца(НалогообложениеНачислений.Период);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактированиеИсторииНалогооблажениеНачислений(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СотрудникиКлиент.ОткрытьФормуРедактированияИстории("НалогообложениеНачислений", Объект.Ссылка, ЭтаФорма);
	Иначе
		ТекстСообщения = Нстр("ru = 'Необходимо записать вид дивидендов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроинициализироватьФорму()
	
	Если ЭтаФорма.НалогообложениеНачисленийПрежняя = Неопределено Тогда
		РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачисленийПрежняя.Период) Тогда
		// нет записей в регистре, нужно записать элемент
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПризнакиУчета(ВидДохода)
	
	НалогообложениеНачисленийУчитыватьИПН	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДохода, "УчитыватьИПН");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпособНалогообложенияПоУмолчанию()
	
	ПолучитьПризнакиУчета(НалогообложениеНачислений.ВидДохода);
	
	НалогообложениеНачислений.СпособОбложенияИПН	= ?(НалогообложениеНачисленийУчитыватьИПН, ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом"), Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьСпособовОблажения()
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачислений.ВидДохода) Тогда
		 ЭтаФорма.НалогообложениеНачислений.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.Дивиденды");
		 УстановитьСпособНалогообложенияПоУмолчанию();
	КонецЕсли;
	 
	НеОблагаетсяЧастично = ПредопределенноеЗначение("Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично"); 
	
	Элементы.НалогообложениеНачисленийДоходНеПодлежащийНалогообложениюИПН.Видимость		= НалогообложениеНачислений.СпособОбложенияИПН	= НеОблагаетсяЧастично;
	
	Элементы.НалогообложениеНачисленийСпособОбложенияИПН.Доступность	= НалогообложениеНачисленийУчитыватьИПН;
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачислений.Период) Тогда
		 ЭтаФорма.НалогообложениеНачислений.Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНалогообложениеНачислений(ТекущийОбъект)
	
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "НалогообложениеНачислений", ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПолейВводаНалогооблаженияНачислений()
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтаФорма, "НалогообложениеНачислений", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте(ЗакрытьПослеЗаписи) 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтаФорма.НалогообложениеНачисленийПрежняя.Период) Тогда
			 ЭтаФорма.НалогообложениеНачисленийНоваяЗапись = Истина;
		КонецЕсли;
		
		Если НЕ НалогообложениеНачисленийНоваяЗапись Тогда
			
			ИзменилсяПериод = (ЭтаФорма.НалогообложениеНачислений.Период <> ЭтаФорма.НалогообложениеНачисленийПрежняя.Период);
			ИзменилисьДанные = Ложь;
			Для Каждого Поле Из ЭтаФорма.НалогообложениеНачисленийПрежняя Цикл
				Если Поле.Ключ = "Период" Тогда
					Продолжить;
				КонецЕсли;
				ИзменилисьДанные = НалогообложениеНачислений[Поле.Ключ] <> Поле.Значение;
				Если ИзменилисьДанные Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ИзменилисьДанные ИЛИ ИзменилсяПериод Тогда
				ОткрытьФормуПредупрежденияОбИзмененииНалогообложения(ЗакрытьПослеЗаписи);	
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура("ПроверкаПередЗаписьюВыполнена", Истина);
	Если Записать(ПараметрыЗаписи) И ЗакрытьПослеЗаписи Тогда 
		Закрыть();
	Иначе
		Если НалогообложениеНачисленийНоваяЗапись Тогда
			 ЭтаФорма.НалогообложениеНачисленийНоваяЗапись = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПредупрежденияОбИзмененииНалогообложения(ЗакрытьПослеИсправления = Истина, ЗаписатьДанные = Истина)
	
	ТекстКнопкиДа = НСтр("ru = 'Изменились настройки'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При редактировании Вы изменили настройки налогообложения вида дивидендов. 
					|Если Вы исправили прежнюю запись (она была ошибочной), нажмите ""Исправлена ошибка"".
					|Если у элемента изменился вид дохода с %1, нажмите ""%2""'"), 
			Формат(НалогообложениеНачислений.Период, "ДФ='д ММММ гггг ""г""'"),
			ТекстКнопкиДа);
			
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеИсправления", ЗакрытьПослеИсправления);
	ДополнительныеПараметры.Вставить("ЗаписатьДанные", ЗаписатьДанные);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуПредупрежденияОИзмененииНалогообложенияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтотОбъект, "НалогообложениеНачислений", ТекстВопроса, ТекстКнопкиДа, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПредупрежденияОИзмененииНалогообложенияЗавершение(Отказ, ДополнительныеПараметры) Экспорт 

	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ НалогообложениеНачисленийНоваяЗапись Тогда
		
		ЗаписатьНалогообложениеНачислений(Объект.Ссылка);

		НалогообложениеНачисленийСтруктура = Новый Структура;
		
		Для Каждого Поле Из ЭтаФорма.НалогообложениеНачисленийПрежняя Цикл
			НалогообложениеНачисленийСтруктура.Вставить(Поле.Ключ, НалогообложениеНачислений[Поле.Ключ]);
		КонецЦикла;
		
		 ЭтаФорма.НалогообложениеНачисленийПрежняя = Новый ФиксированнаяСтруктура(НалогообложениеНачисленийСтруктура);
		
	КонецЕсли;
	
	ОбновитьВидимостьСпособовОблажения();
	
	Если ДополнительныеПараметры.ЗаписатьДанные Тогда 
		ЗаписатьНаКлиенте(ДополнительныеПараметры.ЗакрытьПослеИсправления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаКлиенте(Истина);
КонецПроцедуры

#КонецОбласти
