#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = Перечисления.СостоянияСогласования.Отклонено Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период заявки'"), ЭтотОбъект, "ДатаНачала",, Отказ);
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
	КонецЕсли;
	
	ОбучениеРазвитие.ПроверитьТабличнуюЧастьСотрудниковНаДублиФизическихЛиц(ЭтотОбъект, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПоМероприятиюОбучения(ДанныеЗаполнения);
	ЗаполнитьПоЗаявкеНаВключениеВПланОбучения(ДанныеЗаполнения);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоМероприятиюОбучения(МероприятиеСсылка)
	
	Если ТипЗнч(МероприятиеСсылка) <> Тип("СправочникСсылка.МероприятияОбученияРазвития") Тогда
		Возврат;
	КонецЕсли;

	СтоимостьМероприятия = Неопределено;
	СпособОпределенияСтоимости = Неопределено;
	
	Мероприятие = МероприятиеСсылка;
	Если ЗначениеЗаполнено(Мероприятие) Тогда
		ДанныеМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, "Стоимость, СпособОпределенияСтоимости");
		СтоимостьМероприятия = ДанныеМероприятия.Стоимость;
		СпособОпределенияСтоимости = ДанныеМероприятия.СпособОпределенияСтоимости;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов();
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкеНаВключениеВПланОбучения(ЗаявкаСсылка)
	
	Если ТипЗнч(ЗаявкаСсылка) <> Тип("ДокументСсылка.ЗаявкаНаВключениеВПланОбучения") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаявкаОбъект, "Подразделение, ДатаНачала, ДатаОкончания, Комментарий");
	Сотрудники.Загрузить(ЗаявкаОбъект.Сотрудники.Выгрузить());
	Расходы.Загрузить(ЗаявкаОбъект.Расходы.Выгрузить());

	ЗаполнитьПоМероприятиюОбучения(ЗаявкаОбъект.Мероприятие);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда // Заполнение по данным плана.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Подразделение, ДатаНачала, ДатаОкончания");
	
	Сотрудники.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Сотрудники, 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Сотрудники", Новый Массив), "Сотрудник");

	ЗаполнитьПоМероприятиюОбучения(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Мероприятие"));
	
КонецПроцедуры

Процедура ЗаполнитьСуммуРасходов()
	СуммаРасходов = ОбучениеРазвитиеКлиентСервер.СуммаРасходовНаОбучение(
		ОбучениеРазвитиеКлиентСервер.СтоимостьМероприятия(СтоимостьМероприятия, СпособОпределенияСтоимости, Сотрудники.Количество()), 
		Расходы);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли