#Область СлужебныйПрограммныйИнтерфейс

// См. Справочники.ЛичныеДанныеКандидатов.ЛичныеДанныеКандидатаФизическогоЛица
Функция ЛичныеДанныеКандидатаФизическогоЛица(ФизическоеЛицо) Экспорт
	Возврат ПодборПерсонала.ЛичныеДанныеКандидатаФизическогоЛица(ФизическоеЛицо);
КонецФункции

Функция ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПанельНастроекУправлениеПерсоналом

Процедура ЗаписатьНастройкиПодбораПерсонала(УникальныйИдентификаторФормы, НастройкиПодбораПерсонала) Экспорт
	
	ПараметрыНастроек = Обработки.ПанельНастроекУправлениеПерсоналом.ЗаполнитьСтруктуруПараметровНастроек("НастройкиПодбораПерсонала");
	ПараметрыНастроек.НастройкиПодбораПерсонала = НастройкиПодбораПерсонала;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификаторФормы);
	Обработки.ПанельНастроекУправлениеПерсоналом.ЗаписатьНастройки(ПараметрыНастроек, АдресХранилища);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Функция ЗапуститьИзменениеНастроекКонтроляПДнВФоновомЗадании(Знач ИдентификаторФормы, Знач ИспользоватьСкрытиеПерсональныхДанных) Экспорт
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ИспользоватьСкрытиеПерсональныхДанных", ИспользоватьСкрытиеПерсональныхДанных);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Изменение настроек контроля персональных данных'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("ЗащитаПерсональныхДанных.ИзменитьНастройкиСкрытияПерсональныхДанных", ПараметрыМетода, ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти

Функция ДлительнаяОперацияЗаполненияСчетчиковКандидатовПоВакансии(Вакансия, ТолькоКандидатыВРаботе, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение информационной строки по кандидатам'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"Справочники.Вакансии.ИнформационнаяСтрокаКандидатовПоВакансии", Вакансия, ТолькоКандидатыВРаботе);	
	
КонецФункции

Функция ДлительнаяОперацияЗаполненияЗанятостиПоВакансии(Вакансия, УникальныйИдентификатор) Экспорт
	Возврат ДлительнаяОперацияЗаполненияЗанятостиПоДаннымВакансии(
		Справочники.Вакансии.ДанныеВакансии(Вакансия), УникальныйИдентификатор);
КонецФункции

Функция ДлительнаяОперацияЗаполненияЗанятостиПоДаннымВакансии(ДанныеВакансии, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение информационной строки занятости по вакансии'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Справочники.Вакансии.ИнформационнаяСтрокаЗанятостиПоДаннымВакансии", ДанныеВакансии);

КонецФункции

Функция ПолучитьКурсВалюты(Валюта) Экспорт
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ТекущаяДатаСеанса());
КонецФункции

Функция ПараметрыПоискаПохожихКандидатов() Экспорт
	Возврат ПодборПерсоналаФормы.ПараметрыПоискаПохожихКандидатов();
КонецФункции

Функция ПодобратьПохожихКандидатов(ПараметрыПоискаКандидатов, ИсключитьСвязанныхСФизЛицами = Ложь) Экспорт
	Возврат ПодборПерсоналаФормы.ПодобратьПохожихКандидатов(ПараметрыПоискаКандидатов, ИсключитьСвязанныхСФизЛицами);
КонецФункции

Функция ШрифтыЦветаСовпадающихДанных() Экспорт
	
	ШрифтыЦвета = Новый Структура;
	ШрифтыЦвета.Вставить("ОбычныйЦветФона", ЦветаСтиля.ЦветФонаФормы);
	ШрифтыЦвета.Вставить("СовпадающиеДанныеЦветФонаГруппы", ЦветаСтиля.ЦветФонаПредупреждения);
	ШрифтыЦвета.Вставить("ОбычныйШрифтТекста", ШрифтыСтиля.ОбычныйШрифтТекста);
	ШрифтыЦвета.Вставить("СовпадающиеДанныеШрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	
	Возврат ШрифтыЦвета;
	
КонецФункции

Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, ЗначениеКонстанты) Экспорт
	
	НачатьТранзакцию();
	Попытка
		КонстантаМенеджер = Константы[ИмяКонстанты];
		ТекущееЗначение  = КонстантаМенеджер.Получить();
		Если ТекущееЗначение <> ЗначениеКонстанты Тогда
			КонстантаМенеджер.Установить(ЗначениеКонстанты);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// См. Перечисления.ЭтапыРаботыСКандидатами.СведенияОбЭтапах
Функция СведенияОбЭтапах(ЭтапыРаботы) Экспорт
	Возврат Перечисления.ЭтапыРаботыСКандидатами.СведенияОбЭтапах(ЭтапыРаботы);
КонецФункции

Функция ЭтапРаботыМожноУдалить(ЭтапРаботы) Экспорт
	Возврат Перечисления.ЭтапыРаботыСКандидатами.Действующие().Найти(ЭтапРаботы) = Неопределено;
КонецФункции

Функция ЭтапКандидатаПоНавигационнойСсылке(НавигационнаяСсылка) Экспорт
	Возврат ПодборПерсоналаФормы.ЭтапКандидатаПоНавигационнойСсылке(НавигационнаяСсылка);
КонецФункции

#КонецОбласти