////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дистанционная работа"
// Серверные процедуры и функции форм документов.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура СотрудникиОбновитьЭлементыФормы(Форма) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	ЗаполнитьТекущийВидДоговораПредставление(Форма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ТекущийВидДоговора",
		"Видимость",
		ЗначениеЗаполнено(Форма.ТекущийВидДоговора));
	
КонецПроцедуры

Процедура ДобавитьВМассивСоздаваемыеРеквизитыФормыСотрудника(МассивДобавляемыхРеквизитов) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РаботаетДистанционно", Новый ОписаниеТипов("Булево"), , НСтр("ru='Дистанционная работа'"), Ложь));
	// ЗУПК
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("РежимДистанционнойРаботы", Новый ОписаниеТипов("ПеречислениеСсылка.РежимыДистанционнойРаботы"), , НСтр("ru='Режим дистанционной работа'"), Ложь));
	// ЗУПК
	
	Для Каждого ДобавляемыйРеквизит Из МассивДобавляемыхРеквизитов Цикл
		Если ДобавляемыйРеквизит.Имя = "ТекущийВидДоговора" Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТекущийВидДоговора", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровССотрудниками"), , НСтр("ru='Вид договора'"), Ложь));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТекущийВидДоговораПредставление", Новый ОписаниеТипов("Строка"), , НСтр("ru='Вид договора'"), Ложь));
	
КонецПроцедуры

Процедура ДобавитьКлючиСтруктурыТекущихКадровыхДанныхСотрудника(КлючиСтруктурыТекущихКадровыхДанныхСотрудника, НуженВидДоговора = Истина) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	// ЗУПК
	КлючиСтруктурыТекущихКадровыхДанныхСотрудника = КлючиСтруктурыТекущихКадровыхДанныхСотрудника + ",РаботаетДистанционно,РежимДистанционнойРаботы";
	// ЗУПК
	
	НуженВидДоговора = НуженВидДоговора
						И СтрНайти(КлючиСтруктурыТекущихКадровыхДанныхСотрудника, "ТекущийВидДоговора") = 0;
	
	Если НуженВидДоговора Тогда
		КлючиСтруктурыТекущихКадровыхДанныхСотрудника = КлючиСтруктурыТекущихКадровыхДанныхСотрудника + ",ТекущийВидДоговора";
	КонецЕсли;
		
КонецПроцедуры

Процедура ФормаСотрудникаДобавитьЭлементыФормы(Форма) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	ЭлементГруппаТекущийВидДоговора = Форма.Элементы.Найти("ГруппаТекущийВидДоговора");
	Если ЭлементГруппаТекущийВидДоговора = Неопределено Тогда
		
		ЭлементГруппаТекущийВидДоговора = Форма.Элементы.Вставить("ГруппаТекущийВидДоговора", Тип("ГруппаФормы"),
			Форма.Элементы.РабочееМесто, Форма.Элементы.ГруппаСостояниеСотрудника);
		ЭлементГруппаТекущийВидДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаТекущийВидДоговора.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппаТекущийВидДоговора.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаТекущийВидДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("ТекущийВидДоговора");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить("ТекущийВидДоговора", Тип("ПолеФормы"), ЭлементГруппаТекущийВидДоговора);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.МаксимальнаяШирина = 30;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.ПутьКДанным = "ТекущийВидДоговораПредставление";
	КонецЕсли;
	
	СотрудникиОбновитьЭлементыФормы(Форма);
	
КонецПроцедуры

Процедура ПриемНаРаботуДополнитьФорму(Форма) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	ЭлементПраваяОбъединеннаяГруппа = Форма.Элементы.Найти("ПраваяОбъединеннаяГруппа");
	Если ЭлементПраваяОбъединеннаяГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// ЗУПК
	//Элемент = Форма.Элементы.Найти("РаботаетДистанционно");
	//Если Элемент = Неопределено Тогда
	//	Элемент = Форма.Элементы.Вставить("РаботаетДистанционно", Тип("ПолеФормы"), ЭлементПраваяОбъединеннаяГруппа,
	//		Форма.Элементы.ГруппаНадписьПраваНаОтпуск);
	//	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	//	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	//	Элемент.ПутьКДанным = "Объект.РаботаетДистанционно";
	//	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РаботаетДистанционноПриИзменении");
	//КонецЕсли;
	// ЗУПК
	
	Элемент = Форма.Элементы.Найти("РежимДистанционнойРаботы");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("РежимДистанционнойРаботы", Тип("ПолеФормы"), ЭлементПраваяОбъединеннаяГруппа,
			Форма.Элементы.ГруппаНадписьПраваНаОтпуск);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.РежимДистанционнойРаботы";
		Элемент.ПодсказкаВвода = НСтр("ru = 'Работа по месту нахождения работодателя'");
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РежимДистанционнойРаботыПриИзменении");
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьДистанционнуюРаботуРабочегоМеста(Форма) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Если Не Объект.ИзменитьДистанционнуюРаботу Тогда
			Объект.РаботаетДистанционно = Форма.ТекущаяДистанционнаяРабота;
			// ЗУПК
			Объект.РежимДистанционнойРаботы = Форма.ТекущийРежимДистанционнойРаботы;
			// ЗУПК
		КонецЕсли;
	Иначе
		Если Не Объект.ИзменитьДистанционнуюРаботу Тогда
			Объект.РаботаетДистанционно = Ложь;
			// ЗУПК
			Объект.РежимДистанционнойРаботы = Неопределено;
			// ЗУПК
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоляОтбораПериодическихДанных(ПоляОтбораПериодическихДанных, Отбор) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	ПоляОтбораПериодическихДанных.Вставить("ДистанционнаяРаботаСотрудников", Отбор);
	
КонецПроцедуры

Процедура УстановитьТекущуюДистанционнуюРаботу(Форма, ТекущиеКадровыеДанные = Неопределено) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	Форма.ТекущаяДистанционнаяРабота = ?(ТекущиеКадровыеДанные = Неопределено, Ложь, ТекущиеКадровыеДанные.РаботаетДистанционно);
	// ЗУПК
	Форма.ТекущийРежимДистанционнойРаботы = ?(ТекущиеКадровыеДанные = Неопределено, Ложь, ТекущиеКадровыеДанные.РежимДистанционнойРаботы);
	// ЗУПК
	
КонецПроцедуры

Процедура КадровыйПереводУстановитьДоступностьЭлементовИзмененияДанныхСотрудника(Форма) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ИзменитьДистанционнуюРаботу",
		"Доступность",
		ЗначениеЗаполнено(Форма.Объект.Сотрудник));
		
КонецПроцедуры

Процедура КадровыйПереводДополнитьФорму(Форма, ДобавлятьЭлементыФормы = Истина, ДобавлятьРеквизитыФормы = Истина, ОтложенноеИзменение = Ложь) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	ЭлементПозицияГруппа = Форма.Элементы.Найти("ПозицияГруппа");
	Если ЭлементПозицияГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ДобавлятьРеквизитыФормы Тогда
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТекущаяДистанционнаяРабота", Новый ОписаниеТипов("Булево")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТекущийРежимДистанционнойРаботы", Новый ОписаниеТипов("ПеречислениеСсылка.РежимыДистанционнойРаботы")));
		
		МассивИменРеквизитовФормы = Новый Массив;
		ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
		ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы,, ОтложенноеИзменение);
		
	КонецЕсли;
	
	ЭлементДистанционнаяРаботаГруппа = Форма.Элементы.Найти("ДистанционнаяРаботаГруппа");
	Если ЭлементДистанционнаяРаботаГруппа = Неопределено Тогда
		
		ЭлементДистанционнаяРаботаГруппа = Форма.Элементы.Вставить("ДистанционнаяРаботаГруппа", Тип("ГруппаФормы"),
			ЭлементПозицияГруппа, Форма.Элементы.ТерриторияГруппа);
		ЭлементДистанционнаяРаботаГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементДистанционнаяРаботаГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементДистанционнаяРаботаГруппа.ОтображатьЗаголовок = Ложь;
		ЭлементДистанционнаяРаботаГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("ИзменитьДистанционнуюРаботу");
	Если Элемент = Неопределено Тогда
		
		Элемент = Форма.Элементы.Вставить("ИзменитьДистанционнуюРаботу", Тип("ПолеФормы"), ЭлементДистанционнаяРаботаГруппа);
		// ЗУПК
		Элемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
		// ЗУПК
		Элемент.Вид = ВидПоляФормы.ПолеФлажка;
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элемент.ПутьКДанным = "Объект.ИзменитьДистанционнуюРаботу";
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ИзменитьДистанционнуюРаботуПриИзменении");
		
	КонецЕсли;
	
	// ЗУПК
	//Элемент = Форма.Элементы.Найти("РаботаетДистанционно");
	//Если Элемент = Неопределено Тогда
	//	
	//	Элемент = Форма.Элементы.Вставить("РаботаетДистанционно", Тип("ПолеФормы"), ЭлементДистанционнаяРаботаГруппа);
	//	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	//	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	//	Элемент.ПутьКДанным = "Объект.РаботаетДистанционно";
	//	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РаботаетДистанционноПриИзменении");
	//	
	//КонецЕсли;
	// ЗУПК
	
	// ЗУПК
	Элемент = Форма.Элементы.Найти("РежимДистанционнойРаботы");
	Если Элемент = Неопределено Тогда
		
		Элемент = Форма.Элементы.Вставить("РежимДистанционнойРаботы", Тип("ПолеФормы"), ЭлементДистанционнаяРаботаГруппа);
		Элемент.ПутьКДанным = "Объект.РежимДистанционнойРаботы";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПодсказкаВвода = НСтр("ru = 'Работа по месту нахождения работодателя'");
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РежимДистанционнойРаботыПриИзменении");
		
	КонецЕсли;
	// ЗУПК
	
КонецПроцедуры

Процедура КадровыйПереводСотрудникПриИзменении(Форма) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	
	Объект = Форма.Объект;
	
	Объект.ИзменитьДистанционнуюРаботу = Ложь;
	
КонецПроцедуры

Процедура КадровыйПереводИзменитьДистанционнуюРаботуПриИзменении(Форма) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	Объект = Форма.Объект;
	
	Если Не Объект.ИзменитьДистанционнуюРаботу Тогда
		Объект.РаботаетДистанционно = Форма.ТекущаяДистанционнаяРабота;
		// ЗУПК
		Объект.РежимДистанционнойРаботы = Форма.ТекущийРежимДистанционнойРаботы;
		// ЗУПК
	КонецЕсли;
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(Форма, Объект);
	
КонецПроцедуры

Процедура КадровыйДокументОбновитьРеквизитИКоманды(Форма, ЭтоПеревод = Ложь) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	Объект = Форма.Объект;
	
	ОбновитьКоманды = Ложь;
	ПрежнееЗначениеРаботаетДистанционно = Объект.РаботаетДистанционно;
	
	Если ЭтоПеревод Тогда
		ПрежнееЗначениеИзменитьДистанционнуюРаботу = Объект.ИзменитьДистанционнуюРаботу;
		
		Объект.ИзменитьДистанционнуюРаботу = (Объект.Сотрудники.НайтиСтроки(
			Новый Структура("ИзменитьДистанционнуюРаботу", Истина)).Количество() > 0);
		Объект.РаботаетДистанционно = (Объект.Сотрудники.НайтиСтроки(
			Новый Структура("ИзменитьДистанционнуюРаботу,РаботаетДистанционно", Истина, Истина)).Количество() > 0);
		ОбновитьКоманды = Не ПрежнееЗначениеИзменитьДистанционнуюРаботу = Объект.ИзменитьДистанционнуюРаботу 
					  Или Не ПрежнееЗначениеРаботаетДистанционно = Объект.РаботаетДистанционно;
	Иначе
		Объект.РаботаетДистанционно = (Объект.Сотрудники.НайтиСтроки(
			Новый Структура("РаботаетДистанционно", Истина)).Количество() > 0);
		ОбновитьКоманды = Не ПрежнееЗначениеРаботаетДистанционно = Объект.РаботаетДистанционно;
	КонецЕсли;
	
	Если ОбновитьКоманды Тогда
		ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(Форма, Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура КадровыйПереводДополнитьРасшифровкуСтрокиСотрудника(Форма, ИдентификаторСтрокиСотрудника, ТекстРасшифровки) Экспорт
	
	// ЗУПК
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
	//	Возврат;
	//КонецЕсли;
	// ЗУПК
	
	Объект = Форма.Объект;
	СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтрокиСотрудника);
	
	Если СтрокаСотрудника.ИзменитьДистанционнуюРаботу Тогда
		ТекстРасшифровки = ?(ПустаяСтрока(ТекстРасшифровки), "", ТекстРасшифровки + "; ") + НСтр("ru='Изменена дистанционная работа'");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТекущийВидДоговораПредставление(Форма)
	
	Если Форма.ТекущийВидДоговора = Перечисления.ВидыДоговоровССотрудниками.ПустаяСсылка() Тогда
		ТекущийВидДоговораПредставление = "";
	Иначе
		ТекущийВидДоговораПредставление = Строка(Форма.ТекущийВидДоговора);
		
		Если Форма.РаботаетДистанционно Тогда
			// ЗУПК
			//ТекущийВидДоговораПредставление = ТекущийВидДоговораПредставление + " " + НСтр("ru='(Дистанционная работа)'");
			ТекущийВидДоговораПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"), ТекущийВидДоговораПредставление, Строка(Форма.РежимДистанционнойРаботы));
			// ЗУПК
		КонецЕсли;
	КонецЕсли;
	
	Форма.ТекущийВидДоговораПредставление = ТекущийВидДоговораПредставление;
	
КонецПроцедуры

#КонецОбласти
