#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьРазмерыЛьготИПН();
	
КонецПроцедуры

Процедура ЗаполнитьРазмерыЛьготИПН() Экспорт
	
	НаборЗаписей = РегистрыСведений.РазмерыЛьготИПН.СоздатьНаборЗаписей();

	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20100101', "", 55);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20170101', "", 75);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерЛьготИПН(НаборЗаписей, Период, КатегорияЛицаПолучателяЛьготы, РазмерЛьготы)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.КатегорияЛицаПолучателяЛьготы = КатегорияЛицаПолучателяЛьготы;
	НоваяЗапись.Размер = РазмерЛьготы;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли