#Область СлужебныеПроцедурыИФункции

Функция ТипыЭлектронныхКурсов() Экспорт
	Возврат РазработкаЭлектронныхКурсовСлужебный.ТипыЭлектронныхКурсов();	
КонецФункции

// Порядок элементов

Процедура ПереместитьЭлемент(Направление, СсылкаНаЭлемент) Экспорт
	РазработкаЭлектронныхКурсовСлужебный.ПереместитьЭлемент(Направление, СсылкаНаЭлемент);
КонецПроцедуры

// Внешние программы

Функция ДвоичныеДанныеПрограммы(ИмяПрограммы) Экспорт
	Возврат РазработкаЭлектронныхКурсовСлужебный.ДвоичныеДанныеПрограммы(ИмяПрограммы)
КонецФункции

#КонецОбласти