
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Электронное взаимодействие с сервисами".
// ОбщийМодуль.ЭлектронноеВзаимодействиеССервисамиВызовСервера.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаКомпоненты

#Область ЭТД

// См. функцию ЭлектронноеВзаимодействиеССервисами.ПолучитьПараметрыКомпонентыЭТД
Функция ПолучитьПараметрыКомпонентыЭТД(БИНОпции, ДанныеКОтправке, ПараметрыКлюча = Неопределено) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ПолучитьПараметрыКомпонентыЭТД(БИНОпции, ДанныеКОтправке, ПараметрыКлюча);
КонецФункции

#КонецОбласти

#Область Отчетность1С

// См. функцию ЭлектронноеВзаимодействиеССервисами.ПолучитьПараметрыКомпонентыОтчетность1С
Функция ПолучитьПараметрыКомпонентыОтчетность1С(БИНОпции, ДанныеКОтправке, ПараметрыКлюча = Неопределено) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ПолучитьПараметрыКомпонентыОтчетность1С(БИНОпции, ДанныеКОтправке, ПараметрыКлюча);
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти