#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ НЕ УТ
	// ЗУПК
	СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// ЗУПК
	//-- НЕ УТ
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ НЕ УТ
	// ЗУПК
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	Возврат;
	// ЗУПК
	//-- НЕ УТ

	// УТК
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодМВД", "Заголовок", "");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокНастройкиОтбора", "Видимость", Ложь);
	
	ИсключаемыеЭлементы = Новый Массив;
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортСССР);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортМинморфлота);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ВременноеУдостоверениеВзаменВоенногоБилетаОфицераЗапаса);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.СправкаВзаменВоенногоБилета);
	ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеГражданинаПодлежащегоПризыву);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение = ИсключаемыеЭлементы;
	ЭлементОтбора.Использование = Истина;
    // УТК
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	//++ НЕ УТ
	// ЗУПК
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
	// ЗУПК
	//-- НЕ УТ
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	//++ НЕ УТ
	// ЗУПК
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	// ЗУПК
	//-- НЕ УТ
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
