#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru='Группы рабочих мест создаются автоматически'");
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.РабочиеМестаОхраныТруда") Тогда
		ИменаРеквизитов = "Владелец,
						  |Подразделение,
						  |Должность,
						  |ВАрхиве";
		СведенияОснования = ОхранаТруда.ЗначенияВзносовВредностиПФР(ДанныеЗаполнения, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияОснования);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		ИменаРеквизитов = "Владелец,
						  |Подразделение,
						  |Должность,
						  |Закрыта";
		СведенияОснования = ОхранаТруда.ЗначенияВзносовВредностиПФР(ДанныеЗаполнения, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СведенияОснования);
		ВАрхиве = СведенияОснования.Закрыта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ПорядковыйНомер = Справочники.РабочиеМестаОхраныТруда.МаксимальныйНомерРабочегоМеста(Владелец, Подразделение) + 1;
		Номер = Строка(ПорядковыйНомер);
		Наименование = ОхранаТруда.НаименованиеРабочегоМеста(Подразделение, Должность, Номер);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбъектКопирования.ЭтоГруппа Тогда
		ВызватьИсключение НСтр("ru='Группы рабочих мест создаются автоматически'");
	КонецЕсли;
	
	ПорядковыйНомер = Справочники.РабочиеМестаОхраныТруда.МаксимальныйНомерРабочегоМеста(Владелец, Подразделение) + 1;
	Номер = Строка(ПорядковыйНомер);
	Наименование = ОхранаТруда.НаименованиеРабочегоМеста(Подразделение, Должность, Номер);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗанятостьНомераРабочегоМеста();
	
	УстановитьПривилегированныйРежим(Истина);
	СоздатьГруппуРабочегоМеста();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоУсловиямТруда(УсловияТруда, ДанныеУсловийТруда = Неопределено) Экспорт
	
	Если ДанныеУсловийТруда = Неопределено Тогда
		ДанныеУсловийТруда = ОхранаТруда.ЗначенияВзносовВредностиПФР(УсловияТруда);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеУсловийТруда);
	
	СоответствуетУсловиямТруда = Истина;
	
КонецПроцедуры

Процедура ПроверитьЗанятостьНомераРабочегоМеста()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда")
		И Константы.КонтролироватьУникальностьНомеровРабочихМест.Получить() = Истина Тогда
		
		РезультатЗапроса =
			Справочники.РабочиеМестаОхраныТруда.РезультатЗанятостиНомераРабочегоМеста(Номер, Подразделение, Владелец, Ссылка);
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Номер %1 уже установлен в рабочем месте %2.'"), Выборка.Номер, Выборка.РабочееМесто);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьГруппуРабочегоМеста() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РабочиеМеста.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
		|ГДЕ
		|	РабочиеМеста.Владелец = &Владелец
		|	И РабочиеМеста.Подразделение = &Подразделение
		|	И РабочиеМеста.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Родитель = Справочники.РабочиеМестаОхраныТруда.ПолучитьСсылку();
		
		ГруппаРодитель = Справочники.РабочиеМестаОхраныТруда.СоздатьГруппу();
		ГруппаРодитель.Владелец = Владелец;
		ГруппаРодитель.Подразделение = Подразделение;
		ГруппаРодитель.Наименование = Строка(ГруппаРодитель.Подразделение);
		ГруппаРодитель.УстановитьСсылкуНового(Родитель);
		ГруппаРодитель.Записать();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Родитель = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли