#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДанныеВыбораБЗК.ЗаполнитьДляКлассификатораСПорядкомПоДопРеквизиту(
		Справочники.ВидыДокументовФизическихЛиц,
		ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
	// ЗУПК
	Если НЕ ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		
		ИсключаемыеЭлементы = Новый Массив;
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортСССР);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортСССР);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ПаспортМинморфлота);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеОфицера);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилетОфицераЗапаса);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.ВременноеУдостоверениеВзаменВоенногоБилетаОфицераЗапаса);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.СправкаВзаменВоенногоБилета);
		ИсключаемыеЭлементы.Добавить(Справочники.ВидыДокументовФизическихЛиц.УдостоверениеГражданинаПодлежащегоПризыву);
		
		Для каждого Элемент Из ИсключаемыеЭлементы Цикл
			НайденныйЭлемент = ДанныеВыбора.НайтиПоЗначению(Элемент);
			Если НайденныйЭлемент <> Неопределено Тогда
				ДанныеВыбора.Удалить(НайденныйЭлемент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	// ЗУПК
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли