
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредоставлятьВычет = Ложь;
	НеПредоставлятьВычет = Истина;
	ПрекращатьНеиспользуемыеВычеты = Истина;
	ПодготовитьФормуНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОбработкиПриИзменении(Элемент)
	
	Если ВариантОбработки = 2 Тогда
		Элементы.ПрекращатьНеиспользуемыеВычеты.Видимость = Истина;
		Элементы.ТаблицаСоответствияВычетов.Видимость = Истина;
		Элементы.ДобавляемыеВычеты.Видимость = Ложь;
		Элементы.ДекорацияЗамены.Видимость = Истина;
		Элементы.ДекорацияФормирования.Видимость = Ложь;
		ДобавляемыеВычеты.Очистить();
	Иначе
		Элементы.ПрекращатьНеиспользуемыеВычеты.Видимость = Ложь;
		Элементы.ТаблицаСоответствияВычетов.Видимость = Ложь;
		Элементы.ДобавляемыеВычеты.Видимость = Истина;
		Элементы.ДекорацияЗамены.Видимость = Ложь;
		Элементы.ДекорацияФормирования.Видимость = Истина;
		ТаблицаСоответствияВычетов.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.Период", "ПериодСтрокой", Модифицированность);
	КонтрольМесяца();	
	ДобавляемыеВычеты.Очистить();
	ТаблицаСоответствияВычетов.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.Период", "ПериодСтрокой", , Оповещение);
	ДобавляемыеВычеты.Очистить();
	ТаблицаСоответствияВычетов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт 
	
	Если НЕ ЗначениеВыбрано Тогда
		Возврат;	
	КонецЕсли;
	
	КонтрольМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.Период", "ПериодСтрокой", Направление, Модифицированность);
	КонтрольМесяца();
	ДобавляемыеВычеты.Очистить();
	ТаблицаСоответствияВычетов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	КонтрольМесяца();

КонецПроцедуры

&НаКлиенте
Процедура ДобавляемыеВычетыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ДобавляемыеВычеты.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидВычета) И ДобавляемыеВычеты.НайтиСтроки(Новый Структура("ВидВычета", ТекущиеДанные.ВидВычета)).Количество() > 1 Тогда
		Если ОтменаРедактирования Тогда
			ТекущиеДанные.ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.ПустаяСсылка");
		Иначе
			ТекстСообщения = НСтр("ru = 'В строке повторно указан вид вычета.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "ДобавляемыеВычеты", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствияВычетовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ТаблицаСоответствияВычетов.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВычетДо) И ТаблицаСоответствияВычетов.НайтиСтроки(Новый Структура("ВычетДо", ТекущиеДанные.ВычетДо)).Количество() > 1 Тогда
		Если ОтменаРедактирования Тогда
			ТекущиеДанные.ВычетДо = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.ПустаяСсылка");
		Иначе
			ТекстСообщения = НСтр("ru = 'В строке повторно указан вид вычета(до изменения).'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "ТаблицаСоответствияВычетов", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СотрудникиСуществующийДокумент" Тогда
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.СуществующийДокумент) Тогда
			ПоказатьЗначение(, ТекущиеДанные.СуществующийДокумент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	ТекущийКлюч = Неопределено;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Сотрудник",ТекущиеДанные.Сотрудник);
		
		ОтборПоСотруднику = Новый ФиксированнаяСтруктура(СтруктураОтбора);
		Элементы.Вычеты.ОтборСтрок = ОтборПоСотруднику; 
		Элементы.Вычеты.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередНачаломИзменения(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.СуществующийДокумент) 
			И Элемент.ТекущийЭлемент.Имя = "СотрудникиОтметка" Тогда 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВычеты

&НаКлиенте
Процедура ВычетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле.ГиперссылкаЯчейки И ЗначениеЗаполнено(ТекущиеДанные.Расшифровка) Тогда
		РедактированиеГрафикиВычетов(ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные.ПредоставлятьВычет = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	СуществующийОтбор = Элементы.Вычеты.ОтборСтрок;
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СуществующийОтбор);

	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидВычета) И Вычеты.НайтиСтроки(Новый Структура("ВидВычета, Сотрудник", ТекущиеДанные.ВидВычета, ТекущиеДанные.Сотрудник)).Количество() > 1 Тогда
		Если ОтменаРедактирования Тогда
			ТекущиеДанные.ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.ПустаяСсылка");
		Иначе
			ТекстСообщения = НСтр("ru = 'В строке повторно указан вид вычета.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Вычеты", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыВидВычетаПриИзменении(Элемент)
	
	ТекущиеДанныеСотрудника = Элементы.Сотрудники.ТекущиеДанные;
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Отказ = Ложь;
	
	ТекущиеДанные.ВидДохода = ПолучитьВидДохода(Объект.Период, ТекущиеДанные.ВидВычета);
	
	ЗаполнитьРасшифровкуВСтроке(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСформированныеДокументы

&НаКлиенте
Процедура СформированныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СформированныеДокументы.ТекущиеДанные;

	Если Поле.Имя = "СформированныеДокументыДокумент" Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Документ) Тогда
			ПоказатьЗначение(, ТекущиеДанные.Документ);
		КонецЕсли;
	КонецЕсли;
		
	Если Поле.Имя = "СформированныеДокументыПодробнее" И ЗначениеЗаполнено(ТекущиеДанные.Подробнее) Тогда
		ПоказатьОшибки(ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)

	ОчиститьСообщения();
	
	Шаг = Прав(Элементы.ГруппаСтраницыЭтапов.ТекущаяСтраница.Имя,2);
	Шаг = Число(Шаг);
		
	Шаг = Шаг - 1;
	
	Элементы.Назад.Доступность = Шаг > 1;
	Элементы.Далее.Доступность = Шаг < 3;
	Элементы.ВНачало.Доступность = Шаг = 3;
	
	Шаг = Формат(Шаг,"ЧЦ=2; ЧВН=");
	
	Для каждого СтрокаСтраниц Из Элементы.ГруппаСтраницыЭтапов.ПодчиненныеЭлементы Цикл
		
		НомерСтраницы = Прав(СтрокаСтраниц.Имя,2);
		
		Если Шаг = НомерСтраницы Тогда 
			Элементы.ГруппаСтраницыЭтапов.ТекущаяСтраница = СтрокаСтраниц; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
		
	Шаг = Прав(Элементы.ГруппаСтраницыЭтапов.ТекущаяСтраница.Имя,2);
	Шаг = Число(Шаг);
	
	ТекущийШаг = Шаг;
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеДанных(ТекущийШаг, Отказ);
	
	Если Не Отказ Тогда
		ВыполнитьШаг(ТекущийШаг,Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Шаг = Шаг + 1;
	
	Элементы.Назад.Доступность = Шаг > 1 И Шаг <> 3;
	Элементы.Далее.Доступность = Шаг < 3;
	Элементы.ВНачало.Доступность = Шаг = 3;
	
	Шаг = Формат(Шаг,"ЧЦ=2; ЧВН=");
	
	Для каждого СтрокаСтраниц Из Элементы.ГруппаСтраницыЭтапов.ПодчиненныеЭлементы Цикл
		
		НомерСтраницы = Прав(СтрокаСтраниц.Имя,2);
		
		Если Шаг = НомерСтраницы Тогда 
			Элементы.ГруппаСтраницыЭтапов.ТекущаяСтраница = СтрокаСтраниц; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВНачало(Команда)
	
	ОчиститьСообщения();
	
	Шаг = 1;
	
	Элементы.Назад.Доступность = Шаг > 1;
	Элементы.Далее.Доступность = Шаг < 3;
	Элементы.ВНачало.Доступность = Шаг = 3;
	
	Шаг = Формат(Шаг,"ЧЦ=2; ЧВН=");
	
	Для каждого СтрокаСтраниц Из Элементы.ГруппаСтраницыЭтапов.ПодчиненныеЭлементы Цикл
		
		НомерСтраницы = Прав(СтрокаСтраниц.Имя,2);
		
		Если Шаг = НомерСтраницы Тогда 
			Элементы.ГруппаСтраницыЭтапов.ТекущаяСтраница = СтрокаСтраниц; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыборВсех(Команда)
	
	Для Каждого СтрокаТЧ Из Сотрудники Цикл
		СтрокаТЧ.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыборВсех(Команда)
	
	Для Каждого СтрокаТЧ Из Сотрудники Цикл
		СтрокаТЧ.Отметка = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьЗаполнениеДанных(Шаг, Отказ)
	
	Если Шаг = 1 Тогда // Шаг 1
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнена организация.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"Объект.Организация",Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВариантОбработки) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен вариант обработки.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"ВариантОбработки",Отказ); 			
		КонецЕсли;
		
		Для каждого СтрокаВычет Из ДобавляемыеВычеты Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаВычет.ВидВычета) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен вид вычета.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"ДобавляемыеВычеты",Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого СтрокаВычет Из ТаблицаСоответствияВычетов Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаВычет.ВычетПосле) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен вид вычета.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"ТаблицаСоответствияВычетов",Отказ);
				Прервать;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаВычет.ВычетДо) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен вид вычета.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"ТаблицаСоответствияВычетов",Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Шаг = 2 Тогда

		Для каждого СтрокаВычет Из Вычеты Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаВычет.ВидВычета) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнен вид вычета у %2.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаВычет.Сотрудник);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"Вычеты",Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьШаг(ТекущийШаг, Отказ)
	
	Если ТекущийШаг = 1 И ВариантОбработки = 1 Тогда
		
		Элементы.ВычетыСуществующийДокумент.Видимость = Ложь;
		Элементы.ВычетыПредоставлятьВычет.Видимость = Ложь;
		Элементы.ВычетыКомментарий.Видимость = Ложь;
		
		ПолучитьДанныеДляФормированияЗаявлений(Отказ);
		
	ИначеЕсли ТекущийШаг = 1 И ВариантОбработки = 2 Тогда
		
		Элементы.ВычетыСуществующийДокумент.Видимость = Истина;
		Элементы.ВычетыПредоставлятьВычет.Видимость = Истина;
		Элементы.ВычетыКомментарий.Видимость = Истина;
		
		ПолучитьДанныеДляЗаменыЗаявлений();
		
	ИначеЕсли ТекущийШаг = 2 И ВариантОбработки = 1 Тогда
		
		СформироватьДокументыЗаявлений(Отказ);     
		
	ИначеЕсли ТекущийШаг = 2 И ВариантОбработки = 2 Тогда 
		
		СформироватьДокументыЗаявленийЗамены(Отказ); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДляФормированияЗаявлений(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодСреза", Объект.Период);
	Запрос.УстановитьПараметр("ПустаяДата",  '00010101');
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Объект.Организация);
	Отборы = Новый Массив;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		Отборы, "Организация", "=", Объект.Организация);
	
	КадровыйУчет.СоздатьВТТекущиеКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, Отборы, "Организация" );
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СтатусФизическихЛицКакНалогоплательщиковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_ФизическиеЛица
		|ИЗ
		|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
		|			&ПериодСреза,
		|			Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
		|				И ФизическоеЛицо В
		|					(ВЫБРАТЬ
		|						ВТТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
		|					ИЗ
		|						ВТТекущиеКадровыеДанныеСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТТекущиеКадровыеДанныеСотрудников
		|";
	
	Запрос.Выполнить();
	
	Если ГоловнаяОрганизация = Объект.Организация Тогда
		
		Отборы = Новый Массив;
		
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			Отборы, "ОформленПоТрудовомуДоговору", "=", Ложь);
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			Отборы, "ГоловнаяОрганизация", "=", ГоловнаяОрганизация);
		
		КадровыйУчет.СоздатьВТТекущиеКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, Отборы, "ОформленПоТрудовомуДоговору" );
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СтатусФизическихЛицКакНалогоплательщиковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТ_ГПХ
			|ИЗ
			|	РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.СрезПоследних(
			|			&ПериодСреза,
			|			Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Резидент)
			|				И ФизическоеЛицо В
			|					(ВЫБРАТЬ
			|						ВТТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
			|					ИЗ
			|						ВТТекущиеКадровыеДанныеСотрудников)) КАК СтатусФизическихЛицКакНалогоплательщиковСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВТ_ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо
			|ПОМЕСТИТЬ ВТ_Резиденты
			|ИЗ
			|	ВТ_ФизическиеЛица КАК ВТ_ФизическиеЛица
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТ_ГПХ.ФизическоеЛицо
			|ИЗ
			|	ВТ_ГПХ КАК ВТ_ГПХ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета,
			|	МАКСИМУМ(ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо) КАК ДействуетПо,
			|	МАКСИМУМ(ВычетыФизическихЛицИПНСрезПоследних.ПредоставлятьВычет) КАК ПредоставлятьВычет
			|ПОМЕСТИТЬ ВТ_ФизическиеЛицаСЗаявлениями
			|ИЗ
			|	ВТ_Резиденты КАК ВТ_Резиденты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(&ПериодСреза, ПредоставлятьВычет = ИСТИНА) КАК ВычетыФизическихЛицИПНСрезПоследних
			|		ПО ВТ_Резиденты.ФизическоеЛицо = ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо
			|
			|СГРУППИРОВАТЬ ПО
			|	ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо,
			|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВТ_ФизическиеЛицаСЗаявлениями.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВТ_ФизическиеЛицаСЗаявлениями.ВидВычета КАК ВидВычета,
			|	ВТ_ФизическиеЛицаСЗаявлениями.ДействуетПо КАК ДействуетПо,
			|	ВТ_ФизическиеЛицаСЗаявлениями.ПредоставлятьВычет КАК ПредоставлятьВычет
			|ПОМЕСТИТЬ ВТ_ФизическиеЛицаСДействующимиЗаявлениями
			|ИЗ
			|	ВТ_ФизическиеЛицаСЗаявлениями КАК ВТ_ФизическиеЛицаСЗаявлениями
			|ГДЕ
			|	(ВТ_ФизическиеЛицаСЗаявлениями.ДействуетПо >= &ПериодСреза
			|			ИЛИ ВТ_ФизическиеЛицаСЗаявлениями.ДействуетПо = &ПустаяДата)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВТ_Резиденты.ФизическоеЛицо КАК ФизическоеЛицо
			|ИЗ
			|	ВТ_Резиденты КАК ВТ_Резиденты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФизическиеЛицаСДействующимиЗаявлениями КАК Действующие
			|		ПО ВТ_Резиденты.ФизическоеЛицо = Действующие.ФизическоеЛицо
			|ГДЕ
			|	Действующие.ФизическоеЛицо ЕСТЬ NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Резиденты.ФизическоеЛицо";
	
	Иначе
	        Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета,
			|	МАКСИМУМ(ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо) КАК ДействуетПо,
			|	МАКСИМУМ(ВычетыФизическихЛицИПНСрезПоследних.ПредоставлятьВычет) КАК ПредоставлятьВычет
			|ПОМЕСТИТЬ ВТ_ФизическиеЛицаСЗаявлениями
			|ИЗ
			|	ВТ_ФизическиеЛица КАК ВТ_ФизическиеЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(
			|				&ПериодСреза,
			|				ПредоставлятьВычет = ИСТИНА
			|					И (ДействуетПо >= &ПериодСреза
			|						ИЛИ ДействуетПо = &ПустаяДата)) КАК ВычетыФизическихЛицИПНСрезПоследних
			|		ПО ВТ_ФизическиеЛица.ФизическоеЛицо = ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо
			|
			|СГРУППИРОВАТЬ ПО
			|	ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо,
			|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВТ_ФизическиеЛицаСЗаявлениями.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВТ_ФизическиеЛицаСЗаявлениями.ВидВычета КАК ВидВычета,
			|	ВТ_ФизическиеЛицаСЗаявлениями.ДействуетПо КАК ДействуетПо,
			|	ВТ_ФизическиеЛицаСЗаявлениями.ПредоставлятьВычет КАК ПредоставлятьВычет
			|ПОМЕСТИТЬ ВТ_ФизическиеЛицаСДействующимиЗаявлениями
			|ИЗ
			|	ВТ_ФизическиеЛицаСЗаявлениями КАК ВТ_ФизическиеЛицаСЗаявлениями
			|ГДЕ
			|	(ВТ_ФизическиеЛицаСЗаявлениями.ДействуетПо >= &ПериодСреза
			|			ИЛИ ВТ_ФизическиеЛицаСЗаявлениями.ДействуетПо = &ПустаяДата)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВТ_ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо
			|ИЗ
			|	ВТ_ФизическиеЛица КАК ВТ_ФизическиеЛица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФизическиеЛицаСДействующимиЗаявлениями КАК Действующие
			|		ПО ВТ_ФизическиеЛица.ФизическоеЛицо = Действующие.ФизическоеЛицо
			|ГДЕ
			|	Действующие.ФизическоеЛицо ЕСТЬ NULL
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ФизическиеЛица.ФизическоеЛицо";
			
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Сотрудники.Очистить();
	Вычеты.Очистить();
	ГрафикиВычетов.Очистить();
	ОшибкиФормированияДокументов.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаСотрудники = Сотрудники.Добавить();
		НоваяСтрокаСотрудники.Сотрудник = ВыборкаДетальныеЗаписи.ФизическоеЛицо;
		Для каждого СтрокаВычет Из ДобавляемыеВычеты Цикл
			НоваяСтрокаВычеты = Вычеты.Добавить();
			НоваяСтрокаВычеты.Сотрудник = ВыборкаДетальныеЗаписи.ФизическоеЛицо;
			НоваяСтрокаВычеты.ВидВычета = СтрокаВычет.ВидВычета;
			Если СтрокаВычет.ВидВычета.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам Тогда
				НоваяСтрокаВычеты.Расшифровка = НСтр("ru = 'Подробнее'");
			КонецЕсли;
			НоваяСтрокаВычеты.ПредоставлятьВычет = Истина;
		КонецЦикла;
	КонецЦикла;
	
	Если НоваяСтрокаСотрудники = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='В организации отсутствуют физические лица резиденты с неназначенными вычетами'"));
		Отказ = Истина;
	КонецЕсли;
	
	Сотрудники.Сортировать("Сотрудник, Отметка Убыв");
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДляЗаменыЗаявлений()

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодСреза", Объект.Период);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПустаяДата",  '00010101');
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявлениеНаПредоставлениеВычетовИПН.Ссылка КАК СуществующийДокумент,
	|	ЗаявлениеНаПредоставлениеВычетовИПН.Сотрудник КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_Заявления
	|ИЗ
	|	Документ.ЗаявлениеНаПредоставлениеВычетовИПН КАК ЗаявлениеНаПредоставлениеВычетовИПН
	|ГДЕ
	|	ЗаявлениеНаПредоставлениеВычетовИПН.Организация = &Организация
	|	И ЗаявлениеНаПредоставлениеВычетовИПН.Проведен = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявлениеНаПредоставлениеВычетовИПН.Ссылка,
	|	ЗаявлениеНаПредоставлениеВычетовИПН.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.Регистратор КАК Регистратор,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ДействуетС КАК ДействуетС,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ДействуетПо КАК ДействуетПо,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_ДействующиеПериодическиеВычеты
	|ИЗ
	|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(
	|			&ПериодСреза,
	|			ДействуетПо >= &ПериодСреза
	|				И Размер <> 0
	|				И Регистратор В
	|					(ВЫБРАТЬ
	|						ВТ_Заявления.СуществующийДокумент
	|					ИЗ
	|						ВТ_Заявления КАК ВТ_Заявления)) КАК ПрочиеВычетыФизическихЛицИПНСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.Регистратор КАК Регистратор,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ДействуетС КАК ДействуетС,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ДействуетПо КАК ДействуетПо,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.Размер КАК Размер
	|ПОМЕСТИТЬ ВТ_ИстёкшиеПериодическиеВычеты
	|ИЗ
	|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(
	|			&ПериодСреза,
	|			ДействуетПо < &ПериодСреза
	|				И Размер <> 0
	|				И Регистратор В
	|					(ВЫБРАТЬ
	|						ВТ_Заявления.СуществующийДокумент
	|					ИЗ
	|						ВТ_Заявления КАК ВТ_Заявления)) КАК ПрочиеВычетыФизическихЛицИПНСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДействующиеПериодическиеВычеты КАК ВТ_ДействующиеПериодическиеВычеты
	|		ПО ПрочиеВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо = ВТ_ДействующиеПериодическиеВычеты.ФизическоеЛицо
	|			И ПрочиеВычетыФизическихЛицИПНСрезПоследних.ВидВычета = ВТ_ДействующиеПериодическиеВычеты.ВидВычета
	|			И ПрочиеВычетыФизическихЛицИПНСрезПоследних.Регистратор = ВТ_ДействующиеПериодическиеВычеты.Регистратор
	|ГДЕ
	|	ВТ_ДействующиеПериодическиеВычеты.ФизическоеЛицо ЕСТЬ NULL
	|	И ВТ_ДействующиеПериодическиеВычеты.ВидВычета ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ИсключитьСотрудников
	|ИЗ
	|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(
	|			&ПериодСреза,
	|			Период = &ПериодСреза
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Заявления.ФизическоеЛицо
	|					ИЗ
	|						ВТ_Заявления КАК ВТ_Заявления)) КАК ВычетыФизическихЛицИПНСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета
	|ПОМЕСТИТЬ ВТ_ВычетыФизическихЛицИПНСрезПоследнихНеПредоставлятьВычет
	|ИЗ
	|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(
	|			&ПериодСреза,
	|			Регистратор В
	|					(ВЫБРАТЬ
	|						ВТ_Заявления.СуществующийДокумент
	|					ИЗ
	|						ВТ_Заявления КАК ВТ_Заявления)
	|				И ПредоставлятьВычет = ЛОЖЬ) КАК ВычетыФизическихЛицИПНСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	ВидВычета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета,
	|	ВычетыФизическихЛицИПНСрезПоследних.Период КАК Период,
	|	ВычетыФизическихЛицИПНСрезПоследних.Регистратор КАК Регистратор,
	|	ВычетыФизическихЛицИПНСрезПоследних.ПредоставлятьВычет КАК ПредоставлятьВычет,
	|	ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо КАК ДействуетПо
	|ПОМЕСТИТЬ ВТ_ВычетыФизическихЛицИПНСрезПоследних
	|ИЗ
	|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(
	|			&ПериодСреза,
	|			Регистратор В
	|					(ВЫБРАТЬ
	|						ВТ_Заявления.СуществующийДокумент
	|					ИЗ
	|						ВТ_Заявления КАК ВТ_Заявления)
	|				И ПредоставлятьВычет = ИСТИНА
	|				И ВидВычета <> ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)
	|				И Период <> &ПериодСреза) КАК ВычетыФизическихЛицИПНСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВычетыФизическихЛицИПНСрезПоследнихНеПредоставлятьВычет КАК ВТ_ВычетыФизическихЛицИПНСрезПоследнихНеПредоставлятьВычет
	|		ПО ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо = ВТ_ВычетыФизическихЛицИПНСрезПоследнихНеПредоставлятьВычет.ФизическоеЛицо
	|			И ВычетыФизическихЛицИПНСрезПоследних.ВидВычета = ВТ_ВычетыФизическихЛицИПНСрезПоследнихНеПредоставлятьВычет.ВидВычета
	|ГДЕ
	|	ВТ_ВычетыФизическихЛицИПНСрезПоследнихНеПредоставлятьВычет.ФизическоеЛицо ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета,
	|	ВТ_ВычетыФизическихЛицИПНСрезПоследних.Период КАК Период,
	|	ВТ_ВычетыФизическихЛицИПНСрезПоследних.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТИтоговыйРезультат
	|ИЗ
	|	ВТ_ВычетыФизическихЛицИПНСрезПоследних КАК ВТ_ВычетыФизическихЛицИПНСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсключитьСотрудников КАК ВТ_ИсключитьСотрудников
	|		ПО ВТ_ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо = ВТ_ИсключитьСотрудников.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИстёкшиеПериодическиеВычеты КАК ВТ_ИстёкшиеПериодическиеВычеты
	|		ПО ВТ_ВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо = ВТ_ИстёкшиеПериодическиеВычеты.ФизическоеЛицо
	|			И ВТ_ВычетыФизическихЛицИПНСрезПоследних.ВидВычета = ВТ_ИстёкшиеПериодическиеВычеты.ВидВычета
	|ГДЕ
	|	ВТ_ИсключитьСотрудников.ФизическоеЛицо ЕСТЬ NULL
	|	И ВТ_ИстёкшиеПериодическиеВычеты.ВидВычета ЕСТЬ NULL
	|	И (ВТ_ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо >= &ПериодСреза
	|			ИЛИ ВТ_ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо = &ПустаяДата)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	Регистратор";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТИтоговыйРезультат.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	ВТИтоговыйРезультат КАК ВТИтоговыйРезультат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заявления КАК ВТ_Заявления
	|		ПО ВТИтоговыйРезультат.ФизическоеЛицо = ВТ_Заявления.ФизическоеЛицо
	|			И ВТИтоговыйРезультат.Регистратор = ВТ_Заявления.СуществующийДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТИтоговыйРезультат.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТИтоговыйРезультат.ВидВычета КАК ВидВычета,
	|	ВТ_Заявления.СуществующийДокумент КАК СуществующийДокумент,
	|	ВычетыИПН.НеИспользуется КАК НеИспользуется
	|ИЗ
	|	ВТИтоговыйРезультат КАК ВТИтоговыйРезультат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заявления КАК ВТ_Заявления
	|		ПО ВТИтоговыйРезультат.ФизическоеЛицо = ВТ_Заявления.ФизическоеЛицо
	|			И ВТИтоговыйРезультат.Регистратор = ВТ_Заявления.СуществующийДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыВычетовИПН КАК ВычетыИПН
	|		ПО ВТИтоговыйРезультат.ВидВычета = ВычетыИПН.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычета,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.Регистратор КАК Регистратор,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ДействуетС КАК ДействуетС,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.ДействуетПо КАК ДействуетПо,
	|	ПрочиеВычетыФизическихЛицИПНСрезПоследних.Размер КАК Размер
	|ИЗ
	|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(
	|			&ПериодСреза,
	|			ДействуетПо >= &ПериодСреза
	|				И Размер <> 0
	|				И (ФизическоеЛицо, Регистратор) В
	|					(ВЫБРАТЬ
	|						ВТИтоговыйРезультат.ФизическоеЛицо,
	|						ВТИтоговыйРезультат.Регистратор
	|					ИЗ
	|						ВТИтоговыйРезультат КАК ВТИтоговыйРезультат)) КАК ПрочиеВычетыФизическихЛицИПНСрезПоследних";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Сотрудники.Очистить();
	Вычеты.Очистить(); 
	ГрафикиВычетов.Очистить();
	ОшибкиФормированияДокументов.Очистить();
	
	ВыборкаСотрудники = МассивРезультатов[0].Выбрать();
	Пока ВыборкаСотрудники.Следующий() Цикл
		
		НоваяСтрокаСотрудники = Сотрудники.Добавить();
		НоваяСтрокаСотрудники.Сотрудник = ВыборкаСотрудники.ФизическоеЛицо;

	КонецЦикла;
	
	//ВидыВычетовТребущиеУказанияВидаДохода = ?(ИспользуетсяВидДохода, ВидыВычетовТребущиеУказанияВидаДохода(), Неопределено);
	
	ВыборкаВычеты = МассивРезультатов[1].Выбрать();
	МассивКлючей = Новый Массив;
	Пока ВыборкаВычеты.Следующий() Цикл
		Ключ = Строка(ВыборкаВычеты.ФизическоеЛицо) + "|" + Строка(ВыборкаВычеты.ВидВычета);

	    Если МассивКлючей.Найти(Ключ) <> Неопределено Тогда
	        Продолжить;
	    КонецЕсли;

	    МассивКлючей.Добавить(Ключ);
		
		НоваяСтрокаВычеты = Вычеты.Добавить();
		НоваяСтрокаВычеты.ВидВычета = ВыборкаВычеты.ВидВычета;
		Если ВыборкаВычеты.ВидВычета.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам Тогда
			НоваяСтрокаВычеты.Расшифровка = НСтр("ru = 'Подробнее'");
		КонецЕсли;
		НоваяСтрокаВычеты.Сотрудник = ВыборкаВычеты.ФизическоеЛицо;
		НоваяСтрокаВычеты.СуществующийДокумент = ВыборкаВычеты.СуществующийДокумент; 
		НоваяСтрокаВычеты.НеИспользуется = ВыборкаВычеты.НеИспользуется;
		Если ПрекращатьНеиспользуемыеВычеты И ВыборкаВычеты.НеИспользуется Тогда
			НоваяСтрокаВычеты.ПредоставлятьВычет = Ложь;
		Иначе
			НоваяСтрокаВычеты.ПредоставлятьВычет = Истина;
		КонецЕсли;
		Для каждого Строка Из ТаблицаСоответствияВычетов Цикл
			Если Строка.ВычетДо = ВыборкаВычеты.ВидВычета Тогда
				НоваяСтрокаВычеты.ПредоставлятьВычет = Ложь;
				НовыйКлюч = Строка(ВыборкаВычеты.ФизическоеЛицо) + "|" + Строка(Строка.ВычетПосле);
	            Если МассивКлючей.Найти(НовыйКлюч) = Неопределено Тогда
	                МассивКлючей.Добавить(НовыйКлюч);
					НоваяСтрокаВычеты = Вычеты.Добавить();
					НоваяСтрокаВычеты.Сотрудник = ВыборкаВычеты.ФизическоеЛицо;
					НоваяСтрокаВычеты.ВидВычета = Строка.ВычетПосле;
					Если НоваяСтрокаВычеты.ВидВычета.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам Тогда
						НоваяСтрокаВычеты.Расшифровка = НСтр("ru = 'Подробнее'");
					КонецЕсли;
					НоваяСтрокаВычеты.ПредоставлятьВычет = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	ВыборкаГрафики = МассивРезультатов[2].Выбрать();
	Пока ВыборкаГрафики.Следующий() Цикл
		НоваяСтрокаГрафикВычетов = ГрафикиВычетов.Добавить();
		НоваяСтрокаГрафикВычетов.ВидВычетаИПН = ВыборкаГрафики.ВидВычета;
		НоваяСтрокаГрафикВычетов.ФизическоеЛицо = ВыборкаГрафики.ФизическоеЛицо;
		НоваяСтрокаГрафикВычетов.Размер = ВыборкаГрафики.Размер;
		НоваяСтрокаГрафикВычетов.ДействуетС = ВыборкаГрафики.ДействуетС;
		НоваяСтрокаГрафикВычетов.ДействуетПо = ВыборкаГрафики.ДействуетПо;
	КонецЦикла;
	
	Сотрудники.Сортировать("Сотрудник, Отметка Убыв");
	Вычеты.Сортировать("ПредоставлятьВычет Убыв");

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	Объект.Период = Дата(2026,01,01);
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.Период", "ПериодСтрокой"); 
	ВариантОбработки = 1;
	
	ЗначенияДляЗаполнения  = Новый Структура("Организация", "Объект.Организация");	
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ЗарплатаКадры.ПерваяДоступнаяОрганизация();
	КонецЕсли;
	
	ИспользуетсяВидДохода = ЕстьРеквизитТабЧастиДокумента("ВидДохода", Метаданные.НайтиПоПолномуИмени("Документ.ЗаявлениеНаПредоставлениеВычетовИПН"), "Вычеты");
	
	Элементы.ВычетыВидДохода.Видимость = ИспользуетсяВидДохода;

	Элементы.Назад.Доступность = Ложь;
	Элементы.ВНачало.Доступность = Ложь;
	Элементы.ДекорацияНадписьВидДохода.Видимость = ИспользуетсяВидДохода;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыЗаявлений(Отказ)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НаличиеОшибок = Ложь;
	СформированныеДокументы.Очистить();
	
	ДатаВводаНовыхДокументов = Объект.Период;
	ИтогоСозданоЗаявлений = 0;
	
	Для Каждого СтрокаСотрудник Из Сотрудники Цикл
		
		Если СтрокаСотрудник.Отметка Тогда
		
			НовоеЗаявление = Документы.ЗаявлениеНаПредоставлениеВычетовИПН.СоздатьДокумент();
			НовоеЗаявление.Дата = ТекущаяДата();
			НовоеЗаявление.Месяц = НачалоМесяца(ДатаВводаНовыхДокументов);
			Если ДействуетДо Тогда
				НовоеЗаявление.МесяцЗавершения = КонецГода(ДатаВводаНовыхДокументов);
			КонецЕсли;
			НовоеЗаявление.Сотрудник = СтрокаСотрудник.Сотрудник;
			НовоеЗаявление.Организация = Объект.Организация;
			НовоеЗаявление.Ответственный = Пользователи.ТекущийПользователь();
			НовоеЗаявление.НаличиеЗаявления = Истина;
			
			СтрокаИтого = СформированныеДокументы.Добавить();
			СтрокаИтого.Сотрудник = СтрокаСотрудник.Сотрудник;
						
			Отбор = Новый Структура();
			Отбор.Вставить("Сотрудник", СтрокаСотрудник.Сотрудник);
			ВычетыСотрудника = Вычеты.НайтиСтроки(Отбор);
			
			Для Каждого СтрокаВычет Из ВычетыСотрудника Цикл

				//вычет можно ввести только один раз
				НайденнаяСтрока = НовоеЗаявление.Вычеты.Найти(СтрокаВычет.ВидВычета, "ВидВычетаИПН");
				Если НайденнаяСтрока <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				//заполняем табличную часть документа (Вычеты)
				НоваяСтрокаВычета = НовоеЗаявление.Вычеты.Добавить();
				НоваяСтрокаВычета.ВидВычетаИПН = СтрокаВычет.ВидВычета;
				НоваяСтрокаВычета.ПредоставлятьВычет = Истина;
				
				Если СтрокаВычет.Расшифровка = НСтр("ru = 'Подробнее'") Тогда
					
					ОтборГрафик = Новый Структура();
					ОтборГрафик.Вставить("ВидВычетаИПН", СтрокаВычет.ВидВычета);
					ОтборГрафик.Вставить("ФизическоеЛицо", СтрокаВычет.Сотрудник);
					ГрафикВычета = ГрафикиВычетов.НайтиСтроки(ОтборГрафик);
						
					Для Каждого СтрокаГрафика Из ГрафикВычета Цикл
						//заполняем табличную часть по графикам (ПрочиеВычеты)
						НоваяСтрокаГрафика = НовоеЗаявление.ПрочиеВычеты.Добавить();
						НоваяСтрокаГрафика.ВидВычетаИПН = СтрокаГрафика.ВидВычетаИПН;
						НоваяСтрокаГрафика.ДействуетС = СтрокаГрафика.ДействуетС;
						НоваяСтрокаГрафика.ДействуетПо = СтрокаГрафика.ДействуетПо;
						НоваяСтрокаГрафика.Размер = СтрокаГрафика.Размер;
					КонецЦикла;
					
				КонецЕсли;				
				
			КонецЦикла;
						
			ПараметрыОтбораПоФизлицу = Новый Структура;
			ПараметрыОтбораПоФизлицу.Вставить("ФизическоеЛицо", СтрокаСотрудник.Сотрудник);
			ОшибкиПоСотруднику = ОшибкиФормированияДокументов.Выгрузить(Новый Структура("ФизическоеЛицо", ПараметрыОтбораПоФизлицу.ФизическоеЛицо));
			Если ОшибкиПоСотруднику.Количество() > 0 Тогда 
				СтрокаИтого.Подробнее =  НСтр("ru = 'Подробнее...'");
			КонецЕсли;
			
			Попытка 

				ТаблицаОшибокПроверкиЗаполнения = ОшибкиФормированияДокументов.Выгрузить();
				ТаблицаОшибокПроверкиЗаполнения.Очистить();
				НовоеЗаявление.ДополнительныеСвойства.Вставить("ТаблицаОшибокПроверкиЗаполнения", ТаблицаОшибокПроверкиЗаполнения);
				//пытаемся записать Документ. с проведением
				Если НовоеЗаявление.ПроверитьЗаполнение() Тогда
					НовоеЗаявление.Записать(РежимЗаписиДокумента.Проведение);
					СтрокаИтого.Документ = НовоеЗаявление.Ссылка;
					ИтогоСозданоЗаявлений = ИтогоСозданоЗаявлений + 1;
				Иначе 
					НаличиеОшибок = Истина;
					//ОшибкиФормированияДокументов.Очистить();
					Если Вычеты.НайтиСтроки(Новый Структура("ВидВычета, Сотрудник", Справочники.ВидыВычетовИПН.ПредварительнаяСуммаНалоговыхВычетов, СтрокаСотрудник.Сотрудник)).Количество() > 0 Тогда						
						Если НЕ ДействуетДо Тогда
							НоваяСтрокаОшибок = ОшибкиФормированияДокументов.Добавить();
							НоваяСтрокаОшибок.ФизическоеЛицо = СтрокаСотрудник.Сотрудник;
							НоваяСтрокаОшибок.ВидВычета = Справочники.ВидыВычетовИПН.ПредварительнаяСуммаНалоговыхВычетов;
							НоваяСтрокаОшибок.ОписаниеОшибки = НСтр("ru = 'При использовании предварительной суммы прочих вычетов, необходимо ограничивать ввод заявлений концом года'");
						КонецЕсли;
					КонецЕсли;
					Для Каждого СтрокаОшибки Из НовоеЗаявление.ДополнительныеСвойства.ТаблицаОшибокПроверкиЗаполнения Цикл
						НоваяСтрокаОшибок = ОшибкиФормированияДокументов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаОшибок, СтрокаОшибки);
					КонецЦикла;
					СтрокаИтого.Подробнее = НСтр("ru = 'Подробнее об ошибках...'");
				КонецЕсли;  
				
			Исключение  
				
				НаличиеОшибок = Истина;
				ТекстСообщения = НСтр("ru = 'Ошибка создания документа по причине: %1'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку (ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическое формирование ""Заявлений на предоставление вычетов ИПН"".'"), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				
				Для Каждого СтрокаОшибки Из НовоеЗаявление.ДополнительныеСвойства.ТаблицаОшибокПроверкиЗаполнения Цикл
					НоваяСтрокаОшибок = ОшибкиФормированияДокументов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОшибок, СтрокаОшибки);
				КонецЦикла;
				СтрокаИтого.Подробнее = НСтр("ru = 'Подробнее об ошибках...'");

			КонецПопытки;
			
		КонецЕсли;	
			
	КонецЦикла;
	
	СформированныеДокументы.Сортировать("Подробнее, Сотрудник");
	
	Элементы.Декорация3.Видимость = НаличиеОшибок;
	Элементы.Декорация6.Видимость = Истина;  
	ТекстЗаголовка = НСтр("ru = 'Итого сформировано %1 документов ""Заявлений на предоставление вычетов ИПН"".'");
	ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, ИтогоСозданоЗаявлений);
			
	Элементы.Декорация6.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыЗаявленийЗамены(Отказ)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НаличиеОшибок = Ложь;
	СформированныеДокументы.Очистить();
	
	ДатаВводаНовыхДокументов = Объект.Период;
	ИтогоСозданоЗаявлений = 0;
	
	Для Каждого СтрокаСотрудник Из Сотрудники Цикл
		
		Если СтрокаСотрудник.Отметка Тогда
		
			НовоеЗаявление = Документы.ЗаявлениеНаПредоставлениеВычетовИПН.СоздатьДокумент();
			НовоеЗаявление.Дата = ТекущаяДата();
			НовоеЗаявление.Месяц = НачалоМесяца(ДатаВводаНовыхДокументов);
			Если ДействуетДо Тогда
				НовоеЗаявление.МесяцЗавершения = КонецГода(ДатаВводаНовыхДокументов);
			КонецЕсли;
			НовоеЗаявление.Сотрудник = СтрокаСотрудник.Сотрудник;
			НовоеЗаявление.Организация = Объект.Организация;
			НовоеЗаявление.Ответственный = Пользователи.ТекущийПользователь();
			НовоеЗаявление.НаличиеЗаявления = Истина;
			
			СтрокаИтого = СформированныеДокументы.Добавить();
			СтрокаИтого.Сотрудник = СтрокаСотрудник.Сотрудник;
			
			Отбор = Новый Структура();
			Отбор.Вставить("Сотрудник", СтрокаСотрудник.Сотрудник);
			ВычетыСотрудника = Вычеты.НайтиСтроки(Отбор);
			
			Для Каждого СтрокаВычет Из ВычетыСотрудника Цикл

				//вычет можно ввести только один раз
				НайденнаяСтрока = НовоеЗаявление.Вычеты.Найти(СтрокаВычет.ВидВычета, "ВидВычетаИПН");
				Если НайденнаяСтрока <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				//заполняем табличную часть документа (Вычеты)
				НоваяСтрокаВычета = НовоеЗаявление.Вычеты.Добавить();
				НоваяСтрокаВычета.ВидВычетаИПН = СтрокаВычет.ВидВычета;
				НоваяСтрокаВычета.ПредоставлятьВычет = СтрокаВычет.ПредоставлятьВычет;
				
				Если СтрокаВычет.Расшифровка = НСтр("ru = 'Подробнее'") И СтрокаВычет.ПредоставлятьВычет Тогда
					
					ОтборГрафик = Новый Структура();
					ОтборГрафик.Вставить("ВидВычетаИПН", СтрокаВычет.ВидВычета);
					ОтборГрафик.Вставить("ФизическоеЛицо", СтрокаВычет.Сотрудник);
					ГрафикВычета = ГрафикиВычетов.НайтиСтроки(ОтборГрафик);
						
					Для Каждого СтрокаГрафика Из ГрафикВычета Цикл
						//заполняем табличную часть по графикам (ПрочиеВычеты)
						НоваяСтрокаГрафика = НовоеЗаявление.ПрочиеВычеты.Добавить();
						НоваяСтрокаГрафика.ВидВычетаИПН = СтрокаГрафика.ВидВычетаИПН;
						НоваяСтрокаГрафика.ДействуетС = СтрокаГрафика.ДействуетС;
						НоваяСтрокаГрафика.ДействуетПо = СтрокаГрафика.ДействуетПо;
						НоваяСтрокаГрафика.Размер = СтрокаГрафика.Размер;
					КонецЦикла;
					
				КонецЕсли;				
				
			КонецЦикла;
			
			ПараметрыОтбораПоФизлицу = Новый Структура;
			ПараметрыОтбораПоФизлицу.Вставить("ФизическоеЛицо", СтрокаСотрудник.Сотрудник);
			ОшибкиПоСотруднику = ОшибкиФормированияДокументов.Выгрузить(Новый Структура("ФизическоеЛицо", ПараметрыОтбораПоФизлицу.ФизическоеЛицо));
			Если ОшибкиПоСотруднику.Количество() > 0 Тогда 
				СтрокаИтого.Подробнее =  НСтр("ru = 'Подробнее...'");
			КонецЕсли;
			
			Попытка 

				ТаблицаОшибокПроверкиЗаполнения = ОшибкиФормированияДокументов.Выгрузить();
				ТаблицаОшибокПроверкиЗаполнения.Очистить();
				НовоеЗаявление.ДополнительныеСвойства.Вставить("ТаблицаОшибокПроверкиЗаполнения", ТаблицаОшибокПроверкиЗаполнения);
				//пытаемся записать Документ. с проведением
				Если НовоеЗаявление.ПроверитьЗаполнение() Тогда
					НовоеЗаявление.Записать(РежимЗаписиДокумента.Проведение);
					СтрокаИтого.Документ = НовоеЗаявление.Ссылка;
					ИтогоСозданоЗаявлений = ИтогоСозданоЗаявлений + 1;
				Иначе 
					НаличиеОшибок = Истина;
					//ОшибкиФормированияДокументов.Очистить();
					Если Вычеты.НайтиСтроки(Новый Структура("ВидВычета, Сотрудник", Справочники.ВидыВычетовИПН.ПредварительнаяСуммаНалоговыхВычетов, СтрокаСотрудник.Сотрудник)).Количество() > 0 Тогда						
						Если НЕ ДействуетДо Тогда
							НоваяСтрокаОшибок = ОшибкиФормированияДокументов.Добавить();
							НоваяСтрокаОшибок.ФизическоеЛицо = СтрокаСотрудник.Сотрудник;
							НоваяСтрокаОшибок.ВидВычета = Справочники.ВидыВычетовИПН.ПредварительнаяСуммаНалоговыхВычетов;
							НоваяСтрокаОшибок.ОписаниеОшибки = НСтр("ru = 'При использовании предварительной суммы прочих вычетов, необходимо ограничивать ввод заявлений концом года'");
						КонецЕсли;
					КонецЕсли;
					Для Каждого СтрокаОшибки Из НовоеЗаявление.ДополнительныеСвойства.ТаблицаОшибокПроверкиЗаполнения Цикл
						НоваяСтрокаОшибок = ОшибкиФормированияДокументов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаОшибок, СтрокаОшибки);
					КонецЦикла;
					СтрокаИтого.Подробнее = НСтр("ru = 'Подробнее об ошибках...'");
				КонецЕсли;  
				
			Исключение  
				
				НаличиеОшибок = Истина;
				ТекстСообщения = НСтр("ru = 'Ошибка создания документа по причине: %1'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматическое формирование ""Заявлений на предоставление вычетов ИПН"".'"), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				
				Для Каждого СтрокаОшибки Из НовоеЗаявление.ДополнительныеСвойства.ТаблицаОшибокПроверкиЗаполнения Цикл
					НоваяСтрокаОшибок = ОшибкиФормированияДокументов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОшибок, СтрокаОшибки);
				КонецЦикла;
				СтрокаИтого.Подробнее = НСтр("ru = 'Подробнее об ошибках...'");

			КонецПопытки;
			
		КонецЕсли;	
			
	КонецЦикла;
	
	СформированныеДокументы.Сортировать("Подробнее, Сотрудник");
	
	Элементы.Декорация3.Видимость = НаличиеОшибок;
	Элементы.Декорация6.Видимость = Истина;  
	ТекстЗаголовка = НСтр("ru = 'Итого сформировано %1 документов ""Заявлений на предоставление вычетов ИПН"".'");
	ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, ИтогоСозданоЗаявлений);
			
	Элементы.Декорация6.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибки(ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыОтбораПоФизлицу = Новый Структура;
	ПараметрыОтбораПоФизлицу.Вставить("ФизическоеЛицо", ДанныеСтроки.Сотрудник);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресХранилища", АдресВХранилищеОшибки(ПараметрыОтбораПоФизлицу));
	
	ОткрытьФорму("Обработка.ФормированиеЗаявленийНаПредоставлениеВычетовИПН.Форма.ФормаОшибокПроведения", ПараметрыОткрытия, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилищеОшибки(ПараметрыОтбораПоФизлицу) Экспорт
	
	ТаблицаОтбора = ОшибкиФормированияДокументов.Выгрузить(Новый Структура("ФизическоеЛицо", ПараметрыОтбораПоФизлицу.ФизическоеЛицо,));
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ЗаполнитьРасшифровкуВСтроке(Идентификатор)

	ТекущиеДанные = Вычеты.НайтиПоИдентификатору(Идентификатор);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Расшифровка = 
		?(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.ВидВычета, "ПредоставлениеВычета") = 
			Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам, НСтр("ru = 'Подробнее'"),"");
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеГрафикиВычетов(ДанныеСтроки)

	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли; 
		
	ПараметрыОтбораПоФизлицу = Новый Структура;
	ПараметрыОтбораПоФизлицу.Вставить("ФизическоеЛицо", ДанныеСтроки.Сотрудник);
	ПараметрыОтбораПоФизлицу.Вставить("ВидВычетаИПН", ДанныеСтроки.ВидВычета); 
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ФизическоеЛицо", 				ДанныеСтроки.Сотрудник);
	ПараметрыОткрытия.Вставить("ВидВычетаИПН",						ДанныеСтроки.ВидВычета);
	ПараметрыОткрытия.Вставить("Месяц",							Объект.Период);
	Если ДействуетДо Тогда
		ПараметрыОткрытия.Вставить("МесяцЗавершения",			КонецГода(Объект.Период));
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ПредоставлятьВычет",            ДанныеСтроки.ПредоставлятьВычет);
	ПараметрыОткрытия.Вставить("АдресВХранилищеПрочиеВычеты",	АдресВХранилищеПрочиеВычеты(ПараметрыОтбораПоФизлицу));
	
	ПараметрыОткрытия.Вставить("ТолькоПросмотр",		ЭтаФорма.ТолькоПросмотр);
	
	Оповещение = Новый ОписаниеОповещения("РедактированиеГрафикиВычетовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Форма.РедактированиеГрафикаВычетов", ПараметрыОткрытия, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеГрафикиВычетовЗавершение(РезультатыРедактирования,ДопПараметры) Экспорт
	
	Если РезультатыРедактирования <> Неопределено И РезультатыРедактирования.Модифицированность Тогда
		РедактированиеГрафикиВычетовЗавершениеНаСервере(РезультатыРедактирования);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РедактированиеГрафикиВычетовЗавершениеНаСервере(РезультатыРедактирования)
	
	УдалитьПрочиеВычеты(РезультатыРедактирования.ВидВычетаИПН, РезультатыРедактирования.ФизическоеЛицо);
	
	ТаблицаВидВычета = ПолучитьИзВременногоХранилища(РезультатыРедактирования.АдресВХранилищеПрочиеВычеты);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаВидВычета, ГрафикиВычетов);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилищеПрочиеВычеты(ПараметрыОтбораПоФизлицу) Экспорт
		
	ТаблицаОтбора = ГрафикиВычетов.Выгрузить(Новый Структура("ФизическоеЛицо, ВидВычетаИПН", ПараметрыОтбораПоФизлицу.ФизическоеЛицо,ПараметрыОтбораПоФизлицу.ВидВычетаИПН));
		
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура УдалитьПрочиеВычеты(ВидВычета, ФизическоеЛицо)
	
	УдаляемыеСтроки = ГрафикиВычетов.НайтиСтроки(Новый Структура("ВидВычетаИПН, ФизическоеЛицо", ВидВычета, ФизическоеЛицо));
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		ГрафикиВычетов.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольМесяца()
	
	ДатаКонтроля = Дата(2026,01,01);
	
	Если Объект.Период < ДатаКонтроля Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Обработка применяется с 1 января 2026 года'"));
		Объект.Период = НачалоМесяца(ДатаКонтроля);
		ПериодСтрокой = НСтр("ru = 'Январь 2026'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВидыВычетовТребущиеУказанияВидаДохода() 
	//Возврат Документы.ЗаявлениеНаПредоставлениеВычетовИПН.ВидыВычетовТребущиеУказанияВидаДохода(Объект.Период);  
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВидДохода(Месяц, ВидВычета) 
	
	ВидДохода = Неопределено;
	
	Если Месяц >= '20250101' Тогда
		
		Если ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы")
			ИЛИ ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.Стандартный1МЗП")
			ИЛИ ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.Стандартный75МЗПИнвалиды")
			ИЛИ ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.Стандартный75МЗПРодители")
			ИЛИ ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.БазовыйНалоговыйВычет")
			ИЛИ ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.СоциальныйНалоговыйВычет1_2Группа") 
			ИЛИ ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.СоциальныйНалоговыйВычет3Группа") 
			ИЛИ ВидВычета = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.СоциальныйНалоговыйВычетРодители") Тогда
			
			ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя");
			
		Иначе
			
			ВидДохода = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВидДохода;
	
КонецФункции

&НаСервере
Функция ЕстьРеквизитТабЧастиДокумента(ИмяРеквизита, МетаданныеДокумента, ИмяТабЧасти) 

	ТабЧасть = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти);

	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Возврат Ложь;

	Иначе
		Возврат НЕ (ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

	КонецЕсли;

КонецФункции // ЕстьРеквизитТабЧастиДокумента()

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	Схема = Обработки.ФормированиеЗаявленийНаПредоставлениеВычетовИПН.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

    Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
    Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);

    // Параметры
    СписокФизЛиц = Новый Массив;
    Для каждого Стр Из СформированныеДокументы Цикл
        СписокФизЛиц.Добавить(Стр.Сотрудник);
    КонецЦикла;

    Настройки = Компоновщик.Настройки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Объект.Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокФизЛиц", СписокФизЛиц);
	
	Структура = Новый Структура;
	Структура.Вставить("Период", Объект.Период);
	Структура.Вставить("СписокФизЛиц", СписокФизЛиц);		
	
    Возврат Структура;

КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Пакет = СформироватьОтчетНаСервере(); // получаем с сервера только данные
	
    ОткрытьФорму("Обработка.ФормированиеЗаявленийНаПредоставлениеВычетовИПН.Форма.ФормаОтчета", Пакет);
	
КонецПроцедуры

#КонецОбласти
