&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы11  = "П0001100001";
	СтруктураРеквизитовФормы.мИдГруппы12  = "П0001200001";
	СтруктураРеквизитовФормы.мИдГруппы13  = "П0001300001";
	СтруктураРеквизитовФормы.мИдГруппы14  = "П0001400002";
	СтруктураРеквизитовФормы.мИдГруппы15  = "П0001500002";
	СтруктураРеквизитовФормы.мИдГруппы16  = "П0001600002";
	СтруктураРеквизитовФормы.мИдГруппы17  = "П0001700002";
	СтруктураРеквизитовФормы.мИдГруппы18  = "П0001800002";
	
	
	//210.01
	КолИсхСтрокИдГруппы11  = 1;
	КолИсхСтрокИдГруппы12  = 1;
	КолИсхСтрокИдГруппы13  = 1;
	КолИсхСтрокИдГруппы14  = 1;
	КолИсхСтрокИдГруппы15  = 1;
	КолИсхСтрокИдГруппы16  = 1;
	КолИсхСтрокИдГруппы17  = 1;
	КолИсхСтрокИдГруппы18  = 1;
	
	
	//210.01
	КолКолонокИдГруппы11 = 5;
	КолКолонокИдГруппы12 = 5;
	КолКолонокИдГруппы13 = 5;
	КолКолонокИдГруппы14 = 5;
	КолКолонокИдГруппы15 = 5;
	КолКолонокИдГруппы16 = 4;
	КолКолонокИдГруппы17 = 4;
	КолКолонокИдГруппы18 = 4;
	
	
	СтруктураДанныхФорма210Страница1           = Новый Структура;
	СтруктураДанныхФорма210Страница2           = Новый Структура;
	СтруктураДанныхФорма210Страница3           = Новый Структура;
	СтруктураДанныхФорма210Страница4           = Новый Структура;
	СтруктураДанныхФорма210_01Страница1        = Новый Структура;
	СтруктураДанныхФорма210_01Страница2        = Новый Структура;
	СтруктураДанныхФорма210_01Страница3        = Новый Структура;
	СтруктураДанныхФорма210_01Страница4        = Новый Структура;
	СтруктураДанныхФорма210_01Страница5        = Новый Структура;
	СтруктураДанныхФорма210_01Страница6        = Новый Структура;
	СтруктураДанныхФорма210_01Страница7        = Новый Структура;
	СтруктураДанныхФорма210_01Страница8        = Новый Структура;
	
	мСтруктураФорма210_02Страница1и2 = Новый Структура;
	мСтруктураФорма210_02Страница1и2.Вставить("Форма210_02", "ТаблицаСтраницыФорма210_02");
	
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;

	//210.01
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11,  СтруктураРеквизитовФормы.мИдГруппы11);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12,  СтруктураРеквизитовФормы.мИдГруппы12);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы13,  СтруктураРеквизитовФормы.мИдГруппы13);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы14,  СтруктураРеквизитовФормы.мИдГруппы14);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы15,  СтруктураРеквизитовФормы.мИдГруппы15);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы16,  СтруктураРеквизитовФормы.мИдГруппы16);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы17,  СтруктураРеквизитовФормы.мИдГруппы17);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы18,  СтруктураРеквизитовФормы.мИдГруппы18);
	
	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	
	//210.01
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолИсхСтрокИдГруппы11);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолИсхСтрокИдГруппы12);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы13, КолИсхСтрокИдГруппы13);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы14, КолИсхСтрокИдГруппы14);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы15, КолИсхСтрокИдГруппы15);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы16, КолИсхСтрокИдГруппы16);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы17, КолИсхСтрокИдГруппы17);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы18, КолИсхСтрокИдГруппы18);
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	//210.01
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы11, КолКолонокИдГруппы11);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы12, КолКолонокИдГруппы12);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы13, КолКолонокИдГруппы13);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы14, КолКолонокИдГруппы14);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы15, КолКолонокИдГруппы15);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы16, КолКолонокИдГруппы16);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы17, КолКолонокИдГруппы17);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы18, КолКолонокИдГруппы18);
	
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента             = 0;
	мСписокСтруктурныхЕдиниц                          = Параметры.СписокСтруктурныхЕдиниц;
	СтруктураРеквизитовФормы.НалоговыйКомитет		  = Параметры.НалоговыйКомитет;
	НалоговыйКомитетФорма							  = Параметры.НалоговыйКомитет;
	
	ИмяРаздела = "Форма210Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы11");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы12");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы13");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы14");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы15");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы16");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы17");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы18");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210Страница1";
	СтрокаУровня1.Представление            = "Форма 210.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210Страница2";
	СтрокаУровня1.Представление            = "Форма 210.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210Страница3";
	СтрокаУровня1.Представление            = "Форма 210.00 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210Страница4";
	СтрокаУровня1.Представление            = "Форма 210.00 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница1";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница2";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница3";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница4";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница5";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 5";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница6";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 6";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница7";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 7";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница8";
	СтрокаУровня1.Представление            = "Форма 210.01 Страница 8";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_02Страница1";
	СтрокаУровня1.Представление            = "Форма 210.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма210Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы11;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы12;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы13;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы14;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница5";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы15;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница6";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы16;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница7";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы17;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_01Страница8";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы18;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма210_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если ЭтоРазделРодитель(ЭлементДереваСтраницОтчета.ИмяСтраницы) Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				ЭлементРазделовОтчета.РазделМногостраничный = Ложь;
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				
				Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
				КонецЦикла;
				
			ИначеЕсли ЭлементДереваСтраницОтчета.ИмяСтраницы = "Форма210_02Страница1" Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				
				Если Форма["ТаблицаСтраницыФорма210_02"].Количество() > 0 Тогда
					Форма210_02Количество = Форма["ТаблицаСтраницыФорма210_02"].Количество();
				Иначе
					Форма210_02Количество = 1;
				КонецЕсли;
				
				ЭлементРазделовОтчета.РазделМногостраничный = Истина;
				ЭлементРазделовОтчета.РазделМногострочный = Ложь;
				
				ЭлементРазделовОтчета.КолонкаНомерСтраницыРазделаОтчета = 1;
				
				Для НомерСтраницы = 1 По Форма210_02Количество Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = "Форма 210.02 Лист " + НомерСтраницы;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = "Форма210_02Страница1";
					СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
					
					
					ПодстраницаРазделаОтчет1 = СтраницаРазделаОтчета.ПолучитьЭлементы().Добавить();
					
					ПодстраницаРазделаОтчет1.КолонкаРазделыОтчета      = "Форма 210.02 Страница 1";
					ПодстраницаРазделаОтчет1.КолонкаРазделыОтчетаСокрНаим      = "Форма210_02Страница1";
					ПодстраницаРазделаОтчет1.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					ПодстраницаРазделаОтчет1.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					ПодстраницаРазделаОтчет1.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
					
					ПодстраницаРазделаОтчет2 = СтраницаРазделаОтчета.ПолучитьЭлементы().Добавить();
					
					ПодстраницаРазделаОтчет2.КолонкаРазделыОтчета      = "Форма 210.02 Страница 2";
					ПодстраницаРазделаОтчет2.КолонкаРазделыОтчетаСокрНаим      = "Форма210_02Страница2";
					ПодстраницаРазделаОтчет2.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					ПодстраницаРазделаОтчет2.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					ПодстраницаРазделаОтчет2.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма210Страница1")
			ИЛИ (ИмяРаздела = "Форма210_01Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма210_01Страница1")
			ИЛИ (ИмяРаздела = "Форма210_01Страница2")
			ИЛИ (ИмяРаздела = "Форма210_01Страница3")
			ИЛИ (ИмяРаздела = "Форма210_01Страница4")
			ИЛИ (ИмяРаздела = "Форма210_01Страница5")
			ИЛИ (ИмяРаздела = "Форма210_01Страница6")
			ИЛИ (ИмяРаздела = "Форма210_01Страница7")
			ИЛИ (ИмяРаздела = "Форма210_01Страница8");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма210Страница1" Тогда
		Возврат 4;
	ИначеЕсли Родитель = "Форма210_01Страница1" Тогда
		Возврат 8;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мКвартал = Лев(СтрПериодОтчета,1);
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//210.00Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "Признак7A;Признак7B;Признак7C");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение01;Приложение02");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010001401", "П000010001101;П000010001201;П000010001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002401", "П000010002101;П000010002201;П000010002301");
	//210.00Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020004401", "П000020004101;П000020004201;П000020004301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020005401", "П000020005101;П000020005201;П000020005301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020006401", "П000020006101;П000020006201;П000020006301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020007401", "П000020007101;П000020007201;П000020007301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020008401", "П000020008101;П000020008201;П000020008301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020009401", "П000020009101;П000020009201;П000020009301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020010401", "П000020010101;П000020010201;П000020010301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020011401", "П000020011101;П000020011201;П000020011301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020012401", "П000020012101;П000020012201;П000020012301");
	//210.00Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030016401", "П000030016101;П000030016201;П000030016301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030017401", "П000030017101;П000030017201;П000030017301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030018401", "П000030018101;П000030018201;П000030018301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030019401", "П000030019101;П000030019201;П000030019301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030020401", "П000030020101;П000030020201;П000030020301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030021401", "П000030021101;П000030021201;П000030021301");
	//210.00Стр4
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040022401", "П000040022101;П000040022201;П000040022301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040023401", "П000040023101;П000040023201;П000040023301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040024401", "П000040024101;П000040024201;П000040024301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000040025401", "П000040025101;П000040025201;П000040025301");
	//210.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110000101_1", "П000110000102_1;П000110000103_1;П000110000104_1;П000110000105_1");//Заполнение 1й строки в многострочной форме
	//210.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120000101_1", "П000120000102_1;П000120000103_1;П000120000104_1;П000120000105_1");//Заполнение 1й строки в многострочной форме
	//210.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000130000101_1", "П000130000102_1;П000130000103_1;П000130000104_1;П000130000105_1");//Заполнение 1й строки в многострочной форме
	//210.01Стр4
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000201_1", "П000140000202_1;П000140000203_1;П000140000204_1;П000140000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000103", "П000140000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000104", "П000140000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000140000105", "П000140000205");
	//210.01Стр5
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000201_1", "П000150000202_1;П000150000203_1;П000150000204_1;П000150000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000102", "П000150000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000103", "П000150000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000104", "П000150000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000150000105", "П000150000205");
	//210.01Стр6
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000160000201_1", "П000160000202_1;П000160000203_1;П000160000204_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000160000102", "П000160000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000160000103", "П000160000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000160000104", "П000160000204");
	//210.01Стр7
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000170000201_1", "П000170000202_1;П000170000203_1;П000170000204_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000170000102", "П000170000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000170000103", "П000170000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000170000104", "П000170000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000170000204", "П000140000203;П000170000203;П000140000205");
	//210.01Стр8
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000180000201_1", "П000180000202_1;П000180000203_1;П000180000204_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000180000102", "П000180000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000180000103", "П000180000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000180000104", "П000180000204");
	//210.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210001401", "П000210001101;П000210001201;П000210001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210002401", "П000210002101;П000210002201;П000210002301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210003401", "П000210003101;П000210003201;П000210003301");
	//210.02Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220004401", "П000220004101;П000220004201;П000220004301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220005401", "П000220005101;П000220005201;П000220005301");
	//СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("", "");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма210Страница1","Очередная");
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма210Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук";
	СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Квартал"].Значение) Тогда
		ТабличныйДокумент.Области["Квартал"].Значение = СтруктураРеквизитовФормы.мКвартал;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			НачПозиция = 1;
			Для Шаг = 1 По 3 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		Иначе
			НачПозиция = 1;
			Для Шаг = 1 По 2 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередная"].Значение = "" И
			ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
			ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
			ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
			
			ТабличныйДокумент.Области["Очередная"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОрганаИПН") <> Неопределено И ТабличныйДокумент.Области.Найти("КодНалоговогоОрганаОПВиСО") <> Неопределено
																				   И СтруктураРеквизитовФормы.НаимТекущегоРаздела ="Форма210Страница4" Тогда
		КодНалоговогоОргана = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
		Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОрганаИПН"].Значение) Тогда
			ТабличныйДокумент.Области["КодНалоговогоОрганаИПН"].Значение = КодНалоговогоОргана;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОрганаОПВиСО"].Значение) Тогда
			ТабличныйДокумент.Области["КодНалоговогоОрганаОПВиСО"].Значение = КодНалоговогоОргана;
		КонецЕсли;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ДатаПодачи") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ДатаПодачи"].Значение) Тогда
		ТабличныйДокумент.Области.ДатаПодачи.Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем СписокСтруктурныхЕдиниц;
	Перем НалоговыйКомитет;
	
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("СписокСтруктурныхЕдиниц", СписокСтруктурныхЕдиниц);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если Раздел.ИмяСтраницы = "Форма210_02Страница1"
			ИЛИ Раздел.ИмяСтраницы = "Форма210_02Страница2" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
		
	КонецЦикла;
	
	СтруктураФорма210_02 = Новый Структура;
	Если СписокСохранения.Свойство("Форма210_02", СтруктураФорма210_02) Тогда
		
		Для Каждого ЭлементСтруктуры Из СтруктураФорма210_02 Цикл
			
			Если ЭлементСтруктуры.Ключ = "Форма210_02" Тогда
				
				Для Каждого ЭлементФорма210_02 Из ЭлементСтруктуры.Значение Цикл
					
					Страница1 = Новый СписокЗначений;
					
					Страница1.Добавить(ЭлементФорма210_02.Страница1);
					
					ЭлементФорма210_02.Страница1 = Страница1;
					
					Страница2 = Новый СписокЗначений;
					
					Страница2.Добавить(ЭлементФорма210_02.Страница2);
					
					ЭлементФорма210_02.Страница2 = Страница2;
					
				КонецЦикла;
				
				ТаблСтрФорма210_02 = ЭтаФорма["ТаблицаСтраницыФорма210_02"];
				
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ТаблСтрФорма210_02);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	мСписокСтруктурныхЕдиниц = СписокСтруктурныхЕдиниц;
	НалоговыйКомитетФорма 	 = НалоговыйКомитет;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;

	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

		Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл

			СтруктураГруппы.Добавить();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногостраничный И НЕ Элемент.ТекущиеДанные.РазделМногострочный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета = 1)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета);
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
		
	//многострочные разделы
	Если ИмяТекРаздела = "Форма210_01Страница1"
		ИЛИ ИмяТекРаздела = "Форма210_01Страница2"
		ИЛИ ИмяТекРаздела = "Форма210_01Страница3"
		ИЛИ ИмяТекРаздела = "Форма210_01Страница4"
		ИЛИ ИмяТекРаздела = "Форма210_01Страница5"
		ИЛИ ИмяТекРаздела = "Форма210_01Страница6"
		ИЛИ ИмяТекРаздела = "Форма210_01Страница7"
		ИЛИ ИмяТекРаздела = "Форма210_01Страница8" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	//многоуровневые разделы
	ИначеЕсли ИмяТекРаздела = "Форма210_02Страница1" Тогда
		
		Если ЭтаФорма[мСтруктураФорма210_02Страница1и2.Форма210_02].Количество() = 0 Тогда
			ПостроениеПервоначальнойСтруктурыНаСервере(Истина, ИмяТекРаздела);
		КонецЕсли;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрСледующаяСтраница = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		СтрСледующаяСтраница.АктивнаяСтраница = Истина;
		
		СтруктураДанныхСледующаяСтраница = СтрСледующаяСтраница.Страница1[0].Значение;
		
		Если СтруктураДанныхСледующаяСтраница <> Неопределено Тогда
			Для Каждого Элемент Из СтруктураДанныхСледующаяСтраница Цикл
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;
												
				Попытка
					ТабличныйДокумент.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		УстановитьДоступностьКнопкиУдалитьСтраницу(ТаблицаСтраницРаздела);
		
	ИначеЕсли ИмяТекРаздела = "Форма210_02Страница2" Тогда
		
		Если ЭтаФорма[мСтруктураФорма210_02Страница1и2.Форма210_02].Количество() = 0 Тогда
			ПостроениеПервоначальнойСтруктурыНаСервере(Истина, ИмяТекРаздела);
			НомерСтраницыФорма210_02Страница2Отчета = 1;
		КонецЕсли;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		СтрСледующаяСтраница = СтрТаблицаСтраницы.Страница2[0].Значение;
		
		СтрТаблицаСтраницы.АктивнаяСтраница = Истина;
		
		Если СтрСледующаяСтраница <> Неопределено Тогда
			
			Для Каждого Элемент Из СтрСледующаяСтраница Цикл
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;
					
				Попытка
					ТабличныйДокумент.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
		КонецЕсли;
	
	//обычные разделы
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
		
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
		
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
		
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
		
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
			
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
							
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
						
	КонецЦикла;	
		
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела,ИзменятьАктивнуюСтраницу = Истина)
	
	// Многострочные разделы.
	Если НаимРаздела = "Форма210_01Страница1"
		ИЛИ НаимРаздела = "Форма210_01Страница2"
		ИЛИ НаимРаздела = "Форма210_01Страница3"
		ИЛИ НаимРаздела = "Форма210_01Страница4"
		ИЛИ НаимРаздела = "Форма210_01Страница5"
		ИЛИ НаимРаздела = "Форма210_01Страница6"
		ИЛИ НаимРаздела = "Форма210_01Страница7"
		ИЛИ НаимРаздела = "Форма210_01Страница8" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
		
	// Многоуровневые разделы
	ИначеЕсли НаимРаздела = "Форма210_02Страница1"
		ИЛИ НаимРаздела = "Форма210_02Страница2" Тогда	
		
		СохранитьАктивнуюФорму210_02НаСервере(НаимРаздела);
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если СтрТаблицаСтраницы.Количество() > 0 Тогда
			
			СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
			
			СтрТаблицаСтраницы.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;
		
	// Обычные разделы.
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьАктивнуюФорму210_02НаСервере(ИмяСтраницы)
	
	СохранитьАктивнуюФорму210_02(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьАктивнуюФорму210_02(Форма, ИмяСтраницы)
	Перем ТаблицаСтраницРаздела;
	
	Если Не Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	ТекТабличноеПоле      = Форма.ТабличныйДокумент;
	
	СтрТаблицаСтраницы    = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
					
		СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");
		
		Если ИмяСтраницы = "Форма210_02Страница2" Тогда
			
			Если СтрТаблицаСтраницы.Страница2.Количество() > 0 Тогда
				СтрТаблицаСтраницы.Страница2[0].Значение = СтруктураДанныхТекущейТаблицы;
			Иначе
				СтрТаблицаСтраницы.Страница2.Добавить(СтруктураДанныхТекущейТаблицы);
			КонецЕсли;	
				
		КонецЕсли;
		
		Если ИмяСтраницы = "Форма210_02Страница1" Тогда
			
			Если СтрТаблицаСтраницы.Страница1.Количество() > 0 Тогда
				СтрТаблицаСтраницы.Страница1[0].Значение = СтруктураДанныхТекущейТаблицы;
			Иначе
				СтрТаблицаСтраницы.Страница1.Добавить(СтруктураДанныхТекущейТаблицы);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	//СохранитьДанныеРаздела(ИмяРаздела);
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
	Если ИмяСтраницыПанели = "Форма210_01Страница7" Тогда
		//0000000(X)Y
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(ЭтаФорма.СтруктураЗависимыхЯчеекДляАвторасчета.П000170000204, Лев(ОбластьИмя,13)) > 0 Тогда
			
			Префикс = Сред(ОбластьИмя,Найти(ОбластьИмя,"_"),СтрДлина(ОбластьИмя) - (Найти(ОбластьИмя,"_")-1));
			Индекс = Число(Прав(Префикс,СтрДлина(Префикс)-1)) - 1;
			
			ОкрП000140000203 = 0;
			ОкрП000140000205 = 0;
			ОкрП000170000203 = 0;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_01Страница4" Тогда
				ОкрП000140000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.ТабличныйДокумент.Области["П000140000203" + Префикс].Значение);
			Иначе
				ОкрП000140000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.П0001400002[Индекс].П000140000203);
			КонецЕсли;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_01Страница4" Тогда
				ОкрП000140000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.ТабличныйДокумент.Области["П000140000205" + Префикс].Значение);
			Иначе
				ОкрП000140000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.П0001400002[Индекс].П000140000205);
			КонецЕсли;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_01Страница7" Тогда
				ОкрП000170000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.ТабличныйДокумент.Области["П000170000203" + Префикс].Значение);
			Иначе
				ОкрП000170000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.П0001700002[Индекс].П000170000203);
			КонецЕсли;
			
			П000170000204 = ОкрП000140000203 - ОкрП000170000203 - ОкрП000140000205;
			
			ЭтаФорма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000204" + Префикс, П000170000204);
			
			ЭтаФорма.П0001700002[Индекс].П000170000204 = П000170000204;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_01Страница7" Тогда
				ЭтаФорма.ТабличныйДокумент.Области["П000170000204" + Префикс].Значение = П000170000204;
			КонецЕсли;
			
			Расчет(ЭтаФорма, "Форма210_01Страница7", "П000170000204");  //перерасчет 7й стр. форма 210.01
			
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	Перем ТаблицаСтраницРаздела;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма210Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма210Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма210Страница1.Вставить("Очередная",           Очередная);
			Форма.СтруктураДанныхФорма210Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма210Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Форма.СтруктураДанныхФорма210Страница1.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма210Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма210Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение01 = "";
			Приложение02 = "";
			
			Если ОбластьИмя = "Приложение01" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Приложение01 = Форма.ТабличныйДокумент.Области.Приложение01.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("Приложение01") Тогда
					Приложение01 = Форма.СтруктураДанныхФорма210Страница1.Приложение01;
				КонецЕсли;
				
				Приложение01 = ?(Приложение01 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", Приложение01);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение01.Значение = Приложение01;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение02" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Приложение02 = Форма.ТабличныйДокумент.Области.Приложение02.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("Приложение02") Тогда
					Приложение02 = Форма.СтруктураДанныхФорма210Страница1.Приложение02;
				КонецЕсли;
				
				Приложение02 = ?(Приложение02 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение02", Приложение02);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение02.Значение = Приложение02;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			Признак7A = "";
			Признак7B = "";
			Признак7C = "";
			
			Если ОбластьИмя = "Признак7A" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Признак7A = Форма.ТабличныйДокумент.Области.Признак7A.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("Признак7A") Тогда
					Признак7A = Форма.СтруктураДанныхФорма210Страница1.Признак7A;
				КонецЕсли;
				
				Признак7A = ?(Признак7A = "Х","","Х");
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7A", Признак7A);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7A.Значение = Признак7A;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7B", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7B.Значение = "";
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7C", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7C.Значение = "";
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7B" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Признак7B = Форма.ТабличныйДокумент.Области.Признак7B.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("Признак7B") Тогда
					Признак7B = Форма.СтруктураДанныхФорма210Страница1.Признак7B;
				КонецЕсли;
				
				Признак7B = ?(Признак7B = "Х","","Х");
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7B", Признак7B);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7B.Значение = Признак7B;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7A", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7A.Значение = "";
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7C", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7C.Значение = "";
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7C" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Признак7C = Форма.ТабличныйДокумент.Области.Признак7C.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("Признак7C") Тогда
					Признак7C = Форма.СтруктураДанныхФорма210Страница1.Признак7C;
				КонецЕсли;
				
				Признак7C = ?(Признак7C = "Х","","Х");
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7C", Признак7C);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7C.Значение = Признак7C;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7A", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7A.Значение = "";
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма210Страница1.Вставить("Признак7B", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7B.Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.001 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010001401, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001101 = 0;
			ОкрП000010001201 = 0;
			ОкрП000010001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("П000010001101") Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница1.П000010001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("П000010001201") Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница1.П000010001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("П000010001301") Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница1.П000010001301);
			КонецЕсли;
			
			П000010001401 = ОкрП000010001101 + ОкрП000010001201 + ОкрП000010001301;
			
			Форма.СтруктураДанныхФорма210Страница1.Вставить("П000010001401", П000010001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010001401.Значение = П000010001401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.002 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002401, ОбластьИмя) > 0 Тогда
			
			ОкрП000010002101 = 0;
			ОкрП000010002201 = 0;
			ОкрП000010002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("П000010002101") Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница1.П000010002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("П000010002201") Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница1.П000010002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				ОкрП000010002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница1.Свойство("П000010002301") Тогда
				ОкрП000010002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница1.П000010002301);
			КонецЕсли;
			
			П000010002401 = ОкрП000010002101 + ОкрП000010002201 + ОкрП000010002301;
			
			Форма.СтруктураДанныхФорма210Страница1.Вставить("П000010002401", П000010002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002401.Значение = П000010002401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210Страница2" Тогда
		
		//210.00.004 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020004401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020004101 = 0;
			ОкрП000020004201 = 0;
			ОкрП000020004301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020004101") Тогда
				ОкрП000020004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020004101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020004201") Тогда
				ОкрП000020004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020004201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020004301") Тогда
				ОкрП000020004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020004301);
			КонецЕсли;
			
			П000020004401 = ОкрП000020004101 + ОкрП000020004201 + ОкрП000020004301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020004401", П000020004401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020004401.Значение = П000020004401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.005 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020005401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020005101 = 0;
			ОкрП000020005201 = 0;
			ОкрП000020005301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020005101") Тогда
				ОкрП000020005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020005201") Тогда
				ОкрП000020005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020005201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020005301") Тогда
				ОкрП000020005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020005301);
			КонецЕсли;
			
			П000020005401 = ОкрП000020005101 + ОкрП000020005201 + ОкрП000020005301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020005401", П000020005401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020005401.Значение = П000020005401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.006 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020006401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020006101 = 0;
			ОкрП000020006201 = 0;
			ОкрП000020006301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020006101") Тогда
				ОкрП000020006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020006201") Тогда
				ОкрП000020006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020006301") Тогда
				ОкрП000020006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020006301);
			КонецЕсли;
			
			П000020006401 = ОкрП000020006101 + ОкрП000020006201 + ОкрП000020006301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020006401", П000020006401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020006401.Значение = П000020006401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.007 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ  СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020007401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020007101 = 0;
			ОкрП000020007201 = 0;
			ОкрП000020007301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020007101") Тогда
				ОкрП000020007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020007201") Тогда
				ОкрП000020007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020007301") Тогда
				ОкрП000020007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020007301);
			КонецЕсли;
			
			П000020007401 = ОкрП000020007101 + ОкрП000020007201 + ОкрП000020007301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020007401", П000020007401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020007401.Значение = П000020007401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.008 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020008401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020008101 = 0;
			ОкрП000020008201 = 0;
			ОкрП000020008301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020008101") Тогда
				ОкрП000020008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020008101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020008201") Тогда
				ОкрП000020008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020008201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020008301") Тогда
				ОкрП000020008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020008301);
			КонецЕсли;
			
			П000020008401 = ОкрП000020008101 + ОкрП000020008201 + ОкрП000020008301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020008401", П000020008401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020008401.Значение = П000020008401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.009 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ  СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020009401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020009101 = 0;
			ОкрП000020009201 = 0;
			ОкрП000020009301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020009101") Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020009201") Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020009301") Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020009301);
			КонецЕсли;
			
			П000020009401 = ОкрП000020009101 + ОкрП000020009201 + ОкрП000020009301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020009401", П000020009401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020009401.Значение = П000020009401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.010 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ  СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020010401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020010101 = 0;
			ОкрП000020010201 = 0;
			ОкрП000020010301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020010101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020010101") Тогда
				ОкрП000020010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020010101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020010201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020010201") Тогда
				ОкрП000020010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020010201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020010301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020010301") Тогда
				ОкрП000020010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020010301);
			КонецЕсли;
			
			П000020010401 = ОкрП000020010101 + ОкрП000020010201 + ОкрП000020010301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020010401", П000020010401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020010401.Значение = П000020010401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.011 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020011401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020011101 = 0;
			ОкрП000020011201 = 0;
			ОкрП000020011301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020011101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020011101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020011101") Тогда
				ОкрП000020011101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020011101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020011201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020011201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020011201") Тогда
				ОкрП000020011201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020011201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020011301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020011301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020011301") Тогда
				ОкрП000020011301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020011301);
			КонецЕсли;
			
			П000020011401 = ОкрП000020011101 + ОкрП000020011201 + ОкрП000020011301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020011401", П000020011401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020011401.Значение = П000020011401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.012 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020012401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020012101 = 0;
			ОкрП000020012201 = 0;
			ОкрП000020012301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020012101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020012101") Тогда
				ОкрП000020012101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020012101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020012201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020012201") Тогда
				ОкрП000020012201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020012201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				ОкрП000020012301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020012301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница2.Свойство("П000020012301") Тогда
				ОкрП000020012301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница2.П000020012301);
			КонецЕсли;
			
			П000020012401 = ОкрП000020012101 + ОкрП000020012201 + ОкрП000020012301;
			
			Форма.СтруктураДанныхФорма210Страница2.Вставить("П000020012401", П000020012401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020012401.Значение = П000020012401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210Страница3" Тогда
		
		//210.00.016 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030016401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030016101 = 0;
			ОкрП000030016201 = 0;
			ОкрП000030016301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030016101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030016101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030016101") Тогда
				ОкрП000030016101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030016101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030016201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030016201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030016201") Тогда
				ОкрП000030016201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030016201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030016301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030016301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030016301") Тогда
				ОкрП000030016301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030016301);
			КонецЕсли;
			
			П000030016401 = ОкрП000030016101 + ОкрП000030016201 + ОкрП000030016301;
			
			Форма.СтруктураДанныхФорма210Страница3.Вставить("П000030016401", П000030016401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030016401.Значение = П000030016401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.017 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030017401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030017101 = 0;
			ОкрП000030017201 = 0;
			ОкрП000030017301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030017101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030017101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030017101") Тогда
				ОкрП000030017101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030017101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030017201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030017201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030017201") Тогда
				ОкрП000030017201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030017201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030017301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030017301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030017301") Тогда
				ОкрП000030017301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030017301);
			КонецЕсли;
			
			П000030017401 = ОкрП000030017101 + ОкрП000030017201 + ОкрП000030017301;
			
			Форма.СтруктураДанныхФорма210Страница3.Вставить("П000030017401", П000030017401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030017401.Значение = П000030017401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.018 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030018401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030018101 = 0;
			ОкрП000030018201 = 0;
			ОкрП000030018301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030018101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030018101") Тогда
				ОкрП000030018101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030018101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030018201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030018201") Тогда
				ОкрП000030018201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030018201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030018301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030018301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030018301") Тогда
				ОкрП000030018301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030018301);
			КонецЕсли;
			
			П000030018401 = ОкрП000030018101 + ОкрП000030018201 + ОкрП000030018301;
			
			Форма.СтруктураДанныхФорма210Страница3.Вставить("П000030018401", П000030018401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030018401.Значение = П000030018401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.019 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030019401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030019101 = 0;
			ОкрП000030019201 = 0;
			ОкрП000030019301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030019101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030019101") Тогда
				ОкрП000030019101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030019101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030019201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030019201") Тогда
				ОкрП000030019201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030019201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030019301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030019301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030019301") Тогда
				ОкрП000030019301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030019301);
			КонецЕсли;
			
			П000030019401 = ОкрП000030019101 + ОкрП000030019201 + ОкрП000030019301;
			
			Форма.СтруктураДанныхФорма210Страница3.Вставить("П000030019401", П000030019401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030019401.Значение = П000030019401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.020 IV
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030020401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030020101 = 0;
			ОкрП000030020201 = 0;
			ОкрП000030020301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030020101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030020101") Тогда
				ОкрП000030020101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030020101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030020201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030020201") Тогда
				ОкрП000030020201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030020201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030020301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030020301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030020301") Тогда
				ОкрП000030020301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030020301);
			КонецЕсли;
			
			П000030020401 = ОкрП000030020101 + ОкрП000030020201 + ОкрП000030020301;
			
			Форма.СтруктураДанныхФорма210Страница3.Вставить("П000030020401", П000030020401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030020401.Значение = П000030020401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.021 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030021401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030021101 = 0;
			ОкрП000030021201 = 0;
			ОкрП000030021301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030021101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030021101") Тогда
				ОкрП000030021101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030021101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030021201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030021201") Тогда
				ОкрП000030021201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030021201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				ОкрП000030021301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030021301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница3.Свойство("П000030021301") Тогда
				ОкрП000030021301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница3.П000030021301);
			КонецЕсли;
			
			П000030021401 = ОкрП000030021101 + ОкрП000030021201 + ОкрП000030021301;
			
			Форма.СтруктураДанныхФорма210Страница3.Вставить("П000030021401", П000030021401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030021401.Значение = П000030021401;
			КонецЕсли;
			
		КонецЕсли;
		
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210Страница4" Тогда
		
		//210.00.022 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040022401, ОбластьИмя) > 0 Тогда
			
			ОкрП000040022101 = 0;
			ОкрП000040022201 = 0;
			ОкрП000040022301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040022101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040022101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040022101") Тогда
				ОкрП000040022101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040022101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040022201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040022201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040022201") Тогда
				ОкрП000040022201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040022201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040022301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040022301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040022301") Тогда
				ОкрП000040022301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040022301);
			КонецЕсли;
			
			П000040022401 = ОкрП000040022101 + ОкрП000040022201 + ОкрП000040022301;
			
			Форма.СтруктураДанныхФорма210Страница4.Вставить("П000040022401", П000040022401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040022401.Значение = П000040022401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.023 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040023401, ОбластьИмя) > 0 Тогда
			
			ОкрП000040023101 = 0;
			ОкрП000040023201 = 0;
			ОкрП000040023301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040023101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040023101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040023101") Тогда
				ОкрП000040023101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040023101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040023201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040023201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040023201") Тогда
				ОкрП000040023201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040023201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040023301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040023301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040023301") Тогда
				ОкрП000040023301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040023301);
			КонецЕсли;
			
			П000040023401 = ОкрП000040023101 + ОкрП000040023201 + ОкрП000040023301;
			
			Форма.СтруктураДанныхФорма210Страница4.Вставить("П000040023401", П000040023401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040023401.Значение = П000040023401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.024 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040024401, ОбластьИмя) > 0 Тогда
			
			ОкрП000040024101 = 0;
			ОкрП000040024201 = 0;
			ОкрП000040024301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040024101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040024101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040024101") Тогда
				ОкрП000040024101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040024101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040024201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040024201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040024201") Тогда
				ОкрП000040024201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040024201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040024301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040024301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040024301") Тогда
				ОкрП000040024301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040024301);
			КонецЕсли;
			
			П000040024401 = ОкрП000040024101 + ОкрП000040024201 + ОкрП000040024301;
			
			Форма.СтруктураДанныхФорма210Страница4.Вставить("П000040024401", П000040024401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040024401.Значение = П000040024401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.00.025 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000040025401, ОбластьИмя) > 0 Тогда
			
			ОкрП000040025101 = 0;
			ОкрП000040025201 = 0;
			ОкрП000040025301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040025101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040025101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040025101") Тогда
				ОкрП000040025101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040025101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040025201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040025201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040025201") Тогда
				ОкрП000040025201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040025201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				ОкрП000040025301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000040025301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма210Страница4.Свойство("П000040025301") Тогда
				ОкрП000040025301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма210Страница4.П000040025301);
			КонецЕсли;
			
			П000040025401 = ОкрП000040025101 + ОкрП000040025201 + ОкрП000040025301;
			
			Форма.СтруктураДанныхФорма210Страница4.Вставить("П000040025401", П000040025401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница4" Тогда
				Форма.ТабличныйДокумент.Области.П000040025401.Значение = П000040025401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница1" Тогда
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110000101_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000110000101_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница2" Тогда
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120000101_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000120000101_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница3"  Тогда
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000130000101_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000130000101_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница4" Тогда
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000140000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001M
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000140000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
					СуммаП000140000103 = СуммаП000140000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000140000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000140000103.Значение = СуммаП000140000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
					СуммаП000140000103 = СуммаП000140000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]][Ном - 1].П000140000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000103", СуммаП000140000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001N
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000140000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
					СуммаП000140000104 = СуммаП000140000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000140000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000140000104.Значение = СуммаП000140000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
					СуммаП000140000104 = СуммаП000140000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]][Ном - 1].П000140000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000104", СуммаП000140000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001O
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000140000105, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000140000105 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
					СуммаП000140000105 = СуммаП000140000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000140000205_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000140000105.Значение = СуммаП000140000105;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]].Количество() Цикл
					СуммаП000140000105 = СуммаП000140000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы14]][Ном - 1].П000140000205);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000105", СуммаП000140000105);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если    "П000140000203" = Лев(ОбластьИмя,13)
			ИЛИ "П000140000205" = Лев(ОбластьИмя,13) Тогда
		
			Расчет(Форма, "Форма210_01Страница7", ОбластьИмя);  //перерасчет 7й стр. форма 210.01
		
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница5" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000150000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		//00000001P
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000150000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000102 = СуммаП000150000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000150000102.Значение = СуммаП000150000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000102 = СуммаП000150000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000102", СуммаП000150000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001Q
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000150000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000103 = СуммаП000150000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000150000103.Значение = СуммаП000150000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000103 = СуммаП000150000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000103", СуммаП000150000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001R
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000150000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000104 = СуммаП000150000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000150000104.Значение = СуммаП000150000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000104 = СуммаП000150000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000104", СуммаП000150000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001S
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000150000105, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000150000105 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000105 = СуммаП000150000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000150000205_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000150000105.Значение = СуммаП000150000105;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]].Количество() Цикл
					СуммаП000150000105 = СуммаП000150000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы15]][Ном - 1].П000150000205);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000105", СуммаП000150000105);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница6" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000160000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000160000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		//00000001T
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000160000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000160000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
					СуммаП000160000102 = СуммаП000160000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000160000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000160000102.Значение = СуммаП000160000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
					СуммаП000160000102 = СуммаП000160000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]][Ном - 1].П000160000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000102", СуммаП000160000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001U
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000160000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000160000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
					СуммаП000160000103 = СуммаП000160000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000160000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000160000103.Значение = СуммаП000160000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
					СуммаП000160000103 = СуммаП000160000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]][Ном - 1].П000160000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000103", СуммаП000160000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001T
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000160000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000160000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
					СуммаП000160000104 = СуммаП000160000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000160000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000160000104.Значение = СуммаП000160000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]].Количество() Цикл
					СуммаП000160000104 = СуммаП000160000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы16]][Ном - 1].П000160000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000104", СуммаП000160000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница7" Тогда
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000170000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000170000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001W
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000170000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000170000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]].Количество() Цикл
					СуммаП000170000102 = СуммаП000170000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000170000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000170000102.Значение = СуммаП000170000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]].Количество() Цикл
					СуммаП000170000102 = СуммаП000170000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]][Ном - 1].П000170000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000102", СуммаП000170000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001X
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000170000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000170000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]].Количество() Цикл
					СуммаП000170000103 = СуммаП000170000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000170000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000170000103.Значение = СуммаП000170000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]].Количество() Цикл
					СуммаП000170000103 = СуммаП000170000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]][Ном - 1].П000170000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000103", СуммаП000170000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001Y
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000170000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000170000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]].Количество() Цикл
					СуммаП000170000104 = СуммаП000170000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000170000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000170000104.Значение = СуммаП000170000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]].Количество() Цикл
					СуммаП000170000104 = СуммаП000170000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы17]][Ном - 1].П000170000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000104", СуммаП000170000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_01Страница8" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000180000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма210_01Страница1.Вставить("П000110000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница2.Вставить("П000120000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница3.Вставить("П000130000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница4.Вставить("П000140000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница5.Вставить("П000150000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница6.Вставить("П000160000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница7.Вставить("П000170000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000201_1", НомерСтроки);
			
			Форма.П0001100001[0].П000110000101 = НомерСтроки;
			Форма.П0001200001[0].П000120000101 = НомерСтроки;
			Форма.П0001300001[0].П000130000101 = НомерСтроки;
			Форма.П0001400002[0].П000140000201 = НомерСтроки;
			Форма.П0001500002[0].П000150000201 = НомерСтроки;
			Форма.П0001600002[0].П000160000201 = НомерСтроки;
			Форма.П0001700002[0].П000170000201 = НомерСтроки;
			Форма.П0001800002[0].П000180000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000180000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		//00000001Z
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000180000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000180000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]].Количество() Цикл
					СуммаП000180000102 = СуммаП000180000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000180000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000180000102.Значение = СуммаП000180000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]].Количество() Цикл
					СуммаП000180000102 = СуммаП000180000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]][Ном - 1].П000180000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000102", СуммаП000180000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001AA
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000180000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000180000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]].Количество() Цикл
					СуммаП000180000103 = СуммаП000180000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000180000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000180000103.Значение = СуммаП000180000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]].Количество() Цикл
					СуммаП000180000103 = СуммаП000180000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]][Ном - 1].П000180000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000103", СуммаП000180000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001AB
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000180000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000180000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]].Количество() Цикл
					СуммаП000180000104 = СуммаП000180000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000180000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000180000104.Значение = СуммаП000180000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]].Количество() Цикл
					СуммаП000180000104 = СуммаП000180000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы18]][Ном - 1].П000180000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма210_01Страница8.Вставить("П000180000104", СуммаП000180000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_02Страница1" Тогда
		
		Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("КоличествоПриложений210_02", ТаблицаСтраницРаздела.Количество());
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.КоличествоПриложений210_02.Значение = ТаблицаСтраницРаздела.Количество();
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		Если ОбластьИмя = "УдалитьСтраницу" Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Первоначальная", Первоначальная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Очередная",           Очередная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Дополнительная", Дополнительная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("ПоУведомлению",   ПоУведомлению);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("НомерУведомления", "");
				СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		//210.02.001 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210001401, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000210001101 = 0;
			ОкрП000210001201 = 0;
			ОкрП000210001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210001101") Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210001101") Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210001101") Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210001301);
			КонецЕсли;
			
			П000210001401 = ОкрП000210001101 + ОкрП000210001201 + ОкрП000210001301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000210001401", П000210001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210001401.Значение = П000210001401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.02.002 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210002401, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000210002101 = 0;
			ОкрП000210002201 = 0;
			ОкрП000210002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210002101") Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210002201") Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210002301") Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210002301);
			КонецЕсли;
			
			П000210002401 = ОкрП000210002101 + ОкрП000210002201 + ОкрП000210002301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000210002401",П000210002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210002401.Значение = П000210002401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.02.003 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210003401, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000210003101 = 0;
			ОкрП000210003201 = 0;
			ОкрП000210003301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210003101") Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210003101") Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210003101") Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210003301);
			КонецЕсли;
			
			П000210003401 = ОкрП000210003101 + ОкрП000210003201 + ОкрП000210003301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000210003401",П000210003401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210003401.Значение = П000210003401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма210_02Страница2" Тогда
		
		Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		
		Форма.СтруктураДанныхФорма210Страница1.Вставить("КоличествоПриложений210_02", ТаблицаСтраницРаздела.Количество());
		Форма.СтруктураДанныхФорма210Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210Страница1" Тогда
			Форма.ТабличныйДокумент.Области.КоличествоПриложений210_02.Значение = ТаблицаСтраницРаздела.Количество();
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		//210.02.004 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220004401, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000220004101 = 0;
			ОкрП000220004201 = 0;
			ОкрП000220004301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				ОкрП000220004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220004101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220004101") Тогда
				ОкрП000220004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220004101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				ОкрП000220004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220004201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220004201") Тогда
				ОкрП000220004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220004201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				ОкрП000220004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220004301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220004301") Тогда
				ОкрП000220004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220004301);
			КонецЕсли;
			
			П000220004401 = ОкрП000220004101 + ОкрП000220004201 + ОкрП000220004301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000220004401",П000220004401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220004401.Значение = П000220004401;
			КонецЕсли;
			
		КонецЕсли;
		
		//210.02.005 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220005401, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000220005101 = 0;
			ОкрП000220005201 = 0;
			ОкрП000220005301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				ОкрП000220005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220005101") Тогда
				ОкрП000220005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				ОкрП000220005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220005201") Тогда
				ОкрП000220005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220005201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				ОкрП000220005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220005301") Тогда
				ОкрП000220005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220005301);
			КонецЕсли;
			
			П000220005401 = ОкрП000220005101 + ОкрП000220005201 + ОкрП000220005301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000220005401",П000220005401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220005401.Значение = П000220005401;
			КонецЕсли;
			
		КонецЕсли;
		
	//Авторасчет
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		
		Расчет(Форма,"Форма210Страница1", "");
		Расчет(Форма,"Форма210Страница2", "");
		Расчет(Форма,"Форма210Страница3", "");
		Расчет(Форма,"Форма210Страница4", "");
		Расчет(Форма,"Форма210_01Страница1", "");
		Расчет(Форма,"Форма210_01Страница2", "");
		Расчет(Форма,"Форма210_01Страница3", "");
		Расчет(Форма,"Форма210_01Страница4", "");
		Расчет(Форма,"Форма210_01Страница5", "");
		Расчет(Форма,"Форма210_01Страница6", "");
		Расчет(Форма,"Форма210_01Страница7", "");
		Расчет(Форма,"Форма210_01Страница8", "");
		
		Для Индекс = 1 По Форма.П0001700002.Количество() Цикл
			Расчет(Форма,"Форма210_01Страница7", "П000140000203_" + Индекс);
		КонецЦикла;
		
		Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		Для Каждого СтрокаТЗ из ТаблицаСтраницРаздела Цикл
			СтрокаТЗ.АктивнаяСтраница = Истина;
			Расчет(Форма,"Форма210_02Страница1", "");
			Расчет(Форма,"Форма210_02Страница2", "");
			СтрокаТЗ.АктивнаяСтраница = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка (ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	СформироватьСписокФормБезИерархии();
	
	ТекстВыгрузки = УниверсальнаяВыгрузкаНаСервере();
	
	Если ТекстВыгрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма210_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции

&НаСервере
Функция  УниверсальнаяВыгрузкаНаСервере()
	Возврат РегламентированнаяОтчетностьРК.ВыгрузитьОтчетВXMLДляСОНО(ЭтотОбъект);
КонецФункции

&НаСервере
Процедура СформироватьСписокФормБезИерархии()
	
	мСписокФормБезИерархии.ПолучитьЭлементы().Очистить();
	
	МакетПоказателей = Отчеты[Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("Показатели");
	Префикс = Прав(ЭтаФорма.СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	ОбластьПоказателей = МакетПоказателей.Область("Форма210_" + Префикс);
	
	Для Ном = ОбластьПоказателей.Верх По ОбластьПоказателей.Низ Цикл
		
		НоваяСтрока = мСписокФормБезИерархии.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяФормы			= СокрП(МакетПоказателей.Область(Ном, 1).Текст);
		НоваяСтрока.Выгружать			= ?(СокрП(МакетПоказателей.Область(Ном, 2).Текст)= "1",Истина,Ложь);
		НоваяСтрока.Многострочность		= ?(СокрП(МакетПоказателей.Область(Ном, 3).Текст)= "1",Истина,Ложь);
		НоваяСтрока.КодФормы			= СокрП(МакетПоказателей.Область(Ном, 4).Текст);
		НоваяСтрока.КоличествоНаЛисте	= Число(СокрП(МакетПоказателей.Область(Ном, 5).Текст));
		НоваяСтрока.КоличествоСтраницПриложения = Число(СокрП(МакетПоказателей.Область(Ном, 6).Текст));
		
		Если НоваяСтрока.Многострочность <> Истина Тогда
			Для КолСтр = 1 По НоваяСтрока.КоличествоСтраницПриложения  Цикл
				Для Каждого Элемент Из ЭтаФорма["СтруктураДанных"+ НоваяСтрока.КодФормы + "Страница" + КолСтр] Цикл
					НовыйЭлемент = НоваяСтрока.Значение.Добавить();
					НовыйЭлемент.ИмяОбласти = Элемент.Ключ;
					НовыйЭлемент.Значение = Элемент.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьМногострочнуюСтруктуруДляВыгрузки (ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Возврат СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы);
	
КонецФункции

&НаСервере
Функция СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Перем ТаблицаСтраницРаздела;
	
	Если ТекущееИмяФормы = Неопределено тогда
		ТекущееИмяФормы = "Форма210_02";
	КонецЕсли;	
	
	Если ТекущееИмяФормы = "Форма210_02" Тогда 
		
		Если ЭтаФорма["ТаблицаСтраницы"+ТекущееИмяФормы] = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		КоличествоСтраниц = 0;
		Для каждого ЭлементДерева из мСписокФормБезИерархии.ПолучитьЭлементы() Цикл
			
			Если ЭлементДерева.КодФормы = ТекущееИмяФормы Тогда
				КоличествоСтраниц = ЭлементДерева.КоличествоСтраницПриложения;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		МногострочнаяСтруктура = Новый Структура;
		
		Для Ном = 1 По КоличествоСтраниц Цикл
			
			ДанныеСтраницы = Новый Структура;
			
			ДанныеСтраницы.Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
			
			ТаблицаЗначений = Новый ТаблицаЗначений;
			
			Для каждого СтрокаСписка из ТаблицаСтраницРаздела.Выгрузить(,("Страница"+Ном)) Цикл
				
				НоваяСтрокаТЗ = ТаблицаЗначений.Добавить();
				
				СтруктураСтраницы = СтрокаСписка["Страница"+Ном][0].Значение;
				
				Для Каждого ЭлементСтрутуры из СтруктураСтраницы Цикл
					
					Если ТаблицаЗначений.Колонки.Найти(ЭлементСтрутуры.Ключ) = Неопределено Тогда
						ТипКолонки = Новый Массив;
						ТипКолонки.Добавить(ТипЗнч(ЭлементСтрутуры.Значение));
						ТаблицаЗначений.Колонки.Добавить(ЭлементСтрутуры.Ключ, Новый ОписаниеТипов(ТипКолонки));
					КонецЕсли;
					
					НоваяСтрокаТЗ[ЭлементСтрутуры.Ключ] = ЭлементСтрутуры.Значение;
					
				КонецЦикла;
				
			КонецЦикла;
			
			ДанныеСтраницы.Вставить("Строки",      ТаблицаЗначений);
			
			МногострочнаяСтруктура.Вставить("Страница"+Ном, ДанныеСтраницы);
			
		КонецЦикла;
		
	Иначе 
		
		МногострочнаяСтруктура = Новый Структура;
		
		ТекущийЛист = Неопределено;
		НомерСтроки = 0;
		КоличествоСтрок = ТаблицаМногострочнойФормы.Количество();
		
		Пока Истина Цикл 
			
			Если НомерСтроки >= КоличествоСтрок Тогда 
				Прервать;
			КонецЕсли;
			
			СтрокаТЗ = ТаблицаМногострочнойФормы[НомерСтроки];
			
			Если Не СтрокаТЗ.ИмяЛиста = ТекущийЛист Тогда
				
				МногострочнаяСтруктура.Вставить(СтрокаТЗ.ИмяЛиста, Новый Структура);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("Строки", Новый ТаблицаЗначений);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
				
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Значение");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяОбласти");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяПараметра");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Итог");
				
				
				ТекущийЛист = СтрокаТЗ.ИмяЛиста;
				
			КонецЕсли;
			
			Если СтрокаТЗ.КоличествоROW = "0" Тогда
				//Заполняем таблицу значений параметров шапки
				Если ЗначениеЗаполнено(СтрокаТЗ.ИмяЯчейки) Тогда
					//Добавим новую строку в ТЗ значений шапки таблицы
					НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Добавить();
					
					//Получим значение параметра из структуры формы
					ЗначениеПараметра = ЭтаФорма["СтруктураДанных" + СтрокаТЗ.КодФормы + ?(СтрокаТЗ.КодФормы = "Форма210_01", СтрокаТЗ.ИмяЛиста, "Страница1")][СтрокаТЗ.ИмяЯчейки];
					
					НоваяСтрока.Значение 		= ЗначениеПараметра;
					НоваяСтрока.ИмяПараметра 	= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.ИмяОбласти 		= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.Итог 			= Ложь;
				КонецЕсли;
			Иначе 
				//А это уже строки таблицы
				//Определим состав колонок многострочной формы
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ИмяЛиста", СтрокаТЗ.ИмяЛиста);
				СтруктураПоиска.Вставить("КоличествоROW", "10");
				СтрокиТаблицы = ТаблицаМногострочнойФормы.НайтиСтроки(СтруктураПоиска);
				
				ИмяТаблицы = Сред(СтрокаТЗ.ИмяЯчейки, 1, 11);
				
				//Проверям есть ли у нас вообще записи в многострочной форме
				//И формируем набор колонок таблицы значений
				ЕстьЗаписи = Ложь;
				Если Не ЭтотОбъект[ИмяТаблицы].Количество() = 0 Тогда
					Для Каждого Строка Из СтрокиТаблицы Цикл
						ИмяЯчейки = Сред(Строка.ИмяЯчейки, 1, 13);
						МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Колонки.Добавить(ИмяЯчейки);
						Если ЗначениеЗаполнено(ЭтотОбъект[ИмяТаблицы][0][ИмяЯчейки]) Тогда 
							ЕстьЗаписи = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ЕстьЗаписи Тогда
					//Если записи обнаружены то заполняем таблицу значений
					Для Каждого СтрокаТаблицы Из ЭтотОбъект[ИмяТаблицы] Цикл 
						НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					КонецЦикла;
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
	КонецЕсли;
		
	Возврат МногострочнаяСтруктура;

КонецФункции

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма210Страница1.Очистить();
	СтруктураДанныхФорма210Страница2.Очистить();
	СтруктураДанныхФорма210_01Страница1.Очистить();
	СтруктураДанныхФорма210_01Страница2.Очистить();
	СтруктураДанныхФорма210_01Страница3.Очистить();
	СтруктураДанныхФорма210_01Страница4.Очистить();
	СтруктураДанныхФорма210_01Страница5.Очистить();
	СтруктураДанныхФорма210_01Страница6.Очистить();
	СтруктураДанныхФорма210_01Страница7.Очистить();
	СтруктураДанныхФорма210_01Страница8.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма210Страница1", 1);
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
		ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	мПараметры.Вставить("СписокСтруктурныхЕдиниц", Истина);
	мПараметры.Вставить("РежимВыбораСтруктурныхЕдиниц", "ПоНалогоплательщику");
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("СтруктурныеЕдиницы",        мСписокСтруктурныхЕдиниц);
	ПараметрыФормы.Вставить("мПараметры",                              мПараметры);
	ПараметрыФормы.Вставить("НалоговыйКомитет", 		    НалоговыйКомитетФорма);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210Страница1";
	СтрокаУровня1.Представление            = "Форма 210.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);

	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_01Страница1";
	СтрокаУровня1.Представление            = "Форма 210.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма210_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма210_02Страница1";
	СтрокаУровня1.Представление            = "Форма 210.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма210_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьАвтоПослеСохранениеОтчета", 
		ЭтотОбъект, 
		ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ЗаполнитьАвтоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	//
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц",  мСписокСтруктурныхЕдиниц);
	ПараметрыОтчета.Вставить("НалоговыйКомитет",		 СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма210Страница1", СтруктураДанныхФорма210Страница1);
	Контейнер.Вставить("Форма210Страница2", СтруктураДанныхФорма210Страница2);
	Контейнер.Вставить("Форма210Страница3", СтруктураДанныхФорма210Страница3);
	Контейнер.Вставить("Форма210Страница4", СтруктураДанныхФорма210Страница4);
	Контейнер.Вставить("Форма210_01Страница1", СтруктураДанныхФорма210_01Страница1);
	Контейнер.Вставить("Форма210_01Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001100001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_01Страница2", СтруктураДанныхФорма210_01Страница2);
	Контейнер.Вставить("Форма210_01Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001200001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_01Страница3", СтруктураДанныхФорма210_01Страница3);
	Контейнер.Вставить("Форма210_01Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001300001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_01Страница4", СтруктураДанныхФорма210_01Страница4);
	Контейнер.Вставить("Форма210_01Страница4_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001400002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_01Страница5", СтруктураДанныхФорма210_01Страница5);
	Контейнер.Вставить("Форма210_01Страница5_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001500002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_01Страница6", СтруктураДанныхФорма210_01Страница6);
	Контейнер.Вставить("Форма210_01Страница6_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001600002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_01Страница7", СтруктураДанныхФорма210_01Страница7);
	Контейнер.Вставить("Форма210_01Страница7_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001700002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_01Страница8", СтруктураДанныхФорма210_01Страница8);
	Контейнер.Вставить("Форма210_01Страница8_ДанныеДопСтрок", ДанныеФормыВЗначение(П0001800002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма210_02", ТаблицаСтраницыФорма210_02);
	
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(ИмяОтчета(ЭтаФорма.ИмяФормы), ИмяФормыОтчета(ЭтаФорма.ИмяФормы), ПараметрыОтчета, Контейнер);
	
	Для Каждого ЭлементКонтейнера Из Контейнер Цикл
		
		ИмяСтраницы = ЭлементКонтейнера.Ключ;
		Если ИмяСтраницы = "Форма210_02" Тогда
			Продолжить;
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001100001);
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001200001);
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001300001);
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница4_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001400002);
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница5_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001500002);
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница6_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001600002);
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница7_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001700002);
		ИначеЕсли ИмяСтраницы = "Форма210_01Страница8_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0001800002);
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяСтраницы] = ЭлементКонтейнера.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма210Страница1", 1);

	РасчетНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	ТаблицаСтраницыФорма210_02.Очистить();
	ПостроениеПервоначальнойСтруктурыНаСервере(,"Форма210_02Страница1");
	
	П0001100001.Очистить();
	П0001200001.Очистить();
	П0001300001.Очистить();
	П0001400002.Очистить();
	П0001500002.Очистить();
	П0001600002.Очистить();
	П0001700002.Очистить();
	П0001800002.Очистить();
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
			
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
		
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", 		 ПоказателиОтчета);
	СписокСохранения.Вставить("СписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СписокСохранения.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	
	МассивТиповНеопределено = Новый Массив;
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	// вставляем данные многостраничных разделов
	Форма210_02 = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураФорма210_02Страница1и2 Цикл
		
		Форма210_02.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
		ТаблЗнач = Неопределено;
		
		Если Форма210_02.Свойство(ЭлементСтруктуры.Ключ, ТаблЗнач) Тогда
			
			Если НЕ ТаблЗнач.Колонки.Найти("Страница1") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("Страница1");
				ТаблЗнач.Колонки.Добавить("Страница1", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Страница1 = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Страница1[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ТаблЗнач.Колонки.Найти("Страница2") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("Страница2");
				ТаблЗнач.Колонки.Добавить("Страница2", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Страница2 = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Страница2[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокСохранения.Вставить("Форма210_02", Форма210_02);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если Раздел.ИмяСтраницы = "Форма210_02Страница1"
			ИЛИ Раздел.ИмяСтраницы = "Форма210_02Страница2" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
				   И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			
			Если ЭлеменетДерева.ИмяСтраницы = "Форма210_02Страница1" Тогда 
				
				Для Номер = 0 По ТаблицаСтраницыФорма210_02.Количество()-1 Цикл
					
					ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы,Номер+1);	
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("НаименованиеЛиста",  "Форма 210.02 Лист "+ (Номер+1) +" Страница 1");
					СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
					СтруктураПараметров.Вставить("ИмяСтраницы",        "Форма210_02Страница1");
					Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
					СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
					ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма210_02Страница2",Номер+1);	
					СтруктураПараметров = Новый Структура;
					СтруктураПараметров.Вставить("НаименованиеЛиста",  "Форма 210.02 Лист "+ (Номер+1) +" Страница 2");
					СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
					СтруктураПараметров.Вставить("ИмяСтраницы",        "Форма210_02Страница2");
					Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
					СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
					
					РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
					
				КонецЦикла;
				
			Иначе
				
				ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 Тогда
		ДобавитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Гиперссылка Тогда
		УдалитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 И Область.Текст <> "" Тогда
		ДобавитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Текст <> "" Тогда
		УдалитьСтраницу("");
	КонецЕсли;
	
	//Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7A") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7B") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7C") > 0) 
	 ИЛИ (Найти(ИмяЯчейки, "Приложение01") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Приложение02") > 0)Тогда
		РасчетНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела,ИмяЯчейки);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтраницуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Удалить текущий Лист?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РазделыОтчета.ТекущиеДанные;
	
	НомерУдоляемойСтраницы = ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
	Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьЭлементы().Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДанныхФормыДерево = ТекущиеДанные.ПолучитьЭлементы();
	ЭлементДереваПослеУдаления = ЭлементыДанныхФормыДерево.Получить(?(НомерУдоляемойСтраницы-1 = 0,1,НомерУдоляемойСтраницы-1) - 1).ПолучитьИдентификатор();
	УдаляемыйЛистДерева = ЭлементыДанныхФормыДерево.Получить(НомерУдоляемойСтраницы - 1);
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Форма210_02Страница1" Тогда
		УдалитьДопЛистФорма210_02НаСервере("Форма210_02Страница1");
	КонецЕсли;
	
	ТекущиеДанные.ПолучитьЭлементы().Удалить(ТекущиеДанные.ПолучитьЭлементы().Индекс(УдаляемыйЛистДерева));
	
	Элементы.РазделыОтчета.ТекущаяСтрока = ЭлементДереваПослеУдаления;
	НомерСтраницы = 1;
	Для Каждого СтраницаРаздела Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		СтраницаРаздела.КолонкаРазделыОтчета = "Форма 210.02 Лист " + НомерСтраницы ;
		СтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
		
		Для Каждого ПодСтраницаРаздела Из СтраницаРаздела.ПолучитьЭлементы() Цикл
			
			Если ПодСтраницаРаздела.КолонкаРазделыОтчетаСокрНаим = "Форма210_02Страница1" Тогда
				
				ПодСтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
				
			Иначе
				
				ПодСтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДопЛистФорма210_02НаСервере(ИмяТекущейСтраницыПанели = Неопределено)
	
	УдалитьДопЛистФорма210_02(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
	//СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДопЛистФорма210_02(Форма, ИмяТекущейСтраницыПанели)
	
	Перем ТаблицаСтраницРаздела;
	
	Если Не Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	ИмяТекТабличногоПоля     = "ТабличныйДокумент";
	ТекТабличноеПоле         = Форма[ИмяТекТабличногоПоля];
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина))[0];
	ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
	
	Если СтрТаблицаСтраницы <> Неопределено Тогда
		
		Если ИмяТекущейСтраницыПанели = "Форма210_02Страница1" Тогда
			
			Если ТаблицаСтраницРаздела.Количество() <= 1 Тогда
				Возврат;
			КонецЕсли;
			
			ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
			ТаблицаСтраницРаздела.Удалить(СтрТаблицаСтраницы);
			
		КонецЕсли;
		
		// очищаем редактируемые ячейки удаляемой страницы
		ОчиститьТабличноеПоле(Форма, ИмяТекущейСтраницыПанели);
		
		
	КонецЕсли;
	
	//Расчет(Форма, ИмяТекущейСтраницыПанели);
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	
	Модифицированность = Истина;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма210_02Страница1" Тогда
		
		ДобавитьЛистВФорму210_02НаСервере();
		
	КонецЕсли;
	
	Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "х";
	Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "Удалить Лист";
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЛистВФорму210_02НаСервере()
	
	ВставитьДопЛистФорма210_02НаСервере("Форма210_02Страница1");
	СохранитьАктивнуюФорму210_02НаСервере("Форма210_02Страница1");
	ОчиститьТабличноеПолеНаСервере("Форма210_02Страница2");
	СохранитьАктивнуюФорму210_02НаСервере("Форма210_02Страница2");
	//
	//СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДопЛистФорма210_02НаСервере(ИмяТекущейСтраницыПанели)
	
	ВставитьЛистВФорму210_02(ЭтаФорма, ИмяТекущейСтраницыПанели);
	ПослеВставкиДополнительногоЛистаВФорму210_02НаСервере(ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьЛистВФорму210_02(Форма, ИмяТекущейСтраницыПанели)

	Перем ТаблицаСтраницРаздела;
	Перем ТаблицаСтраница1;

	Если Не Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЛистовРаздела = Форма[ТаблицаСтраницРаздела];
	
	ТекТабличноеПоле     = Форма.ТабличныйДокумент;
	// находим активную страницу
	ТекущийЛист = ТаблицаЛистовРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если ИмяТекущейСтраницыПанели = "Форма210_02Страница1" Тогда
		
		СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");
		ТекущийЛист[0].АктивнаяСтраница = Ложь;
		
		НовыйЛист = ТаблицаЛистовРаздела.Добавить();
		НовыйЛист.Представление      = "";
		НовыйЛист.АктивнаяСтраница   = Истина; // Активная страница
		
		
		СтруктураДанных = Новый Структура;
		НовыйЛист.Страница2.Добавить(СтруктураДанных);
		ОчиститьТабличноеПоле(Форма, ИмяТекущейСтраницыПанели);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеВставкиДополнительногоЛистаВФорму210_02НаСервере(ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист = Истина)
	
	ПослеВставкиДополнительногоЛистаВФорму210_02(ЭтаФорма, ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПослеВставкиДополнительногоЛистаВФорму210_02(Форма, ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист)
	
	ТекущийЭлемент = Форма.РазделыОтчета.НайтиПоИдентификатору(Форма.Элементы.РазделыОтчета.ТекущаяСтрока);
	
	Родитель = ТекущийЭлемент.ПолучитьРодителя();

	Если НЕ Родитель = Неопределено Тогда
		
		РодительРодителя = Родитель.ПолучитьРодителя();
		
		Если Не РодительРодителя = Неопределено Тогда 
			
			ТекущийЭлемент = РодительРодителя;
			
		Иначе
			
			ТекущийЭлемент = Родитель;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	НомерДобавляемойСтраницы = ТекущийЭлемент.ПолучитьЭлементы().Количество() + 1;
	
	ДобавляемаяСтраница = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяСтраница.КолонкаРазделыОтчета              = "Форма 210.02 Лист " + НомерДобавляемойСтраницы;
	ДобавляемаяСтраница.КолонкаРазделыОтчетаСокрНаим      = ТекущийЭлемент.КолонкаРазделыОтчетаСокрНаим;
	ДобавляемаяСтраница.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяСтраница.РазделМногостраничный             = ТекущийЭлемент.РазделМногостраничный;
	
	ИдентификаторДобавляемойСтраницы = ДобавляемаяСтраница.ПолучитьИдентификатор();
	
	ТекущийЭлемент = ДобавляемаяСтраница;
	
	ДобавляемаяПодСтраница1 = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяПодСтраница1.КолонкаРазделыОтчета              = "Форма 210.02 Страница 1";
	ДобавляемаяПодСтраница1.КолонкаРазделыОтчетаСокрНаим      = "Форма210_02Страница1";
	ДобавляемаяПодСтраница1.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяПодСтраница1.РазделМногостраничный             = Истина;
	
	ДобавляемаяПодСтраница2 = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяПодСтраница2.КолонкаРазделыОтчета              = "Форма 210.02 Страница 2";
	ДобавляемаяПодСтраница2.КолонкаРазделыОтчетаСокрНаим      = "Форма210_02Страница2";
	ДобавляемаяПодСтраница2.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяПодСтраница2.РазделМногостраничный             = Истина;
	
	
	Если НЕ ИмяТекущейСтраницыПанели = "Форма210_02Страница1" Тогда
		ИдентификаторДобавляемойСтраницы = ДобавляемаяСтраница.ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ПерейтиНаВставленныйЛист Тогда
		Форма.Элементы.РазделыОтчета.ТекущаяСтрока = ИдентификаторДобавляемойСтраницы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроениеПервоначальнойСтруктурыНаСервере(Первый = Истина, НаимРаздела)
	
	ПостроениеПервоначальнойСтруктуры(ЭтаФорма, Первый, НаимРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПостроениеПервоначальнойСтруктуры(Форма, Первый = Истина, НаимРаздела)
	Перем ТаблицаСтраницРаздела;
	Перем ТаблицаДоходовИсточника;

	Если Не Форма.мСтруктураФорма210_02Страница1и2.Свойство("Форма210_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];

	Если Первый Тогда
				
		ОчиститьТабличноеПоле(Форма, НаимРаздела);
		СтруктураДанныхТекущейТаблицыРаздел1 = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");

		СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
		СтрНоваяСтраница.Представление      = "";
		СтрНоваяСтраница.АктивнаяСтраница   = Истина;
		СтрНоваяСтраница.АвтоматическоеПредставление = Истина;
		СтрНоваяСтраница.Страница1.Добавить(СтруктураДанныхТекущейТаблицыРаздел1);
		
		СтруктураДанных = Новый Структура;
		СтрНоваяСтраница.Страница2.Добавить(СтруктураДанных);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт

	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);

КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт

	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ИмяТабличногоПоля)

	ТабличноеПоле = Форма[ИмяТабличногоПоля];
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Инд = 0 По ТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;

		ИмяПоказателя      = ТекущаяОбласть.Имя;
		ЗначениеПоказателя = ТекущаяОбласть.Значение;

		СтруктураДанныхПоля.Вставить(ИмяПоказателя, ЗначениеПоказателя);

	КонецЦикла;

	Возврат СтруктураДанныхПоля;

КонецФункции

&НаСервере
Процедура УстановитьДоступностьКнопкиУдалитьСтраницу(Таблица)
	
	Обл = ТабличныйДокумент.Области.Найти("УдалитьСтраницуЗначок");
	Если Обл = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Таблица.Количество() = 1 Тогда 
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
	Иначе
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Истина;
		Обл.Текст = "Удалить Лист";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");
	

	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];

	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;

	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
					ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
			
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
	//СтрокаПересчета = "ПересчитатьНумерациюСтрок_" + (СтруктураГруппы.Количество()- 1);
	//
	//#Если НаКлиенте Тогда
	//	Форма.РасчетНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела,СтрокаПересчета);
	//#Иначе
	//	Форма.РасчетНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела,СтрокаПересчета);
	//#КонецЕсли
	//
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	МассивПересчета = Новый Массив;
	МассивПересчета.Добавить("Форма210_01Страница4");
	МассивПересчета.Добавить("Форма210_01Страница5");
	МассивПересчета.Добавить("Форма210_01Страница6");
	МассивПересчета.Добавить("Форма210_01Страница7");
	МассивПересчета.Добавить("Форма210_01Страница8");
	
	Для каждого Элемент из МассивПересчета Цикл
		РасчетНаКлиенте(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;

	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;

	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;

	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли

	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;

	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");

		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];

		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.

		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;

		Если СпециальноеДобавление Тогда
			
		Иначе
					
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;

		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;

		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда

			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл

				ТекСтрока = СтруктураГруппы[НСтр - 1];

				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк

		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
		
		КонецЦикла;

		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
	
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае

	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
		
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];

	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
	ИдГрупп.Вставить("мИдГруппы17", СтруктураРеквизитовФормы.мИдГруппы17);
	ИдГрупп.Вставить("мИдГруппы18", СтруктураРеквизитовФормы.мИдГруппы18);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;

	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
	ИдГрупп.Вставить("мИдГруппы17", СтруктураРеквизитовФормы.мИдГруппы17);
	ИдГрупп.Вставить("мИдГруппы18", СтруктураРеквизитовФормы.мИдГруппы18);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма210_01Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы11;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма210_01Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы12;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма210_01Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы13;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма210_01Страница4" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы14;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма210_01Страница5" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы15;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма210_01Страница6" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы16;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма210_01Страница7" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы17;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма210_01Страница8" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы18;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
	ИдГрупп.Вставить("мИдГруппы17", СтруктураРеквизитовФормы.мИдГруппы17);
	ИдГрупп.Вставить("мИдГруппы18", СтруктураРеквизитовФормы.мИдГруппы18);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы11", СтруктураРеквизитовФормы.мИдГруппы11);
	ИдГрупп.Вставить("мИдГруппы12", СтруктураРеквизитовФормы.мИдГруппы12);
	ИдГрупп.Вставить("мИдГруппы13", СтруктураРеквизитовФормы.мИдГруппы13);
	ИдГрупп.Вставить("мИдГруппы14", СтруктураРеквизитовФормы.мИдГруппы14);
	ИдГрупп.Вставить("мИдГруппы15", СтруктураРеквизитовФормы.мИдГруппы15);
	ИдГрупп.Вставить("мИдГруппы16", СтруктураРеквизитовФормы.мИдГруппы16);
	ИдГрупп.Вставить("мИдГруппы17", СтруктураРеквизитовФормы.мИдГруппы17);
	ИдГрупп.Вставить("мИдГруппы18", СтруктураРеквизитовФормы.мИдГруппы18);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы11 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы12 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы13 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы14 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница4";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы15 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница5";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы16 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница6";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы17 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница7";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы18 Тогда
		
		ТекТабличноеПоле = "Форма210_01Страница8";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001200001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001300001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001400002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001500002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001600002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001700002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0001800002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001200001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001300001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001400002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001500002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001600002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001700002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0001800002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	//Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	//СтруктураГруппы = Форма[СтруктураГруппы];
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,5,1)) = 1 Тогда
		
		СтруктураГруппы = Форма["П0001100001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000110000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001200001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000120000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001300001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000130000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001400002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000140000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001500002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000150000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001600002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000160000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001700002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000170000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0001800002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000180000201 = Индекс + 2;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры