
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НаДату >= '20150101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;
	Иначе
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияРПН;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  	20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 	5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 	5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002016Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v26.r112 от 13.08.2016 г.; 200.00.v26.r113 от 22.12.2016 г."; 
	НоваяФорма.ДатаНачалоДействия = '20160101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20161231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002017Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v27.r117 от 08.06.2017 г."; 
	НоваяФорма.ДатаНачалоДействия = '20170101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20171231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002018Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v28.r121 от 04.01.2019 г."; 
	НоваяФорма.ДатаНачалоДействия = '20180101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20181231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002019Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v29.r123 от 30.04.2019 г."; 
	НоваяФорма.ДатаНачалоДействия = '20190101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20190930';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002019Кв4";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v29.r123 от 30.04.2019 г."; 
	НоваяФорма.ДатаНачалоДействия = '20191001'; 
	НоваяФорма.ДатаКонецДействия  = '20191231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002020Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v30.r130 от 21.12.2020 г."; 
	НоваяФорма.ДатаНачалоДействия = '20200101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20201231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002021Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v31.r134 от 23.12.2021 г."; 
	НоваяФорма.ДатаНачалоДействия = '20210101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20220630';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002022Кв3";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v32.r136 от 22.12.2022 г."; 
	НоваяФорма.ДатаНачалоДействия = '20220701';                                                                                         
	НоваяФорма.ДатаКонецДействия  = '20221231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2002023Кв1";
	НоваяФорма.ОписаниеОтчета     = "Декларация по индивидуальному подоходному налогу и социальному налогу. Версии шаблонов ФНО для ИС СОНО: 200.00.v33.r141 от 28.04.2025 г."; 
	НоваяФорма.ДатаНачалоДействия = '20230101';                                                                                         
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
    
    Возврат ТаблицаФормОтчета;
	
КонецФункции