
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПредоставлятьВычет = Истина;
	Параметры.Свойство("ПредоставлятьВычет", ПредоставлятьВычет);
	Если ПредоставлятьВычет = Неопределено Тогда
		ПредоставлятьВычет = Истина;	
	КонецЕсли;

	Если Параметры.Свойство("Месяц") Или Параметры.Свойство("НалоговыйПериод") Тогда
		
		Месяц = Неопределено;
		НалоговыйПериод = Неопределено;
		Параметры.Свойство("Месяц", Месяц);
		Параметры.Свойство("НалоговыйПериод", НалоговыйПериод);

		Если Месяц <> Неопределено И НалоговыйПериод = Неопределено Тогда
			НалоговыйПериод = Год(Месяц)
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
		
		Если НалоговыйПериод <> Неопределено Тогда
			
			Если ПредоставлятьВычет Тогда
				
				СписокОтбора = Новый СписокЗначений; 
				ДоступныеВычеты = УчетНалоговВзносовОтчислений.ВычетыНалогоплательщика(НалоговыйПериод);
				Для Каждого Вычет Из ДоступныеВычеты Цикл
					СписокОтбора.Добавить(Вычет);
				КонецЦикла;
				
				ПредставлениеОтбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Действующие вычеты %1 года'"), НалоговыйПериод);
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
					"Ссылка", СписокОтбора, ВидСравненияКомпоновкиДанных.ВСписке, ПредставлениеОтбора, ПредоставлятьВычет);

			КонецЕсли;
			
		КонецЕсли;
	
		ОтображатьНеиспользуемые = Год(ТекущаяДатаСеанса()) <> Год(Месяц) ИЛИ НЕ ПредоставлятьВычет; 
		
	Иначе
		
		ОтображатьНеиспользуемые = НЕ ПредоставлятьВычет;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ОтображатьНеиспользуемые");
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОтображатьНеиспользуемые", ОтображатьНеиспользуемые);
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
		Элементы.Приоритет.Видимость = Ложь;
		Элементы.ФормаУвеличитьПриоритет.Видимость = Ложь;
		Элементы.ФормаУменьшитьПриоритет.Видимость = Ложь;
		Если Параметры.Свойство("МножественныйВыбор") Тогда
			Если Параметры.МножественныйВыбор <> Неопределено И Параметры.МножественныйВыбор Тогда 
				Элементы.Список.МножественныйВыбор = Истина;
				Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Множественный;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УвеличитьПриоритет(Команда)
	
	ИзменитьПриоритетНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьПриоритет(Команда)
	
	ИзменитьПриоритетНаСервере(Ложь);
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Элементы.Список.МножественныйВыбор Тогда
		
		Оповестить("СписокВыборЗначения", Значение, "ВидыВычетовИПН");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеИспользуетсяПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,"ОтображатьНеиспользуемые", ОтображатьНеиспользуемые);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПриоритетНаСервере(Увеличить = Истина)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Ссылка, "ПометкаУдаления") Тогда
		Возврат;
	КонецЕсли;
	
	ПриоритетТекущий = ТекущаяСтрока.Приоритет;
	
	Если Увеличить Тогда
		ПриоритетПоиска = ?(ПриоритетТекущий = 1,1,ПриоритетТекущий - 1);
	Иначе
		ПриоритетПоиска = ?(ПриоритетТекущий = Справочники.ВидыВычетовИПН.МаксимальныйПриоритет(),
			ПриоритетТекущий,ПриоритетТекущий + 1);
	КонецЕсли;
	
	Если ПриоритетПоиска <> ПриоритетТекущий Тогда
		СсылкаНаСоседний  = НайтиСсылкуНаСоседний(ПриоритетПоиска);
		ЗаменитьПриоритеты(ТекущаяСтрока.Ссылка,СсылкаНаСоседний,ПриоритетПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиСсылкуНаСоседний(ПриоритетПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка,
		|	ВидыВычетовИПН.Приоритет
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.Приоритет = &Приоритет
		|	И ВидыВычетовИПН.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Приоритет", ПриоритетПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаменитьПриоритеты(ТекущийЭлемент,СоседнийЭлемент,Приоритет)
	
	Если СоседнийЭлемент = Неопределено Тогда
		//Свободный приоритет
		НачатьТранзакцию();
		Попытка
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыВычетовИПН");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ТекущийЭлемент);
			Блокировка.Заблокировать();
			
			СправочникОбъект = ТекущийЭлемент.ПолучитьОбъект();
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Приоритет = Приоритет;
			СправочникОбъект.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление приоритетов справочников'"),
			УровеньЖурналаРегистрации.Ошибка,,
			ТекущийЭлемент,ИнформацияОбОшибке());
			ТекстОшибки = НСтр("ru = 'При обновлении приоритетов справочника возникла ошибка, см. ""Журнал регистрации"".'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
		КонецПопытки;
		
	Иначе
		//Обмен приоритетами
		
		НачатьТранзакцию();
		Попытка
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыВычетовИПН");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ТекущийЭлемент);
			
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыВычетовИПН");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СоседнийЭлемент);
			Блокировка.Заблокировать();
			
			//Обменяем приоритеты
			СправочникОбъект = ТекущийЭлемент.ПолучитьОбъект();
			ПриоритетДляОбмена = СправочникОбъект.Приоритет;
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Приоритет = Приоритет;
			СправочникОбъект.Записать();
			
			СправочникОбъект = СоседнийЭлемент.ПолучитьОбъект();
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Приоритет = ПриоритетДляОбмена;
			СправочникОбъект.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление приоритетов справочников'"),
			УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.ВидыВычетовИПН,
			ТекущийЭлемент,ИнформацияОбОшибке());
			ТекстОшибки = НСтр("ru = 'При обновлении приоритетов справочника возникла ошибка, см. ""Журнал регистрации"".'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

