#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПолучитьПараметры();
	
	ИспользуетсяПериодДействия = Ложь;
	
	Заголовок = Строка(ФизическоеЛицо);
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(НалогиВзносыОтчисления, "МесяцНалоговогоПериода", "МесяцНалоговогоПериодаСтрокой");
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(НалогиВзносыОтчисления, "МесяцПериода", "МесяцПериодаСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ,ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для НомерСтроки = 0 По НалогиВзносыОтчисления.Количество()-1 Цикл
		
		Если НЕ ЗначениеЗаполнено(НалогиВзносыОтчисления[НомерСтроки].ФизическоеЛицо) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан сотрудник'"), , СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("НалогиВзносыОтчисления[%1].ФизическоеЛицо", НомерСтроки));
			Отказ = Истина
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НалогиВзносыОтчисления[НомерСтроки].МесяцНалоговогоПериода) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задан месяц налогового периода'"), , СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("НалогиВзносыОтчисления[%1].МесяцНалоговогоПериода", НомерСтроки));
			Отказ = Истина
		КонецЕсли;
		
		Если Документы.ВедомостьНаПеречислениеВзносовОтчислений.ПеречислятьПоМесяцуПериода(ПериодРегистрации, ВидНалогаВзносаОтчисления, ВидПлатежа, Организация) Тогда  
			Если НЕ ЗначениеЗаполнено(НалогиВзносыОтчисления[НомерСтроки].МесяцНалоговогоПериода) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задан месяц периода'"), , СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("НалогиВзносыОтчисления[%1].МесяцПериода", НомерСтроки));
				Отказ = Истина
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНалогиВзносыОтчисления

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, ЭтаФорма);      
		Элемент.ТекущиеДанные.МесяцНалоговогоПериода = ПериодРегистрации;
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(НалогиВзносыОтчисления, "МесяцНалоговогоПериода", "МесяцНалоговогоПериодаСтрокой");
		Элемент.ТекущиеДанные.МесяцПериода = ПериодРегистрации;
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(НалогиВзносыОтчисления, "МесяцПериода", "МесяцПериодаСтрокой");  
        УстановитьВидДохода();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцНалоговогоПериодаПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(Элементы.НалогиВзносыОтчисления.ТекущиеДанные, "МесяцНалоговогоПериода", "МесяцНалоговогоПериодаСтрокой", Модифицированность);
	УстановитьВидДохода();
	УстановитьМесяцПериода();
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцНалоговогоПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    ОповещениеЗавершения = Новый ОписаниеОповещения("НалогиВзносыОтчисленияМесяцНалоговогоПериодаНачалоВыбораЗавершение", ЭтотОбъект);
    ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, Элементы.НалогиВзносыОтчисления.ТекущиеДанные, "МесяцНалоговогоПериода", "МесяцНалоговогоПериодаСтрокой",, ОповещениеЗавершения);
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцНалоговогоПериодаНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
    УстановитьВидДохода();
	УстановитьМесяцПериода();
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцНалоговогоПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(Элементы.НалогиВзносыОтчисления.ТекущиеДанные, "МесяцНалоговогоПериода", "МесяцНалоговогоПериодаСтрокой", Направление, Модифицированность);
    УстановитьВидДохода();
	УстановитьМесяцПериода();
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцНалоговогоПериодаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
    УстановитьВидДохода();	
	УстановитьМесяцПериода();

КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцНалоговогоПериодаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
    УстановитьВидДохода();	
	УстановитьМесяцПериода();

КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцПериодаПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(Элементы.НалогиВзносыОтчисления.ТекущиеДанные, "МесяцПериода", "МесяцПериодаСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, Элементы.НалогиВзносыОтчисления.ТекущиеДанные, "МесяцПериода", "МесяцПериодаСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(Элементы.НалогиВзносыОтчисления.ТекущиеДанные, "МесяцПериода", "МесяцПериодаСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцПериодаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияМесяцПериодаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьПараметры()
	
	ТаблицаНВО = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилищеНалогиВзносыОтчисленияПоСтроке);
	
	НалогиВзносыОтчисления.Загрузить(ТаблицаНВО);
	НалогиВзносыОтчисления.Сортировать("МесяцНалоговогоПериода");
	Параметры.Свойство("ФизическоеЛицо",		ФизическоеЛицо);
	
	Параметры.Свойство("Организация",			Организация);
	Параметры.Свойство("Подразделение",			Подразделение);
	Параметры.Свойство("ПериодРегистрации",		ПериодРегистрации);
	Параметры.Свойство("ВидНалогаВзносаОтчисления",	ВидНалогаВзносаОтчисления);
	Параметры.Свойство("ВидПлатежа",	ВидПлатежа);
	Параметры.Свойство("ВидДохода",	    ВидДохода);
    Если Параметры.Свойство("ДатаКорректировкиВеденияУчетаПоДаннымНВО") Тогда
        ДатаКорректировкиВеденияУчетаПоДаннымНВО = ?(ЗначениеЗаполнено(Параметры.ДатаКорректировкиВеденияУчетаПоДаннымНВО), Параметры.ДатаКорректировкиВеденияУчетаПоДаннымНВО, ПериодРегистрации);
    Иначе
        ДатаКорректировкиВеденияУчетаПоДаннымНВО = ПериодРегистрации;
    КонецЕсли;
        
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		ПериодыНВО = ТаблицаНВО.Скопировать(, "МесяцНалоговогоПериода");
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'Сумма платежа (к перечислению)'");
		ЗаполнитьСтавкуЕдиногоПлатежа(Организация, Справочники.ВидыДоходов.ДоходыОтРаботодателя, ПериодыНВО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПроверитьЗаполнение() Тогда
		
		РезультатыРедактирования = Новый Структура;
		РезультатыРедактирования.Вставить("Модифицированность", Модифицированность);
		РезультатыРедактирования.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		РезультатыРедактирования.Вставить("АдресВХранилищеНалогиВзносыОтчисленияПоСтроке", АдресВХранилищеНалогиВзносыОтчисленияПоСтроке());
		
		Модифицированность = Ложь;
		Закрыть(РезультатыРедактирования)
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилищеНалогиВзносыОтчисленияПоСтроке()
	
	НалогиВзносыОтчисленияФизлица = НалогиВзносыОтчисления.Выгрузить();
	НалогиВзносыОтчисленияФизлица.ЗаполнитьЗначения(ФизическоеЛицо, "ФизическоеЛицо");
	
	Возврат ПоместитьВоВременноеХранилище(НалогиВзносыОтчисленияФизлица, УникальныйИдентификатор);
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьСтавкуЕдиногоПлатежа(Организация, ВидДохода, ПериодыНВО)
	
	НесколькоПериодов = Ложь;
	
	Если ТипЗнч(ПериодыНВО) = Тип("ТаблицаЗначений") Тогда
		НесколькоПериодов = Истина;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.УстановитьПараметр("ПериодыНВО", ПериодыНВО);
	Запрос.УстановитьПараметр("ВидДохода", ВидДохода);
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	
	Если НесколькоПериодов Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыНВО.МесяцНалоговогоПериода КАК Период
		|
		|ПОМЕСТИТЬ ВТДатыПоМесяцам
		|ИЗ &ПериодыНВО КАК ПериодыНВО
		|";
		
	Иначе
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	&ПериодыНВО КАК Период
		|
		|ПОМЕСТИТЬ ВТДатыПоМесяцам
		|";
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
	УчетНалоговВзносовОтчислений.СоздатьВТСтавкиНалоговВзносовПоПериодам(Организация, МенеджерВТ);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтавкиНВО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СтавкиНВО.Ставка КАК Ставка
	|
	|ИЗ ВТСтавки КАК СтавкиНВО
	|
	|ГДЕ
	|	СтавкиНВО.ВидДохода = &ВидДохода
	|	И СтавкиНВО.ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
	|";

	ТаблицаСтавок = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидДохода()
    
    Если ДатаКорректировкиВеденияУчетаПоДаннымНВО <= Элементы.НалогиВзносыОтчисления.ТекущиеДанные.МесяцНалоговогоПериода
        И (ВидПлатежа <> ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПениАкт")
        ИЛИ ВидПлатежа <> ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПениСам")) Тогда
        Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП")
            ИЛИ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС")
            ИЛИ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОПВР")
            ИЛИ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ОППВ") Тогда
            Элементы.НалогиВзносыОтчисления.ТекущиеДанные.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя");        
        Иначе	
            Элементы.НалогиВзносыОтчисления.ТекущиеДанные.ВидДохода = ?(НЕ ЗначениеЗаполнено(Элементы.НалогиВзносыОтчисления.ТекущиеДанные.ВидДохода), 
                                                                        ?(НЕ ЗначениеЗаполнено(ВидДохода), ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтРаботодателя"), ВидДохода),
                                                                        Элементы.НалогиВзносыОтчисления.ТекущиеДанные.ВидДохода);        
        КонецЕсли;
    Иначе
        Элементы.НалогиВзносыОтчисления.ТекущиеДанные.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ПустаяСсылка");
    КонецЕсли;                
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМесяцПериода()
	
	Если ВидНалогаВзносаОтчисления <> ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС")
		ИЛИ ВидНалогаВзносаОтчисления <> ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ООСМС")Тогда
		Элементы.НалогиВзносыОтчисления.ТекущиеДанные.МесяцПериода = Элементы.НалогиВзносыОтчисления.ТекущиеДанные.МесяцНалоговогоПериода;        
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
