#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Ссылка,Организация,Дата,НомерСтрокиРаботника,АдресХранилища");
	
	ЗаполнитьДанныеФормы();
	
	ОписанияОбязательныхПолей = Документы.СведенияДляФРМР.ОписанияОбязательныхПолей();
	ОписанияОбязательныхПолейТаблиц = Документы.СведенияДляФРМР.ОписанияОбязательныхПолейТаблиц();
	
	УстановитьСвойствоПолейАвтоОтметкаНезаполненного();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заполнение

&НаСервере
Процедура ЗаполнитьДанныеФормы()
	
	ПараметрыЗаполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	ДанныеДляЗаполнения = ПараметрыЗаполнения.ДанныеДляЗаполнения;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.Работники[0]);
	ДокументыУдостоверяющиеЛичность.Загрузить(ДанныеДляЗаполнения.ДокументыУдостоверяющиеЛичность);
	ЛичноеДело.Загрузить(ДанныеДляЗаполнения.ЛичноеДело);
	ОбщееОбразование.Загрузить(ДанныеДляЗаполнения.ОбщееОбразование);
	ПрофессиональноеОбразование.Загрузить(ДанныеДляЗаполнения.ПрофессиональноеОбразование);
	ПослевузовскоеОбразование.Загрузить(ДанныеДляЗаполнения.ПослевузовскоеОбразование);
	ДополнительноеПрофессиональноеОбразование.Загрузить(ДанныеДляЗаполнения.ДополнительноеПрофессиональноеОбразование);
	Сертификаты.Загрузить(ДанныеДляЗаполнения.Сертификаты);
	Награды.Загрузить(ДанныеДляЗаполнения.Награды);
	Квалификация.Загрузить(ДанныеДляЗаполнения.Квалификация);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьСвойствоПолейАвтоОтметкаНезаполненного()
	
	Для Каждого ОписаниеТаблицы Из ОписанияОбязательныхПолейТаблиц Цикл
		
		Если ЭтотОбъект[ОписаниеТаблицы.Ключ].Количество() > 0 Тогда
			
			Для Каждого ОписаниеПоля Из ОписаниеТаблицы.Значение Цикл
				Элементы[ОписаниеТаблицы.Ключ + ОписаниеПоля.Имя + "Значение"].АвтоОтметкаНезаполненного = ОписаниеПоля.ОтметкаНезаполненного;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ОписаниеПоля Из ОписанияОбязательныхПолей Цикл
		Элементы[ОписаниеПоля.Имя].АвтоОтметкаНезаполненного = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
