
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗУПК
	СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// ЗУПК
	
	ГоловнаяОрганизация = Параметры.ГоловнаяОрганизация;
	// ЗУПК
	Организация 		= Параметры.ГоловнаяОрганизация;
	// ЗУПК
	ФизическоеЛицо      = Параметры.ФизическоеЛицо;
	
	Если Год = 0 Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	МАКСИМУМ(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода) КАК Месяц
		|ИЗ
		// ЗУПК
		|	РегистрСведений.ДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботыНДФЛ
		// ЗУПК
		|ГДЕ
		|	ДоходыПредыдущегоМестаРаботыНДФЛ.ФизическоеЛицо = &ФизическоеЛицо
		// ЗУПК
		|	И ДоходыПредыдущегоМестаРаботыНДФЛ.Организация = &Организация";
		// ЗУПК
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
		// ЗУПК
		Запрос.УстановитьПараметр("Организация", Организация);
		// ЗУПК
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Месяц = Null Тогда
				Год = Год(ТекущаяДатаСеанса());
			Иначе
				Год = Год(Выборка.Месяц);
			КонецЕсли;
		Иначе
			Год = Год(ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	
	Если ФизическоеЛицо.Пустая() Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ПрочитатьДанные();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанные()
	
	Доходы.Очистить();
	
	ТекстЗапроса = "ВЫБРАТЬ
	               // ЗУПК
	               |	ДоходыПредыдущегоМестаРаботыНДФЛ.СуммаДохода КАК Доход,
	               |	ДоходыПредыдущегоМестаРаботыНДФЛ.ПримененнаяЛьгота КАК ПримененнаяЛьгота,
	               |	ДоходыПредыдущегоМестаРаботыНДФЛ.ВОСМС КАК ВОСМС,
	               // ЗУПК
	               |	ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода КАК Месяц
	               |ИЗ
	               // ЗУПК
	               |	РегистрСведений.ДоходыПредыдущегоМестаРаботы КАК ДоходыПредыдущегоМестаРаботыНДФЛ
	               // ЗУПК
	               |ГДЕ
	               |	ДоходыПредыдущегоМестаРаботыНДФЛ.ФизическоеЛицо = &ФизическоеЛицо
	               // ЗУПК
	               |	И ДоходыПредыдущегоМестаРаботыНДФЛ.Организация = &Организация
	               // ЗУПК
	               |	И ГОД(ДоходыПредыдущегоМестаРаботыНДФЛ.МесяцНалоговогоПериода) = &Год
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Месяц";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	// ЗУПК
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	// ЗУПК
	Запрос.УстановитьПараметр("Год", Год);
	
	Выборка = Запрос.Выполнить().Выбрать();
	// ЗУПК
	Для Сч = 1 По 12 Цикл
		СтрокаДоходов       = Доходы.Добавить();
		СтрокаДоходов.Месяц = Дата(Год, Сч, 1);
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Новый Структура("Месяц", СтрокаДоходов.Месяц)) Тогда
			СтрокаДоходов.Сумма             = Выборка.Доход;
			СтрокаДоходов.ПримененнаяЛьгота = Выборка.ПримененнаяЛьгота;
			СтрокаДоходов.ВОСМС 			= Выборка.ВОСМС;
		КонецЕсли;
	КонецЦикла;
	
	Если Год >= 2018 Тогда
		Элементы.ДоходыПримененнаяЛьгота.Заголовок = "Примененный вычет";
	КонецЕсли;
	// ЗУПК
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ДоходСНарастающимИтогом = 0;
	
	// ЗУПК
    НаборЗаписей = РегистрыСведений.ДоходыПредыдущегоМестаРаботы.СоздатьНаборЗаписей();
	// ЗУПК
	НаборЗаписей.Отбор.ФизическоеЛицо.Значение      = ФизическоеЛицо;
	НаборЗаписей.Отбор.ФизическоеЛицо.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ФизическоеЛицо.Использование = Истина;
	// ЗУПК
    НаборЗаписей.Отбор.Организация.Значение      = ЭтаФорма.Организация;
    НаборЗаписей.Отбор.Организация.ВидСравнения  = ВидСравнения.Равно;
    НаборЗаписей.Отбор.Организация.Использование = Истина;
	// ЗУПК
	
	Для Каждого СтрокаДохода Из Доходы Цикл
		
		// ЗУПК
        Если СтрокаДохода.Сумма = 0 И СтрокаДохода.ПримененнаяЛьгота = 0 И СтрокаДохода.ВОСМС = 0 Тогда
            Продолжить;
        КонецЕсли;
        НаборЗаписей.Отбор.МесяцНалоговогоПериода.Значение   = СтрокаДохода.Месяц;
        НаборЗаписей.Отбор.МесяцНалоговогоПериода.ВидСравнения  = ВидСравнения.Равно;
        НаборЗаписей.Отбор.МесяцНалоговогоПериода.Использование = Истина;
        
        НаборЗаписей.Прочитать();
        Если НаборЗаписей.Количество() = 0 Тогда
		// ЗУПК
		ЗаписьОДоходах  = НаборЗаписей.Добавить();
		ЗаписьОДоходах.ФизическоеЛицо         = ФизическоеЛицо;
		// ЗУПК
        ЗаписьОДоходах.Организация            = ЭтаФорма.Организация;
        ЗаписьОДоходах.МесяцНалоговогоПериода = СтрокаДохода.Месяц;
        ЗаписьОДоходах.СуммаДохода            = СтрокаДохода.Сумма;
        ЗаписьОДоходах.ПримененнаяЛьгота      = СтрокаДохода.ПримененнаяЛьгота;
        ЗаписьОДоходах.ВОСМС      			  = СтрокаДохода.ВОСМС;
        Иначе
            Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
                ЗаписьНабора.СуммаДохода            = СтрокаДохода.Сумма;
                ЗаписьНабора.ПримененнаяЛьгота      = СтрокаДохода.ПримененнаяЛьгота;
                ЗаписьНабора.ВОСМС      			= СтрокаДохода.ВОСМС;
            КонецЦикла;
        КонецЕсли; 
        НаборЗаписей.Записать();
		// ЗУПК
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	// ЗУПК
    Если ЭтаФорма.Модифицированность Тогда
        Оповещение = Новый ОписаниеОповещения("ДанныеПриИзмененииЗавершение", ЭтотОбъект);
        ТекстВопроса = НСтр("ru = 'Данные модифицированы. Записать данные?'");        
        ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
    Иначе
        ПрочитатьДанные();
    КонецЕсли;
	// ЗУПК
КонецПроцедуры
	
// ЗУПК
&НаКлиенте
Процедура Подключаемый_ОрганизацияПриИзменении(Элемент)
	
    Если ЭтаФорма.Модифицированность Тогда
        Оповещение = Новый ОписаниеОповещения("ДанныеПриИзмененииЗавершение", ЭтотОбъект);
        ТекстВопроса = НСтр("ru = 'Данные модифицированы. Записать данные?'");        
        ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
    Иначе
        ПрочитатьДанные();
    КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
    Если Ответ <> КодВозвратаДиалога.Да Тогда 
        ПрочитатьДанные();
    Иначе
        ЗаписатьНаСервере();
        ПрочитатьДанные();
    КонецЕсли;
    ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
// ЗУПК

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

#КонецОбласти
