#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Ученический договор
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Справочник.ИндивидуальныйПланРазвития";
	КомандаПечати.Идентификатор = "ИндивидуальныйПланРазвития";
	КомандаПечати.Представление = НСтр("ru = 'Индивидуальный план развития'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИндивидуальныйПланРазвития");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ИндивидуальныйПланРазвития",
			НСтр("ru = 'Индивидуальный план развития'"),
			ПечатьИПР(МассивОбъектов, ОбъектыПечати),
			,
			"Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвития");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьИПР(МассивОбъектов, ОбъектыПечати)
	
	// Создаем табличный документ и устанавливаем имя параметров печати.
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИПР";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.ИндивидуальныйПланРазвития.ПФ_MXL_ИндивидуальныйПланРазвития");
	
	Области = Новый Структура();
	Области.Вставить("Шапка", Макет.ПолучитьОбласть("Шапка"));
	Области.Вставить("Строка", Макет.ПолучитьОбласть("СтрокаМероприятия"));
	
	ПоляПоискаРезультатов = "ФизическоеЛицо, Мероприятие, ДатаНачалаПлан, ДатаОкончанияПлан";
	ОтборРезультатов = Новый Структура(ПоляПоискаРезультатов);
	
	ДанныеДляПечати = ДанныеДляПечати(МассивОбъектов);
	Если ДанныеДляПечати.РезультатыОбучения <> Неопределено Тогда
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеДляПечати.РезультатыОбучения, ПоляПоискаРезультатов);
	КонецЕсли;
	
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеДляПечати.ИндивидуальныеПланыРазвития);
	Пока Обход.СледующийПоЗначениюПоля("ИПР") Цикл
		ЗаполнитьЗначенияСвойств(Области.Шапка.Параметры, Обход.ТекущиеДанные());
		Области.Шапка.Параметры.ДатаНачалаИПР = Формат(Обход.ТекущиеДанные().ДатаНачалаИПР, "ДЛФ=D");
		Области.Шапка.Параметры.ДатаОкончанияИПР = Формат(Обход.ТекущиеДанные().ДатаОкончанияИПР, "ДЛФ=D");
		ТабличныйДокумент.Вывести(Области.Шапка);
		Пока Обход.СледующийПоЗначениямПолей("НомерСтроки") Цикл
			ЗаполнитьЗначенияСвойств(Области.Строка.Параметры, Обход.ТекущиеДанные());
			Области.Строка.Параметры.ДатаНачала = Формат(Обход.ТекущиеДанные().ДатаНачала, "ДЛФ=D");
			Области.Строка.Параметры.ДатаОкончания = Формат(Обход.ТекущиеДанные().ДатаОкончания, "ДЛФ=D");
			Области.Строка.Параметры.ФамилияИООтветственного = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(
				Обход.ТекущиеДанные().ФИООтветственного);
			ПредставлениеРезультатов = "";
			Если ДанныеДляПечати.РезультатыОбучения <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ОтборРезультатов, Обход.ТекущиеДанные());
				ОтборРезультатов.ДатаНачалаПлан = Обход.ТекущиеДанные().ДатаНачала;
				ОтборРезультатов.ДатаОкончанияПлан = Обход.ТекущиеДанные().ДатаОкончания;
				РезультатыОбучения = ДанныеДляПечати.РезультатыОбучения.НайтиСтроки(ОтборРезультатов);
				ДополнитьПредставление(ПредставлениеРезультатов, 
					ОбучениеРазвитиеКлиентСервер.ПредставлениеРезультатовОбучения(РезультатыОбучения));
			КонецЕсли;
			ДополнитьПредставление(ПредставлениеРезультатов, Обход.ТекущиеДанные().РезультатВыполнения, Символы.ПС);
			Области.Строка.Параметры.Результаты = ПредставлениеРезультатов;
			ТабличныйДокумент.Вывести(Области.Строка);
		КонецЦикла;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеДляПечати(МассивИПР)
	
	Данные = Новый Структура();
	Данные.Вставить("ИндивидуальныеПланыРазвития");
	Данные.Вставить("РезультатыОбучения");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивИПР);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИндивидуальныйПланРазвития.Ссылка КАК ИПР,
		|	ИндивидуальныйПланРазвития.Владелец КАК ФизическоеЛицо,
		|	ИндивидуальныйПланРазвития.Владелец.ФИО КАК ФИОСотрудника,
		|	ИндивидуальныйПланРазвития.Ответственный.ФизическоеЛицо КАК СотрудникКадровойСлужбы,
		|	ИндивидуальныйПланРазвития.Ответственный.ФизическоеЛицо.ФИО КАК ФИОСотрудникаКадровойСлужбы,
		|	ИндивидуальныйПланРазвития.ДатаНачала КАК ДатаНачалаИПР,
		|	ИндивидуальныйПланРазвития.ДатаОкончания КАК ДатаОкончанияИПР,
		|	ИндивидуальныйПланРазвития.Подразделение КАК Подразделение,
		|	ИндивидуальныйПланРазвития.РекомендацииРазвития КАК РекомендацииРазвития,
		|	ПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	ПрограммаОбучения.ДатаНачала КАК ДатаНачала,
		|	ПрограммаОбучения.ДатаОкончания КАК ДатаОкончания,
		|	ПрограммаОбучения.РезультатВыполнения КАК РезультатВыполнения,
		|	ПрограммаОбучения.Ответственный КАК Ответственный,
		|	ЕСТЬNULL(ПрограммаОбучения.Ответственный.ФИО, """") КАК ФИООтветственного,
		|	ПрограммаОбучения.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИндивидуальныйПланРазвития.Мероприятия КАК ПрограммаОбучения
		|		ПО (ПрограммаОбучения.Ссылка = ИндивидуальныйПланРазвития.Ссылка)
		|ГДЕ
		|	ИндивидуальныйПланРазвития.Ссылка В (&МассивОбъектов)
		|УПОРЯДОЧИТЬ ПО
		|	ИПР,
		|	НомерСтроки";
	Данные.ИндивидуальныеПланыРазвития = Запрос.Выполнить().Выгрузить();
	
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОбучениеСотрудников) Тогда
		Данные.РезультатыОбучения = ОбучениеРазвитие.РезультатыОбучения(
			Данные.ИндивидуальныеПланыРазвития.Скопировать(, 
				СтрСоединить(ОбщегоНазначения.ВыгрузитьКолонку(ОбучениеРазвитие.НовыйПланМероприятий().Колонки, "Имя"), ",")));
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Процедура ДополнитьПредставление(Представление, Дополнение, Разделитель = ", ") Экспорт
	ОбучениеРазвитиеКлиентСервер.ДополнитьПредставление(Представление, Дополнение, Разделитель);
КонецПроцедуры

#КонецОбласти

#КонецЕсли