#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Наименование = Владелец.Наименование + " (" + Формат(ДатаНачала, "ДФ=MM.yyyy")+ " - " + Формат(ДатаОкончания, "ДФ=MM.yyyy") + ")";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		Для Каждого Мероприятие Из Мероприятия Цикл
			Если НЕ ЗначениеЗаполнено(Мероприятие.ДатаНачала)
				ИЛИ Мероприятие.ДатаНачала > Мероприятие.ДатаОкончания
				ИЛИ Мероприятие.ДатаНачала < ДатаНачала
				ИЛИ Мероприятие.ДатаНачала > ДатаОкончания Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период.'"), Ссылка, 
					СтрШаблон("Мероприятия[%1].ДатаНачала", Формат(Мероприятия.Индекс(Мероприятие), "ЧГ=;")), , Отказ);
			ИначеЕсли НЕ ЗначениеЗаполнено(Мероприятие.ДатаОкончания)
				ИЛИ Мероприятие.ДатаОкончания < ДатаНачала
				ИЛИ Мероприятие.ДатаОкончания > ДатаОкончания Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период.'"), Ссылка, 
					СтрШаблон("Мероприятия[%1].ДатаОкончания", Формат(Мероприятия.Индекс(Мероприятие), "ЧГ=;")), , Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
		
	МассивНепроверяемыхРеквизитов.Добавить("Мероприятие.ДатаНачала");
	МассивНепроверяемыхРеквизитов.Добавить("Мероприятие.ДатаОкончания");

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры
 
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли