
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = Параметры.Период;
	СписокФизЛиц = Новый ФиксированныйМассив(Параметры.СписокФизЛиц);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Результат = СформироватьОтчетНаСервере();
	Результат.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	Результат.Очистить();

	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокФизЛиц", СписокФизЛиц);

	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ФизЛицо", ФизЛицо);
	КонецЕсли;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, УникальныйИдентификатор);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	ПолученныеДанныеРасшифровки = РасшифровкаИзХранилища(Расшифровка, АдресДанныхРасшифровки);
	Если (ПолученныеДанныеРасшифровки <> Null) И (ПолученныеДанныеРасшифровки <> Неопределено) Тогда
		ПоказатьЗначение(, ПолученныеДанныеРасшифровки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(СписокФизЛиц) = Тип("ФиксированныйМассив") И СписокФизЛиц.Количество() <> 0 Тогда
		СформироватьОтчет(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасшифровкаИзХранилища(Расшифровка, АдресДанныхРасшифровки) 
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	Если Тип(ДанныеРасшифровки) = Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		Возврат ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля().Получить(0).Значение;
	КонецЕсли;  
	
КонецФункции    



