#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// см. КриптографияСервер.ПриДобавленииОбработчиковОбновления
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//  ЗавершениеОбновления - Булево - флаг завершения обновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики, ЗавершениеОбновления = Ложь) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "1.0.1.6";
	Обработчик.Процедура = "КриптографияСерверПереопределяемый.ЗаполнитьПровайдерКриптографии";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "1.0.1.6";
	Обработчик.Процедура = "КриптографияСерверПереопределяемый.ЗаполнитьМестоВыполненияКриптографическихОпераций";
	Обработчик.НачальноеЗаполнение = Истина;
	
КонецПроцедуры

// Заполняет провайдер криптографии, если он не был задан с учетом имеющихся настроек других подсистем.
//
Процедура ЗаполнитьПровайдерКриптографии() Экспорт
	
	ПровайдерКриптографии = Константы.ПровайдерКриптографии.Получить();
	
	Если Не ЗначениеЗаполнено(ПровайдерКриптографии) Тогда
		Константы.ПровайдерКриптографии.Установить(Перечисления.ТипПровайдераКриптографии.NCALayer);
	КонецЕсли;
	
	ПровайдерКриптографии = Константы.ПровайдерКриптографии.Получить();
	
	Если Не ЗначениеЗаполнено(ПровайдерКриптографии) Тогда
		
		ПараметрыЭТД = ЭТДСерверПовтИсп.ПолучитьПараметрыЭТД();
		
		ИспользоватьВнешнююКриптографиюДляКомпонентыЭТД = Ложь;
		
		Если ПараметрыЭТД.Свойство("ИспользоватьВнешнююКриптографиюДляКомпоненты") Тогда
			ИспользоватьВнешнююКриптографиюДляКомпонентыЭТД = ПараметрыЭТД.ИспользоватьВнешнююКриптографиюДляКомпоненты;
		КонецЕсли;
		
		ИспользоватьВнешнююКриптографиюДляКомпоненты = ИспользоватьВнешнююКриптографиюДляКомпонентыЭТД;
		
		Если ИспользоватьВнешнююКриптографиюДляКомпоненты Тогда
			Константы.ПровайдерКриптографии.Установить(Перечисления.ТипПровайдераКриптографии.Kalkan);
		Иначе
			Константы.ПровайдерКриптографии.Установить(Перечисления.ТипПровайдераКриптографии.NCALayer);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет место выполнения криптографических операций, если оно не было задано.
//
Процедура ЗаполнитьМестоВыполненияКриптографическихОпераций() Экспорт
	
	МестоУстановкиБиблиотеки = Константы.МестоВыполненияКриптографическихОпераций.Получить();
	
	Если Не ЗначениеЗаполнено(МестоУстановкиБиблиотеки) Тогда
		
		МестоУстановкиБиблиотеки = Перечисления.МестаВыполненияКриптографическихОпераций.НаКлиенте;
		Константы.МестоВыполненияКриптографическихОпераций.Установить(МестоУстановкиБиблиотеки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Определяет, является ли информационная база файловой.
//
// Возвращаемое значение:
//   Булево – Истина, если база данных файловая, иначе Ложь.
//
Функция ИнформационнаяБазаФайловая() Экспорт
	
	Возврат ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
КонецФункции

#КонецОбласти

#КонецОбласти