#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет начальное заполнение данных контроля задержки кандидатов
//
// Параметры:
//  ПараметрыОбновления  - Структура - описывает текущие параметры обновления
//
Процедура ПриНачальномЗаполненииДанныхКонтроляЗадержкиКандидатов(ПараметрыОбновления) Экспорт
	
	НастройкиПодбораПерсонала = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
	Если НастройкиПодбораПерсонала.ПричинаАвтоматическогоОтклонения <> Справочники.ПричиныОтклоненияКандидатов.ПустаяСсылка() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ПричиныОтклоненияКандидатов");
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиПодбораПерсонала");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ПричинаОтклонения = Справочники.ПричиныОтклоненияКандидатов.ДобавитьПричинуОтклоненияКандидатов(НСтр("ru = 'Задержка на этапе'"));
		НастройкиПодбораПерсонала.ДнейДоСообщения = 30;
		НастройкиПодбораПерсонала.ДнейДоОтклонения = 60;
		НастройкиПодбораПерсонала.ПричинаАвтоматическогоОтклонения = ПричинаОтклонения;
		РегистрыСведений.НастройкиПодбораПерсонала.УстановитьНастройки(НастройкиПодбораПерсонала);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ПроверкаНаличияЗадержавшихсяКандидатов(Проверка, ПараметрыПроверки) Экспорт
	
	ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе = ПолучитьФункциональнуюОпцию("ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе");
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтрольВеденияУчета") ИЛИ Не ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов().Предупреждение;
	ЗадержавшиесяКандидаты = РезультатПроверкиНаличияЗадержавшихсяКандидатов(СпособВыявленияЗадержавшихсяКандидатов);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗадержавшиесяКандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗадержавшийсяКандидат Из ЗадержавшиесяКандидаты Цикл
		МодульКонтрольВеденияУчета = ОбщегоНазначения.ОбщийМодуль("КонтрольВеденияУчета");
		Проблема = МодульКонтрольВеденияУчета.ОписаниеПроблемы(ЗадержавшийсяКандидат.Кандидат, ПараметрыПроверки);
		Проблема.ВажностьПроблемы = Перечисления["ВажностьПроблемыУчета"].Предупреждение;
		ДнейДоСообщения = ЗарплатаКадрыКлиентСервер.ПредставлениеПоПериодичности(ЗадержавшийсяКандидат.ДнейДоступно,
			Перечисления.Периодичность.День);
		Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Кандидат без движения более %1.
			|Продолжите работу с кандидатом или отклоните его, если работа в действительности завершена.'"),
			ДнейДоСообщения);
		УстановитьПривилегированныйРежим(Истина);
		КонтрольВеденияУчетаБЗК.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив задержавшихся кандидатов
//
// Параметры:
//  СпособВыявленияЗадержавшихсяКандидатов - Строка - вариант из СпособВыявленияЗадержавшихсяКандидатов().
// 
// Возвращаемое значение:
//  ЗадержавшиесяКандидаты - Массив - массив задержавшихся кандидатов
//
Функция ЗадержавшиесяКандидаты(СпособВыявленияЗадержавшихсяКандидатов) Экспорт
	
	ЗадержавшиесяКандидаты = РезультатПроверкиНаличияЗадержавшихсяКандидатов(СпособВыявленияЗадержавшихсяКандидатов);
	ЗадержавшиесяКандидаты = ЗадержавшиесяКандидаты.ВыгрузитьКолонку("Кандидат");
	
	Возврат ЗадержавшиесяКандидаты;
	
КонецФункции

Функция СпособыВыявленияЗадержавшихсяКандидатов() Экспорт
	
	Варианты = Новый Структура();
	Варианты.Вставить("Предупреждение", "Предупреждение");
	Варианты.Вставить("Отклонение", "Отклонение");
	
	Возврат Варианты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатПроверкиНаличияЗадержавшихсяКандидатов(СпособВыявленияЗадержавшихсяКандидатов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущиеЭтапыРаботыСКандидатами.Кандидат КАК Кандидат,
		|	ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
		|	ТекущиеЭтапыРаботыСКандидатами.Состояние КАК Состояние,
		|	ТекущиеЭтапыРаботыСКандидатами.ДатаВремя КАК ДатаВремя
		|ПОМЕСТИТЬ ВТТекущиеЭтапыРаботыСКандидатами
		|ИЗ
		|	РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапыРаботыСКандидатами
		|ГДЕ
		|	ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы <> ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.РаботаЗавершена)
		|	И ТекущиеЭтапыРаботыСКандидатами.Кандидат.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Отклонено)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоследниеПройденныеЭтапы.Кандидат КАК Кандидат,
		|	ПоследниеПройденныеЭтапы.ЭтапРаботы КАК ЭтапРаботы,
		|	ПоследниеПройденныеЭтапы.Период КАК Период
		|ПОМЕСТИТЬ ВТПоследниеПройденныеЭтапы
		|ИЗ
		|	РегистрСведений.РаботаСКандидатами.СрезПоследних(, СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповРаботыСКандидатами.Пройден)) КАК ПоследниеПройденныеЭтапы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущиеЭтапыРаботыСКандидатами.Кандидат КАК Кандидат,
		|	ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
		|	ТекущиеЭтапыРаботыСКандидатами.ДатаВремя КАК ДатаЭтапа
		|ИЗ
		|	ВТТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапыРаботыСКандидатами
		|ГДЕ
		|	ТекущиеЭтапыРаботыСКандидатами.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТекущиеЭтапыРаботыСКандидатами.Кандидат,
		|	ПоследниеПройденныеЭтапы.ЭтапРаботы,
		|	ПоследниеПройденныеЭтапы.Период
		|ИЗ
		|	ВТТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапыРаботыСКандидатами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеПройденныеЭтапы КАК ПоследниеПройденныеЭтапы
		|		ПО ТекущиеЭтапыРаботыСКандидатами.Кандидат = ПоследниеПройденныеЭтапы.Кандидат
		|			И ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы <> ПоследниеПройденныеЭтапы.ЭтапРаботы
		|ГДЕ
		|	ТекущиеЭтапыРаботыСКандидатами.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТекущиеЭтапыРаботыСКандидатами.Кандидат,
		|	ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы,
		|	ТекущиеЭтапыРаботыСКандидатами.Кандидат.ДатаРегистрации
		|ИЗ
		|	ВТТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапыРаботыСКандидатами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|		ПО ТекущиеЭтапыРаботыСКандидатами.Кандидат = РаботаСКандидатами.Кандидат
		|ГДЕ
		|	РаботаСКандидатами.ЭтапРаботы ЕСТЬ NULL";
	
	ЗадержавшиесяКандидаты = Новый ТаблицаЗначений;
	ЗадержавшиесяКандидаты.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	ЗадержавшиесяКандидаты.Колонки.Добавить("ДнейДоступно", Новый ОписаниеТипов("Число"));
	
	СпособыВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов();
	НастройкиПодбораПерсонала = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
	ДанныеЗадержкиПоЭтапам = ДанныеЗадержкиПоЭтапам(СпособВыявленияЗадержавшихсяКандидатов);
	Выборка = Запрос.Выполнить().Выбрать();
	ТекущаяДата = ТекущаяДатаСеанса();
	Если СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Отклонение Тогда
		ДнейДоступно = НастройкиПодбораПерсонала.ДнейДоОтклонения;
		ЗаполнитьКандидатовДляОтклонения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата);
	ИначеЕсли СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Предупреждение Тогда
		ДнейДоступно = НастройкиПодбораПерсонала.ДнейДоСообщения;
		ЗаполнитьКандидатовДляПредупреждения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата);
	Иначе
		ВызватьИсключение НСтр("ru = 'Способ выявления задержавшихся кандидатов не определен'");
	КонецЕсли;
		
	Возврат ЗадержавшиесяКандидаты;
	
КонецФункции

Функция ДанныеЗадержкиПоЭтапам(СпособВыявленияЗадержавшихсяКандидатов) Экспорт
	
	Запрос = Новый Запрос;
	СхемаЗапроса = Новый СхемаЗапроса;
	ОписаниеЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	ОператорСхемы = ОписаниеЗапроса.Операторы[0];
	ВыбираемыеПоля = ОператорСхемы.ВыбираемыеПоля;
	
	ОператорСхемы.Источники.Добавить("Справочник.ЭтапыРаботыСкандидатами", "ЭтапыРаботыСкандидатами");
	ВыбираемыеПоля = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.Ссылка");
	
	СпособыВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов();
	Если СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Отклонение Тогда
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ОтклонятьЗадержавшихсяКандидатов");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.СпособОтклоненияЗадержавшихсяКандидатов");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ДнейДоОтклонения");
	ИначеЕсли СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Предупреждение Тогда
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ПроверятьКандидатовНаЗадержку");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.СпособПроверкиКандидатовНаЗадержку");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ДнейДоСообщения");
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЭтапыБезОтклонения()
	
	ЭтапыБезОтклонения = Новый Массив;
	ЭтапыБезОтклонения.Добавить(Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу);
	ЭтапыБезОтклонения.Добавить(Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу);
	ЭтапыБезОтклонения.Добавить();
	
	Возврат ЭтапыБезОтклонения
	
КонецФункции

Процедура ЗаполнитьКандидатовДляОтклонения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата)
	
	ЭтапыБезОтклонения = ЭтапыБезОтклонения();
	Пока Выборка.СледующийПоЗначениюПоля("Кандидат") Цикл
		Если ТипЗнч(Выборка.ЭтапРаботы) = Тип("СправочникСсылка.ЭтапыРаботыСкандидатами") Тогда
			ДанныеЗадержкиПоЭтапу = ДанныеЗадержкиПоЭтапам.НайтиСтроки(Новый Структура("Ссылка", Выборка.ЭтапРаботы));
			Если ДанныеЗадержкиПоЭтапу.Количество() = 0 Или Не ДанныеЗадержкиПоЭтапу[0].ОтклонятьЗадержавшихсяКандидатов Тогда
				Продолжить;
			ИначеЕсли ДанныеЗадержкиПоЭтапу[0].СпособОтклоненияЗадержавшихсяКандидатов =
				Перечисления.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе Тогда
				ДнейДоступно = ДанныеЗадержкиПоЭтапу[0].ДнейДоОтклонения;
			КонецЕсли;
		Иначе
			Если ЭтапыБезОтклонения.Найти(Выборка.ЭтапРаботы) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если (НачалоДня(ТекущаяДата) - НачалоДня(Выборка.ДатаЭтапа)) / (60 * 60 * 24) > ДнейДоступно Тогда
			ЗадержавшийсяКандидат = ЗадержавшиесяКандидаты.Добавить();
			ЗадержавшийсяКандидат.Кандидат = Выборка.Кандидат;
			ЗадержавшийсяКандидат.ДнейДоступно = ДнейДоступно;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКандидатовДляПредупреждения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата)
	
	Пока Выборка.СледующийПоЗначениюПоля("Кандидат") Цикл
		Если ТипЗнч(Выборка.ЭтапРаботы) = Тип("СправочникСсылка.ЭтапыРаботыСкандидатами") Тогда
			ДанныеЗадержкиПоЭтапу = ДанныеЗадержкиПоЭтапам.НайтиСтроки(Новый Структура("Ссылка", Выборка.ЭтапРаботы));
			Если ДанныеЗадержкиПоЭтапу.Количество() = 0 Или Не ДанныеЗадержкиПоЭтапу[0].ПроверятьКандидатовНаЗадержку Тогда
				Продолжить;
			ИначеЕсли ДанныеЗадержкиПоЭтапу[0].СпособПроверкиКандидатовНаЗадержку =
				Перечисления.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе Тогда
				ДнейДоступно = ДанныеЗадержкиПоЭтапу[0].ДнейДоСообщения;
			КонецЕсли;
		КонецЕсли;
		Если (НачалоДня(ТекущаяДата) - НачалоДня(Выборка.ДатаЭтапа)) / (60 * 60 * 24) > ДнейДоступно Тогда
			ЗадержавшийсяКандидат = ЗадержавшиесяКандидаты.Добавить();
			ЗадержавшийсяКандидат.Кандидат = Выборка.Кандидат;
			ЗадержавшийсяКандидат.ДнейДоступно = ДнейДоступно;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли