
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидОсмотра") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			РабочиеМеста.Отбор, "ВидОсмотра", Параметры.ВидОсмотра, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если Параметры.Свойство("ИсключаяРабочееМесто") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			РабочиеМеста.Отбор, "Ссылка", Параметры.ИсключаяРабочееМесто, ВидСравненияКомпоновкиДанных.НеРавно);
		РеквизитыРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Параметры.ИсключаяРабочееМесто, "Владелец, Подразделение");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			РабочиеМеста, 
			"Организация", 
			РеквизитыРабочегоМеста.Владелец, , , 
			Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, 
			Строка(Новый УникальныйИдентификатор));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			РабочиеМеста, 
			"Подразделение", 
			РеквизитыРабочегоМеста.Подразделение, , , 
			Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, 
			Строка(Новый УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
