#Область СлужебныеПроцедурыИФункции

// Обработчик подписки на событие ЗаполнитьНаборЗначенийДоступаСПредметомКандидатом.
// 
// Параметры:
// 	НаборЗаписей - РегистрСведенийНаборЗаписей.ПредметыПапкиВзаимодействий - 
// 	Отказ - Булево
// 	Замещение - Булево
//
Процедура ЗаполнитьНаборЗначенийДоступаСПредметомКандидатом(НаборЗаписей, Отказ, Замещение) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(НаборЗаписей) Тогда
		Возврат;
	КонецЕсли;
	
	Если НаборЗаписей.Отбор["Взаимодействие"].Использование = Ложь 
		Или Не ЗначениеЗаполнено(НаборЗаписей.Отбор.Взаимодействие.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийПредмет = НаборЗаписей.ДополнительныеСвойства.СтруктураЗаписи.Предмет; // СправочникСсылка - 
	
	Если Не ПредметИзменился(НаборЗаписей, ПрежнийПредмет) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПредметЯвляетсяКандидатом(НаборЗаписей, ПрежнийПредмет) Тогда 
		УправлениеДоступом.ОбновитьНаборыЗначенийДоступа(НаборЗаписей.Отбор.Взаимодействие.Значение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРаботуСКандидатомПриИзмененииКадровойИстории(НаборЗаписейКадровойИстории, Отказ, Замещение) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(НаборЗаписейКадровойИстории) Тогда
		Возврат;
	КонецЕсли;

	// Если изменение кадровой истории - это прием на работу, нужно найти кандидата и отметить у него соотв. состояние
	// - если принят на работу - состояние "пройден"
	// - если не принят (отмена приема на работу) - состояние "пустое"
	
	ИзменившиесяДанныеКадровойИстории = НаборЗаписейКадровойИстории.ТаблицаИзменившихсяДанныхНабора();
	Если ИзменившиесяДанныеКадровойИстории = Неопределено Или ИзменившиесяДанныеКадровойИстории.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПриемНаРаботуСотрудников = Новый Соответствие;
	
	Для Каждого Изменение Из ИзменившиесяДанныеКадровойИстории Цикл
		Если Изменение.Добавление И Изменение.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием Тогда
			ПриемНаРаботуСотрудников.Вставить(Изменение.Сотрудник, ОписаниеЭтапаПриемНаРаботу(Истина, Изменение.Период));
		КонецЕсли;
		Если Изменение.Удаление И Изменение.СтароеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием Тогда
			ПриемНаРаботуСотрудников.Вставить(Изменение.Сотрудник, ОписаниеЭтапаПриемНаРаботу(Ложь));
		КонецЕсли;
	КонецЦикла;
	
	Если ПриемНаРаботуСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КандидатыПоСотрудникам = ПодборПерсонала.КандидатыПоСотрудникам(
		ОбщегоНазначения.ВыгрузитьКолонку(ПриемНаРаботуСотрудников, "Ключ"));

	Для Каждого СтрокаТаблицы Из КандидатыПоСотрудникам Цикл
		Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
		Результат.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТаблицы.Кандидат);
		Результат.ЭтапРаботы.Этап = Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу;
		ОписаниеЭтапа = ПриемНаРаботуСотрудников.Получить(СтрокаТаблицы.Сотрудник);
		Если ОписаниеЭтапа.Принят Тогда
			Результат.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
			Результат.ЭтапРаботы.Период = Перечисления.ЭтапыРаботыСКандидатами.УточнитьВремяЭтапа(
				Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу, ОписаниеЭтапа.ДатаПриема);
			Результат.ЭтапРаботы.ДокументОснование = НаборЗаписейКадровойИстории.Отбор.Регистратор.Значение;
		КонецЕсли;
		ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидатов(Результат);
	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьРаботуСКандидатомПриИзмененииРешенияОПриемеНаРаботу(ДокументОбъект, Отказ) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;

	Кандидаты = Новый Массив;
	
	ПрежниеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДокументОбъект.ДополнительныеСвойства, "ПрежниеДанные", Новый Структура);

	Если Не ПрежниеДанные.Свойство("Кандидат") Тогда
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	ИначеЕсли ПрежниеДанные.Кандидат <> ДокументОбъект.Кандидат Тогда
		Кандидаты.Добавить(ПрежниеДанные.Кандидат);
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПрежниеДанные, "Проведен", Ложь) <> ДокументОбъект.Проведен Тогда
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПрежниеДанные, "Комментарий", Ложь) <> ДокументОбъект.Комментарий Тогда
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	КонецЕсли;

	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	РешенияПоКандидатам = Документы.РешениеОПриемеНаРаботу.РешенияПоКандидатам(Кандидаты);
	ДанныеРешений = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ОбщегоНазначения.ВыгрузитьКолонку(РешенияПоКандидатам, "Значение"), "Дата, Проведен, Комментарий");
	Для Каждого Кандидат Из Кандидаты Цикл
		Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
		Результат.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат);
		Результат.ЭтапРаботы.Этап = Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу;
		Решение = РешенияПоКандидатам[Кандидат];
		Если ЗначениеЗаполнено(Решение) Тогда
			Если ДанныеРешений[Решение].Проведен Тогда
				Результат.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
			Иначе
				Результат.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован;
			КонецЕсли;
			Результат.ЭтапРаботы.Период = Перечисления.ЭтапыРаботыСКандидатами.УточнитьВремяЭтапа(
				Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу, ДанныеРешений[Решение].Дата);
			Результат.ЭтапРаботы.Комментарий = ДанныеРешений[Решение].Комментарий;
			Результат.ЭтапРаботы.ДокументОснование = Решение;
		КонецЕсли;
		ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидатов(Результат);
	КонецЦикла;

КонецПроцедуры

Функция ПредметИзменился(ТекущийНабор, ПрежнийПредмет)
	
	Если ТекущийНабор.Количество() = 0 Или Не ЗначениеЗаполнено(ТекущийНабор[0].Предмет) Тогда
		Возврат ЗначениеЗаполнено(ПрежнийПредмет);
	КонецЕсли;
	
	Возврат ТекущийНабор[0].Предмет <> ПрежнийПредмет;
	
КонецФункции

Функция ПредметЯвляетсяКандидатом(ТекущийНабор, ПрежнийПредмет)
	
	Если ТипЗнч(ПрежнийПредмет) = Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТекущийНабор.Количество() > 0 И ТипЗнч(ТекущийНабор[0].Предмет) = Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОписаниеЭтапаПриемНаРаботу(Принят, ДатаПриема = Неопределено)
	
	Описание = Новый Структура();
	Описание.Вставить("Принят", Принят);
	Описание.Вставить("ДатаПриема", ДатаПриема);
	
	Возврат Описание;

КонецФункции

#КонецОбласти