#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Владелец");
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляПодчиненногоСправочника(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру категорий гражданства в мед. регистре.
//
Функция НаименованияКатегорийГражданстваМедицинскихРаботников() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлементыКлассификаторовФедеральныхМедрегистров.Ссылка КАК Ссылка,
	               |	ЭлементыКлассификаторовФедеральныхМедрегистров.НаименованиеПолное КАК Наименование,
	               |	ВЫБОР
	               |		КОГДА ЭлементыКлассификаторовФедеральныхМедрегистров.Код = ""1""
	               |			ТОГДА ""ГражданинРоссии""
	               |		КОГДА ЭлементыКлассификаторовФедеральныхМедрегистров.Код = ""3""
	               |			ТОГДА ""ИностранныйГражданин""
	               |		КОГДА ЭлементыКлассификаторовФедеральныхМедрегистров.Код = ""4""
	               |			ТОГДА ""БезГражданства""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Код
	               |ИЗ
	               |	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторовФедеральныхМедрегистров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторыФедеральныхМедрегистров КАК КлассификаторыФедеральныхМедрегистров
	               |		ПО ЭлементыКлассификаторовФедеральныхМедрегистров.Владелец = КлассификаторыФедеральныхМедрегистров.Ссылка
	               |ГДЕ
	               |	КлассификаторыФедеральныхМедрегистров.Код = &ИдентификаторКлассификатора";
	
	Запрос.УстановитьПараметр("ИдентификаторКлассификатора", "1.2.643.5.1.13.13.99.2.315");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Гражданство = Новый Структура("ГражданинРоссии, ИностранныйГражданин, БезГражданства");
	
	Пока Выборка.Следующий() Цикл 
		
		Если ПустаяСтрока(Выборка.Код ) Тогда
			Продолжить;
		КонецЕсли;
		
		Гражданство.Вставить(Выборка.Код, Выборка.Наименование);
		
	КонецЦикла;
	
	Возврат Гражданство;
	
КонецФункции	

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = Данные.НаименованиеПолное;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НаименованиеПолное");
КонецПроцедуры

#КонецОбласти

#КонецЕсли

