
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ДатыЗапретаИзменения

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НаправлениеНаМедицинскийОсмотр",				"ДатаОсмотра",	"ОхранаТруда",	"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаключениеМедицинскогоОсмотра",				"ДатаОсмотра",	"ОхранаТруда",	"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МедицинскиеОсмотры",					"Период",		"ОхранаТруда",	"ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МедицинскиеОсмотрыПоВидамРабот",		"Период",		"ОхранаТруда",	"ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам",	"Период",		"ОхранаТруда",	"ГоловнаяОрганизация");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

// СтандартныеПодсистемы.ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НаправлениеНаМедицинскийОсмотр";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ДатаРождения";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаключениеМедицинскогоОсмотра";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "РезультатОсмотра,ПояснениеРезультата";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.ОпределитьРазделыСВариантамиОтчетов
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Если Разделы.НайтиПоЗначению(Метаданные.Подсистемы.ОхранаТруда) = Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы.ОхранаТруда.Подсистемы.МедицинскиеОсмотры, НСтр("ru = 'Медицинские осмотры'"));
	КонецЕсли;
	
КонецПроцедуры

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.МедицинскиеОсмотры);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ОбновлениеПериодическихМедицинскихОсмотров.Имя);
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбновлениеПериодическихМедицинскихОсмотров.ИмяМетода);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий

// СтандартныеПодсистемы.Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.НаправлениеНаМедицинскийОсмотр); 
	СписокОбъектов.Добавить(Документы.ЗаключениеМедицинскогоОсмотра); 
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.РегламентныеЗадания

// См. процедуру РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбновлениеПериодическихМедицинскихОсмотров;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьМедицинскиеОсмотры;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РегламентныеЗадания

// СтандартныеПодсистемы.Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf80-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ЗаключениеМедицинскогоОсмотра);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4fe-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.НаправлениеНаМедицинскийОсмотр);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры") Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики.Добавить(МедицинскиеОсмотры);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат; // Модель сервиса.
	КонецЕсли;
	
	Если Не ПравоДоступа("Использование", Метаданные.Обработки.МедицинскиеОсмотры) Тогда
		Возврат; // Нет прав.
	КонецЕсли;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	
	Разделы = МодульТекущиеДелаСервер.РазделыДляОбъекта("Обработка.МедицинскиеОсмотры");
	Если Разделы.Количество() = 0 Тогда
		// Не вынесены в командный интерфейс.
		РазделОхранаТруда = Метаданные.Подсистемы.Найти("ОхранаТруда");
		Если РазделОхранаТруда = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Разделы.Добавить(РазделОхранаТруда);
	КонецЕсли;
	
	ИстекшиеМедицинскиеОсмотры = ИстекшиеПериодическиеМедицинскиеОсмотры(
		Перечисления.ВидыОбследований.МедицинскийОсмотр);
	ИспользоватьПсихиатрическиеОсвидетельствования = 
		ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования");
	ИстекшиеПсихиатрическиеОсмотры = ?(ИспользоватьПсихиатрическиеОсвидетельствования,
		ИстекшиеПериодическиеМедицинскиеОсмотры(
		Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование), Неопределено);
	ВредныеФакторыБезПодтвержденияСоответствия = ВредныеФакторыБезПодтвержденияСоответствия(Перечисления.ВидыОбследований.МедицинскийОсмотр);
	РабочиеМестаСУстаревшимиВреднымиФакторами = РабочиеМестаСУстаревшимиВреднымиФакторами();
	
	ВредныеФакторыБезПодтвержденияСоответствияПсихиатрическоеОсвидетельствование = Неопределено;
	Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		ВредныеФакторыБезПодтвержденияСоответствияПсихиатрическоеОсвидетельствование =
			ВредныеФакторыБезПодтвержденияСоответствия(Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
	КонецЕсли;
	
	Для Каждого Раздел Из Разделы Цикл
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = "ИстекшиеПериодическиеМедицинскиеОсмотры";
		Дело.ЕстьДела       = Ложь;
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
		Дело.Представление  = НСтр("ru = 'Медицинские осмотры'");
		Дело.Количество		= 0;
		Дело.Подсказка      = НСтр("ru = 'Истекли сроки обязательных периодических медицинских осмотров. Сотрудникам необходимо немедленно пройти осмотр.'");
		Если ИстекшиеМедицинскиеОсмотры <> Неопределено Тогда
			Дело.ЕстьДела = Истина;
			Дело.Количество = ИстекшиеМедицинскиеОсмотры.Количество;
			Дело.ПараметрыФормы = Новый Структура("Организация", ИстекшиеМедицинскиеОсмотры.Организация);
			Дело.ПараметрыФормы.Вставить("ВидОсмотра", ИстекшиеМедицинскиеОсмотры.ВидОсмотра);
			Дело.Форма = "Обработка.МедицинскиеОсмотры.Форма.Форма";
		КонецЕсли;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = "ВредныеФакторыБезПодтвержденияСоответствия";
		Дело.ЕстьДела       = Ложь;
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
		Дело.Представление  = НСтр("ru = 'Соответствие вредных факторов медицинских осмотров'");
		Дело.Количество		= 0;
		Дело.Подсказка      = НСтр("ru = 'Для того чтобы результаты медицинских осмотров, пройденных до 1 апреля 2021 года по классификатору приказа №302н, действовали и по приказу №29н, требуется установить соответствие вредных факторов.'");
		Если ВредныеФакторыБезПодтвержденияСоответствия <> Неопределено Тогда
			Дело.ЕстьДела = Истина;
			Дело.Количество = ВредныеФакторыБезПодтвержденияСоответствия.Количество;
			Дело.ПараметрыФормы.Вставить("ВидОсмотра", Перечисления.ВидыОбследований.МедицинскийОсмотр);
			Дело.ПараметрыФормы.Вставить("ИмяСтраницы", "СопоставлениеСтраница");
			Дело.Форма = "Обработка.МедицинскиеОсмотры.Форма.Форма";
		КонецЕсли;
		
		Если Не ИспользоватьПсихиатрическиеОсвидетельствования Тогда
			Продолжить;
		КонецЕсли;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = "ИстекшиеПериодическиеПсихиатрическиеОсмотры";
		Дело.ЕстьДела       = Ложь;
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
		Дело.Представление  = НСтр("ru = 'Истекшие психиатрические освидетельствования'");
		Дело.Количество		= 0;
		Дело.Подсказка      = НСтр("ru = 'Истекли сроки обязательных периодических психиатрических освидетельствований. Сотрудникам необходимо немедленно пройти освидетельствование.'");
		Если ИстекшиеПсихиатрическиеОсмотры <> Неопределено Тогда
			Дело.ЕстьДела = Истина;
			Дело.Количество = ИстекшиеПсихиатрическиеОсмотры.Количество;
			Дело.ПараметрыФормы = Новый Структура("Организация", ИстекшиеПсихиатрическиеОсмотры.Организация);
			Дело.ПараметрыФормы.Вставить("ВидОсмотра", ИстекшиеПсихиатрическиеОсмотры.ВидОсмотра);
			Дело.ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Психиатрические освидетельствования'"));
			Дело.Форма = "Обработка.МедицинскиеОсмотры.Форма.Форма";
		КонецЕсли;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = "ВидыДеятельностиБезПодтвержденияСоответствия";
		Дело.ЕстьДела       = Ложь;
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
		Дело.Представление  = НСтр("ru = 'Соответствие видов деятельности психиатрических освидетельствований'");
		Дело.Количество		= 0;
		Дело.Подсказка      = НСтр("ru = 'Для того чтобы результаты психиатрических освидетельствований, пройденных до 1 сентября 2022 года, действовали и по приказу №342н, требуется установить соответствие видов деятельности.'");
		Если ВредныеФакторыБезПодтвержденияСоответствияПсихиатрическоеОсвидетельствование <> Неопределено Тогда
			Дело.ЕстьДела = Истина;
			Дело.Количество = ВредныеФакторыБезПодтвержденияСоответствияПсихиатрическоеОсвидетельствование.Количество;
			Дело.ПараметрыФормы.Вставить("ВидОсмотра", Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
			Дело.ПараметрыФормы.Вставить("ИмяСтраницы", "СопоставлениеСтраница");
			Дело.ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Психиатрические освидетельствования'"));
			Дело.Форма = "Обработка.МедицинскиеОсмотры.Форма.Форма";
		КонецЕсли;
		
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = "РабочиеМестаСУстаревшимиВреднымиФакторами";
		Дело.ЕстьДела       = Ложь;
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
		Дело.Представление  = НСтр("ru = 'Периодические психиатрические освидетельствования'");
		Дело.Количество		= 0;
		Дело.Подсказка      = НСтр("ru = 'Рабочим местам назначены устаревшие виды работ или вредные факторы с периодическим осмотром. С 1 сентября 2022 года психиатрические освидетельствования проводятся однократно.'");
		Если РабочиеМестаСУстаревшимиВреднымиФакторами <> Неопределено Тогда
			Дело.ЕстьДела = Истина;
			Дело.Количество = РабочиеМестаСУстаревшимиВреднымиФакторами.Количество;
			Дело.ПараметрыФормы = Новый Структура("Организация", РабочиеМестаСУстаревшимиВреднымиФакторами.Организация);
			Дело.ПараметрыФормы.Вставить("ВидОсмотра", Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
			Дело.ПараметрыФормы.Вставить("ИмяСтраницы", "РабочиеМестаСтраница");
			Дело.ПараметрыФормы.Вставить("ПроверятьУстаревшиеВредныеФакторыИВидыРабот", Истина);
			Дело.ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Психиатрические освидетельствования'"));
			Дело.Форма = "Обработка.МедицинскиеОсмотры.Форма.Форма";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ТекущиеДела

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ЗаключениеМедицинскогоОсмотраПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаключениеМедицинскогоОсмотра, Истина);
	Списки.Вставить(Метаданные.Документы.НаправлениеНаМедицинскийОсмотр, Истина);
	Списки.Вставить(Метаданные.Справочники.НаправлениеНаМедицинскийОсмотрПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВредныеФакторыРабочегоМеста, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.МедицинскиеОсмотры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.МедицинскиеОсмотрыПоВидамРабот, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПериодическиеМедицинскиеОсмотры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест, Истина);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает дату вступления в силу приказа Минздрава РФ от 28 января 2021 г. № 29н.
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаПриказа29н() Экспорт
	// ЗУПК
	Возврат '19000101';
	// ЗУПК
КонецФункции

Функция ВредныеФакторыИВидыРаботРабочегоМеста(РабочееМесто, ВидОсмотра = Неопределено) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВТВредныеФакторыИВидыРаботРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра);
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВременныхТаблиц, "ВТВредныеФакторыИВидыРаботРабочегоМеста") Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.Код КАК Код,
		|	ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор КАК ВредныйФактор
		|ИЗ
		|	ВТВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|УПОРЯДОЧИТЬ ПО
		|	Код";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВредныйФактор");
	
КонецФункции

Функция ПериодичностьМедицинскихОсмотров(РабочееМесто, ВидОсмотра = Неопределено) Экспорт
	
	ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодичностьОсмотров.КратностьОсмотра КАК Кратность,
		|	ПериодичностьОсмотров.ПериодичностьОсмотра КАК Периодичность,
		|	ПериодичностьОсмотров.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичности,
		|	ПериодичностьОсмотров.ПредставлениеПериодичностиОсмотра КАК Представление,
		|	ПериодичностьОсмотров.Однократно КАК Однократно
		|ИЗ
		|	РегистрСведений.ПериодичностьМедицинскихОсмотровРабочихМест КАК ПериодичностьОсмотров
		|ГДЕ
		|	ПериодичностьОсмотров.РабочееМесто = &РабочееМесто
		|	И ПериодичностьОсмотров.ВидОсмотра = &ВидОсмотра";
	
	Если ВидОсмотра = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПериодичностьОсмотров.ВидОсмотра = &ВидОсмотра", "ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОписаниеПериодичности;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Выборка);
	
	Возврат ОписаниеПериодичности;
	
КонецФункции

Функция ПоследнийОсмотр(ФизическоеЛицо, РабочееМесто, ВидОсмотра, ДатаАктуальности = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МедицинскиеОсмотры.Период КАК Период,
		|	МедицинскиеОсмотры.Регистратор КАК Регистратор,
		|	МедицинскиеОсмотры.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МедицинскиеОсмотры.РабочееМесто КАК РабочееМесто,
		|	МедицинскиеОсмотры.РезультатОсмотра КАК РезультатОсмотра,
		|	МедицинскиеОсмотры.ВидОсмотра КАК ВидОсмотра,
		|	МедицинскиеОсмотры.ТипОсмотра КАК ТипОсмотра,
		|	МедицинскиеОсмотры.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотры.СрезПоследних(
		|			&ДатаАктуальности,
		|			ФизическоеЛицо = &ФизическоеЛицо
		|				И ВидОсмотра = &ВидОсмотра
		|				И РабочееМесто = &РабочееМесто) КАК МедицинскиеОсмотры";
	Если ДатаАктуальности = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", "");
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

Функция СледующийОсмотр(ФизическоеЛицо, РабочееМесто, ВидОсмотра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодическиеОсмотры.ДатаСледующегоОсмотра КАК ДатаСледующегоОсмотра,
		|	ПериодическиеОсмотры.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПериодическиеОсмотры.РабочееМесто КАК РабочееМесто,
		|	ПериодическиеОсмотры.ВидОсмотра КАК ВидОсмотра,
		|	ПериодическиеОсмотры.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ПериодическиеОсмотры.РезультатОсмотра КАК РезультатОсмотра,
		|	ПериодическиеОсмотры.ДатаПройденногоОсмотра КАК ДатаПройденногоОсмотра,
		|	ПериодическиеОсмотры.Направление КАК Направление,
		|	ПериодическиеОсмотры.Заключение КАК Заключение
		|ИЗ
		|	РегистрСведений.ПериодическиеМедицинскиеОсмотры КАК ПериодическиеОсмотры
		|ГДЕ
		|	ПериодическиеОсмотры.ФизическоеЛицо = &ФизическоеЛицо
		|	И ПериодическиеОсмотры.ВидОсмотра = &ВидОсмотра
		|	И ПериодическиеОсмотры.РабочееМесто = &РабочееМесто";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

Функция ВыданноеНаправление(ФизическоеЛицо, РабочееМесто, ВидОсмотра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеНаправления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыданныеНаправления.РабочееМесто КАК РабочееМесто,
		|	ВыданныеНаправления.ВидОсмотра КАК ВидОсмотра,
		|	ВыданныеНаправления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВыданныеНаправления.Направление КАК Направление,
		|	ВыданныеНаправления.Заключение КАК Заключение
		|ИЗ
		|	РегистрСведений.ВыданныеНаправленияНаМедицинскийОсмотр.СрезПоследних(
		|			,
		|			ФизическоеЛицо = &ФизическоеЛицо
		|				И ВидОсмотра = &ВидОсмотра
		|				И РабочееМесто = &РабочееМесто) КАК ВыданныеНаправления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

Функция ВредныеФакторыИВидыРаботТребующиеОсмотра(ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности) Экспорт
	
	ВредныеФакторыИВидыРабот = Новый ТаблицаЗначений;
	ВредныеФакторыИВидыРабот.Колонки.Добавить("ВредныйФактор", Новый ОписаниеТипов("СправочникСсылка.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы"));
	ВредныеФакторыИВидыРабот.Колонки.Добавить("ДатаОсмотра", Новый ОписаниеТипов("Дата"));
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВредныеФакторыИВидыРаботРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра);
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВременныхТаблиц, "ВТВредныеФакторыИВидыРаботРабочегоМеста") Тогда
		Возврат ВредныеФакторыИВидыРабот;
	КонецЕсли;
	
	СоздатьВТПериодичностьВредныхФакторов(МенеджерВременныхТаблиц, "ВТВредныеФакторыИВидыРаботРабочегоМеста");
	СоздатьВТОсмотрыПоВреднымФакторамФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо, ДатаАктуальности, Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор КАК ВредныйФактор,
		|	ОсмотрыПоВреднымФакторам.ДатаОсмотра КАК ДатаОсмотра,
		|	ОсмотрыПоВреднымФакторам.РезультатОсмотра КАК РезультатОсмотра,
		|	ПериодичностьВредныхФакторов.Кратность КАК Кратность,
		|	ПериодичностьВредныхФакторов.Периодичность КАК Периодичность,
		|	ПериодичностьВредныхФакторов.ЕдиницаПериодичности КАК ЕдиницаПериодичности,
		|	ПериодичностьВредныхФакторов.Однократно КАК Однократно
		|ИЗ
		|	ВТВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторам КАК ОсмотрыПоВреднымФакторам
		|		ПО (ОсмотрыПоВреднымФакторам.ВредныйФактор = ВредныеФакторыРабочегоМеста.ВредныйФактор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодичностьВредныхФакторов КАК ПериодичностьВредныхФакторов
		|		ПО (ПериодичностьВредныхФакторов.ВредныйФактор = ВредныеФакторыРабочегоМеста.ВредныйФактор)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ДатаОсмотра) Тогда
			// Осмотр не проводился.
			НоваяСтрока = ВредныеФакторыИВидыРабот.Добавить();
			НоваяСтрока.ВредныйФактор = Выборка.ВредныйФактор;
			НоваяСтрока.ДатаОсмотра = ДатаАктуальности;
			Продолжить;
		КонецЕсли;
		// Осмотр проводился, проверяем его актуальность.
		ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
		ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Выборка);
		ДатаСледующегоОсмотра = ДатаСледующегоОсмотра(Выборка.ДатаОсмотра, ОписаниеПериодичности);
		Если ДатаСледующегоОсмотра > ДатаАктуальности Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ВредныеФакторыИВидыРабот.Добавить();
		НоваяСтрока.ВредныйФактор = Выборка.ВредныйФактор;
		НоваяСтрока.ДатаОсмотра = ДатаСледующегоОсмотра;
	КонецЦикла;
	
	Возврат ВредныеФакторыИВидыРабот;
	
КонецФункции

Функция ВредныеФакторыТребующиеОсмотра(ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности) Экспорт
	
	ВредныеФакторы = Новый ТаблицаЗначений;
	ВредныеФакторы.Колонки.Добавить("ВредныйФактор", Новый ОписаниеТипов("СправочникСсылка.ВредныеОпасныеПроизводственныеФакторы"));
	ВредныеФакторы.Колонки.Добавить("ДатаОсмотра", Новый ОписаниеТипов("Дата"));
	
	Если ДатаАктуальности > ДатаПриказа29н()
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочееМесто, "ВредныеФакторыСопоставлены") Тогда
		Возврат ВредныеФакторы;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВредныеФакторыРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра);
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВременныхТаблиц, "ВТВредныеФакторыРабочегоМеста") Тогда
		Возврат ВредныеФакторы;
	КонецЕсли;
	
	СоздатьВТПериодичностьВредныхФакторов(МенеджерВременныхТаблиц, "ВТВредныеФакторыРабочегоМеста");
	СоздатьВТОсмотрыПоВреднымФакторамФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо, ДатаАктуальности);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор КАК ВредныйФактор,
		|	ОсмотрыПоВреднымФакторам.ДатаОсмотра КАК ДатаОсмотра,
		|	ОсмотрыПоВреднымФакторам.РезультатОсмотра КАК РезультатОсмотра,
		|	ПериодичностьВредныхФакторов.Кратность КАК Кратность,
		|	ПериодичностьВредныхФакторов.Периодичность КАК Периодичность,
		|	ПериодичностьВредныхФакторов.ЕдиницаПериодичности КАК ЕдиницаПериодичности,
		|	ПериодичностьВредныхФакторов.Однократно КАК Однократно
		|ИЗ
		|	ВТВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторам КАК ОсмотрыПоВреднымФакторам
		|		ПО (ОсмотрыПоВреднымФакторам.ВредныйФактор = ВредныеФакторыРабочегоМеста.ВредныйФактор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодичностьВредныхФакторов КАК ПериодичностьВредныхФакторов
		|		ПО (ПериодичностьВредныхФакторов.ВредныйФактор = ВредныеФакторыРабочегоМеста.ВредныйФактор)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ДатаОсмотра) Тогда
			// Осмотр не проводился.
			НоваяСтрока = ВредныеФакторы.Добавить();
			НоваяСтрока.ВредныйФактор = Выборка.ВредныйФактор;
			НоваяСтрока.ДатаОсмотра = ДатаАктуальности;
			Продолжить;
		КонецЕсли;
		// Осмотр проводился, проверяем его актуальность.
		ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
		ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Выборка);
		ДатаСледующегоОсмотра = ДатаСледующегоОсмотра(Выборка.ДатаОсмотра, ОписаниеПериодичности);
		Если ДатаСледующегоОсмотра > ДатаАктуальности Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ВредныеФакторы.Добавить();
		НоваяСтрока.ВредныйФактор = Выборка.ВредныйФактор;
		НоваяСтрока.ДатаОсмотра = ДатаСледующегоОсмотра;
	КонецЦикла;
	
	Возврат ВредныеФакторы;
	
КонецФункции

Функция ВидыРаботТребующиеОсмотра(ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности) Экспорт
	
	ВидыРабот = Новый ТаблицаЗначений;
	ВидыРабот.Колонки.Добавить("ВидРабот", Новый ОписаниеТипов("СправочникСсылка.ВидыРаботМедицинскихОсмотров"));
	ВидыРабот.Колонки.Добавить("ДатаОсмотра", Новый ОписаниеТипов("Дата"));
	
	Если ДатаАктуальности > ДатаПриказа29н()
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочееМесто, "ВредныеФакторыСопоставлены") Тогда
		Возврат ВидыРабот;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВидыРаботРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра);

	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВременныхТаблиц, "ВТВидыРаботПозиции") Тогда
		Возврат ВидыРабот;
	КонецЕсли;
	
	СоздатьВТПериодичностьВидовРабот(МенеджерВременныхТаблиц, "ВТВидыРаботПозиции");
	СоздатьВТОсмотрыПоВидамРаботФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо, ДатаАктуальности);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботПозиции.ВидРабот КАК ВидРабот,
		|	ОсмотрыПоВидамРабот.ДатаОсмотра КАК ДатаОсмотра,
		|	ОсмотрыПоВидамРабот.РезультатОсмотра КАК РезультатОсмотра,
		|	ПериодичностьВидовРабот.Кратность КАК Кратность,
		|	ПериодичностьВидовРабот.Периодичность КАК Периодичность,
		|	ПериодичностьВидовРабот.ЕдиницаПериодичности КАК ЕдиницаПериодичности
		|ИЗ
		|	ВТВидыРаботПозиции КАК ВидыРаботПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВидамРабот КАК ОсмотрыПоВидамРабот
		|		ПО (ОсмотрыПоВидамРабот.ВидРабот = ВидыРаботПозиции.ВидРабот)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодичностьВидовРабот КАК ПериодичностьВидовРабот
		|		ПО (ПериодичностьВидовРабот.ВидРабот = ВидыРаботПозиции.ВидРабот)";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ДатаОсмотра) Тогда
			// Осмотр не проводился.
			НоваяСтрока = ВидыРабот.Добавить();
			НоваяСтрока.ВидРабот = Выборка.ВидРабот;
			НоваяСтрока.ДатаОсмотра = ДатаАктуальности;
			Продолжить;
		КонецЕсли;
		// Осмотр проводился, проверяем его актуальность.
		ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
		ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Выборка);
		ДатаСледующегоОсмотра = ДатаСледующегоОсмотра(Выборка.ДатаОсмотра, ОписаниеПериодичности);
		Если ДатаСледующегоОсмотра > ДатаАктуальности Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ВидыРабот.Добавить();
		НоваяСтрока.ВидРабот = Выборка.ВидРабот;
		НоваяСтрока.ДатаОсмотра = ДатаСледующегоОсмотра;
	КонецЦикла;
	
	Возврат ВидыРабот;
	
КонецФункции

Функция ОсмотрыПоВреднымФакторамИВидамРаботФизическогоЛица(ФизическоеЛицо, РабочееМесто, ДатаАктуальности = Неопределено) Экспорт
	
	ВидОсмотра = Неопределено;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования") Тогда
		ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	КонецЕсли;
	
	ОсмотрыПоФакторам = Новый ТаблицаЗначений;
	ОсмотрыПоФакторам.Колонки.Добавить("ВредныйФактор", Новый ОписаниеТипов("СправочникСсылка.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы"));
	ОсмотрыПоФакторам.Колонки.Добавить("Периодичность", Новый ОписаниеТипов("Структура"));
	ОсмотрыПоФакторам.Колонки.Добавить("ПоследнийОсмотр", Новый ОписаниеТипов("Дата"));
	ОсмотрыПоФакторам.Колонки.Добавить("СледующийОсмотр", Новый ОписаниеТипов("Дата"));
	ОсмотрыПоФакторам.Колонки.Добавить("Результат", Новый ОписаниеТипов("ПеречислениеСсылка.РезультатыМедицинскогоОсмотра"));
	ОсмотрыПоФакторам.Колонки.Добавить("СостояниеПроцент", Новый ОписаниеТипов("Число"));
	ОсмотрыПоФакторам.Колонки.Добавить("Требуется", Новый ОписаниеТипов("Булево"));
	ОсмотрыПоФакторам.Колонки.Добавить("Регистратор");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВредныеФакторыИВидыРаботРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра);
	СоздатьВТОсмотрыПоВреднымФакторамФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо, ДатаАктуальности, Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ЕстьВидОсмотра", Не ВидОсмотра = Неопределено);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор КАК ВредныйФактор,
		|	ОсмотрыПоВреднымФакторам.ДатаОсмотра КАК ПоследнийОсмотр,
		|	ОсмотрыПоВреднымФакторам.Регистратор КАК Регистратор,
		|	ОсмотрыПоВреднымФакторам.РезультатОсмотра КАК РезультатОсмотра,
		|	ВЫБОР
		|		КОГДА ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор ЕСТЬ НЕ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяРабочимМестом
		|ПОМЕСТИТЬ ВТСостояниеОсмотров
		|ИЗ
		|	ВТОсмотрыПоВреднымФакторам КАК ОсмотрыПоВреднымФакторам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|		ПО ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор = ОсмотрыПоВреднымФакторам.ВредныйФактор
		|		И ВЫБОР
		|			КОГДА &ЕстьВидОсмотра
		|				ТОГДА ВредныеФакторыИВидыРаботРабочегоМеста.ВидОсмотра = &ВидОсмотра
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	ВТВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторам КАК ОсмотрыПоВреднымФакторам
		|		ПО ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор = ОсмотрыПоВреднымФакторам.ВредныйФактор
		|ГДЕ
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор ЕСТЬ NULL";
	Запрос.Выполнить();
	
	СоздатьВТПериодичностьВредныхФакторов(МенеджерВременныхТаблиц, "ВТСостояниеОсмотров");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОсмотров.ВредныйФактор КАК ВредныйФактор,
		|	СостояниеОсмотров.ПоследнийОсмотр КАК ПоследнийОсмотр,
		|	СостояниеОсмотров.Регистратор КАК Регистратор,
		|	СостояниеОсмотров.РезультатОсмотра КАК Результат,
		|	СостояниеОсмотров.ТребуетсяРабочимМестом КАК Требуется,
		|	ПериодичностьВредныхФакторов.Кратность КАК Кратность,
		|	ПериодичностьВредныхФакторов.Периодичность КАК Периодичность,
		|	ПериодичностьВредныхФакторов.ЕдиницаПериодичности КАК ЕдиницаПериодичности,
		|	ПериодичностьВредныхФакторов.Однократно КАК Однократно
		|ИЗ
		|	ВТСостояниеОсмотров КАК СостояниеОсмотров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодичностьВредныхФакторов КАК ПериодичностьВредныхФакторов
		|		ПО (ПериодичностьВредныхФакторов.ВредныйФактор = СостояниеОсмотров.ВредныйФактор)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуТаблицыОсмотровПоФакторам(ОсмотрыПоФакторам, Выборка);
	КонецЦикла;
	
	Возврат ОсмотрыПоФакторам;
	
КонецФункции

Функция ОсмотрыПоВреднымФакторамФизическогоЛица(ФизическоеЛицо, РабочееМесто, ДатаАктуальности = Неопределено) Экспорт
	
	ВидОсмотра = Неопределено;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования") Тогда
		ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	КонецЕсли;
	
	ОсмотрыПоФакторам = Новый ТаблицаЗначений;
	ОсмотрыПоФакторам.Колонки.Добавить("ВредныйФактор", Новый ОписаниеТипов("СправочникСсылка.ВредныеОпасныеПроизводственныеФакторы"));
	ОсмотрыПоФакторам.Колонки.Добавить("Периодичность", Новый ОписаниеТипов("Структура"));
	ОсмотрыПоФакторам.Колонки.Добавить("ПоследнийОсмотр", Новый ОписаниеТипов("Дата"));
	ОсмотрыПоФакторам.Колонки.Добавить("СледующийОсмотр", Новый ОписаниеТипов("Дата"));
	ОсмотрыПоФакторам.Колонки.Добавить("Результат", Новый ОписаниеТипов("ПеречислениеСсылка.РезультатыМедицинскогоОсмотра"));
	ОсмотрыПоФакторам.Колонки.Добавить("СостояниеПроцент", Новый ОписаниеТипов("Число"));
	ОсмотрыПоФакторам.Колонки.Добавить("Требуется", Новый ОписаниеТипов("Булево"));
	ОсмотрыПоФакторам.Колонки.Добавить("Регистратор");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВредныеФакторыРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра);
	СоздатьВТОсмотрыПоВреднымФакторамФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо, ДатаАктуальности);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ЕстьВидОсмотра", Не ВидОсмотра = Неопределено);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор КАК ВредныйФактор,
		|	ОсмотрыПоВреднымФакторам.ДатаОсмотра КАК ПоследнийОсмотр,
		|	ОсмотрыПоВреднымФакторам.Регистратор КАК Регистратор,
		|	ОсмотрыПоВреднымФакторам.РезультатОсмотра КАК РезультатОсмотра,
		|	ВЫБОР
		|		КОГДА ВредныеФакторыРабочегоМеста.ВредныйФактор ЕСТЬ НЕ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяРабочимМестом
		|ПОМЕСТИТЬ ВТСостояниеОсмотров
		|ИЗ
		|	ВТОсмотрыПоВреднымФакторам КАК ОсмотрыПоВреднымФакторам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ПО ВредныеФакторыРабочегоМеста.ВредныйФактор = ОсмотрыПоВреднымФакторам.ВредныйФактор
		|		И ВЫБОР
		|			КОГДА &ЕстьВидОсмотра
		|				ТОГДА ВредныеФакторыРабочегоМеста.ВидОсмотра = &ВидОсмотра
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	ВТВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторам КАК ОсмотрыПоВреднымФакторам
		|		ПО ВредныеФакторыРабочегоМеста.ВредныйФактор = ОсмотрыПоВреднымФакторам.ВредныйФактор
		|ГДЕ
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор ЕСТЬ NULL";
	Запрос.Выполнить();
	
	СоздатьВТПериодичностьВредныхФакторов(МенеджерВременныхТаблиц, "ВТСостояниеОсмотров");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОсмотров.ВредныйФактор КАК ВредныйФактор,
		|	СостояниеОсмотров.ПоследнийОсмотр КАК ПоследнийОсмотр,
		|	СостояниеОсмотров.Регистратор КАК Регистратор,
		|	СостояниеОсмотров.РезультатОсмотра КАК Результат,
		|	СостояниеОсмотров.ТребуетсяРабочимМестом КАК Требуется,
		|	ПериодичностьВредныхФакторов.Кратность КАК Кратность,
		|	ПериодичностьВредныхФакторов.Периодичность КАК Периодичность,
		|	ПериодичностьВредныхФакторов.ЕдиницаПериодичности КАК ЕдиницаПериодичности,
		|	ПериодичностьВредныхФакторов.Однократно КАК Однократно
		|ИЗ
		|	ВТСостояниеОсмотров КАК СостояниеОсмотров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодичностьВредныхФакторов КАК ПериодичностьВредныхФакторов
		|		ПО (ПериодичностьВредныхФакторов.ВредныйФактор = СостояниеОсмотров.ВредныйФактор)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуТаблицыОсмотровПоФакторам(ОсмотрыПоФакторам, Выборка);
	КонецЦикла;
	
	Возврат ОсмотрыПоФакторам;
	
КонецФункции

Функция ОсмотрыПоВидамРаботФизическогоЛица(ФизическоеЛицо, РабочееМесто, ДатаАктуальности = Неопределено) Экспорт
	
	ВидОсмотра = Неопределено;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования") Тогда
		ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	КонецЕсли;
	
	ОсмотрыПоВидамРабот = Новый ТаблицаЗначений;
	ОсмотрыПоВидамРабот.Колонки.Добавить("ВидРабот", Новый ОписаниеТипов("СправочникСсылка.ВидыРаботМедицинскихОсмотров"));
	ОсмотрыПоВидамРабот.Колонки.Добавить("Периодичность", Новый ОписаниеТипов("Структура"));
	ОсмотрыПоВидамРабот.Колонки.Добавить("ПоследнийОсмотр", Новый ОписаниеТипов("Дата"));
	ОсмотрыПоВидамРабот.Колонки.Добавить("СледующийОсмотр", Новый ОписаниеТипов("Дата"));
	ОсмотрыПоВидамРабот.Колонки.Добавить("Результат", Новый ОписаниеТипов("ПеречислениеСсылка.РезультатыМедицинскогоОсмотра"));
	ОсмотрыПоВидамРабот.Колонки.Добавить("СостояниеПроцент", Новый ОписаниеТипов("Число"));
	ОсмотрыПоВидамРабот.Колонки.Добавить("Требуется", Новый ОписаниеТипов("Булево"));
	ОсмотрыПоВидамРабот.Колонки.Добавить("Регистратор");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВидыРаботРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра);
	СоздатьВТОсмотрыПоВидамРаботФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо, ДатаАктуальности);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ЕстьВидОсмотра", Не ВидОсмотра = Неопределено);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоВидамРабот.ВидРабот КАК ВидРабот,
		|	ОсмотрыПоВидамРабот.ДатаОсмотра КАК ПоследнийОсмотр,
		|	ОсмотрыПоВидамРабот.Регистратор КАК Регистратор,
		|	ОсмотрыПоВидамРабот.РезультатОсмотра КАК РезультатОсмотра,
		|	ВЫБОР
		|		КОГДА ВидыРаботПозиции.ВидРабот ЕСТЬ НЕ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяРабочимМестом
		|ПОМЕСТИТЬ ВТСостояниеОсмотров
		|ИЗ
		|	ВТОсмотрыПоВидамРабот КАК ОсмотрыПоВидамРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыРаботПозиции КАК ВидыРаботПозиции
		|		ПО ВидыРаботПозиции.ВидРабот = ОсмотрыПоВидамРабот.ВидРабот
		|		И ВЫБОР
		|			КОГДА &ЕстьВидОсмотра
		|				ТОГДА ВидыРаботПозиции.ВидОсмотра = &ВидОсмотра
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыРаботПозиции.ВидРабот,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	ВТВидыРаботПозиции КАК ВидыРаботПозиции
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВидамРабот КАК ОсмотрыПоВидамРабот
		|		ПО ВидыРаботПозиции.ВидРабот = ОсмотрыПоВидамРабот.ВидРабот
		|ГДЕ
		|	ОсмотрыПоВидамРабот.ВидРабот ЕСТЬ NULL";
	Запрос.Выполнить();
	
	СоздатьВТПериодичностьВидовРабот(МенеджерВременныхТаблиц, "ВТСостояниеОсмотров");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеОсмотров.ВидРабот КАК ВидРабот,
		|	СостояниеОсмотров.ПоследнийОсмотр КАК ПоследнийОсмотр,
		|	СостояниеОсмотров.Регистратор КАК Регистратор,
		|	СостояниеОсмотров.РезультатОсмотра КАК Результат,
		|	СостояниеОсмотров.ТребуетсяРабочимМестом КАК Требуется,
		|	ПериодичностьВидовРабот.Кратность КАК Кратность,
		|	ПериодичностьВидовРабот.Периодичность КАК Периодичность,
		|	ПериодичностьВидовРабот.ЕдиницаПериодичности КАК ЕдиницаПериодичности
		|ИЗ
		|	ВТСостояниеОсмотров КАК СостояниеОсмотров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодичностьВидовРабот КАК ПериодичностьВидовРабот
		|		ПО (ПериодичностьВидовРабот.ВидРабот = СостояниеОсмотров.ВидРабот)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДобавитьСтрокуТаблицыОсмотровПоФакторам(ОсмотрыПоВидамРабот, Выборка);
	КонецЦикла;
	
	Возврат ОсмотрыПоВидамРабот;
	
КонецФункции

Процедура ЗаполнитьРабочееМесто(РабочееМесто, КадровыеДанные) Экспорт
	
	Если Не ОхранаТруда.ОхранаТрудаИспользуется() Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КадровыеДанные[0].РабочееМестоОхраныТруда) Тогда
		РабочееМесто = КадровыеДанные[0].РабочееМестоОхраныТруда;
	КонецЕсли;
	
КонецПроцедуры

// Выполняется при изменении состава вредных факторов или видов работ для рабочего места или при изменении периодичности
// одного из них.
//
Процедура ОбновитьПериодичностьОсмотровРабочихМест(РабочиеМеста, ВидОсмотра) Экспорт
	
	ЭтоПсихиатрическийОсмотр = ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста);
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ЭтоПсихиатрическийОсмотр", ЭтоПсихиатрическийОсмотр);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникРабочиеМеста.Ссылка КАК РабочееМесто,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|				ГДЕ
		|					ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто = СправочникРабочиеМеста.Ссылка
		|					И ВредныеФакторыИВидыРаботРабочегоМеста.ВидОсмотра = &ВидОсмотра)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВредныеФакторыИВидыРабот,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|				ГДЕ
		|					ВредныеФакторыРабочегоМеста.РабочееМесто = СправочникРабочиеМеста.Ссылка
		|					И ВредныеФакторыРабочегоМеста.ВидОсмотра = &ВидОсмотра
		|					И НЕ ВредныеФакторыРабочегоМеста.ВредныйФактор.СоответствиеПодтверждено)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВредныеФакторы,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботРабочегоМеста
		|				ГДЕ
		|					ВидыРаботРабочегоМеста.РабочееМесто = СправочникРабочиеМеста.Ссылка
		|					И ВидыРаботРабочегоМеста.ВидОсмотра = &ВидОсмотра
		|					И НЕ ВидыРаботРабочегоМеста.ВидРабот.СоответствиеПодтверждено)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВидыРабот
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК СправочникРабочиеМеста
		|ГДЕ
		|	СправочникРабочиеМеста.Ссылка В(&РабочиеМеста)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыРабочегоМеста.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторы.КратностьОсмотра КАК Кратность,
		|	ВредныеФакторы.ПериодичностьОсмотра КАК Периодичность,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичности,
		|	ВредныеФакторы.Однократно КАК Однократно,
		|	ВЫБОР
		|		КОГДА &ЭтоПсихиатрическийОсмотр
		|			ТОГДА """"
		|		ИНАЧЕ ВредныеФакторы.Код
		|	КОНЕЦ КАК ВредныйФакторКод,
		|	ВредныеФакторы.Наименование КАК ВредныйФакторНаименование,
		|	NULL КАК ВидРаботКод,
		|	NULL КАК ВидРаботНаименование
		|ИЗ
		|	РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеФакторы
		|		ПО ВредныеФакторыРабочегоМеста.ВредныйФактор = ВредныеФакторы.Ссылка
		|			И (ВредныеФакторыРабочегоМеста.РабочееМесто В (&РабочиеМеста))
		|			И (ВредныеФакторыРабочегоМеста.ВидОсмотра = &ВидОсмотра)
		|			И (НЕ ВредныеФакторы.СоответствиеПодтверждено)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыРаботРабочегоМеста.РабочееМесто,
		|	ВидыРабот.КратностьОсмотра,
		|	ВидыРабот.ПериодичностьОсмотра,
		|	ВидыРабот.ЕдиницаПериодичностиОсмотра,
		|	ВидыРабот.Однократно,
		|	NULL,
		|	NULL,
		|	ВЫБОР
		|		КОГДА &ЭтоПсихиатрическийОсмотр
		|			ТОГДА """"
		|		ИНАЧЕ ВидыРабот.Код
		|	КОНЕЦ,
		|	ВидыРабот.Наименование
		|ИЗ
		|	РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботРабочегоМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРабот
		|		ПО ВидыРаботРабочегоМеста.ВидРабот = ВидыРабот.Ссылка
		|			И (ВидыРаботРабочегоМеста.РабочееМесто В (&РабочиеМеста))
		|			И (ВидыРаботРабочегоМеста.ВидОсмотра = &ВидОсмотра)
		|			И (НЕ ВидыРабот.СоответствиеПодтверждено)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто,
		|	ВредныеФакторы.КратностьОсмотра,
		|	ВредныеФакторы.ПериодичностьОсмотра,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра,
		|	ВредныеФакторы.Однократно,
		|	ВредныеФакторы.Код,
		|	ВредныеФакторы.Наименование,
		|	NULL,
		|	NULL
		|ИЗ
		|	РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеФакторы
		|		ПО ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор = ВредныеФакторы.Ссылка
		|			И (ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто В (&РабочиеМеста))
		|			И (ВредныеФакторыИВидыРаботРабочегоМеста.ВидОсмотра = &ВидОсмотра)
		|
		|УПОРЯДОЧИТЬ ПО
		|	РабочееМесто";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРабочихМест = РезультатыЗапроса[0].Выбрать();
	ВыборкаФакторов = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаРабочихМест.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РабочееМесто.Установить(ВыборкаРабочихМест.РабочееМесто);
		НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидОсмотра);
		Если Не ВыборкаРабочихМест.ЕстьВредныеФакторы И Не ВыборкаРабочихМест.ЕстьВидыРабот И Не ВыборкаРабочихМест.ЕстьВредныеФакторыИВидыРабот Тогда
			НаборЗаписей.Записать();
			Продолжить;
		КонецЕсли;
		ПредставленияФакторов = ПредставленияФакторов();
		ОписанияПериодичности = Новый Массив;
		ВыборкаФакторов.СледующийПоЗначениюПоля("РабочееМесто");
		Пока ВыборкаФакторов.Следующий() Цикл
			Описание = ОписаниеПериодичностиОсмотров();
			ЗаполнитьЗначенияСвойств(Описание, ВыборкаФакторов);
			ОписанияПериодичности.Добавить(Описание);
			ДополнитьПредставленияФакторов(ПредставленияФакторов, ВыборкаФакторов, ЭтоПсихиатрическийОсмотр);
		КонецЦикла;
		МинимальнаяПериодичность = МинимальнаяПериодичность(ОписанияПериодичности);
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ПредставленияФакторов);
		СтрокаНабора.РабочееМесто = ВыборкаРабочихМест.РабочееМесто;
		СтрокаНабора.ВидОсмотра = ВидОсмотра;
		СтрокаНабора.Однократно = МинимальнаяПериодичность.Однократно;
		СтрокаНабора.КратностьОсмотра = МинимальнаяПериодичность.Кратность;
		СтрокаНабора.ПериодичностьОсмотра = МинимальнаяПериодичность.Периодичность;
		СтрокаНабора.ЕдиницаПериодичностиОсмотра = МинимальнаяПериодичность.ЕдиницаПериодичности;
		СтрокаНабора.ПредставлениеПериодичностиОсмотра = МинимальнаяПериодичность.Представление;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапуститьОбновлениеПериодическихОсмотров(Организация = Неопределено, ФизическиеЛица = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры") Тогда 
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Массив;
	Параметры.Добавить(Организация);
	Параметры.Добавить(ФизическиеЛица);
	
	ФоновыеЗадания.Выполнить("МедицинскиеОсмотры.ОбновитьПериодическиеОсмотры", Параметры);
	
КонецПроцедуры

Функция МинимальнаяПериодичностьОсмотров(ВредныеФакторыВидыРабот) Экспорт
	
	ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ВредныеФакторыВидыРабот);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеФакторы.КратностьОсмотра КАК Кратность,
		|	ВредныеФакторы.ПериодичностьОсмотра КАК Периодичность,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичности,
		|	ВредныеФакторы.Однократно КАК Однократно
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеФакторы
		|ГДЕ
		|	ВредныеФакторы.Ссылка В (&Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВидыРабот.КратностьОсмотра,
		|	ВидыРабот.ПериодичностьОсмотра,
		|	ВидыРабот.ЕдиницаПериодичностиОсмотра,
		|	ВидыРабот.Однократно
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРабот
		|ГДЕ
		|	ВидыРабот.Ссылка В (&Ссылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.КратностьОсмотра,
		|	ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ПериодичностьОсмотра,
		|	ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ЕдиницаПериодичностиОсмотра,
		|	ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Однократно
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы
		|ГДЕ
		|	ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Ссылка В (&Ссылка)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ОписаниеПериодичности;
	КонецЕсли;
	
	МаксимальныйКоэффициент = 0;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Однократно Тогда
			ОписаниеПериодичности.Однократно = Истина;
			Продолжить;
		КонецЕсли;
		Коэффициент = Выборка.Кратность * ЧастейВГоду(Выборка.ЕдиницаПериодичности) / Выборка.Периодичность;
		Если Коэффициент > МаксимальныйКоэффициент Тогда
			ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Выборка);
			МаксимальныйКоэффициент = Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьПредставлениеПериодичности(ОписаниеПериодичности);
	
	Возврат ОписаниеПериодичности;
	
КонецФункции

Функция ПериодичностьОсмотровПоВреднымФакторам(ВредныеФакторы) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВредныеФакторы, "ПредставлениеПериодичностиОсмотра");
КонецФункции

Процедура ОбновитьВредныеФакторыРабочихМест(ИсточникСсылка = Неопределено, РабочиеМеста = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ИсточникСсылка);
	Запрос.УстановитьПараметр("ЕстьОтборРабочихМест", РабочиеМеста <> Неопределено);
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто,
	|	ЕСТЬNULL(РабочиеМестаПоРезультату.Ссылка, НЕОПРЕДЕЛЕНО) КАК Документ,
	|	ВредныеФакторыПоРезультату.ВредныйФактор КАК ВредныйФактор,
	|	ВредныеФакторыПоРезультату.ВредныйФактор.ВидОсмотра КАК ВидОсмотра,
	|	НЕ ВредныеФакторыПоРезультату.ВредныйФактор ЕСТЬ NULL КАК ЕстьФакторы
	|ПОМЕСТИТЬ ВТВсеРабочиеМеста
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РабочиеМестаПоРезультату
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
	|			ПО РабочиеМестаПоРезультату.Ссылка = РезультатыСпецоценкиУсловийТруда.Ссылка
	|				И (РезультатыСпецоценкиУсловийТруда.Проведен)
	|				И (РезультатыСпецоценкиУсловийТруда.Ссылка <> &Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.ВредныеФакторы КАК ВредныеФакторыПоРезультату
	|			ПО РабочиеМестаПоРезультату.Ссылка = ВредныеФакторыПоРезультату.Ссылка
	|				И РабочиеМестаПоРезультату.ИдентификаторСтрокиРабочегоМеста = ВредныеФакторыПоРезультату.ИдентификаторСтрокиРабочегоМеста
	|		ПО РабочиеМестаОхраныТруда.Ссылка = РабочиеМестаПоРезультату.РабочееМесто
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьОтборРабочихМест
	|				ТОГДА РабочиеМестаОхраныТруда.Ссылка В (&РабочиеМеста)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеМестаОхраныТруда.Ссылка,
	|	ЕСТЬNULL(АналогичныеМестаПоРезультату.Ссылка, НЕОПРЕДЕЛЕНО),
	|	ВредныеФакторыПоРезультату.ВредныйФактор,
	|	ВредныеФакторыПоРезультату.ВредныйФактор.ВидОсмотра,
	|	НЕ ВредныеФакторыПоРезультату.ВредныйФактор ЕСТЬ NULL
	|ИЗ
	|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК АналогичныеМестаПоРезультату
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
	|			ПО АналогичныеМестаПоРезультату.Ссылка = РезультатыСпецоценкиУсловийТруда.Ссылка
	|				И (РезультатыСпецоценкиУсловийТруда.Проведен)
	|				И (РезультатыСпецоценкиУсловийТруда.Ссылка <> &Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.ВредныеФакторы КАК ВредныеФакторыПоРезультату
	|			ПО АналогичныеМестаПоРезультату.Ссылка = ВредныеФакторыПоРезультату.Ссылка
	|				И АналогичныеМестаПоРезультату.ИдентификаторСтрокиРабочегоМеста = ВредныеФакторыПоРезультату.ИдентификаторСтрокиРабочегоМеста
	|		ПО РабочиеМестаОхраныТруда.Ссылка = АналогичныеМестаПоРезультату.АналогичноеМесто
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ЕстьОтборРабочихМест
	|				ТОГДА РабочиеМестаОхраныТруда.Ссылка В (&РабочиеМеста)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ РабочиеМестаОхраныТруда.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	МАКСИМУМ(ВсеРабочиеМеста.Документ) КАК Документ
	|ПОМЕСТИТЬ ВТМаксимальныеРабочиеМеста
	|ИЗ
	|	ВТВсеРабочиеМеста КАК ВсеРабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеРабочиеМеста.РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	МАКСИМУМ(ВсеРабочиеМеста.ЕстьФакторы) КАК ЕстьФакторы
	|ИЗ
	|	ВТМаксимальныеРабочиеМеста КАК МаксимальныеРабочиеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсеРабочиеМеста КАК ВсеРабочиеМеста
	|		ПО МаксимальныеРабочиеМеста.РабочееМесто = ВсеРабочиеМеста.РабочееМесто
	|			И МаксимальныеРабочиеМеста.Документ = ВсеРабочиеМеста.Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеРабочиеМеста.РабочееМесто
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеРабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	ВсеРабочиеМеста.ВредныйФактор КАК ВредныйФактор,
	|	ВсеРабочиеМеста.ВидОсмотра КАК ВидОсмотра,
	|	ВсеРабочиеМеста.Документ КАК Документ,
	|	ВсеРабочиеМеста.ЕстьФакторы КАК ЕстьФакторы
	|ИЗ
	|	ВТМаксимальныеРабочиеМеста КАК МаксимальныеРабочиеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсеРабочиеМеста КАК ВсеРабочиеМеста
	|		ПО МаксимальныеРабочиеМеста.РабочееМесто = ВсеРабочиеМеста.РабочееМесто
	|			И МаксимальныеРабочиеМеста.Документ = ВсеРабочиеМеста.Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочееМесто";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРабочихМест = РезультатыЗапроса[2].Выбрать();
	ВыборкаФакторов = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаРабочихМест.Следующий() Цикл
		ВыборкаФакторов.СледующийПоЗначениюПоля("РабочееМесто");
		ПоРезультатуСпецоценки = Истина;
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста");
		ЭлементБлокировкиДанных.УстановитьЗначение("РабочееМесто", ВыборкаРабочихМест.РабочееМесто);
		
		НаборЗаписей = РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РабочееМесто.Установить(ВыборкаРабочихМест.РабочееМесто);
		
		НачатьТранзакцию();
		Попытка
			БлокировкаДанных.Заблокировать();
			НаборЗаписей.Прочитать();
			Для Каждого НайденнаяСтрока Из НаборЗаписей Цикл
				Если Не ЗначениеЗаполнено(НайденнаяСтрока.Основание) Тогда
					ПоРезультатуСпецоценки = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ВыборкаРабочихМест.ЕстьФакторы Тогда
				Если ПоРезультатуСпецоценки Тогда
					НаборЗаписей.Очистить();
					НаборЗаписей.Записать();
				КонецЕсли;
			Иначе
				НаборЗаписей.Очистить();
				Пока ВыборкаФакторов.Следующий() Цикл
					НоваяСтрока = НаборЗаписей.Добавить();
					НоваяСтрока.РабочееМесто = ВыборкаРабочихМест.РабочееМесто;
					НоваяСтрока.ВредныйФактор = ВыборкаФакторов.ВредныйФактор;
					НоваяСтрока.ВидОсмотра = ВыборкаФакторов.ВидОсмотра;
					НоваяСтрока.Основание = ВыборкаФакторов.Документ;
				КонецЦикла;
				НаборЗаписей.Записать();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ПредставлениеОбработки = НСтр("ru = 'Обновление вредных факторов рабочих мест по результатам спецоценки'"); 
			ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция МедицинскиеОсмотрыФизическихЛиц(ФизическиеЛица) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПериодическиеМедицинскиеОсмотры.ВидОсмотра КАК ВидОсмотра,
	|	ПериодическиеМедицинскиеОсмотры.ДатаПройденногоОсмотра КАК ДатаПройденногоОсмотра,
	|	ПериодическиеМедицинскиеОсмотры.РезультатОсмотра КАК РезультатОсмотра,
	|	ПериодическиеМедицинскиеОсмотры.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ПериодическиеМедицинскиеОсмотры КАК ПериодическиеМедицинскиеОсмотры
	|ГДЕ
	|	ПериодическиеМедицинскиеОсмотры.ФизическоеЛицо В (&ФизическиеЛица)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область ПодключениеСобытийОбновленияПериодическихОсмотров

Процедура ЗарегистрироватьИзменениеРабочихМестДляМедосмотровПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуОбновленияРабочихМестДляМедосмотров(Источник);
	
	ЗарегистрироватьОбновлениеПериодическихОсмотров(Источник.ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОсмотров);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеКадровойИсторииДляМедосмотровПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ТипРегистратора = ТипЗнч(Источник.Отбор.Регистратор.Значение);
	Если Не (ТипРегистратора = Тип("ДокументСсылка.Увольнение") Или ТипРегистратора = Тип("ДокументСсылка.УвольнениеСписком")
		Или ТипРегистратора = Тип("ДокументСсылка.ПрекращениеПодработки")) Тогда
		
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуОбновленияКадровойИсторииДляМедосмотров(Источник);
	
	ЗарегистрироватьОбновлениеПериодическихОсмотров(Источник.ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОсмотров);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеФизическогоЛицаДляМедосмотровПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновленияПериодическихОсмотров = НоваяТаблицаОбновлениеПериодическихОсмотров();
	
	ЗаполнитьТаблицуОбновленияПериодическихОсмотровПоФизическомуЛицу(ТаблицаОбновленияПериодическихОсмотров, Источник);
	
	ЗарегистрироватьОбновлениеПериодическихОсмотров(ТаблицаОбновленияПериодическихОсмотров);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПериодическихОсмотровПоФизическимЛицам(ТаблицаОбновлениеПериодическихОсмотров, ФизическиеЛица) Экспорт

	Если ФизическиеЛица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	ОтборыМассив = Новый Массив;
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ОтборыМассив, "ФизическоеЛицо", "В", ФизическиеЛица);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ОтборыМассив, "ОформленПоТрудовомуДоговору", "=", Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ОтборыМассив, "ДатаУвольнения", "<", ТекущаяДатаСеанса());
	КадровыйУчет.СоздатьВТТекущиеКадровыеДанныеСотрудников(МенеджерВТ, Ложь, ОтборыМассив, "ГоловнаяОрганизация");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадровыеДанные.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	ВТТекущиеКадровыеДанныеСотрудников КАК КадровыеДанные";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОбновлениеПериодическихОсмотров.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеВводаНаОсновании

Процедура ЗаполнитьКадровыйПереводПоЗаключениюМедицинскогоОсмотра(ДокументОбъект, Основание) Экспорт
	ЗаполнитьДокументОтстраненияПоЗаключениюМедицинскогоОсмотра(ДокументОбъект, Основание);	
КонецПроцедуры

Процедура ЗаполнитьУвольнениеПоЗаключениюМедицинскогоОсмотра(ДокументОбъект, Основание) Экспорт
	ЗаполнитьДокументОтстраненияПоЗаключениюМедицинскогоОсмотра(ДокументОбъект, Основание);
КонецПроцедуры

Процедура ПриЗаписиДокументаОтстранения(ДокументОбъект) Экспорт
	
	Если Не ДокументОбъект.ДополнительныеСвойства.Свойство("Основание") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра.СоздатьНаборЗаписей();
	
	СтрокаНабора = НаборЗаписей.Добавить();
	СтрокаНабора.ДокументОтстранения = ДокументОбъект.Ссылка;
	СтрокаНабора.ЗаключениеМедицинскогоОсмотра = ДокументОбъект.ДополнительныеСвойства["Основание"];
	СтрокаНабора.Организация = ДокументОбъект.Организация;
	СтрокаНабора.ФизическоеЛицо = ДокументОбъект.ФизическоеЛицо;
	
	НаборЗаписей.Отбор.ДокументОтстранения.Установить(ДокументОбъект.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьОплатуПоСреднемуПоНаправлениюНаМедицинскийОсмотр(ДокументОбъект, Основание) Экспорт
	
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.НаправлениеНаМедицинскийОсмотр") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНаправления = Документы.НаправлениеНаМедицинскийОсмотр.ДанныеНаправления(Основание);
	Если ДанныеНаправления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеНаправления.Проведен Тогда
		ТекстСообщения = НСтр("ru = 'Документ направления на медицинский осмотр не проведен'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Сотрудник = СотрудникПоФизическомуЛицу(
		ДанныеНаправления.ФизическоеЛицо, 
		ДанныеНаправления.РабочееМесто,
		ДанныеНаправления.Организация);
		
	ДокументОбъект["ДатаНачала"] = ДанныеНаправления.ДатаОсмотра;
	ДокументОбъект["ДатаОкончания"] = ДанныеНаправления.ДатаОсмотра;
	ДокументОбъект.Заполнить(Сотрудник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторы.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ВидыРаботМедицинскихОсмотров.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.7.52";
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторы.НачальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f5a8af6b-77e8-40f1-8834-cb24ee43fb44");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение классификатора вредных (опасных) производственных факторов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.7.52";
	Обработчик.Процедура = "Справочники.ВидыРаботМедицинскихОсмотров.НачальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("767e0487-b9de-4bf2-b9a8-4b130c822eb5");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение классификатора видов работ, при выполнении которых требуется обязательное прохождение медицинских осмотров.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.59";
	Обработчик.Процедура = "МедицинскиеОсмотры.ОбновитьПериодическиеОсмотрыУволенныхСотрудников";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("dbb42dcc-fbe8-4be1-82c6-f81b507b57b2");
	Обработчик.Комментарий = НСтр("ru = 'Обновление периодических медицинских осмотров для уволенных сотрудников.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.47";
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторы.ЗаполнитьВидОсмотраМедицинскогоПеречня";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa63-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита «Вид осмотра» элементов классификатора вредных(опасных) производственных факторов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.47";
	Обработчик.Процедура = "Справочники.ВидыРаботМедицинскихОсмотров.ЗаполнитьВидОсмотраМедицинскогоПеречня";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa64-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита «Вид осмотра» элементов классификатора видов работ медицинских осмотров.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.48";
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторы.СоздатьЭлементыПсихиатрическогоПеречня";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa65-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Дополнение классификатора вредных (опасных) производственных факторов психиатрическим перечнем.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.48";
	Обработчик.Процедура = "Справочники.ВидыРаботМедицинскихОсмотров.СоздатьЭлементыПсихиатрическогоПеречня";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa66-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Дополнение классификатора видов работ медицинских осмотров психиатрическим перечнем.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.48";
	Обработчик.Процедура = "МедицинскиеОсмотры.ЗаполнитьРабочиеМестаВОбъектахПодсистемыМедосмотры";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa67-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение объектов подсистемы «Медосмотры» рабочими местами'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.50";
	Обработчик.Процедура = "МедицинскиеОсмотры.ОбновитьПериодическиеОсмотрыНазначенныхРабочихМест";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0133fa68-3084-11eb-a40e-4cedfb9508b6");
	Обработчик.Комментарий = НСтр("ru = 'Обновление периодических медицинских осмотров для назначенных рабочих мест сотрудников.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.129";
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.НачальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d93a7384-7cce-11eb-82af-f09a943f852e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение классификатора вредных (опасных) производственных факторов по приказу № 29н.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.130";
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ЗаполнениеСоответствий";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d93a7385-7cce-11eb-82af-f09a943f852e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение соответствия классификаторов по приказам № 302н и № 29н.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.131";
	Обработчик.Процедура = "МедицинскиеОсмотры.ЗаполнитьРабочиеМестаНовымиВреднымиФакторами";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d93a7386-7cce-11eb-82af-f09a943f852e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение рабочих мест вредными факторами по приказу № 29н.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.18.2";
	Обработчик.Процедура = "РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.УдалитьЛишниеЗаписиДляНепроведенныхЗаключений";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d923f9eb-93c6-11eb-82ce-e744245b8b09");
	Обработчик.Комментарий = НСтр("ru = 'Удаление лишних записей медосмотров по вредным факторам, ошибочно созданных для непроведенных заключений.'");	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.18.8";
	Обработчик.Процедура = "РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.ПриОбновленииИБЗаполнитьИзмерениеРабочееМесто";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f5b58841-9eba-11eb-82df-d08b79cf51cb");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение измерения Рабочее место в регистре сведений медосмотров по вредным факторам.'");	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.18.8";
	Обработчик.Процедура = "МедицинскиеОсмотры.ЗаполнитьНаправленияЗаключенияНовымиВреднымиФакторами";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d93a7387-7cce-11eb-82af-f09a943f852e");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение направлений на медосмотр и заключений вредными факторами по приказу № 29н.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.18.10";
	Обработчик.Процедура = "РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест.ПриОбновленииИБОбновитьПериодичностьОсмотровРабочихМест";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b6d531d5-a290-11eb-82e4-ee5987012024");
	Обработчик.Комментарий = НСтр("ru = 'Обновление периодичности медицинских осмотров рабочих мест.'");	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.12";
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.СоздатьЭлементыПсихиатрическогоПеречня";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3aba9563-2539-11ed-84d4-d81f28eb49c9");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение классификатора видов деятельности по приказу № 342н.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.204";
	Обработчик.Процедура = "Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ЗаполнитьАрхивностьЭлементовПсихиатрическогоПеречня";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3ee46e41-dfdb-4ed9-b242-5dba855d9ad9");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение архивности вредных факторов и видов работ положения № 695.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.205";
	Обработчик.Процедура = "МедицинскиеОсмотры.ЗаполнитьОрганизацииРабочихМест";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e507e9cf-6a43-11ed-852c-8cacda5986b3");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение организации в регистрах сведений с вредными факторами и видами работ рабочих мест.'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.РабочиеМестаСотрудников
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.РабочиеМестаСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеПериодическихМедицинскихОсмотров;
	
	// Метаданные.Справочники.ФизическиеЛица
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.Справочники.ФизическиеЛица;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеПериодическихМедицинскихОсмотров;
	
	// Метаданные.РегистрыСведений.МедицинскиеОсмотры
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.МедицинскиеОсмотры;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеПериодическихМедицинскихОсмотров;
	
	// Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеПериодическихМедицинскихОсмотров;
	
КонецПроцедуры

Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры") Тогда
		Возврат;
	КонецЕсли;
	
	// После создания нового узла нужно полностью заполнить вторичные данные, 
	// т.к. они не включаются в состав начального образа.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	НЕ ФизическиеЛица.Ссылка В (&Обработанные)";
	
	Обработанные = Новый Массив;
	Пока Истина Цикл
		Запрос.УстановитьПараметр("Обработанные", Обработанные);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		ФизическиеЛица = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
		ТаблицаОбновления = НоваяТаблицаОбновлениеПериодическихОсмотров();
		ЗаполнитьТаблицуОбновленияПериодическихОсмотровПоФизическимЛицам(ТаблицаОбновления, ФизическиеЛица);
		ЗарегистрироватьОбновлениеПериодическихОсмотров(ТаблицаОбновления);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, ФизическиеЛица);
	КонецЦикла;
	
	ЗапуститьОбновлениеПериодическихОсмотров();
	
КонецПроцедуры

#КонецОбласти

#Область ОснованияДляОбновленияПериодическихОсмотров

Процедура ЗаполнитьТаблицуОбновленияРабочихМестДляМедосмотров(Источник) Экспорт
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеПериодическихОсмотров();
	
	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора();
	
	Если ИзменившиесяДанные <> Неопределено Тогда
		// Анализируем изменения того, что влияет на осмотры: рабочие места, даты.
		Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
			Если СтрокаТаблицы["Добавление"] = Истина Или СтрокаТаблицы["Удаление"] = Истина Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), СтрокаТаблицы);
			Иначе
				Если СтрокаТаблицы["ИзменилсяРесурсРабочееМесто"] = Истина Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), СтрокаТаблицы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновлениеПериодическихОсмотров", ТаблицаОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияКадровойИсторииДляМедосмотров(Источник) Экспорт
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеПериодическихОсмотров();
	
	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора();
	
	Если ИзменившиесяДанные <> Неопределено Тогда
		// Анализируем изменения того, что влияет на осмотры: позиции, даты.
		Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
			Если СтрокаТаблицы["Добавление"] = Истина Или СтрокаТаблицы["Удаление"] = Истина Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), СтрокаТаблицы);
			Иначе
				Если СтрокаТаблицы["ИзменилсяРесурсДолжностьПоШтатномуРасписанию"] = Истина Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), СтрокаТаблицы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновлениеПериодическихОсмотров", ТаблицаОбновления);
	
КонецПроцедуры

#КонецОбласти

#Область РазделыДанных

// Добавляет разделы в таблицу разделов данных.
// 
// Параметры:
//  РазделыДанных - ТаблицаЗначений - см. СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.ТаблицаВсехРазделовДанных
Процедура ПриДобавленииРазделовДанных(РазделыДанных) Экспорт
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьРазделДанныхВТаблицу(РазделыДанных, "МедицинскиеОсмотры",
		"Медицинские осмотры", "ОхранаТруда", , "МедицинскиеОсмотры.ПриДобавленииРазделовДанных");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеПериодическихОсмотров

Процедура ОбновлениеПериодическихМедицинскихОсмотров() Экспорт
	
	// Регламентные задания блокируются на время служебных операций с информационной базой.
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбновлениеПериодическихМедицинскихОсмотров);
	
	ОбновитьПериодическиеОсмотры();
	
КонецПроцедуры

Процедура ОбновитьПериодическиеОсмотры(Организация = Неопределено, ФизическиеЛица = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ДанныеНабора.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеНабора.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	РегистрСведений.ОбновлениеПериодическихМедицинскихОсмотров КАК ДанныеНабора
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если Организация <> Неопределено Тогда
		ОтборЗапроса.Добавить("ДанныеНабора.ГоловнаяОрганизация = &ГоловнаяОрганизация");
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	КонецЕсли;
	Если ФизическиеЛица <> Неопределено Тогда
		ОтборЗапроса.Добавить("ДанныеНабора.ФизическоеЛицо В(&ФизическиеЛица)");
		Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Истина Цикл
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбновлениеПериодическихМедицинскихОсмотров"); 
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ФизическоеЛицо", "ФизическоеЛицо");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГоловнаяОрганизация", "ГоловнаяОрганизация");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ТаблицаОбновления = РезультатЗапроса.Выгрузить();
			ОбновитьПериодическиеОсмотрыФизическихЛиц(ТаблицаОбновления);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПериодическиеОсмотрыОрганизацииДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	Попытка
		ОбновитьПериодическиеОсмотры(Параметры.Организация);
	Исключение
		ПредставлениеОбработки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обновление периодических осмотров по организации %1'"), 
			Параметры.Организация);
		ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ОбновитьПериодическиеОсмотрыФизическихЛицДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	Попытка
		ОбновитьПериодическиеОсмотры(, Параметры.ФизическиеЛица);
	Исключение
		ПредставлениеОбработки = НСтр("ru = 'Обновление периодических осмотров по физическим лицам'"); 
		ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ОбновитьПериодическиеОсмотрыФизическихЛиц(ТаблицаОбновления)
	
	ПериодическиеОсмотры = НоваяТаблицаПериодическиеОсмотры();
	
	ЗаполнитьТаблицуПериодическихОсмотров(ПериодическиеОсмотры, ТаблицаОбновления);
	
	ПериодическиеОсмотры.Индексы.Добавить("ФизическоеЛицо, ГоловнаяОрганизация");
	
	ОтборСтрок = Новый Структура("ФизическоеЛицо, ГоловнаяОрганизация");
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		// Заполняем набор периодических осмотров.
		НаборОсмотры = РегистрыСведений.ПериодическиеМедицинскиеОсмотры.СоздатьНаборЗаписей();
		НаборОсмотры.Отбор.ФизическоеЛицо.Установить(СтрокаТаблицы.ФизическоеЛицо);
		НаборОсмотры.Отбор.ГоловнаяОрганизация.Установить(СтрокаТаблицы.ГоловнаяОрганизация);
		ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаТаблицы);
		НайденныеСтроки = ПериодическиеОсмотры.НайтиСтроки(ОтборСтрок);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НайденныеСтроки, НаборОсмотры);
		// Подготавливаем к очистке набор обновления.
		НаборОбновления = РегистрыСведений.ОбновлениеПериодическихМедицинскихОсмотров.СоздатьНаборЗаписей();
		НаборОбновления.Отбор.ФизическоеЛицо.Установить(СтрокаТаблицы.ФизическоеЛицо);
		НаборОбновления.Отбор.ГоловнаяОрганизация.Установить(СтрокаТаблицы.ГоловнаяОрганизация);
		НачатьТранзакцию();
		Попытка
			НаборОсмотры.Записать();
			НаборОбновления.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПериодическихОсмотров(ПериодическиеОсмотры, ТаблицаОбновления)
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	// Получаем сотрудников и рабочие места.
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыСотрудников.КадровыеДанные = 
		"ДолжностьПоШтатномуРасписанию,ГоловнаяОрганизация,ДатаРождения,
		|РабочееМестоОхраныТруда,РабочееМестоОхраныТрудаПериодРегистрации";
	
	ПараметрыСотрудников.СписокФизическихЛиц = ТаблицаОбновления.ВыгрузитьКолонку("ФизическоеЛицо");
	ПараметрыСотрудников.ПодработкиРаботниковПоТрудовымДоговорам = Истина;
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыСотрудников.Отборы, "ДатаУвольнения", "=", Дата(1, 1, 1));
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Истина, ПараметрыСотрудников);
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВТ, "ВТСотрудникиОрганизации") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТаблицаОбновления", ТаблицаОбновления);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОбновления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаОбновления.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ПОМЕСТИТЬ ВТОбновления
		|ИЗ
		|	&ТаблицаОбновления КАК ТаблицаОбновления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ДолжностьПоШтатномуРасписанию КАК Позиция,
		|	Сотрудники.РабочееМестоОхраныТруда КАК РабочееМесто,
		|	Сотрудники.РабочееМестоОхраныТрудаПериодРегистрации КАК ДатаНачала,
		|	Сотрудники.ДатаРождения КАК ДатаРождения,
		|	ДОБАВИТЬКДАТЕ(Сотрудники.ДатаРождения, ГОД, 21) КАК Дата21Год,
		|	ПериодичностьОсмотров.ВидОсмотра КАК ВидОсмотра,
		|	ПериодичностьОсмотров.Однократно КАК Однократно,
		|	ПериодичностьОсмотров.КратностьОсмотра КАК Кратность,
		|	ПериодичностьОсмотров.ПериодичностьОсмотра КАК Периодичность,
		|	ПериодичностьОсмотров.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичности
		|ПОМЕСТИТЬ ВТСотрудникиТребующиеОсмотра
		|ИЗ
		|	ВТСотрудникиОрганизации КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбновления КАК ТаблицаОбновления
		|		ПО ТаблицаОбновления.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
		|		И ТаблицаОбновления.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПериодичностьМедицинскихОсмотровРабочихМест КАК ПериодичностьОсмотров
		|		ПО ПериодичностьОсмотров.РабочееМесто = Сотрудники.РабочееМестоОхраныТруда";
	Запрос.Выполнить();
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВТ, "ВТСотрудникиТребующиеОсмотра") Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем сведения о последнем пройденном осмотре.
	СоздатьВТПройденныеОсмотры(МенеджерВТ, "ВТСотрудникиТребующиеОсмотра");
	
	// Сотрудники, хотя бы раз проходившие осмотр на том рабочем месте, на котором сейчас работают.
	// Для них просто отсчитаем дату следующего осмотра.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.Позиция КАК Позиция,
		|	Сотрудники.РабочееМесто КАК РабочееМесто,
		|	Сотрудники.ВидОсмотра КАК ВидОсмотра,
		|	Сотрудники.Дата21Год КАК Дата21Год,
		|	ПройденныеОсмотры.ДатаОсмотра КАК ДатаПройденногоОсмотра,
		|	ПройденныеОсмотры.РезультатОсмотра КАК РезультатОсмотра,
		|	ПройденныеОсмотры.Заключение КАК Заключение,
		|	ПройденныеОсмотры.Направление КАК Направление,
		|	Сотрудники.Однократно КАК Однократно,
		|	Сотрудники.Кратность КАК Кратность,
		|	Сотрудники.Периодичность КАК Периодичность,
		|	Сотрудники.ЕдиницаПериодичности КАК ЕдиницаПериодичности
		|ИЗ
		|	ВТСотрудникиТребующиеОсмотра КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПройденныеОсмотры КАК ПройденныеОсмотры
		|		ПО (ПройденныеОсмотры.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (ПройденныеОсмотры.ВидОсмотра = Сотрудники.ВидОсмотра)
		|			И (ПройденныеОсмотры.РабочееМесто = Сотрудники.РабочееМесто)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ПериодическиеОсмотры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
		ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Выборка);
		ДатаСледующегоОсмотра = ДатаСледующегоОсмотра(Выборка.ДатаПройденногоОсмотра, ОписаниеПериодичности);
		Если Выборка.ДатаПройденногоОсмотра < Выборка.Дата21Год Тогда
			ДатаСледующегоОсмотра = Мин(ДатаСледующегоОсмотра, ДобавитьМесяц(Выборка.ДатаПройденногоОсмотра, 12));
		КонецЕсли;
		НоваяСтрока.ДатаСледующегоОсмотра = ДатаСледующегоОсмотра;
	КонецЦикла;
	
	// Никогда не проходившие осмотр на этом рабочем месте
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.Позиция КАК Позиция,
		|	Сотрудники.РабочееМесто КАК РабочееМесто,
		|	Сотрудники.ВидОсмотра КАК ВидОсмотра,
		|	Сотрудники.Дата21Год КАК Дата21Год,
		|	Сотрудники.ДатаНачала КАК ДатаНачала
		|ПОМЕСТИТЬ ВТСотрудникиНеПроходившиеОсмотрНаПозиции
		|ИЗ
		|	ВТСотрудникиТребующиеОсмотра КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПройденныеОсмотры КАК ПройденныеОсмотры
		|		ПО (ПройденныеОсмотры.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (ПройденныеОсмотры.ВидОсмотра = Сотрудники.ВидОсмотра)
		|			И (ПройденныеОсмотры.РабочееМесто = Сотрудники.РабочееМесто)
		|ГДЕ
		|	ПройденныеОсмотры.ДатаОсмотра ЕСТЬ NULL";
	Запрос.Выполнить();
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВТ, "ВТСотрудникиНеПроходившиеОсмотрНаПозиции") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботМедицинскихОсмотровРабочегоМеста.РабочееМесто КАК РабочееМесто,
		|	ВидыРаботМедицинскихОсмотровРабочегоМеста.ВидРабот КАК ВидРабот
		|ПОМЕСТИТЬ ВТВидыРаботМедицинскихОсмотровРабочихМест
		|ИЗ
		|	РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботМедицинскихОсмотровРабочегоМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРаботМедицинскихОсмотровСправочник
		|		ПО ВидыРаботМедицинскихОсмотровРабочегоМеста.ВидРабот = ВидыРаботМедицинскихОсмотровСправочник.Ссылка
		|			И (НЕ ВидыРаботМедицинскихОсмотровСправочник.СоответствиеПодтверждено)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВредныеФакторыРабочегоМеста.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыРабочихМест
		|ИЗ
		|	РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеФакторыСправочник
		|		ПО ВредныеФакторыРабочегоМеста.ВредныйФактор = ВредныеФакторыСправочник.Ссылка
		|			И (НЕ ВредныеФакторыСправочник.СоответствиеПодтверждено)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто,
		|	ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор
		|ИЗ
		|	РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста";
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТТребуемыеВредныеФакторы
		|ИЗ
		|	ВТСотрудникиНеПроходившиеОсмотрНаПозиции КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВредныеФакторыРабочихМест КАК ВредныеФакторыРабочегоМеста
		|		ПО (ВредныеФакторыРабочегоМеста.РабочееМесто = Сотрудники.РабочееМесто)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВидыРаботРабочегоМеста.ВидРабот КАК ВидРабот
		|ПОМЕСТИТЬ ВТТребуемыеВидыРабот
		|ИЗ
		|	ВТСотрудникиНеПроходившиеОсмотрНаПозиции КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыРаботМедицинскихОсмотровРабочихМест КАК ВидыРаботРабочегоМеста
		|		ПО (ВидыРаботРабочегоМеста.РабочееМесто = Сотрудники.РабочееМесто)";
	Запрос.Выполнить();
	
	СоздатьВТОсмотрыПоВреднымФакторам(МенеджерВТ, "ВТТребуемыеВредныеФакторы");
	СоздатьВТОсмотрыПоВидамРабот(МенеджерВТ, "ВТТребуемыеВидыРабот");
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	// Выявляются люди и рабочие места, которым 
	// - не получается "перезачесть" из-за как минимум одного вредного фактора (вида работ),
	// - можно полностью "перезачесть" осмотр по вредным факторам (видам работ).
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ВидОсмотра КАК ВидОсмотра,
		|	Сотрудники.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТСотрудникиОсмотрНаПозицииНельзяПерезачесть
		|ИЗ
		|	ВТСотрудникиНеПроходившиеОсмотрНаПозиции КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВредныеФакторыРабочихМест КАК ВредныеФакторыРабочегоМеста
		|		ПО (ВредныеФакторыРабочегоМеста.РабочееМесто = Сотрудники.РабочееМесто)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторам КАК ПройденныеОсмотрыПоВреднымФакторам
		|		ПО (ПройденныеОсмотрыПоВреднымФакторам.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (ПройденныеОсмотрыПоВреднымФакторам.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (ПройденныеОсмотрыПоВреднымФакторам.ВредныйФактор = ВредныеФакторыРабочегоМеста.ВредныйФактор)
		|ГДЕ
		|	ПройденныеОсмотрыПоВреднымФакторам.ДатаОсмотра ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация,
		|	Сотрудники.ВидОсмотра,
		|	Сотрудники.РабочееМесто
		|ИЗ
		|	ВТСотрудникиНеПроходившиеОсмотрНаПозиции КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботРабочегоМеста
		|		ПО (ВидыРаботРабочегоМеста.РабочееМесто = Сотрудники.РабочееМесто)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсмотрыПоВидамРабот КАК ПройденныеОсмотрыПоВидамРабот
		|		ПО (ПройденныеОсмотрыПоВидамРабот.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (ПройденныеОсмотрыПоВидамРабот.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (ПройденныеОсмотрыПоВидамРабот.ВидРабот = ВидыРаботРабочегоМеста.ВидРабот)
		|ГДЕ
		|	ПройденныеОсмотрыПоВидамРабот.ДатаОсмотра ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.ВидОсмотра КАК ВидОсмотра,
		|	Сотрудники.РабочееМесто КАК РабочееМесто,
		|	КадровыеДанные.Позиция КАК Позиция,
		|	КадровыеДанные.ДатаНачала КАК ДатаСледующегоОсмотра
		|ИЗ
		|	ВТСотрудникиОсмотрНаПозицииНельзяПерезачесть КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиТребующиеОсмотра КАК КадровыеДанные
		|		ПО (КадровыеДанные.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (КадровыеДанные.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (КадровыеДанные.ВидОсмотра = Сотрудники.ВидОсмотра)
		|			И (КадровыеДанные.РабочееМесто = Сотрудники.РабочееМесто)";
	
	// АПК:96 -вкл
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перечисляем тех, кому не получилось перезачесть осмотр из-за одного или нескольких вредных факторов (видов работ).
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПериодическиеОсмотры.Добавить(), Выборка);
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.Позиция КАК Позиция,
		|	Сотрудники.РабочееМесто КАК РабочееМесто,
		|	Сотрудники.ВидОсмотра КАК ВидОсмотра,
		|	Сотрудники.Дата21Год КАК Дата21Год
		|ПОМЕСТИТЬ ВТСотрудникиОсмотрНаПозицииМожноПерезачесть
		|ИЗ
		|	ВТСотрудникиНеПроходившиеОсмотрНаПозиции КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОсмотрНаПозицииНельзяПерезачесть КАК НельзяПерезачесть
		|		ПО (НельзяПерезачесть.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (НельзяПерезачесть.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (НельзяПерезачесть.ВидОсмотра = Сотрудники.ВидОсмотра)
		|			И (НельзяПерезачесть.РабочееМесто = Сотрудники.РабочееМесто)
		|ГДЕ
		|	НельзяПерезачесть.РабочееМесто ЕСТЬ NULL";
	Запрос.Выполнить();
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВТ, "ВТСотрудникиОсмотрНаПозицииМожноПерезачесть") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеФакторы.Ссылка КАК Ссылка,
		|	ВредныеФакторы.КратностьОсмотра КАК КратностьОсмотра,
		|	ВредныеФакторы.ПериодичностьОсмотра КАК ПериодичностьОсмотра,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичностиОсмотра
		|ПОМЕСТИТЬ ВТСправочникиВредныхФакторов
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеФакторы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВредныеФакторы.Ссылка,
		|	ВредныеФакторы.КратностьОсмотра,
		|	ВредныеФакторы.ПериодичностьОсмотра,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеФакторы";
	Запрос.Выполнить();
	
	// АПК:96 -выкл результат должен содержать уникальные значения
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Сотрудники.Позиция КАК Позиция,
		|	Сотрудники.РабочееМесто КАК РабочееМесто,
		|	Сотрудники.ВидОсмотра КАК ВидОсмотра,
		|	Сотрудники.Дата21Год КАК Дата21Год,
		|	ПройденныеОсмотрыПоВреднымФакторам.ДатаОсмотра КАК ДатаПройденногоОсмотра,
		|	ПройденныеОсмотрыПоВреднымФакторам.Направление КАК Направление,
		|	ПройденныеОсмотрыПоВреднымФакторам.Заключение КАК Заключение,
		|	ПройденныеОсмотрыПоВреднымФакторам.РезультатОсмотра КАК РезультатОсмотра,
		|	ВредныеФакторы.КратностьОсмотра КАК Кратность,
		|	ВредныеФакторы.ПериодичностьОсмотра КАК Периодичность,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичности
		|ИЗ
		|	ВТСотрудникиОсмотрНаПозицииМожноПерезачесть КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВредныеФакторыРабочихМест КАК ВредныеФакторыРабочегоМеста
		|		ПО (ВредныеФакторыРабочегоМеста.РабочееМесто = Сотрудники.РабочееМесто)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСправочникиВредныхФакторов КАК ВредныеФакторы
		|		ПО (ВредныеФакторы.Ссылка = ВредныеФакторыРабочегоМеста.ВредныйФактор)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторам КАК ПройденныеОсмотрыПоВреднымФакторам
		|		ПО (ПройденныеОсмотрыПоВреднымФакторам.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (ПройденныеОсмотрыПоВреднымФакторам.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (ПройденныеОсмотрыПоВреднымФакторам.ВредныйФактор = ВредныеФакторыРабочегоМеста.ВредныйФактор)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация,
		|	Сотрудники.Позиция,
		|	Сотрудники.РабочееМесто,
		|	Сотрудники.ВидОсмотра,
		|	Сотрудники.Дата21Год,
		|	ПройденныеОсмотрыПоВидамРабот.ДатаОсмотра,
		|	ПройденныеОсмотрыПоВидамРабот.Направление,
		|	ПройденныеОсмотрыПоВидамРабот.Заключение,
		|	ПройденныеОсмотрыПоВидамРабот.РезультатОсмотра,
		|	ВидыРабот.КратностьОсмотра,
		|	ВидыРабот.ПериодичностьОсмотра,
		|	ВидыРабот.ЕдиницаПериодичностиОсмотра
		|ИЗ
		|	ВТСотрудникиОсмотрНаПозицииМожноПерезачесть КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботРабочегоМеста
		|		ПО (ВидыРаботРабочегоМеста.РабочееМесто = Сотрудники.РабочееМесто)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРабот
		|		ПО (ВидыРабот.Ссылка = ВидыРаботРабочегоМеста.ВидРабот)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсмотрыПоВидамРабот КАК ПройденныеОсмотрыПоВидамРабот
		|		ПО (ПройденныеОсмотрыПоВидамРабот.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (ПройденныеОсмотрыПоВидамРабот.ГоловнаяОрганизация = Сотрудники.ГоловнаяОрганизация)
		|			И (ПройденныеОсмотрыПоВидамРабот.ВидРабот = ВидыРаботРабочегоМеста.ВидРабот)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	РабочееМесто";
	
	// АПК:96 -вкл
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("ФизическоеЛицо") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("РабочееМесто") Цикл
			НоваяСтрока = ПериодическиеОсмотры.Добавить();
			Пока Выборка.Следующий() Цикл
				ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
				ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Выборка);
				ДатаСледующегоОсмотра = ДатаСледующегоОсмотра(Выборка.ДатаПройденногоОсмотра, ОписаниеПериодичности);
				Если Выборка.ДатаПройденногоОсмотра < Выборка.Дата21Год Тогда
					ДатаСледующегоОсмотра = Мин(ДатаСледующегоОсмотра, ДобавитьМесяц(Выборка.ДатаПройденногоОсмотра, 12));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НоваяСтрока.ДатаСледующегоОсмотра) Тогда
					НоваяСтрока.ДатаСледующегоОсмотра = ДатаСледующегоОсмотра;
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				Иначе
					Если ДатаСледующегоОсмотра < НоваяСтрока.ДатаСледующегоОсмотра Тогда
						НоваяСтрока.ДатаСледующегоОсмотра = ДатаСледующегоОсмотра;
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяТаблицаПериодическиеОсмотры()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Таблица.Колонки.Добавить("ГоловнаяОрганизация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("ВидОсмотра", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОбследований"));
	Таблица.Колонки.Добавить("Позиция", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	Таблица.Колонки.Добавить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	Таблица.Колонки.Добавить("ДатаПройденногоОсмотра", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ДатаСледующегоОсмотра", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("Направление", Новый ОписаниеТипов("ДокументСсылка.НаправлениеНаМедицинскийОсмотр"));
	Таблица.Колонки.Добавить("Заключение", Новый ОписаниеТипов("ДокументСсылка.ЗаключениеМедицинскогоОсмотра"));
	Таблица.Колонки.Добавить("РезультатОсмотра", Новый ОписаниеТипов("ПеречислениеСсылка.РезультатыМедицинскогоОсмотра"));
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область ОснованияДляОбновленияПериодическихОсмотров

Функция НоваяТаблицаОбновлениеПериодическихОсмотров() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Таблица.Колонки.Добавить("ГоловнаяОрганизация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗарегистрироватьОбновлениеПериодическихОсмотров(ТаблицаОбновления) Экспорт
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновления.Свернуть("ФизическоеЛицо, ГоловнаяОрганизация");
	
	НаборЗаписей = РегистрыСведений.ОбновлениеПериодическихМедицинскихОсмотров.СоздатьНаборЗаписей();
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		НаборЗаписей.Очистить();
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
		НаборЗаписей.Отбор["ФизическоеЛицо"].Установить(СтрокаТаблицы["ФизическоеЛицо"]);
		НаборЗаписей.Отбор["ГоловнаяОрганизация"].Установить(СтрокаТаблицы["ГоловнаяОрганизация"]);
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПериодическихОсмотровПоФизическомуЛицу(ТаблицаОбновлениеПериодическихОсмотров, ФизическоеЛицоОбъект)
	
	Если ФизическоеЛицоОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРождения = ФизическоеЛицоОбъект.ДатаРождения;
	
	ОбновлятьПериодическиеОсмотрыФизическогоЛица = Ложь;
	Если Не ФизическоеЛицоОбъект.ДополнительныеСвойства.Свойство("ПрежниеЗначения") Тогда
		ОбновлятьПериодическиеОсмотрыФизическогоЛица = Истина;
	Иначе
		ПрежниеЗначения = ФизическоеЛицоОбъект.ДополнительныеСвойства["ПрежниеЗначения"];
		Если ДатаРождения <> ПрежниеЗначения.ДатаРождения Тогда
			ОбновлятьПериодическиеОсмотрыФизическогоЛица = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОбновлятьПериодическиеОсмотрыФизическогоЛица Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуОбновленияПериодическихОсмотровПоФизическимЛицам(
		ТаблицаОбновлениеПериодическихОсмотров, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицоОбъект.Ссылка));

КонецПроцедуры

#КонецОбласти

Процедура СформироватьНаправления(ДанныеНаправлений)
	
	Для Каждого ОписаниеНаправления Из ДанныеНаправлений.ОписанияНаправлений Цикл
		Описание = Документы.НаправлениеНаМедицинскийОсмотр.ОписаниеДляЗаполнения();
		ЗаполнитьЗначенияСвойств(Описание, ДанныеНаправлений);
		ЗаполнитьЗначенияСвойств(Описание, ОписаниеНаправления);
		Если ЗначениеЗаполнено(ОписаниеНаправления.Направление) Тогда
			НаправлениеОбъект = ОписаниеНаправления.Направление.ПолучитьОбъект();
		Иначе
			НаправлениеОбъект = Документы.НаправлениеНаМедицинскийОсмотр.СоздатьДокумент();
		КонецЕсли;
		НаправлениеОбъект.Заполнить(Описание);
		НачатьТранзакцию();
		Попытка
			НаправлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ПредставлениеОбработки = НСтр("ru = 'Направление на медицинский осмотр (проведение)'");
			ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
			ВызватьИсключение;
		КонецПопытки;
		ОписаниеНаправления.Направление = НаправлениеОбъект.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьНаправленияДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	СформироватьНаправления(Параметры.ДанныеНаправлений);
	
	Направления = ОбщегоНазначения.ВыгрузитьКолонку(Параметры.ДанныеНаправлений.ОписанияНаправлений, "Направление");
	ПоместитьВоВременноеХранилище(Направления, АдресРезультата);
	
КонецПроцедуры

Процедура СформироватьЗаключения(ДанныеЗаключений)
	
	Для Каждого ОписаниеЗаключения Из ДанныеЗаключений.ОписанияЗаключений Цикл
		Описание = Документы.ЗаключениеМедицинскогоОсмотра.ОписаниеДляЗаполнения();
		ЗаполнитьЗначенияСвойств(Описание, ДанныеЗаключений);
		ЗаполнитьЗначенияСвойств(Описание, ОписаниеЗаключения);
		Если ЗначениеЗаполнено(ОписаниеЗаключения.Заключение) Тогда
			ЗаключениеОбъект = ОписаниеЗаключения.Заключение.ПолучитьОбъект();
		Иначе
			ЗаключениеОбъект = Документы.ЗаключениеМедицинскогоОсмотра.СоздатьДокумент();
		КонецЕсли;
		ЗаключениеОбъект.Заполнить(Описание);
		НачатьТранзакцию();
		Попытка
			ЗаключениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ПредставлениеОбработки = НСтр("ru = 'Заключение медицинского осмотра (проведение)'");
			ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
			ВызватьИсключение;
		КонецПопытки;
		ОписаниеЗаключения.Заключение = ЗаключениеОбъект.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьЗаключенияДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	СформироватьЗаключения(Параметры.ДанныеЗаключений);
	
	Организация = Параметры.ДанныеЗаключений.Организация;
	ФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(Параметры.ДанныеЗаключений.ОписанияЗаключений, "ФизическоеЛицо");
	
	ОбновитьПериодическиеОсмотры(Организация, ФизическиеЛица);
	
	Заключения = ОбщегоНазначения.ВыгрузитьКолонку(Параметры.ДанныеЗаключений.ОписанияЗаключений, "Заключение");
	ПоместитьВоВременноеХранилище(Заключения, АдресРезультата);
	
КонецПроцедуры

Процедура ЗаполнитьВыданныеРанееНаправления(ОписанияНаправлений, ТолькоНаправленияБезЗаключений = Истина) Экспорт
	
	Если ОписанияНаправлений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОтбор = Новый ТаблицаЗначений;
	ТаблицаОтбор.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОтбор.Колонки.Добавить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	ТаблицаОтбор.Колонки.Добавить("Описание");
	
	Для Каждого Описание Из ОписанияНаправлений Цикл
		НоваяСтрока = ТаблицаОтбор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Описание);
		НоваяСтрока.Описание = Описание;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", ТаблицаОтбор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Таблица.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТТаблицаОтбор
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеНаправления.Период КАК Период,
		|	ВыданныеНаправления.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыданныеНаправления.РабочееМесто КАК РабочееМесто,
		|	ВыданныеНаправления.Направление КАК Направление,
		|	ВыданныеНаправления.Заключение КАК Заключение,
		|	ВыданныеНаправления.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ВыданныеНаправленияНаМедицинскийОсмотр.СрезПоследних(
		|			,
		|			(ФизическоеЛицо, РабочееМесто) В
		|				(ВЫБРАТЬ
		|					Таблица.ФизическоеЛицо,
		|					Таблица.РабочееМесто
		|				ИЗ
		|					ВТТаблицаОтбор КАК Таблица)) КАК ВыданныеНаправления
		|ГДЕ
		|	ВыданныеНаправления.Заключение = ЗНАЧЕНИЕ(Документ.ЗаключениеМедицинскогоОсмотра.ПустаяСсылка)";
	Если Не ТолькоНаправленияБезЗаключений Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВыданныеНаправления.Заключение = ЗНАЧЕНИЕ(Документ.ЗаключениеМедицинскогоОсмотра.ПустаяСсылка)", "ИСТИНА");
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("ФизическоеЛицо, РабочееМесто");
	
	ВыданныеНаправления = РезультатЗапроса.Выгрузить();
	Для Каждого СтрокаТаблицы Из ВыданныеНаправления Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаТаблицы);
		НайденныеСтроки = ТаблицаОтбор.НайтиСтроки(ОтборСтрок);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Описание.Направление = СтрокаТаблицы.Направление;
			НайденнаяСтрока.Описание.Заключение = СтрокаТаблицы.Заключение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьЗаключениеПоНаправлению(Направление) Экспорт
	
	Возврат ЗаключениеПоНаправлению(Направление) <> Неопределено;
	
КонецФункции

Функция ЗаключениеПоНаправлению(Направление) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Направление", Направление);
	Запрос.Текст = 	
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаключениеМедицинскогоОсмотра.Ссылка КАК Заключение
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|ГДЕ
		|	ЗаключениеМедицинскогоОсмотра.Направление = &Направление
		|	И НЕ ЗаключениеМедицинскогоОсмотра.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Заключение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьДокументОтстраненияПоЗаключениюМедицинскогоОсмотра(ДокументОбъект, Основание)
	
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.ЗаключениеМедицинскогоОсмотра") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеЗаключения = Документы.ЗаключениеМедицинскогоОсмотра.ДанныеЗаключения(Основание);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеЗаключения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеЗаключения.Проведен Тогда
		ТекстСообщения = НСтр("ru = 'Документ заключения медицинского осмотра не проведен'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаключения.ДокументОтстранения) И ДанныеЗаключения.ДокументОтстранения <> ДокументОбъект.Ссылка Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'На основании заключения уже введен документ отстранения от работы %1'"),
			ДанныеЗаключения.ДокументОтстранения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Сотрудник = СотрудникПоФизическомуЛицу(
		ДанныеЗаключения.ФизическоеЛицо, 
		ДанныеЗаключения.РабочееМесто,
		ДанныеЗаключения.Организация, 
		ДокументОбъект.Ссылка);
		
	ДокументОбъект.Заполнить(Сотрудник);
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ДокументОснование", Основание);
	
КонецПроцедуры

Функция СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация, ИсключаемыйРегистратор = Неопределено) Экспорт
	
	ПараметрыЗапроса = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыЗапроса.Организация = Организация;
	ПараметрыЗапроса.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	ПараметрыЗапроса.ИсключаемыйРегистратор = ИсключаемыйРегистратор;
	ПараметрыЗапроса.ПодработкиРаботниковПоТрудовымДоговорам = Истина;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "РабочееМестоОхраныТруда", "=", РабочееМесто);
	
	УстановитьПривилегированныйРежим(Истина);
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Ложь, ПараметрыЗапроса);
	УстановитьПривилегированныйРежим(Ложь);
	
	КоличествоСотрудников = СотрудникиОрганизации.Количество();
	
	Если КоличествоСотрудников = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось найти сотрудника организации %1 на рабочем месте %2 для физического лица %3'"),
			Организация,
			РабочееМесто,
			ФизическоеЛицо);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Возврат СотрудникиОрганизации[КоличествоСотрудников - 1].Сотрудник;
	
КонецФункции

Функция ИстекшиеПериодическиеМедицинскиеОсмотры(ВидОсмотра)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИстекшиеОсмотры.Организация КАК Организация,
		|	ИстекшиеОсмотры.ВидОсмотра КАК ВидОсмотра,
		|	ИстекшиеОсмотры.Количество КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодическиеОсмотры.Организация КАК Организация,
		|		ПериодическиеОсмотры.ВидОсмотра КАК ВидОсмотра,
		|		КОЛИЧЕСТВО(ПериодическиеОсмотры.РезультатОсмотра) КАК Количество
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ПериодическиеМедицинскиеОсмотры.РабочееМесто.Владелец КАК Организация,
		|			ПериодическиеМедицинскиеОсмотры.ВидОсмотра КАК ВидОсмотра,
		|			ПериодическиеМедицинскиеОсмотры.РезультатОсмотра КАК РезультатОсмотра
		|		ИЗ
		|			РегистрСведений.ПериодическиеМедицинскиеОсмотры КАК ПериодическиеМедицинскиеОсмотры
		|		ГДЕ
		|			ПериодическиеМедицинскиеОсмотры.ДатаСледующегоОсмотра <= &ДатаАктуальности
		|			И ПериодическиеМедицинскиеОсмотры.ВидОсмотра = &ВидОсмотра
		|
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|		ВЫБРАТЬ
		|			ПериодическиеМедицинскиеОсмотры.РабочееМесто.Владелец,
		|			ПериодическиеМедицинскиеОсмотры.ВидОсмотра,
		|			ПериодическиеМедицинскиеОсмотры.РезультатОсмотра
		|		ИЗ
		|			РегистрСведений.ПериодическиеМедицинскиеОсмотры КАК ПериодическиеМедицинскиеОсмотры
		|		ГДЕ
		|			ПериодическиеМедицинскиеОсмотры.ДатаСледующегоОсмотра > &ДатаАктуальности
		|			И ПериодическиеМедицинскиеОсмотры.ВидОсмотра = &ВидОсмотра
		|			И ПериодическиеМедицинскиеОсмотры.РезультатОсмотра = 
		|				ЗНАЧЕНИЕ(Перечисление.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания)) КАК ПериодическиеОсмотры
		|	СГРУППИРОВАТЬ ПО
		|		ПериодическиеОсмотры.Организация,
		|		ПериодическиеОсмотры.ВидОсмотра
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(ПериодическиеОсмотры.РезультатОсмотра) > 0) КАК ИстекшиеОсмотры";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

Функция ВредныеФакторыБезПодтвержденияСоответствия(ВидОсмотра)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КоличествоНеподтвержденных.Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(ВредныеФакторыНеПодтвержденные.Ссылка) КАК Количество
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ВредныеОпасныеПроизводственныеФакторы.Ссылка
		|		ИЗ
		|			Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеОпасныеПроизводственныеФакторы,
		|			РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ГДЕ
		|			ВЫБОР
		|				КОГДА ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|					ГДЕ
		|						ВредныеФакторыРабочегоМеста.ВредныйФактор = ВредныеОпасныеПроизводственныеФакторы.Ссылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|			И НЕ ВредныеОпасныеПроизводственныеФакторы.СоответствиеПодтверждено
		|			И ВредныеОпасныеПроизводственныеФакторы.ВидОсмотра = &ВидОсмотра
		|
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ВидыРаботМедицинскихОсмотров.Ссылка
		|		ИЗ
		|			РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботМедицинскихОсмотровРабочегоМеста,
		|			Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРаботМедицинскихОсмотров
		|		ГДЕ
		|			ВЫБОР
		|				КОГДА ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботМедицинскихОсмотровРабочегоМеста
		|					ГДЕ
		|						ВидыРаботМедицинскихОсмотровРабочегоМеста.ВидРабот = ВидыРаботМедицинскихОсмотров.Ссылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|			И НЕ ВидыРаботМедицинскихОсмотров.СоответствиеПодтверждено
		|			И ВидыРаботМедицинскихОсмотров.ВидОсмотра = &ВидОсмотра
		|
		|		ОБЪЕДИНИТЬ ВСЕ
		|
		|		ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Ссылка
		|		ИЗ
		|			РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста,
		|			Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК
		|				ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы
		|		ГДЕ
		|			ВЫБОР
		|				КОГДА ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА
		|					ИЗ
		|						РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|					ГДЕ
		|						ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор = ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Ссылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|			И НЕ ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.СоответствиеПодтверждено
		|			И ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ВАрхиве
		|			И ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ВидОсмотра = &ВидОсмотра) КАК
		|			ВредныеФакторыНеПодтвержденные
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(ВредныеФакторыНеПодтвержденные.Ссылка) > 0) КАК КоличествоНеподтвержденных";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

Функция РабочиеМестаСУстаревшимиВреднымиФакторами()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОсмотра", Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РабочиеМестаСУстаревшимиВреднымиФакторами.Организация КАК Организация,
		|	РабочиеМестаСУстаревшимиВреднымиФакторами.Количество КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВидыДеятельностиПериодические.Организация КАК Организация,
		|		КОЛИЧЕСТВО(ВидыДеятельностиПериодические.РабочееМесто) КАК Количество
		|	ИЗ
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто КАК РабочееМесто,
		|			ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто.Владелец КАК Организация
		|		ИЗ
		|			РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК
		|					ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы
		|				ПО ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор = ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Ссылка
		|		ГДЕ
		|			НЕ ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.Однократно
		|			И ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ВидОсмотра = &ВидОсмотра) КАК
		|			ВидыДеятельностиПериодические
		|	СГРУППИРОВАТЬ ПО
		|		ВидыДеятельностиПериодические.Организация
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(ВидыДеятельностиПериодические.РабочееМесто) > 0) КАК РабочиеМестаСУстаревшимиВреднымиФакторами";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

#Область РаспределениеПоДням

Процедура РаспределитьОсмотрыПоДнямДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		РаспределитьОсмотрыПоДням(Параметры.ВыбранныйПериод, Параметры.ОписанияНаправлений);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ПредставлениеОбработки = НСтр("ru = 'Заполнение даты направления на медосмотр'");
		ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
		ВызватьИсключение;
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(Параметры.ОписанияНаправлений, АдресРезультата);
	
КонецПроцедуры

Процедура РаспределитьОсмотрыПоДням(ВыбранныйПериод, ОписанияНаправлений)
	
	ДатаНачала = ВыбранныйПериод.ДатаНачала;
	ДатаОкончания = ВыбранныйПериод.ДатаОкончания;
	
	ТаблицаОтбор = Новый ТаблицаЗначений;
	ТаблицаОтбор.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаОтбор.Колонки.Добавить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	ТаблицаОтбор.Колонки.Добавить("Месяц", Новый ОписаниеТипов("Дата"));
	ТаблицаОтбор.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ТаблицаОтбор.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	
	ОсмотрыПоДням = Новый Соответствие;
	ДниПоФизическимЛицам = Новый Соответствие;
	
	Для Каждого Описание Из ОписанияНаправлений Цикл
		Описание.ДатаОсмотра = Неопределено;
		Месяц = НачалоМесяца(ДатаНачала);
		Пока Месяц < ДатаОкончания Цикл
			НоваяСтрока = ТаблицаОтбор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Описание);
			НоваяСтрока.Месяц = Месяц;
			НоваяСтрока.ДатаНачала = Макс(ДатаНачала, НачалоМесяца(Месяц));
			НоваяСтрока.ДатаОкончания = Мин(ДатаОкончания, КонецМесяца(Месяц));
			Месяц = ДобавитьМесяц(Месяц, 1);
		КонецЦикла;
	КонецЦикла;
	
	Если ТаблицаОтбор.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТаблицаОтбор", ТаблицаОтбор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОтбор.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаОтбор.РабочееМесто КАК РабочееМестоОхраныТруда,
		|	ТаблицаОтбор.Месяц КАК Месяц,
		|	ТаблицаОтбор.ДатаНачала КАК ДатаНачала,
		|	ТаблицаОтбор.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТОтборФизическихЛиц
		|ИЗ
		|	&ТаблицаОтбор КАК ТаблицаОтбор";
	Запрос.Выполнить();
	
	ПараметрыЗапроса = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
	ПараметрыЗапроса.ИмяВТФизическиеЛица = "ВТОтборФизическихЛиц";
	ПараметрыЗапроса.ИмяПоляФизическоеЛицо = "ФизическоеЛицо";
	ПараметрыЗапроса.КадровыеДанные = "РабочееМестоОхраныТруда";
	ПараметрыЗапроса.НачалоПериода = ДатаНачала;
	ПараметрыЗапроса.ОкончаниеПериода = ДатаОкончания;
	ПараметрыЗапроса.РаботникиПоДоговорамГПХ = Ложь;
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Ложь, ПараметрыЗапроса);
	
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.РабочееМестоОхраныТруда КАК РабочееМесто,
		|	ОтборФизическихЛиц.Месяц КАК Месяц,
		|	&ДатаАктуальности КАК ДатаАктуальности,
		|	ОтборФизическихЛиц.ДатаНачала КАК ДатаНачала,
		|	ОтборФизическихЛиц.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВТСотрудникиОрганизации КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборФизическихЛиц КАК ОтборФизическихЛиц
		|		ПО (ОтборФизическихЛиц.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
		|			И (ОтборФизическихЛиц.РабочееМестоОхраныТруда = Сотрудники.РабочееМестоОхраныТруда)";
	Запрос.Выполнить();
	
	ПараметрыЗапроса = УчетРабочегоВремениРасширенный.ПараметрыДляСоздатьВТПлановоеВремяСотрудников();
	УчетРабочегоВремениРасширенный.СоздатьВТПлановоеВремя(МенеджерВТ, Ложь, ПараметрыЗапроса);

	ОписаниеФильтра = СостоянияСотрудников.ОписаниеФильтраСоздатьВТСостоянияСотрудниковНаДаты("ВТПлановоеВремя");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период", "Дата");
	СостоянияСотрудников.СоздатьВТСостоянияСотрудниковНаДаты(МенеджерВТ, Ложь, ОписаниеФильтра, "ВТСостоянияСотрудниковНаДаты");
	
	Запрос.УстановитьПараметр("РабочееВремя", УчетРабочегоВремениРасширенный.ВидыВремениВключаемыеВНорму());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПлановоеВремя.Дата КАК Дата
		|ИЗ
		|	ВТПлановоеВремя КАК ПлановоеВремя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
		|		ПО (Сотрудники.Сотрудник = ПлановоеВремя.Сотрудник)
		|			И (Сотрудники.Месяц = ПлановоеВремя.Месяц)
		|			И (ПлановоеВремя.ВидУчетаВремени В (&РабочееВремя))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСостоянияСотрудниковНаДаты КАК СостоянияСотрудников
		|		ПО (СостоянияСотрудников.Сотрудник = ПлановоеВремя.Сотрудник)
		|			И (СостоянияСотрудников.Период = ПлановоеВремя.Дата)
		|			И (СостоянияСотрудников.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудника.Работа))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	Дата";
	СотрудникиДаты = Запрос.Выполнить().Выгрузить();
	СотрудникиДаты.Индексы.Добавить("ФизическоеЛицо");
	
	Календарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	ПлановыеДаты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СотрудникиДаты.ВыгрузитьКолонку("Дата"));
	БлижайшиеРабочиеДаты = КалендарныеГрафики.БлижайшиеРабочиеДаты(Календарь, ПлановыеДаты);
	
	Для Каждого Описание Из ОписанияНаправлений Цикл
		Если ЗначениеЗаполнено(Описание.ДатаОсмотра) Тогда
			Продолжить;
		КонецЕсли;
		Если ДниПоФизическимЛицам[Описание.ФизическоеЛицо] <> Неопределено Тогда
			Описание.ДатаОсмотра = ДниПоФизическимЛицам[Описание.ФизическоеЛицо];
			Продолжить;
		КонецЕсли;
		ОтборСтрок = Новый Структура("ФизическоеЛицо");
		ОтборСтрок.ФизическоеЛицо = Описание.ФизическоеЛицо;
		НайденныеСтроки = СотрудникиДаты.НайтиСтроки(ОтборСтрок);
		Вчера = Неопределено;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяБлижайшаяДата = БлижайшиеРабочиеДаты[НайденнаяСтрока.Дата];
			Если НайденнаяБлижайшаяДата <> НайденнаяСтрока.Дата Тогда
				Продолжить;
			КонецЕсли;
			Если Вчера = Неопределено Тогда
				Вчера = НайденнаяБлижайшаяДата;
				Продолжить;
			КонецЕсли;
			ОсмотровВчера = ОсмотрыНаДату(ОсмотрыПоДням, Вчера);
			Если ОсмотровВчера = 0 Тогда
				ДобавитьОсмотрНаДату(ОсмотрыПоДням, Вчера, Описание);
				ДниПоФизическимЛицам.Вставить(Описание.ФизическоеЛицо, Описание.ДатаОсмотра);
				Прервать;
			КонецЕсли;
			ОсмотровСегодня = ОсмотрыНаДату(ОсмотрыПоДням, НайденнаяБлижайшаяДата);
			Если ОсмотровСегодня < ОсмотровВчера Тогда
				ДобавитьОсмотрНаДату(ОсмотрыПоДням, НайденнаяБлижайшаяДата, Описание);
				ДниПоФизическимЛицам.Вставить(Описание.ФизическоеЛицо, НайденнаяБлижайшаяДата);
				Прервать;
			КонецЕсли;
			Вчера = НайденнаяБлижайшаяДата;
		КонецЦикла;
		Если ЗначениеЗаполнено(Описание.ДатаОсмотра) Тогда
			Продолжить;
		КонецЕсли;
		Если НайденныеСтроки.Количество() > 0 И Вчера <> Неопределено Тогда
			ДобавитьОсмотрНаДату(ОсмотрыПоДням, Вчера, Описание);
			ДниПоФизическимЛицам.Вставить(Описание.ФизическоеЛицо, Вчера);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ОсмотрыНаДату(ОсмотрыПоДням, Дата)
	
	Осмотры = ОсмотрыПоДням[Дата];
	Если Осмотры = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Осмотры.Количество();
	
КонецФункции

Процедура ДобавитьОсмотрНаДату(ОсмотрыПоДням, Дата, Описание)
	
	Осмотры = ОсмотрыПоДням[Дата];
	Если Осмотры = Неопределено Тогда
		Осмотры = Новый Массив;
	КонецЕсли;
	
	Осмотры.Добавить(Описание);
	ОсмотрыПоДням.Вставить(Дата, Осмотры);
	
	Описание.ДатаОсмотра = Дата;
	
КонецПроцедуры

#КонецОбласти

Функция ДатаСледующегоОсмотра(ДатаОсмотра, ОписаниеПериодичностиОсмотров)
	
	Если ОписаниеПериодичностиОсмотров.Однократно Тогда
		Возврат ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата();
	КонецЕсли;
	
	Если ОписаниеПериодичностиОсмотров.Кратность = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МесяцевВЕдиницуИзмерения = МесяцевВЕдиницуИзмерения(ОписаниеПериодичностиОсмотров.ЕдиницаПериодичности);
	
	ИнтервалМесяцев = (ОписаниеПериодичностиОсмотров.Периодичность * МесяцевВЕдиницуИзмерения) / ОписаниеПериодичностиОсмотров.Кратность;
	
	Возврат ДобавитьМесяц(ДатаОсмотра, ИнтервалМесяцев);
	
КонецФункции

Функция ЧастейВГоду(ЕдиницаПериодичности)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.Периодичность.Год, 1);
	Соответствие.Вставить(Перечисления.Периодичность.Полугодие, 2);
	Соответствие.Вставить(Перечисления.Периодичность.Квартал, 4);
	Соответствие.Вставить(Перечисления.Периодичность.Месяц, 12);
	
	Возврат Соответствие[ЕдиницаПериодичности];
	
КонецФункции

Функция МесяцевВЕдиницуИзмерения(ЕдиницаПериодичности)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.Периодичность.Год, 12);
	Соответствие.Вставить(Перечисления.Периодичность.Полугодие, 6);
	Соответствие.Вставить(Перечисления.Периодичность.Квартал, 3);
	Соответствие.Вставить(Перечисления.Периодичность.Месяц, 1);
	
	Возврат Соответствие[ЕдиницаПериодичности];
	
КонецФункции

Процедура СоздатьВТПериодичностьВредныхФакторов(МенеджерВременныхТаблиц, ИмяВТВредныеФакторы = "ВТВредныеФакторы")
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВредныеФакторы.Ссылка КАК ВредныйФактор,
		|	ВредныеФакторы.КратностьОсмотра КАК Кратность,
		|	ВредныеФакторы.ПериодичностьОсмотра КАК Периодичность,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичности,
		|	ВредныеФакторы.Однократно КАК Однократно,
		|	ВредныеФакторы.ПредставлениеПериодичностиОсмотра КАК Представление
		|ПОМЕСТИТЬ ВТПериодичностьВредныхФакторов
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы КАК ВредныеФакторы
		|ГДЕ
		|	ВредныеФакторы.Ссылка В
		|		(ВЫБРАТЬ
		|			ВредныеФакторы.ВредныйФактор
		|		ИЗ
		|			ВТВредныеФакторы КАК ВредныеФакторы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВредныеФакторы.Ссылка,
		|	ВредныеФакторы.КратностьОсмотра,
		|	ВредныеФакторы.ПериодичностьОсмотра,
		|	ВредныеФакторы.ЕдиницаПериодичностиОсмотра,
		|	ВредныеФакторы.Однократно КАК Однократно,
		|	ВредныеФакторы.ПредставлениеПериодичностиОсмотра
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы КАК ВредныеФакторы
		|ГДЕ
		|	ВредныеФакторы.Ссылка В
		|		(ВЫБРАТЬ
		|			ВредныеФакторы.ВредныйФактор
		|		ИЗ
		|			ВТВредныеФакторы КАК ВредныеФакторы)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТВредныеФакторы", ИмяВТВредныеФакторы);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТПериодичностьВидовРабот(МенеджерВременныхТаблиц, ИмяВТВидыРабот = "ВТВидыРабот")
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыРаботМедицинскихОсмотров.Ссылка КАК ВидРабот,
		|	ВидыРаботМедицинскихОсмотров.КратностьОсмотра КАК Кратность,
		|	ВидыРаботМедицинскихОсмотров.ПериодичностьОсмотра КАК Периодичность,
		|	ВидыРаботМедицинскихОсмотров.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичности,
		|	ВидыРаботМедицинскихОсмотров.ПредставлениеПериодичностиОсмотра КАК Представление
		|ПОМЕСТИТЬ ВТПериодичностьВидовРабот
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров КАК ВидыРаботМедицинскихОсмотров
		|ГДЕ
		|	ВидыРаботМедицинскихОсмотров.Ссылка В
		|			(ВЫБРАТЬ
		|				ВидыРабот.ВидРабот
		|			ИЗ
		|				ВТВидыРабот КАК ВидыРабот)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТВидыРабот", ИмяВТВидыРабот);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТВредныеФакторыИВидыРаботРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ЕстьВидОсмотра", Не ВидОсмотра = Неопределено);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.ВидОсмотра КАК ВидОсмотра,
		|	ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор.Код КАК Код,
		|	ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыИВидыРаботРабочегоМеста
		|ИЗ
		|	РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|ГДЕ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто = &РабочееМесто
		|	И ВЫБОР
		|		КОГДА &ЕстьВидОсмотра
		|			ТОГДА ВредныеФакторыИВидыРаботРабочегоМеста.ВидОсмотра = &ВидОсмотра
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТВредныеФакторыРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ЕстьВидОсмотра", Не ВидОсмотра = Неопределено);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыРабочегоМеста.ВидОсмотра КАК ВидОсмотра,
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыРабочегоМеста
		|ИЗ
		|	РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|ГДЕ
		|	ВредныеФакторыРабочегоМеста.РабочееМесто = &РабочееМесто
		|	И ВЫБОР
		|		КОГДА &ЕстьВидОсмотра
		|			ТОГДА ВредныеФакторыРабочегоМеста.ВидОсмотра = &ВидОсмотра
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТВидыРаботРабочегоМеста(МенеджерВременныхТаблиц, РабочееМесто, ВидОсмотра)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидОсмотра", ВидОсмотра);
	Запрос.УстановитьПараметр("ЕстьВидОсмотра", Не ВидОсмотра = Неопределено);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыРаботРабочегоМеста.ВидОсмотра КАК ВидОсмотра,
		|	ВидыРаботРабочегоМеста.ВидРабот КАК ВидРабот
		|ПОМЕСТИТЬ ВТВидыРаботПозиции
		|ИЗ
		|	РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботРабочегоМеста
		|ГДЕ
		|	ВидыРаботРабочегоМеста.РабочееМесто = &РабочееМесто
		|	И ВЫБОР
		|		КОГДА &ЕстьВидОсмотра
		|			ТОГДА ВидыРаботРабочегоМеста.ВидОсмотра = &ВидОсмотра
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТОсмотрыПоВреднымФакторамФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо,
	ДатаАктуальности = Неопределено, УчитыватьРаботы = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоВреднымФакторам.Период КАК ДатаОсмотра,
		|	ОсмотрыПоВреднымФакторам.Регистратор КАК Регистратор,
		|	ОсмотрыПоВреднымФакторам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор КАК ВредныйФактор,
		|	ОсмотрыПоВреднымФакторам.РезультатОсмотра КАК РезультатОсмотра
		|ПОМЕСТИТЬ ВТОсмотрыПоВреднымФакторамПредварительные
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам.СрезПоследних(
		|			&ДатаАктуальности,
		|			ФизическоеЛицо = &ФизическоеЛицо
		|				И ВредныйФактор ССЫЛКА Справочник.ВредныеОпасныеПроизводственныеФакторы) КАК ОсмотрыПоВреднымФакторам
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо,
		|	ВредныйФактор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсмотрыПоВреднымФакторам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор КАК ВредныйФактор,
		|	МАКСИМУМ(ОсмотрыПоВреднымФакторам.ДатаОсмотра) КАК ДатаОсмотра
		|ПОМЕСТИТЬ ВТОсмотрыПоВреднымФакторамПредварительныеСгруппированные
		|ИЗ
		|	ВТОсмотрыПоВреднымФакторамПредварительные КАК ОсмотрыПоВреднымФакторам
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсмотрыПоВреднымФакторам.ФизическоеЛицо,
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо,
		|	ВредныйФактор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Осмотры.ДатаОсмотра КАК ДатаОсмотра,
		|	МАКСИМУМ(Осмотры.Регистратор) КАК Регистратор,
		|	Осмотры.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Осмотры.ВредныйФактор КАК ВредныйФактор,
		|	МАКСИМУМ(Осмотры.РезультатОсмотра) КАК РезультатОсмотра
		|ПОМЕСТИТЬ ВТОсмотрыПоВреднымФакторам
		|ИЗ
		|	ВТОсмотрыПоВреднымФакторамПредварительные КАК Осмотры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторамПредварительныеСгруппированные КАК ОсмотрыСгруппированные
		|		ПО Осмотры.ДатаОсмотра = ОсмотрыСгруппированные.ДатаОсмотра
		|			И Осмотры.ФизическоеЛицо = ОсмотрыСгруппированные.ФизическоеЛицо
		|			И Осмотры.ВредныйФактор = ОсмотрыСгруппированные.ВредныйФактор
		|
		|СГРУППИРОВАТЬ ПО
		|	Осмотры.ДатаОсмотра,
		|	Осмотры.ФизическоеЛицо,
		|	Осмотры.ВредныйФактор";
	
	Если УчитыватьРаботы Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВредныеОпасныеПроизводственныеФакторы", "ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы");
	КонецЕсли;
	Если ДатаАктуальности = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", "");
	КонецЕсли;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТОсмотрыПоВреднымФакторам(МенеджерВременныхТаблиц, ИмяВТФизическиеЛица = "ВТФизическиеЛица")
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоВреднымФакторам.Период КАК ДатаОсмотра,
		|	ОсмотрыПоВреднымФакторам.Регистратор КАК Заключение,
		|	ОсмотрыПоВреднымФакторам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсмотрыПоВреднымФакторам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор КАК ВредныйФактор,
		|	ОсмотрыПоВреднымФакторам.РезультатОсмотра КАК РезультатОсмотра,
		|	ОсмотрыПоВреднымФакторам.Направление КАК Направление
		|ПОМЕСТИТЬ ВТОсмотрыПоВреднымФакторамПредварительные
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам.СрезПоследних(
		|			,
		|			(ФизическоеЛицо, ГоловнаяОрганизация, ВредныйФактор) В
		|				(ВЫБРАТЬ
		|					ФизическиеЛица.ФизическоеЛицо,
		|					ФизическиеЛица.ГоловнаяОрганизация,
		|					ФизическиеЛица.ВредныйФактор
		|				ИЗ
		|					ВТФизическиеЛица КАК ФизическиеЛица)) КАК ОсмотрыПоВреднымФакторам
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо,
		|	ГоловнаяОрганизация,
		|	ВредныйФактор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсмотрыПоВреднымФакторам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсмотрыПоВреднымФакторам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор КАК ВредныйФактор,
		|	МАКСИМУМ(ОсмотрыПоВреднымФакторам.ДатаОсмотра) КАК ДатаОсмотра
		|ПОМЕСТИТЬ ВТОсмотрыПоВреднымФакторамПредварительныеСгруппированные
		|ИЗ
		|	ВТОсмотрыПоВреднымФакторамПредварительные КАК ОсмотрыПоВреднымФакторам
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсмотрыПоВреднымФакторам.ФизическоеЛицо,
		|	ОсмотрыПоВреднымФакторам.ГоловнаяОрганизация,
		|	ОсмотрыПоВреднымФакторам.ВредныйФактор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо,
		|	ГоловнаяОрганизация,
		|	ВредныйФактор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Осмотры.ДатаОсмотра КАК ДатаОсмотра,
		|	МАКСИМУМ(Осмотры.Заключение) КАК Заключение,
		|	Осмотры.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Осмотры.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Осмотры.ВредныйФактор КАК ВредныйФактор,
		|	МАКСИМУМ(Осмотры.РезультатОсмотра) КАК РезультатОсмотра,
		|	МАКСИМУМ(Осмотры.Направление) КАК Направление
		|ПОМЕСТИТЬ ВТОсмотрыПоВреднымФакторам
		|ИЗ
		|	ВТОсмотрыПоВреднымФакторамПредварительные КАК Осмотры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсмотрыПоВреднымФакторамПредварительныеСгруппированные КАК ОсмотрыСгруппированные
		|		ПО Осмотры.ДатаОсмотра = ОсмотрыСгруппированные.ДатаОсмотра
		|			И Осмотры.ФизическоеЛицо = ОсмотрыСгруппированные.ФизическоеЛицо
		|			И Осмотры.ГоловнаяОрганизация = ОсмотрыСгруппированные.ГоловнаяОрганизация
		|			И Осмотры.ВредныйФактор = ОсмотрыСгруппированные.ВредныйФактор
		|
		|СГРУППИРОВАТЬ ПО
		|	Осмотры.ДатаОсмотра,
		|	Осмотры.ФизическоеЛицо,
		|	Осмотры.ГоловнаяОрганизация,
		|	Осмотры.ВредныйФактор";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТФизическиеЛица", ИмяВТФизическиеЛица);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТОсмотрыПоВидамРаботФизическогоЛица(МенеджерВременныхТаблиц, ФизическоеЛицо, ДатаАктуальности)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоВидамРабот.Период КАК ДатаОсмотра,
		|	ОсмотрыПоВидамРабот.Регистратор КАК Регистратор,
		|	ОсмотрыПоВидамРабот.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсмотрыПоВидамРабот.ВидРабот КАК ВидРабот,
		|	ОсмотрыПоВидамРабот.РезультатОсмотра КАК РезультатОсмотра
		|ПОМЕСТИТЬ ВТОсмотрыПоВидамРабот
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотрыПоВидамРабот.СрезПоследних(&ДатаАктуальности, ФизическоеЛицо = &ФизическоеЛицо) КАК ОсмотрыПоВидамРабот";
	Если ДатаАктуальности = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", "");
	КонецЕсли;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТОсмотрыПоВидамРабот(МенеджерВременныхТаблиц, ИмяВТФизическиеЛица = "ВТФизическиеЛица")
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоВидамРабот.Период КАК ДатаОсмотра,
		|	ОсмотрыПоВидамРабот.Регистратор КАК Заключение,
		|	ОсмотрыПоВидамРабот.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсмотрыПоВидамРабот.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ОсмотрыПоВидамРабот.ВидРабот КАК ВидРабот,
		|	ОсмотрыПоВидамРабот.РезультатОсмотра КАК РезультатОсмотра,
		|	ОсмотрыПоВидамРабот.Направление КАК Направление
		|ПОМЕСТИТЬ ВТОсмотрыПоВидамРабот
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотрыПоВидамРабот.СрезПоследних(
		|			,
		|			(ФизическоеЛицо, ГоловнаяОрганизация, ВидРабот) В
		|				(ВЫБРАТЬ
		|					ФизическиеЛица.ФизическоеЛицо,
		|					ФизическиеЛица.ГоловнаяОрганизация,
		|					ФизическиеЛица.ВидРабот
		|				ИЗ
		|					ВТФизическиеЛица КАК ФизическиеЛица)) КАК ОсмотрыПоВидамРабот";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТФизическиеЛица", ИмяВТФизическиеЛица);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТПройденныеОсмотры(МенеджерВТ, ИмяВТФизическиеЛица = "ВТФизическиеЛица")
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсмотрыПоРабочимМестам.Период КАК ДатаОсмотра,
		|	ОсмотрыПоРабочимМестам.Регистратор КАК Заключение,
		|	ОсмотрыПоРабочимМестам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОсмотрыПоРабочимМестам.РезультатОсмотра КАК РезультатОсмотра,
		|	ОсмотрыПоРабочимМестам.РабочееМесто КАК РабочееМесто,
		|	ОсмотрыПоРабочимМестам.ВидОсмотра КАК ВидОсмотра,
		|	ОсмотрыПоРабочимМестам.Направление КАК Направление
		|ПОМЕСТИТЬ ВТПройденныеОсмотры
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотры.СрезПоследних(
		|			,
		|			(ФизическоеЛицо, РабочееМесто, ВидОсмотра) В
		|				(ВЫБРАТЬ
		|					ФизическиеЛица.ФизическоеЛицо,
		|					ФизическиеЛица.РабочееМесто,
		|					ФизическиеЛица.ВидОсмотра
		|				ИЗ
		|					ВТФизическиеЛица КАК ФизическиеЛица)) КАК ОсмотрыПоРабочимМестам";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТФизическиеЛица", ИмяВТФизическиеЛица);
	Запрос.Выполнить();
	
КонецПроцедуры

Функция АктуальностьОсмотраВПроцентах(ПоследнийОсмотр, СледующийОсмотр)
	
	Если Не ЗначениеЗаполнено(ПоследнийОсмотр) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СледующийОсмотр) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Сегодня = НачалоДня(ТекущаяДатаСеанса());

	Если Сегодня > СледующийОсмотр Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Сегодня < ПоследнийОсмотр Тогда
		Возврат 100;
	КонецЕсли;
	
	Возврат ((СледующийОсмотр - Сегодня) / (СледующийОсмотр - ПоследнийОсмотр)) * 100;
	
КонецФункции

Процедура ДобавитьСтрокуТаблицыОсмотровПоФакторам(ОсмотрыПоФакторам, ВыборкаЗапроса)
	
	НоваяСтрока = ОсмотрыПоФакторам.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЗапроса);
	
	НоваяСтрока.Периодичность = ОписаниеПериодичностиОсмотров();
	ЗаполнитьЗначенияСвойств(НоваяСтрока.Периодичность, ВыборкаЗапроса);
	ЗаполнитьПредставлениеПериодичности(НоваяСтрока.Периодичность);
	
	Если Не ЗначениеЗаполнено(ВыборкаЗапроса.ПоследнийОсмотр) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыборкаЗапроса.Результат = Перечисления.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания Тогда
		НоваяСтрока.СледующийОсмотр = ВыборкаЗапроса.ПоследнийОсмотр;
		НоваяСтрока.СостояниеПроцент = 0;
		Возврат;
	Иначе
		НоваяСтрока.СледующийОсмотр = ДатаСледующегоОсмотра(ВыборкаЗапроса.ПоследнийОсмотр, НоваяСтрока.Периодичность);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоваяСтрока.СледующийОсмотр) Тогда
		НоваяСтрока.СостояниеПроцент = АктуальностьОсмотраВПроцентах(НоваяСтрока.ПоследнийОсмотр, НоваяСтрока.СледующийОсмотр);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПериодичностиОсмотров()
	
	Возврат МедицинскиеОсмотрыКлиентСервер.ОписаниеПериодичностиОсмотров();
	
КонецФункции

Процедура ЗаполнитьПредставлениеПериодичности(ОписаниеПериодичности)
	
	ОписаниеПериодичности.Представление = ПредставлениеПериодичности(ОписаниеПериодичности.Кратность,
		ОписаниеПериодичности.Периодичность, ОписаниеПериодичности.ЕдиницаПериодичности, ОписаниеПериодичности.Однократно);
	
КонецПроцедуры

Функция ПредставленияФакторов()
	
	Представления = Новый Структура(
		"ВредныеФакторыПолноеПредставление,
		|ВидыРаботПолноеПредставление,
		|ВредныеФакторыКодыПредставление,
		|ВидыРаботКодыПредставление");
	
	Представления.ВредныеФакторыПолноеПредставление = "";
	Представления.ВидыРаботПолноеПредставление = "";
	Представления.ВредныеФакторыКодыПредставление = "";
	Представления.ВидыРаботКодыПредставление = "";
		
	Возврат Представления;
	
КонецФункции

Процедура ДополнитьПредставленияФакторов(Представления, ВыборкаФакторов, ЭтоПсихиатрическоеОсвидетельствование)
	
	Если Не ЭтоПсихиатрическоеОсвидетельствование
		И Не ЗначениеЗаполнено(ВыборкаФакторов.ВредныйФакторКод) И Не ЗначениеЗаполнено(ВыборкаФакторов.ВидРаботКод) Тогда
		Возврат;
	КонецЕсли;
	
	Разделитель = "," + Символы.НПП;
	СимволПробела = ?(ЭтоПсихиатрическоеОсвидетельствование, "", Символы.НПП);
	ВредныйФакторКод = "";
	Если ЗначениеЗаполнено(ВыборкаФакторов.ВредныйФакторКод) Тогда
		ВредныйФакторКод = ВыборкаФакторов.ВредныйФакторКод + ".";
		Если ЗначениеЗаполнено(Представления["ВредныеФакторыКодыПредставление"]) Тогда
			Представления["ВредныеФакторыКодыПредставление"] = Представления["ВредныеФакторыКодыПредставление"] + Разделитель;
		КонецЕсли;
		Представления["ВредныеФакторыКодыПредставление"] = Представления["ВредныеФакторыКодыПредставление"] + ВредныйФакторКод;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаФакторов.ВредныйФакторНаименование) Тогда
		Если ЗначениеЗаполнено(Представления["ВредныеФакторыПолноеПредставление"]) Тогда
			Представления["ВредныеФакторыПолноеПредставление"] = Представления["ВредныеФакторыПолноеПредставление"] + Разделитель;
		КонецЕсли;
		Представления["ВредныеФакторыПолноеПредставление"] = Представления["ВредныеФакторыПолноеПредставление"] + ВредныйФакторКод + СимволПробела + ВыборкаФакторов.ВредныйФакторНаименование;
	КонецЕсли;
	
	ВидРаботКод = "";
	Если ЗначениеЗаполнено(ВыборкаФакторов.ВидРаботКод) Тогда
		ВидРаботКод = ВыборкаФакторов.ВидРаботКод + ".";
		Если ЗначениеЗаполнено(Представления["ВидыРаботКодыПредставление"]) Тогда
			Представления["ВидыРаботКодыПредставление"] = Представления["ВидыРаботКодыПредставление"] + Разделитель;
		КонецЕсли;
		Представления["ВидыРаботКодыПредставление"] = Представления["ВидыРаботКодыПредставление"] + ВидРаботКод;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаФакторов.ВидРаботНаименование) Тогда
		Если ЗначениеЗаполнено(Представления["ВидыРаботПолноеПредставление"]) Тогда
			Представления["ВидыРаботПолноеПредставление"] = Представления["ВидыРаботПолноеПредставление"] + Разделитель;
		КонецЕсли;
		Представления["ВидыРаботПолноеПредставление"] = Представления["ВидыРаботПолноеПредставление"] + ВидРаботКод + СимволПробела + ВыборкаФакторов.ВидРаботНаименование;
	КонецЕсли;
	
КонецПроцедуры
 
Функция МинимальнаяПериодичность(ОписанияПериодичности)
	
	ОписаниеПериодичности = ОписаниеПериодичностиОсмотров();
	
	МаксимальныйКоэффициент = 0;
	Для Каждого Описание Из ОписанияПериодичности Цикл
		Если Описание.Однократно Тогда
			ОписаниеПериодичности.Однократно = Истина;
			Продолжить;
		КонецЕсли;
		Коэффициент = Описание.Кратность * ЧастейВГоду(Описание.ЕдиницаПериодичности) / Описание.Периодичность;
		Если Коэффициент > МаксимальныйКоэффициент Тогда
			ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, Описание);
			МаксимальныйКоэффициент = Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьПредставлениеПериодичности(ОписаниеПериодичности);
	
	Возврат ОписаниеПериодичности;
	
КонецФункции

Процедура ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке, ПредставлениеОбработки)
	
	ИмяСобытия = НСтр("ru = 'Медицинские осмотры'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, 
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка при обработке медицинских осмотров. Обратитесь к администратору.
              |Техническая информация:
              |При выполнении операции «%1» возникает
              |%2'"), 
		ПредставлениеОбработки,
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#Область ВредныеФакторыВидыРабот

Процедура СохранитьПрежниеДанныеВредногоФактораВидаРабот(ФакторОбъект) Экспорт
	
	СохранитьПрежнююПериодичностьВредногоФактораВидаРабот(ФакторОбъект);
	СохранитьПрежнийНаборСоответствующихВредныхФакторов(ФакторОбъект);
	
КонецПроцедуры

Процедура СохранитьПрежнююПериодичностьВредногоФактораВидаРабот(ФакторОбъект) Экспорт
	
	Если ФакторОбъект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если ФакторОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПериодичности = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ФакторОбъект.Ссылка, СравниваемыеПоляПериодичности());
	
	ПрежняяПериодичность = МедицинскиеОсмотрыКлиентСервер.ОписаниеПериодичностиОсмотров();
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьОписаниеПериодичностиПоВредномуФакторуВидуРабот(ПрежняяПериодичность, РеквизитыПериодичности);
	
	ФакторОбъект.ДополнительныеСвойства.Вставить("ПрежняяПериодичность", ПрежняяПериодичность);

КонецПроцедуры

Процедура СохранитьПрежнийНаборСоответствующихВредныхФакторов(ФакторОбъект) Экспорт
	
	Если ФакторОбъект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если ФакторОбъект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СоответствующиеВредныеФакторы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФакторОбъект.Ссылка, "СоответствующиеВредныеФакторы");
	ФакторОбъект.ДополнительныеСвойства.Вставить("ПрежниеСоответствующиеВредныеФакторы", СоответствующиеВредныеФакторы.Выгрузить());

КонецПроцедуры

Процедура ПроверитьИзменениеДанныхВредногоФактора(ВредныйФакторОбъект) Экспорт
	
	ПроверитьИзменениеПериодичностиВредногоФактора(ВредныйФакторОбъект);
	ОбновитьРабочиеМестаПоСопоставленнымВреднымФакторам(ВредныйФакторОбъект);
	
КонецПроцедуры

Процедура ПроверитьИзменениеПериодичностиВредногоФактора(ВредныйФакторОбъект) Экспорт
	
	Если Не ОбновлятьПериодичностьОсмотровПоВредномуФакторуВидуРабот(ВредныйФакторОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбновитьПериодичностьОсмотровРабочихМестПоВредномуФактору(ВредныйФакторОбъект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПроверитьИзменениеДанныхВидаРабот(ВидРаботОбъект) Экспорт
	ПроверитьИзменениеПериодичностиВидаРабот(ВидРаботОбъект);
	ОбновитьРабочиеМестаПоСопоставленнымВреднымФакторам(ВидРаботОбъект);
КонецПроцедуры

Процедура ПроверитьИзменениеПериодичностиВидаРабот(ВидРаботОбъект)
	
	Если Не ОбновлятьПериодичностьОсмотровПоВредномуФакторуВидуРабот(ВидРаботОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ОбновитьПериодичностьОсмотровРабочихМестПоВидуРабот(ВидРаботОбъект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ОбновлятьПериодичностьОсмотровПоВредномуФакторуВидуРабот(ФакторОбъект)
	
	Если Не ФакторОбъект.ДополнительныеСвойства.Свойство("ПрежняяПериодичность") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПрежняяПериодичность = ФакторОбъект.ДополнительныеСвойства["ПрежняяПериодичность"];
	
	НоваяПериодичность = МедицинскиеОсмотрыКлиентСервер.ОписаниеПериодичностиОсмотров();
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьОписаниеПериодичностиПоВредномуФакторуВидуРабот(НоваяПериодичность, ФакторОбъект);

	Если ОбщегоНазначения.КоллекцииИдентичны(НоваяПериодичность, ПрежняяПериодичность) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СравниваемыеПоляПериодичности()
	
	Возврат
		"Однократно,
		|КратностьОсмотра, 
		|ПериодичностьОсмотра, 
		|ЕдиницаПериодичностиОсмотра, 
		|ПредставлениеПериодичностиОсмотра";
	
КонецФункции

Функция ПредставлениеПериодичности(Кратность, Периодичность, ЕдиницаПериодичности, Однократно = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Кратность) Или Не ЗначениеЗаполнено(Периодичность) Тогда
		Если Однократно Тогда
			Возврат НСтр("ru='Однократно'");
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	КратностьПредставление = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 раз;;%1 раза;%1 раз;'"), 
		Кратность);
		
	ШаблонЕдиницыПериодичности = "";
	Если ЕдиницаПериодичности = Перечисления.Периодичность.Год Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 год;;%1 года;%1 лет;'");
	ИначеЕсли ЕдиницаПериодичности = Перечисления.Периодичность.Полугодие Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 полугодие;;%1 полугодия;%1 полугодий;'");
	ИначеЕсли ЕдиницаПериодичности = Перечисления.Периодичность.Квартал Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 квартал;;%1 квартала;%1 кварталов;'");
	ИначеЕсли ЕдиницаПериодичности = Перечисления.Периодичность.Месяц Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 месяц;;%1 месяца;%1 месяцев;'");
	КонецЕсли;
	
	Если Периодичность = 1 Тогда
		ШаблонЕдиницыПериодичности = СтрЗаменить(ШаблонЕдиницыПериодичности, "%1", "");
	КонецЕсли;
	
	ПериодичностьПредставление = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		ШаблонЕдиницыПериодичности, 
		Периодичность);
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 в %2'"), 
		КратностьПредставление, 
		ПериодичностьПредставление);
		
	Возврат Представление;
		
КонецФункции

Процедура ЗаполнитьОрганизацию(НаборЗаписей) Экспорт
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМеста = НаборЗаписей.ВыгрузитьКолонку("РабочееМесто");
	ОрганизацииРабочихМест = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(РабочиеМеста, "Владелец");
	
	Для Каждого СтрокаНабора Из НаборЗаписей Цикл
		СтрокаНабора.Организация = ОрганизацииРабочихМест[СтрокаНабора.РабочееМесто];
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ОбновитьПериодическиеОсмотрыУволенныхСотрудников(ПараметрыОбновления) Экспорт
	
	// Составляем перечень позиций для медосмотров.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Позиции.Позиция КАК Позиция
		|ИЗ
		|	РегистрСведений.УдалитьПериодичностьМедицинскихОсмотровПозицииШтатногоРасписания КАК Позиции";
	ПозицииМедосмотров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Позиция");
	
	Если ПозицииМедосмотров.Количество() = 0 Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	// Получаем уволенных сотрудников.
	ПараметрыЗапроса = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыЗапроса.КадровыеДанные = "ФизическоеЛицо, ГоловнаяОрганизация";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ДолжностьПоШтатномуРасписанию", "В", ПозицииМедосмотров);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ДатаУвольнения", "<>", Дата(1, 1, 1));
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Ложь, ПараметрыЗапроса);
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	ВТСотрудникиОрганизации КАК Сотрудники";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеПериодическихОсмотров();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), Выборка);
	КонецЦикла;
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеПериодическихОсмотров(ТаблицаОбновления);
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
	ФизическиеЛица = ТаблицаОбновления.ВыгрузитьКолонку("ФизическоеЛицо");
	ЗапуститьОбновлениеПериодическихОсмотров(, ФизическиеЛица);
	
КонецПроцедуры

Процедура ЗаполнитьРабочиеМестаВОбъектахПодсистемыМедосмотры(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ПредварительныйТекстЗапросаРабочиеМестаТребующиеОбработки();
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, "ВТСвязиРабочихМестСПозициями", Неопределено);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Запрос.Текст = ОсновнойТекстЗапросаРабочиеМестаТребующиеОбработки();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаВредныеФакторыИВидыРабот = РезультатыЗапроса[РезультатыЗапроса.Количество() - 26].Выбрать();
	ВыборкаВредныеФакторы = РезультатыЗапроса[РезультатыЗапроса.Количество() - 25].Выбрать();
	ВыборкаВидыРабот = РезультатыЗапроса[РезультатыЗапроса.Количество() - 24].Выбрать();
	ВыборкаПериодичностьМедосмотров = РезультатыЗапроса[РезультатыЗапроса.Количество() - 23].Выбрать();
	ВыборкаВыданныеНаправления = РезультатыЗапроса[РезультатыЗапроса.Количество() - 22].Выбрать();
	ВыборкаМедицинскиеОсмотры = РезультатыЗапроса[РезультатыЗапроса.Количество() - 21].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМедицинскиеДокументы = РезультатыЗапроса[РезультатыЗапроса.Количество() - 20].Выбрать();
	
	// Регистры
	НаборЗаписейВредныеФакторыИВидыРабот = 
		ОхранаТруда.НаборЗаписейРегистраСведенийИзВыборки(ВыборкаВредныеФакторыИВидыРабот, "ВредныеФакторыИВидыРаботРабочегоМеста");
	НаборЗаписейВредныеФакторы = 
		ОхранаТруда.НаборЗаписейРегистраСведенийИзВыборки(ВыборкаВредныеФакторы, "ВредныеФакторыРабочегоМеста");
	НаборЗаписейВидыРабот = 
		ОхранаТруда.НаборЗаписейРегистраСведенийИзВыборки(ВыборкаВидыРабот, "ВидыРаботМедицинскихОсмотровРабочегоМеста");
	НаборЗаписейПериодичностьМедосмотров = 
		ОхранаТруда.НаборЗаписейРегистраСведенийИзВыборки(ВыборкаПериодичностьМедосмотров, "ПериодичностьМедицинскихОсмотровРабочихМест");
	НаборЗаписейВыданныеНаправления = 
		ОхранаТруда.НаборЗаписейРегистраСведенийИзВыборки(ВыборкаВыданныеНаправления, "ВыданныеНаправленияНаМедицинскийОсмотр");
	
	НачатьТранзакцию();
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейВредныеФакторыИВидыРабот, Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейВредныеФакторы, Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейВидыРабот, Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейПериодичностьМедосмотров, Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписейВыданныеНаправления, Ложь);
		
		ОбработатьДокументыМедицинскихОсмотров(ВыборкаМедицинскиеДокументы);
		ОхранаТруда.ОбработатьРегистрСведенийПодчиненныйРегистратору(ВыборкаМедицинскиеОсмотры, "МедицинскиеОсмотры");
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения рабочих мест в объектах подсистемы «Медосмотры»'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Функция ПредварительныйТекстЗапросаРабочиеМестаТребующиеОбработки()
	
	// АПК:96 -выкл результат должен содержать уникальные значения
		
	Возврат
		"ВЫБРАТЬ
		|	ПериодичностьРабочихМест.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТПериодичностьМедицинскихОсмотровРабочихМестОбработанные
		|ИЗ
		|	РегистрСведений.ПериодичностьМедицинскихОсмотровРабочихМест КАК ПериодичностьРабочихМест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МедицинскиеОсмотры.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТМедицинскиеОсмотрыОбработанные
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотры КАК МедицинскиеОсмотры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеНаправленияНаМедицинскийОсмотр.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТВыданныеНаправленияНаМедицинскийОсмотрОбработанные
		|ИЗ
		|	РегистрСведений.ВыданныеНаправленияНаМедицинскийОсмотр КАК ВыданныеНаправленияНаМедицинскийОсмотр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТВредныеФакторыИВидыРаботРабочегоМестаОбработанные
		|ИЗ
		|	РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВредныеФакторыРабочегоМеста.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТВредныеФакторыРабочегоМестаОбработанные
		|ИЗ
		|	РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРаботРабочегоМеста.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТВидыРаботРабочегоМестаОбработанные
		|ИЗ
		|	РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботРабочегоМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаправлениеНаМедицинскийОсмотр.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТНаправлениеНаМедицинскийОсмотрОбработанные
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаключениеМедицинскогоОсмотра.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТЗаключениеМедицинскогоОсмотраОбработанные
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВредныеФакторыИВидыРаботПозицииШтатногоРасписания.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторыИВидыРаботПозицииШтатногоРасписания.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыИВидыРаботПозицииШтатногоРасписания
		|ИЗ
		|	РегистрСведений.УдалитьВредныеФакторыИВидыРаботПозицииШтатногоРасписания КАК ВредныеФакторыИВидыРаботПозицииШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВредныеФакторыПозицииШтатногоРасписания.Позиция КАК Позиция,
		|	ВредныеФакторыПозицииШтатногоРасписания.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыПозицииШтатногоРасписания
		|ИЗ
		|	РегистрСведений.УдалитьВредныеФакторыПозицииШтатногоРасписания КАК ВредныеФакторыПозицииШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыРаботПозицииШтатногоРасписания.Позиция КАК Позиция,
		|	ВидыРаботПозицииШтатногоРасписания.ВидРабот КАК ВидРабот
		|ПОМЕСТИТЬ ВТВидыРаботПозицииШтатногоРасписания
		|ИЗ
		|	РегистрСведений.УдалитьВидыРаботМедицинскихОсмотровПозицииШтатногоРасписания КАК ВидыРаботПозицииШтатногоРасписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодичностьМедицинскихОсмотров.Позиция КАК Позиция,
		|	ПериодичностьМедицинскихОсмотров.КратностьОсмотра КАК КратностьОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ПериодичностьОсмотра КАК ПериодичностьОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичностиОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ПредставлениеПериодичностиОсмотра КАК ПредставлениеПериодичностиОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ВредныеФакторыПолноеПредставление КАК ВредныеФакторыПолноеПредставление,
		|	ПериодичностьМедицинскихОсмотров.ВидыРаботПолноеПредставление КАК ВидыРаботПолноеПредставление,
		|	ПериодичностьМедицинскихОсмотров.ВредныеФакторыКодыПредставление КАК ВредныеФакторыКодыПредставление,
		|	ПериодичностьМедицинскихОсмотров.ВидыРаботКодыПредставление КАК ВидыРаботКодыПредставление
		|ПОМЕСТИТЬ ВТПериодичностьМедицинскихОсмотровРабочихМест
		|ИЗ
		|	РегистрСведений.УдалитьПериодичностьМедицинскихОсмотровПозицииШтатногоРасписания КАК ПериодичностьМедицинскихОсмотров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Период КАК Период,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Позиция КАК Позиция,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Направление КАК Направление,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Заключение КАК Заключение,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Организация КАК Организация
		|ПОМЕСТИТЬ ВТВыданныеНаправленияНаМедицинскийОсмотр
		|ИЗ
		|	РегистрСведений.УдалитьВыданныеНаправленияНаМедицинскийОсмотр КАК ВыданныеНаправленияНаМедицинскийОсмотр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МедицинскиеОсмотры.Период КАК Период,
		|	МедицинскиеОсмотры.Регистратор КАК Регистратор,
		|	МедицинскиеОсмотры.НомерСтроки КАК НомерСтроки,
		|	МедицинскиеОсмотры.Активность КАК Активность,
		|	МедицинскиеОсмотры.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МедицинскиеОсмотры.Позиция КАК Позиция,
		|	МедицинскиеОсмотры.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	МедицинскиеОсмотры.РезультатОсмотра КАК РезультатОсмотра,
		|	МедицинскиеОсмотры.Организация КАК Организация,
		|	МедицинскиеОсмотры.ТипОсмотра КАК ТипОсмотра,
		|	МедицинскиеОсмотры.Направление КАК Направление
		|ПОМЕСТИТЬ ВТМедицинскиеОсмотры
		|ИЗ
		|	РегистрСведений.УдалитьМедицинскиеОсмотры КАК МедицинскиеОсмотры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаправлениеНаМедицинскийОсмотр.Ссылка КАК Ссылка,
		|	НаправлениеНаМедицинскийОсмотр.УдалитьПозиция КАК УдалитьПозиция
		|ПОМЕСТИТЬ ВТНаправлениеНаМедицинскийОсмотр
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаключениеМедицинскогоОсмотра.Ссылка КАК Ссылка,
		|	ЗаключениеМедицинскогоОсмотра.УдалитьПозиция КАК УдалитьПозиция
		|ПОМЕСТИТЬ ВТЗаключениеМедицинскогоОсмотра
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаправлениеНаМедицинскийОсмотр.Ссылка КАК Ссылка,
		|	НаправлениеНаМедицинскийОсмотр.УдалитьПозиция КАК Позиция
		|ПОМЕСТИТЬ ВТМедицинскиеДокументы
		|ИЗ
		|	ВТНаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаключениеМедицинскогоОсмотра.Ссылка,
		|	ЗаключениеМедицинскогоОсмотра.УдалитьПозиция
		|ИЗ
		|	ВТЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто,
		|	ШтатноеРасписание.Ссылка КАК Позиция
		|ПОМЕСТИТЬ ВТСвязиРабочихМестСПозициямиНеОтобранные
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО РабочиеМестаОхраныТруда.УдалитьДолжностьПоШтатномуРасписанию = ШтатноеРасписание.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТСвязиРабочихМестСПозициями
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодичностьМедицинскихОсмотровРабочихМест КАК ПериодичностьМедицинскихОсмотровРабочихМест
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ПериодичностьМедицинскихОсмотровРабочихМест.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодичностьМедицинскихОсмотровРабочихМестОбработанные КАК ПериодичностьМедицинскихОсмотровРабочихМестОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ПериодичностьМедицинскихОсмотровРабочихМестОбработанные.РабочееМесто
		|ГДЕ
		|	ПериодичностьМедицинскихОсмотровРабочихМестОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМедицинскиеОсмотры КАК МедицинскиеОсмотры
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = МедицинскиеОсмотры.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМедицинскиеОсмотрыОбработанные КАК МедицинскиеОсмотрыОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = МедицинскиеОсмотрыОбработанные.РабочееМесто
		|ГДЕ
		|	МедицинскиеОсмотрыОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВыданныеНаправленияНаМедицинскийОсмотр КАК ВыданныеНаправленияНаМедицинскийОсмотр
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ВыданныеНаправленияНаМедицинскийОсмотр.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыданныеНаправленияНаМедицинскийОсмотрОбработанные КАК ВыданныеНаправленияНаМедицинскийОсмотрОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ВыданныеНаправленияНаМедицинскийОсмотрОбработанные.РабочееМесто
		|ГДЕ
		|	ВыданныеНаправленияНаМедицинскийОсмотрОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВредныеФакторыИВидыРаботПозицииШтатногоРасписания КАК ВредныеФакторыИВидыРаботПозицииШтатногоРасписания
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ВредныеФакторыИВидыРаботПозицииШтатногоРасписания.РабочееМесто
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВредныеФакторыИВидыРаботРабочегоМестаОбработанные КАК ВредныеФакторыИВидыРаботРабочегоМестаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ВредныеФакторыИВидыРаботРабочегоМестаОбработанные.РабочееМесто
		|ГДЕ
		|	ВредныеФакторыИВидыРаботРабочегоМестаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВредныеФакторыПозицииШтатногоРасписания КАК ВредныеФакторыПозицииШтатногоРасписания
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ВредныеФакторыПозицииШтатногоРасписания.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВредныеФакторыРабочегоМестаОбработанные КАК ВредныеФакторыРабочегоМестаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ВредныеФакторыРабочегоМестаОбработанные.РабочееМесто
		|ГДЕ
		|	ВредныеФакторыРабочегоМестаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыРаботПозицииШтатногоРасписания КАК ВидыРаботПозицииШтатногоРасписания
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ВидыРаботПозицииШтатногоРасписания.Позиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыРаботРабочегоМестаОбработанные КАК ВидыРаботРабочегоМестаОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ВидыРаботРабочегоМестаОбработанные.РабочееМесто
		|ГДЕ
		|	ВидыРаботРабочегоМестаОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = НаправлениеНаМедицинскийОсмотр.УдалитьПозиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНаправлениеНаМедицинскийОсмотрОбработанные КАК НаправлениеНаМедицинскийОсмотрОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = НаправлениеНаМедицинскийОсмотрОбработанные.РабочееМесто
		|ГДЕ
		|	НаправлениеНаМедицинскийОсмотрОбработанные.РабочееМесто ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто,
		|	СвязиРабочихМестСПозициямиНеОтобранные.Позиция
		|ИЗ
		|	ВТСвязиРабочихМестСПозициямиНеОтобранные КАК СвязиРабочихМестСПозициямиНеОтобранные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.Позиция = ЗаключениеМедицинскогоОсмотра.УдалитьПозиция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаключениеМедицинскогоОсмотраОбработанные КАК ЗаключениеМедицинскогоОсмотраОбработанные
		|		ПО СвязиРабочихМестСПозициямиНеОтобранные.РабочееМесто = ЗаключениеМедицинскогоОсмотраОбработанные.РабочееМесто
		|ГДЕ
		|	ЗаключениеМедицинскогоОсмотраОбработанные.РабочееМесто ЕСТЬ NULL";
	
	// АПК:96 -вкл
		
КонецФункции

Функция ОсновнойТекстЗапросаРабочиеМестаТребующиеОбработки()
	
	Возврат
		"ВЫБРАТЬ
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторыИВидыРаботПозицииШтатногоРасписания.ВредныйФактор КАК ВредныйФактор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр) КАК ВидОсмотра
		|ИЗ
		|	ВТВредныеФакторыИВидыРаботПозицииШтатногоРасписания КАК ВредныеФакторыИВидыРаботПозицииШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО ВредныеФакторыИВидыРаботПозицииШтатногоРасписания.РабочееМесто = СвязиРабочихМестСПозициями.Позиция
		|СГРУППИРОВАТЬ ПО
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ВредныеФакторыИВидыРаботПозицииШтатногоРасписания.ВредныйФактор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторыПозицииШтатногоРасписания.ВредныйФактор КАК ВредныйФактор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр) КАК ВидОсмотра
		|ИЗ
		|	ВТВредныеФакторыПозицииШтатногоРасписания КАК ВредныеФакторыПозицииШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО ВредныеФакторыПозицииШтатногоРасписания.Позиция = СвязиРабочихМестСПозициями.Позиция
		|СГРУППИРОВАТЬ ПО
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ВредныеФакторыПозицииШтатногоРасписания.ВредныйФактор,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	ВидыРаботПозицииШтатногоРасписания.ВидРабот КАК ВидРабот,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр) КАК ВидОсмотра
		|ИЗ
		|	ВТВидыРаботПозицииШтатногоРасписания КАК ВидыРаботПозицииШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО ВидыРаботПозицииШтатногоРасписания.Позиция = СвязиРабочихМестСПозициями.Позиция
		|СГРУППИРОВАТЬ ПО
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ВидыРаботПозицииШтатногоРасписания.ВидРабот,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр) КАК ВидОсмотра,
		|	ПериодичностьМедицинскихОсмотров.КратностьОсмотра КАК КратностьОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ПериодичностьОсмотра КАК ПериодичностьОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ЕдиницаПериодичностиОсмотра КАК ЕдиницаПериодичностиОсмотра,
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ПредставлениеПериодичностиОсмотра КАК СТРОКА(1000)) КАК
		|		ПредставлениеПериодичностиОсмотра,
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВредныеФакторыПолноеПредставление КАК СТРОКА(1000)) КАК
		|		ВредныеФакторыПолноеПредставление,
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВидыРаботПолноеПредставление КАК СТРОКА(1000)) КАК
		|		ВидыРаботПолноеПредставление,
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВредныеФакторыКодыПредставление КАК СТРОКА(1000)) КАК
		|		ВредныеФакторыКодыПредставление,
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВидыРаботКодыПредставление КАК СТРОКА(1000)) КАК ВидыРаботКодыПредставление
		|ИЗ
		|	ВТПериодичностьМедицинскихОсмотровРабочихМест КАК ПериодичностьМедицинскихОсмотров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО ПериодичностьМедицинскихОсмотров.Позиция = СвязиРабочихМестСПозициями.Позиция
		|СГРУППИРОВАТЬ ПО
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр),
		|	ПериодичностьМедицинскихОсмотров.КратностьОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ПериодичностьОсмотра,
		|	ПериодичностьМедицинскихОсмотров.ЕдиницаПериодичностиОсмотра,
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ПредставлениеПериодичностиОсмотра КАК СТРОКА(1000)),
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВредныеФакторыПолноеПредставление КАК СТРОКА(1000)),
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВидыРаботПолноеПредставление КАК СТРОКА(1000)),
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВредныеФакторыКодыПредставление КАК СТРОКА(1000)),
		|	ВЫРАЗИТЬ(ПериодичностьМедицинскихОсмотров.ВидыРаботКодыПредставление КАК СТРОКА(1000))
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Период КАК Период,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Позиция КАК Позиция,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр) КАК ВидОсмотра,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Направление КАК Направление,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Заключение КАК Заключение,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Организация КАК Организация
		|ИЗ
		|	ВТВыданныеНаправленияНаМедицинскийОсмотр КАК ВыданныеНаправленияНаМедицинскийОсмотр
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО ВыданныеНаправленияНаМедицинскийОсмотр.Позиция = СвязиРабочихМестСПозициями.Позиция
		|СГРУППИРОВАТЬ ПО
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Период,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.ФизическоеЛицо,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Позиция,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.ГоловнаяОрганизация,
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр),
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Направление,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Заключение,
		|	ВыданныеНаправленияНаМедицинскийОсмотр.Организация
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МедицинскиеОсмотры.Период КАК Период,
		|	МедицинскиеОсмотры.Регистратор КАК Регистратор,
		|	МедицинскиеОсмотры.НомерСтроки КАК НомерСтроки,
		|	МедицинскиеОсмотры.Активность КАК Активность,
		|	МедицинскиеОсмотры.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МедицинскиеОсмотры.Позиция КАК Позиция,
		|	МедицинскиеОсмотры.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр) КАК ВидОсмотра,
		|	МедицинскиеОсмотры.РезультатОсмотра КАК РезультатОсмотра,
		|	МедицинскиеОсмотры.Организация КАК Организация,
		|	МедицинскиеОсмотры.ТипОсмотра КАК ТипОсмотра,
		|	МедицинскиеОсмотры.Направление КАК Направление
		|ИЗ
		|	ВТМедицинскиеОсмотры КАК МедицинскиеОсмотры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО МедицинскиеОсмотры.Позиция = СвязиРабочихМестСПозициями.Позиция
		|СГРУППИРОВАТЬ ПО
		|	МедицинскиеОсмотры.Период,
		|	МедицинскиеОсмотры.Регистратор,
		|	МедицинскиеОсмотры.НомерСтроки,
		|	МедицинскиеОсмотры.Активность,
		|	МедицинскиеОсмотры.ФизическоеЛицо,
		|	МедицинскиеОсмотры.Позиция,
		|	МедицинскиеОсмотры.ГоловнаяОрганизация,
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр),
		|	МедицинскиеОсмотры.РезультатОсмотра,
		|	МедицинскиеОсмотры.Организация,
		|	МедицинскиеОсмотры.ТипОсмотра,
		|	МедицинскиеОсмотры.Направление
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|ПО
		|	Регистратор
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МедицинскиеДокументы.Ссылка КАК Ссылка,
		|	СвязиРабочихМестСПозициями.РабочееМесто КАК РабочееМесто,
		|	СвязиРабочихМестСПозициями.РабочееМесто.Подразделение КАК Подразделение,
		|	СвязиРабочихМестСПозициями.РабочееМесто.Должность КАК Должность,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр) КАК ВидОсмотра
		|ИЗ
		|	ВТМедицинскиеДокументы КАК МедицинскиеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСвязиРабочихМестСПозициями КАК СвязиРабочихМестСПозициями
		|		ПО МедицинскиеДокументы.Позиция = СвязиРабочихМестСПозициями.Позиция
		|СГРУППИРОВАТЬ ПО
		|	МедицинскиеДокументы.Ссылка,
		|	СвязиРабочихМестСПозициями.РабочееМесто,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОбследований.МедицинскийОсмотр)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВредныеФакторыИВидыРаботРабочегоМестаОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВредныеФакторыРабочегоМестаОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВидыРаботРабочегоМестаОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПериодичностьМедицинскихОсмотровРабочихМестОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВыданныеНаправленияНаМедицинскийОсмотрОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТМедицинскиеОсмотрыОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНаправлениеНаМедицинскийОсмотрОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЗаключениеМедицинскогоОсмотраОбработанные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВредныеФакторыИВидыРаботПозицииШтатногоРасписания
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВредныеФакторыПозицииШтатногоРасписания
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВидыРаботПозицииШтатногоРасписания
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПериодичностьМедицинскихОсмотровРабочихМест
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВыданныеНаправленияНаМедицинскийОсмотр
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТМедицинскиеОсмотры
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНаправлениеНаМедицинскийОсмотр
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЗаключениеМедицинскогоОсмотра
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТМедицинскиеДокументы
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСвязиРабочихМестСПозициямиНеОтобранные
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСвязиРабочихМестСПозициями";
		
КонецФункции

Процедура ОбработатьДокументыМедицинскихОсмотров(ВыборкаДокументов)

	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументСсылка = ВыборкаДокументов.Ссылка;
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ДокументСсылка.Метаданные().ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		Блокировка.Заблокировать();
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(ДокументСсылка);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ВыборкаДокументов, , "Ссылка");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ОбновитьПериодическиеОсмотрыНазначенныхРабочихМест(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМестаСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РабочиеМестаСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	РегистрСведений.РабочиеМестаСотрудников КАК РабочиеМестаСотрудников";
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, , Неопределено);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Выборка = ОбновляемыеДанные.Выбрать();
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеПериодическихОсмотров();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОбновления.Добавить(), Выборка);
	КонецЦикла;
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеПериодическихОсмотров(ТаблицаОбновления);
	ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
	
	ФизическиеЛица = ТаблицаОбновления.ВыгрузитьКолонку("ФизическоеЛицо");
	ЗапуститьОбновлениеПериодическихОсмотров(, ФизическиеЛица);
	
КонецПроцедуры

Процедура ЗаполнитьРабочиеМестаНовымиВреднымиФакторами(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Если Не Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ЕстьСоответствия() Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Отсутствуют соответствия вредных факторов по приказу 302н вредным факторам по приказу 29н'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка);
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТРабочиеМестаОбновленные
		|ИЗ
		|	РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМеста.Ссылка КАК РабочееМесто
		|ПОМЕСТИТЬ ВТРабочиеМестаКОбновлению
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
		|ГДЕ
		|	НЕ РабочиеМеста.Ссылка В (&Обработанные)
		|	И НЕ РабочиеМеста.ЭтоГруппа
		|	И НЕ РабочиеМеста.ВАрхиве
		|	И НЕ РабочиеМеста.ВредныеФакторыСопоставлены
		|	И НЕ РабочиеМеста.Ссылка В
		|		(ВЫБРАТЬ
		|			РабочиеМестаОбновленные.РабочееМесто
		|		ИЗ
		|			ВТРабочиеМестаОбновленные КАК РабочиеМестаОбновленные)";
	
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, "ВТРабочиеМестаКОбновлению");
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыРабочегоМеста.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыРабочегоМеста
		|ИЗ
		|	РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|ГДЕ
		|	ВредныеФакторыРабочегоМеста.РабочееМесто В
		|		(ВЫБРАТЬ
		|			РабочиеМестаКОбновлению.РабочееМесто
		|		ИЗ
		|			ВТРабочиеМестаКОбновлению КАК РабочиеМестаКОбновлению)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыРаботРабочегоМеста.РабочееМесто,
		|	ВидыРаботРабочегоМеста.ВидРабот
		|ИЗ
		|	РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботРабочегоМеста
		|ГДЕ
		|	ВидыРаботРабочегоМеста.РабочееМесто В
		|		(ВЫБРАТЬ
		|			РабочиеМестаКОбновлению.РабочееМесто
		|		ИЗ
		|			ВТРабочиеМестаКОбновлению КАК РабочиеМестаКОбновлению)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеМестаКОбновлению.РабочееМесто КАК РабочееМесто,
		|	ВредныеФакторыРабочегоМеста.ВредныйФактор
		|ПОМЕСТИТЬ ВТРабочиеМестаСВреднымиФакторами
		|ИЗ
		|	ВТРабочиеМестаКОбновлению КАК РабочиеМестаКОбновлению
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|		ПО РабочиеМестаКОбновлению.РабочееМесто = ВредныеФакторыРабочегоМеста.РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоответствиеВредныхФакторов.Ссылка КАК ВредныйФактор302Н,
		|	СоответствиеВредныхФакторов.ВредныйФактор КАК ВредныйФактор29Н
		|ПОМЕСТИТЬ ВТСоответствиеВредныхФакторов
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы.СоответствующиеВредныеФакторы КАК СоответствиеВредныхФакторов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СоответствиеВредныхФакторов.Ссылка,
		|	СоответствиеВредныхФакторов.ВредныйФактор
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров.СоответствующиеВредныеФакторы КАК СоответствиеВредныхФакторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеМестаСВреднымиФакторами.РабочееМесто КАК РабочееМесто,
		|	РабочиеМестаСВреднымиФакторами.ВредныйФактор КАК ВредныйФактор302Н,
		|	СоответствиеВредныхФакторов.ВредныйФактор29Н КАК ВредныйФактор29Н,
		|	НЕ СоответствиеВредныхФакторов.ВредныйФактор29Н ЕСТЬ NULL КАК ЕстьСоответствие
		|ИЗ
		|	ВТРабочиеМестаСВреднымиФакторами КАК РабочиеМестаСВреднымиФакторами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВредныхФакторов КАК СоответствиеВредныхФакторов
		|		ПО РабочиеМестаСВреднымиФакторами.ВредныйФактор = СоответствиеВредныхФакторов.ВредныйФактор302Н
		|ИТОГИ
		|ПО
		|	РабочееМесто,
		|	ВредныйФактор302Н";
		
	БлокировкаДанных = Новый БлокировкаДанных;
	БлокировкаДанных.Добавить("РегистрСведений.ВредныеФакторыРабочегоМеста");
	БлокировкаДанных.Добавить("РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста");
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		
		ВыборкаРабочихМест = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		РабочиеМестаСНовымиФакторами = Новый Массив;
		
		Пока ВыборкаРабочихМест.Следующий() Цикл
			Обработанные.Добавить(ВыборкаРабочихМест.РабочееМесто);
			НовыеФакторы = Новый Массив;
			НаборЗаписей = РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РабочееМесто.Установить(ВыборкаРабочихМест.РабочееМесто);
			НаборЗаписей.Отбор.ВидОсмотра.Использование = Ложь;
			
			ВыборкаВредныхФакторов = ВыборкаРабочихМест.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			КоличествоФакторов = ВыборкаВредныхФакторов.Количество();
			ВредныеФакторыСопоставлены = Истина;
			Пока ВыборкаВредныхФакторов.Следующий() Цикл
				Если КоличествоФакторов = 1 И Не ЗначениеЗаполнено(ВыборкаВредныхФакторов.ВредныйФактор302Н) Тогда
					Прервать;
				КонецЕсли;
				Выборка = ВыборкаВредныхФакторов.Выбрать();
				Если Выборка.Количество() > 1 Тогда;
					ВредныеФакторыСопоставлены = Ложь;
				КонецЕсли;
				Пока Выборка.Следующий() Цикл
					Если Выборка.ЕстьСоответствие И НовыеФакторы.Найти(Выборка.ВредныйФактор29Н) = Неопределено Тогда
						НовыеФакторы.Добавить(Выборка.ВредныйФактор29Н);
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.РабочееМесто = ВыборкаРабочихМест.РабочееМесто;
						НоваяЗапись.ВредныйФактор = Выборка.ВредныйФактор29Н;
						НоваяЗапись.ВидОсмотра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ВредныйФактор29Н, "ВидОсмотра");
					Иначе
						ВредныеФакторыСопоставлены = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			НовыеФакторыДобавлены = НаборЗаписей.Количество() > 0;
			Если НовыеФакторыДобавлены Тогда
				РабочиеМестаСНовымиФакторами.Добавить(ВыборкаРабочихМест.РабочееМесто);
			КонецЕсли;
			Если ВредныеФакторыСопоставлены Или НовыеФакторыДобавлены Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
				
				РабочееМестоОбъект = ВыборкаРабочихМест.РабочееМесто.ПолучитьОбъект();
				ЗаблокироватьДанныеДляРедактирования(ВыборкаРабочихМест.РабочееМесто);
				РабочееМестоОбъект.ВредныеФакторыСопоставлены = ВредныеФакторыСопоставлены;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РабочееМестоОбъект);
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ПредставлениеОбработки = НСтр("ru = 'Заполнение рабочих мест вредными факторами из классификатора по приказу №29н'"); 
		ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновитьПериодичностьОсмотровРабочихМест(РабочиеМестаСНовымиФакторами, Перечисления.ВидыОбследований.МедицинскийОсмотр);
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
КонецПроцедуры

Процедура ЗаполнитьНаправленияЗаключенияНовымиВреднымиФакторами(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	Если Не Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ЕстьСоответствия() Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Отсутствуют соответствия вредных факторов по приказу 302н вредным факторам по приказу 29н'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка);
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыИВидыРаботНаправлений.Ссылка КАК Документ
		|ПОМЕСТИТЬ ВТНаправленияЗаключенияОбновленные
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр.ВредныеФакторыИВидыРабот КАК ВредныеФакторыИВидыРаботНаправлений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыИВидыРаботЗаключений.Ссылка
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра.ВредныеФакторыИВидыРабот КАК ВредныеФакторыИВидыРаботЗаключений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НаправлениеНаМедицинскийОсмотр.Ссылка КАК Документ
		|ПОМЕСТИТЬ ВТНаправленияЗаключенияКОбновлению
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр
		|ГДЕ
		|	НЕ НаправлениеНаМедицинскийОсмотр.Ссылка В (&Обработанные)
		|	И НЕ НаправлениеНаМедицинскийОсмотр.ПометкаУдаления
		|	И НЕ НаправлениеНаМедицинскийОсмотр.Ссылка В
		|		(ВЫБРАТЬ
		|			НаправленияЗаключенияОбновленные.Документ
		|		ИЗ
		|			ВТНаправленияЗаключенияОбновленные КАК НаправленияЗаключенияОбновленные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаключениеМедицинскогоОсмотра.Ссылка
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|ГДЕ
		|	НЕ ЗаключениеМедицинскогоОсмотра.Ссылка В (&Обработанные)
		|	И НЕ ЗаключениеМедицинскогоОсмотра.ПометкаУдаления
		|	И НЕ ЗаключениеМедицинскогоОсмотра.Ссылка В
		|		(ВЫБРАТЬ
		|			НаправленияЗаключенияОбновленные.Документ
		|		ИЗ
		|			ВТНаправленияЗаключенияОбновленные КАК НаправленияЗаключенияОбновленные)";
	
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, "ВТНаправленияЗаключенияКОбновлению");
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыНаправление.Ссылка КАК Документ,
		|	ВредныеФакторыНаправление.ВредныйФактор КАК ВредныйФактор
		|ПОМЕСТИТЬ ВТВредныеФакторыДокументов
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр.ВредныеФакторы КАК ВредныеФакторыНаправление
		|ГДЕ
		|	ВредныеФакторыНаправление.Ссылка В
		|		(ВЫБРАТЬ
		|			НаправленияЗаключенияКОбновлению.Документ
		|		ИЗ
		|			ВТНаправленияЗаключенияКОбновлению КАК НаправленияЗаключенияКОбновлению)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыРаботНаправление.Ссылка,
		|	ВидыРаботНаправление.ВидРабот
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр.ВидыРабот КАК ВидыРаботНаправление
		|ГДЕ
		|	ВидыРаботНаправление.Ссылка В
		|		(ВЫБРАТЬ
		|			НаправленияЗаключенияКОбновлению.Документ
		|		ИЗ
		|			ВТНаправленияЗаключенияКОбновлению КАК НаправленияЗаключенияКОбновлению)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВредныеФакторыЗаключение.Ссылка,
		|	ВредныеФакторыЗаключение.ВредныйФактор
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра.ВредныеФакторы КАК ВредныеФакторыЗаключение
		|ГДЕ
		|	ВредныеФакторыЗаключение.Ссылка В
		|		(ВЫБРАТЬ
		|			НаправленияЗаключенияКОбновлению.Документ
		|		ИЗ
		|			ВТНаправленияЗаключенияКОбновлению КАК НаправленияЗаключенияКОбновлению)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыРаботЗаключение.Ссылка,
		|	ВидыРаботЗаключение.ВидРабот
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра.ВидыРабот КАК ВидыРаботЗаключение
		|ГДЕ
		|	ВидыРаботЗаключение.Ссылка В
		|		(ВЫБРАТЬ
		|			НаправленияЗаключенияКОбновлению.Документ
		|		ИЗ
		|			ВТНаправленияЗаключенияКОбновлению КАК НаправленияЗаключенияКОбновлению)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаправленияЗаключенияКОбновлению.Документ КАК Документ,
		|	ВредныеФакторыДокументов.ВредныйФактор
		|ПОМЕСТИТЬ ВТДокументыСВреднымиФакторами
		|ИЗ
		|	ВТНаправленияЗаключенияКОбновлению КАК НаправленияЗаключенияКОбновлению
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВредныеФакторыДокументов КАК ВредныеФакторыДокументов
		|		ПО НаправленияЗаключенияКОбновлению.Документ = ВредныеФакторыДокументов.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоответствиеВредныхФакторов.Ссылка КАК ВредныйФактор302Н,
		|	СоответствиеВредныхФакторов.ВредныйФактор КАК ВредныйФактор29Н
		|ПОМЕСТИТЬ ВТСоответствиеВредныхФакторов
		|ИЗ
		|	Справочник.ВредныеОпасныеПроизводственныеФакторы.СоответствующиеВредныеФакторы КАК СоответствиеВредныхФакторов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СоответствиеВредныхФакторов.Ссылка,
		|	СоответствиеВредныхФакторов.ВредныйФактор
		|ИЗ
		|	Справочник.ВидыРаботМедицинскихОсмотров.СоответствующиеВредныеФакторы КАК СоответствиеВредныхФакторов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыСВреднымиФакторами.Документ КАК Документ,
		|	ДокументыСВреднымиФакторами.ВредныйФактор КАК ВредныйФактор302Н,
		|	СоответствиеВредныхФакторов.ВредныйФактор29Н КАК ВредныйФактор29Н,
		|	НЕ СоответствиеВредныхФакторов.ВредныйФактор29Н ЕСТЬ NULL КАК ЕстьСоответствие
		|ИЗ
		|	ВТДокументыСВреднымиФакторами КАК ДокументыСВреднымиФакторами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВредныхФакторов КАК СоответствиеВредныхФакторов
		|		ПО ДокументыСВреднымиФакторами.ВредныйФактор = СоответствиеВредныхФакторов.ВредныйФактор302Н
		|УПОРЯДОЧИТЬ ПО
		|	Документ
		|ИТОГИ
		|ПО
		|	Документ,
		|	ВредныйФактор302Н";
		
	БлокировкаДанных = Новый БлокировкаДанных;
	БлокировкаДанных.Добавить("Документ.НаправлениеНаМедицинскийОсмотр");
	БлокировкаДанных.Добавить("Документ.ЗаключениеМедицинскогоОсмотра");
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		
		ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДокументов.Следующий() Цикл
			Обработанные.Добавить(ВыборкаДокументов.Документ);
			ДокументОбъект = ВыборкаДокументов.Документ.ПолучитьОбъект();
			ВыборкаВредныхФакторов = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			КоличествоФакторов = ВыборкаВредныхФакторов.Количество();
			ВредныеФакторыСопоставлены = Истина;
			Пока ВыборкаВредныхФакторов.Следующий() Цикл
				Если КоличествоФакторов = 1 И Не ЗначениеЗаполнено(ВыборкаВредныхФакторов.ВредныйФактор302Н) Тогда
					Прервать;
				КонецЕсли;
				Выборка = ВыборкаВредныхФакторов.Выбрать();
				Если Выборка.Количество() > 1 Тогда;
					ВредныеФакторыСопоставлены = Ложь;
				КонецЕсли;
				Пока Выборка.Следующий() Цикл
					Если Выборка.ЕстьСоответствие Тогда
						ДокументОбъект.ВредныеФакторыИВидыРабот.Добавить().ВредныйФактор = Выборка.ВредныйФактор29Н;
					Иначе
						ВредныеФакторыСопоставлены = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Если ВредныеФакторыСопоставлены Или ДокументОбъект.ВредныеФакторыИВидыРабот.Количество() > 0 Тогда
				ДокументОбъект.ВредныеФакторыИВидыРабот.Свернуть("ВредныйФактор");
				ДокументОбъект.ВредныеФакторыИВидыРабот.Сортировать("ВредныйФактор");
				Если ТипЗнч(ВыборкаДокументов.Документ) = Тип("ДокументСсылка.ЗаключениеМедицинскогоОсмотра") И ДокументОбъект.Проведен Тогда
					ДокументОбъект.ЗаполнитьМедицинскиеОсмотрыПоВреднымФакторам();
				КонецЕсли;
				ЗаблокироватьДанныеДляРедактирования(ВыборкаДокументов.Документ);
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ПредставлениеОбработки = НСтр("ru = 'Заполнение медицинских документов вредными факторами из классификатора по приказу №29н'"); 
		ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
КонецПроцедуры

Процедура ЗаполнитьОрганизацииРабочихМест(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура("ОбработкаЗавершена");
	КонецЕсли;
	
	ИменаРегистров = Новый Массив;
	ИменаРегистров.Добавить("ВидыРаботМедицинскихОсмотровРабочегоМеста");
	ИменаРегистров.Добавить("ВредныеФакторыИВидыРаботРабочегоМеста");
	ИменаРегистров.Добавить("ВредныеФакторыРабочегоМеста");
	ИменаРегистров.Добавить("ПериодичностьМедицинскихОсмотровРабочихМест");
	
	БлокировкаДанных = Новый БлокировкаДанных;
	Для Каждого ИмяРегистра Из ИменаРегистров Цикл
		БлокировкаДанных.Добавить("РегистрСведений." + ИмяРегистра);
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		
		Для Каждого ИмяРегистра Из ИменаРегистров Цикл
			НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Прочитать();
			ЗаполнитьОрганизацию(НаборЗаписей);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЦикла;
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	Исключение
		ОтменитьТранзакцию();
		ПредставлениеОбработки = НСтр("ru = 'Заполнение организаций для рабочих мест в регистрах сведений медосмотров'");
		ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьПериодичностьОсмотровРабочихМестПоВредномуФактору(ВредныйФактор)
	
	РабочиеМеста = РабочиеМестаПоВредномуФактору(ВредныйФактор);
	
	ОбновитьПериодичностьОсмотровРабочихМест(РабочиеМеста, ВредныйФактор.ВидОсмотра);
	
КонецПроцедуры

Функция РабочиеМестаПоВредномуФактору(ВредныйФактор)
	
	Если ТипЗнч(ВредныйФактор) = Тип("СправочникСсылка.ВредныеОпасныеПроизводственныеФакторы") Тогда
		РегистрСведений = РегистрыСведений.ВредныеФакторыРабочегоМеста;
	Иначе
		РегистрСведений = РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста;
	КонецЕсли;
	
	НаборЗаписей = РегистрСведений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВредныйФактор.Установить(ВредныйФактор);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВредныйФактор.ВидОсмотра);
	НаборЗаписей.Прочитать();
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(НаборЗаписей.ВыгрузитьКолонку("РабочееМесто"));
	
КонецФункции

Процедура ОбновитьПериодичностьОсмотровРабочихМестПоВидуРабот(ВидРабот)
	
	РабочиеМеста = РабочиеМестаПоВидуРабот(ВидРабот);
	
	ОбновитьПериодичностьОсмотровРабочихМест(РабочиеМеста, ВидРабот.ВидОсмотра);
	
КонецПроцедуры

Функция РабочиеМестаПоВидуРабот(ВидРабот)
	
	НаборЗаписей = РегистрыСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидРабот.Установить(ВидРабот);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидРабот.ВидОсмотра);
	НаборЗаписей.Прочитать();
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(НаборЗаписей.ВыгрузитьКолонку("РабочееМесто"));
	
КонецФункции

Процедура ОбновитьЗависимыеДанныеПоНаборуВредныхФакторовВидовРабот(НаборЗаписей) Экспорт
	
	ОбновитьПериодичностьОсмотровРабочихМестПоНаборуВредныхФакторовВидовРабот(НаборЗаписей);
	ОбновитьВредныеФакторыНаправленийЗаключений(НаборЗаписей);
	ОбновитьВредныеФакторыРезультатовСпецоценки(НаборЗаписей);
	
КонецПроцедуры

Процедура ОбновитьПериодичностьОсмотровРабочихМестПоНаборуВредныхФакторовВидовРабот(НаборЗаписей) Экспорт
	
	Если Не НаборЗаписей.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = НаборЗаписей.ДополнительныеСвойства["ПрежнийНабор"];
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ПрежнийНабор, НаборЗаписей) Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеМеста = НаборЗаписей.ВыгрузитьКолонку("РабочееМесто");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РабочиеМеста, ПрежнийНабор.ВыгрузитьКолонку("РабочееМесто"), Истина);

	ВидыОсмотра = НаборЗаписей.ВыгрузитьКолонку("ВидОсмотра");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыОсмотра, ПрежнийНабор.ВыгрузитьКолонку("ВидОсмотра"), Истина);
	ВидыОсмотра = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВидыОсмотра);
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ВидОсмотра Из ВидыОсмотра Цикл
		ОбновитьПериодичностьОсмотровРабочихМест(РабочиеМеста, ВидОсмотра);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновитьРабочиеМестаПоСопоставленнымВреднымФакторам(ФакторОбъект)
	
	Если Не ФакторОбъект.ДополнительныеСвойства.Свойство("ПрежниеСоответствующиеВредныеФакторы") Тогда
		Возврат;
	КонецЕсли;
	
	ВредныйФактор = ФакторОбъект.Ссылка;
	ТаблицаПрежнихВредныхФакторов = ФакторОбъект.ДополнительныеСвойства.ПрежниеСоответствующиеВредныеФакторы;
	
	ВредныеФакторыПрежние = ТаблицаПрежнихВредныхФакторов.ВыгрузитьКолонку("ВредныйФактор");
	ВредныеФакторыНовые = ВредныйФактор.СоответствующиеВредныеФакторы.Выгрузить().ВыгрузитьКолонку("ВредныйФактор");
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ВредныеФакторыПрежние, ВредныеФакторыНовые) Тогда
		Возврат;
	КонецЕсли;
	
	ВредныеФакторыКДобавлению = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВредныеФакторыНовые, ВредныеФакторыПрежние);
	ВредныеФакторыКУдалению = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВредныеФакторыПрежние, ВредныеФакторыНовые);
	
	Если ВредныеФакторыКДобавлению.Количество() = 0 И ВредныеФакторыКУдалению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВредныйФактор) = Тип("СправочникСсылка.ВидыРаботМедицинскихОсмотров") Тогда
		РабочиеМеста = РабочиеМестаПоВидуРабот(ВредныйФактор);
	Иначе
		РабочиеМеста = РабочиеМестаПоВредномуФактору(ВредныйФактор);
		Если ТипЗнч(ВредныйФактор) = Тип("СправочникСсылка.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы") Тогда
			ВредныеФакторыКУдалению.Добавить(ВредныйФактор);
		КонецЕсли;
	КонецЕсли;
	
	ВидОсмотра = ВредныйФактор.ВидОсмотра;
	
	Для Каждого РабочееМесто Из РабочиеМеста Цикл
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста");
		ЭлементБлокировкиДанных.УстановитьЗначение("РабочееМесто", РабочееМесто);
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидОсмотра", ВидОсмотра);
		
		НаборФакторов = РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста.СоздатьНаборЗаписей();
		НаборФакторов.Отбор.РабочееМесто.Установить(РабочееМесто);
		НаборФакторов.Отбор.ВидОсмотра.Установить(ВидОсмотра);
		
		НачатьТранзакцию();
		Попытка
			БлокировкаДанных.Заблокировать();
			НаборФакторов.Прочитать();
			ВредныеФакторыРабочегоМеста = НаборФакторов.ВыгрузитьКолонку("ВредныйФактор");
			НовыеВредныеФакторыРабочегоМеста = ОбщегоНазначения.СкопироватьРекурсивно(ВредныеФакторыРабочегоМеста);
			Для Каждого ФакторКУдалению Из ВредныеФакторыКУдалению Цикл
				ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(НовыеВредныеФакторыРабочегоМеста, ФакторКУдалению);
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НовыеВредныеФакторыРабочегоМеста, ВредныеФакторыКДобавлению);
			НовыеВредныеФакторыРабочегоМеста = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НовыеВредныеФакторыРабочегоМеста);
			Если ОбщегоНазначения.КоллекцииИдентичны(ВредныеФакторыРабочегоМеста, НовыеВредныеФакторыРабочегоМеста) Тогда
				Продолжить;
			КонецЕсли;
			НаборФакторов.Очистить();
			Для Каждого НовыйФактор Из НовыеВредныеФакторыРабочегоМеста Цикл
				НоваяЗапись = НаборФакторов.Добавить();
				НоваяЗапись.РабочееМесто = РабочееМесто;
				НоваяЗапись.ВидОсмотра = ВидОсмотра;
				НоваяЗапись.ВредныйФактор = НовыйФактор;
			КонецЦикла;
			НаборФакторов.ДополнительныеСвойства.Вставить("ОбновитьНаправленияЗаключения", Истина);
			НаборФакторов.ДополнительныеСвойства.Вставить("ОбновитьРезультатыСпецоценки", Истина);
			НаборФакторов.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ПредставлениеОбработки = НСтр("ru = 'Обновление вредных факторов рабочего места'"); 
			ЗарегистрироватьОшибкуОбработкиМедицинскихОсмотров(ИнформацияОбОшибке(), ПредставлениеОбработки);
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
		
	ПроверитьРезультатСопоставлениеВредныхФакторовРабочегоМеста(РабочиеМеста);
		
КонецПроцедуры

Процедура ОбновитьВредныеФакторыНаправленийЗаключений(НаборЗаписей)
	
	Если Не НаборЗаписей.ДополнительныеСвойства.Свойство("ОбновитьНаправленияЗаключения") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НаборЗаписей.ДополнительныеСвойства["ОбновитьНаправленияЗаключения"] Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НаправлениеНаМедицинскийОсмотр.Ссылка КАК Документ,
		|	ЛОЖЬ КАК ПерезаполнятьМедосмотр
		|ИЗ
		|	Документ.НаправлениеНаМедицинскийОсмотр КАК НаправлениеНаМедицинскийОсмотр
		|ГДЕ
		|	НЕ НаправлениеНаМедицинскийОсмотр.ПометкаУдаления
		|	И НаправлениеНаМедицинскийОсмотр.РабочееМесто = &РабочееМесто
		|	И НаправлениеНаМедицинскийОсмотр.ВидОсмотра = &ВидОсмотра
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаключениеМедицинскогоОсмотра.Ссылка,
		|	ИСТИНА
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|ГДЕ
		|	НЕ ЗаключениеМедицинскогоОсмотра.ПометкаУдаления
		|	И ЗаключениеМедицинскогоОсмотра.РабочееМесто = &РабочееМесто
		|	И ЗаключениеМедицинскогоОсмотра.ВидОсмотра = &ВидОсмотра";
	
	Запрос.УстановитьПараметр("РабочееМесто", НаборЗаписей.Отбор.РабочееМесто.Значение);
	Запрос.УстановитьПараметр("ВидОсмотра", НаборЗаписей.Отбор.ВидОсмотра.Значение);
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументов.Документ.ПолучитьОбъект();
		ДокументОбъект.ВредныеФакторыИВидыРабот.Очистить();
		Для Каждого Запись Из НаборЗаписей Цикл
			ДокументОбъект.ВредныеФакторыИВидыРабот.Добавить().ВредныйФактор = Запись.ВредныйФактор;
		КонецЦикла;
		Если ВыборкаДокументов.ПерезаполнятьМедосмотр Тогда
			ДокументОбъект.ЗаполнитьМедицинскиеОсмотрыПоВреднымФакторам();
		КонецЕсли;
		ЗаблокироватьДанныеДляРедактирования(ВыборкаДокументов.Документ);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьВредныеФакторыРезультатовСпецоценки(НаборЗаписей)
	
	Если Не НаборЗаписей.ДополнительныеСвойства.Свойство("ОбновитьРезультатыСпецоценки") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НаборЗаписей.ДополнительныеСвойства["ОбновитьРезультатыСпецоценки"] Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка КАК Документ,
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста КАК ИдентификаторСтрокиРабочегоМеста,
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка.Дата КАК Дата
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка,
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.ИдентификаторСтрокиРабочегоМеста,
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка.Дата
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто = &РабочееМесто
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|ПО
		|	Документ";
	
	// АПК:96 -вкл
	
	РабочееМесто = НаборЗаписей.Отбор.РабочееМесто.Значение;
	
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	
	ВидОсмотра = НаборЗаписей.Отбор.ВидОсмотра.Значение;
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументов.Документ.ПолучитьОбъект();
		ВыборкаИдентификаторов = ВыборкаДокументов.Выбрать();
		Пока ВыборкаИдентификаторов.Следующий() Цикл
			ДанныеПоиска = Новый Структура("ИдентификаторСтрокиРабочегоМеста", ВыборкаИдентификаторов.ИдентификаторСтрокиРабочегоМеста);
			НайденныеСтроки = ДокументОбъект.ВредныеФакторы.НайтиСтроки(ДанныеПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
				Если ЗначениеЗаполнено(НайденнаяСтрока.ВредныйФактор)
				 И ВидОсмотра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НайденнаяСтрока.ВредныйФактор, "ВидОсмотра") Тогда 
					ДокументОбъект.ВредныеФакторы.Удалить(НайденнаяСтрока); 
				КонецЕсли;
			КонецЦикла;
			Для Каждого Запись Из НаборЗаписей Цикл
				НоваяСтрока = ДокументОбъект.ВредныеФакторы.Добавить();
				НоваяСтрока.ВредныйФактор = Запись.ВредныйФактор;
				НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = ВыборкаИдентификаторов.ИдентификаторСтрокиРабочегоМеста;
			КонецЦикла;
		КонецЦикла;
		ЗаблокироватьДанныеДляРедактирования(ВыборкаДокументов.Документ);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла;
	
	ОбновитьВредныеФакторыРабочихМест(, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РабочееМесто));
	
КонецПроцедуры

Процедура ПроверитьРезультатСопоставлениеВредныхФакторовРабочегоМеста(РабочиеМеста)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РабочиеМестаОхраныТруда.Ссылка КАК РабочееМесто
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|ГДЕ
		|	НЕ РабочиеМестаОхраныТруда.ВредныеФакторыСопоставлены
		|	И РабочиеМестаОхраныТруда.Ссылка В (&РабочиеМеста)
		|	И (ВЫБОР
		|		КОГДА (РабочиеМестаОхраныТруда.Ссылка, ЛОЖЬ) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВредныеФакторыРабочегоМеста.РабочееМесто КАК РабочееМесто,
		|				ВредныеФакторыРабочегоМеста.ВредныйФактор.СоответствиеПодтверждено КАК СоответствиеПодтверждено
		|			ИЗ
		|				РегистрСведений.ВредныеФакторыРабочегоМеста КАК ВредныеФакторыРабочегоМеста
		|			ГДЕ
		|				ВредныеФакторыРабочегоМеста.РабочееМесто В (&РабочиеМеста)
		|
		|			ОБЪЕДИНИТЬ ВСЕ
		|
		|			ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВидыРаботМедицинскихОсмотров.РабочееМесто,
		|				ВидыРаботМедицинскихОсмотров.ВидРабот.СоответствиеПодтверждено
		|			ИЗ
		|				РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ВидыРаботМедицинскихОсмотров
		|			ГДЕ
		|				ВидыРаботМедицинскихОсмотров.РабочееМесто В (&РабочиеМеста)
		|
		|			ОБЪЕДИНИТЬ ВСЕ
		|
		|			ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто,
		|				ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор.СоответствиеПодтверждено
		|			ИЗ
		|				РегистрСведений.ВредныеФакторыИВидыРаботРабочегоМеста КАК ВредныеФакторыИВидыРаботРабочегоМеста
		|			ГДЕ
		|				ВредныеФакторыИВидыРаботРабочегоМеста.РабочееМесто В (&РабочиеМеста)
		|				И ВредныеФакторыИВидыРаботРабочегоМеста.ВредныйФактор.ВАрхиве)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ)";
	
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РабочееМестоОбъект = Выборка.РабочееМесто.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(Выборка.РабочееМесто);
		РабочееМестоОбъект.ВредныеФакторыСопоставлены = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РабочееМестоОбъект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
