#Область ПрограммныйИнтерфейс

// см. ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов()
Функция ПараметрыСохраненияФайлов() Экспорт
	Возврат ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов(); 
КонецФункции

// см. ФайловаяСистемаКлиент.СохранитьФайлы()
Процедура СохранитьФайлы(ОбработчикЗавершения, СохраняемыеФайлы, ПараметрыСохранения = Неопределено) Экспорт
	ФайловаяСистемаКлиент.СохранитьФайлы(ОбработчикЗавершения, СохраняемыеФайлы, ПараметрыСохранения);
КонецПроцедуры

// см. КриптографияКлиент.ОткрытьФормуВводаДанныхКриптография()
Процедура ОткрытьФормуВводаДанных(ОбработчикОповещения = Неопределено, ПараметрыФормы = Неопределено) Экспорт	
	КриптографияКлиент.ОткрытьФормуВводаДанныхКриптография(ОбработчикОповещения, ПараметрыФормы);	
КонецПроцедуры

// см. УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм
Функция НоваяКоллекцияПечатныхФорм(Знач Идентификаторы) Экспорт
	Возврат УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификаторы); 
КонецФункции

// см. УправлениеПечатьюКлиент.ПечатьДокументов
Процедура ПечатьДокументов(КоллекцияПечатныхФорм, Знач ОбъектыПечати = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбъектыПечати, ДополнительныеПараметры);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти