#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства
			И НЕ ТипЗнч(СтрокаНабора.Начисление) = Тип("СправочникСсылка.ВидыПрочихДоходовФизическихЛиц") Тогда
			
			ВызватьИсключение НСтр("ru = 'Расчет по виду дохода ""Доход субъекта предпринимательства"" производится через элементы справочника ""Виды прочих доходов"".'");
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20210101') Тогда
			
			Если СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства Тогда
				
				ВызватьИсключение НСтр("ru = 'Расчет по виду дохода ""Доход субъекта предпринимательства"" доступен с 2021 года.'");
				
			КонецЕсли;
				
		КонецЕсли;

		Если СтрокаНабора.Период < Дата('20230101') Тогда
			
			Если ЗначениеЗаполнено(СтрокаНабора.СпособОбложенияЕП)
				ИЛИ ЗначениеЗаполнено(СтрокаНабора.ДоходНеПодлежащийНалогообложениюЕП) Тогда
				
				ВызватьИсключение НСтр("ru = 'Установка параметров налогообложения единым платежом доступны в настройках учетной политики с 2023 года.'");
				
			КонецЕсли;
			
		КонецЕсли;

		Если СтрокаНабора.Период < Дата('20240101') Тогда
			
			Если ЗначениеЗаполнено(СтрокаНабора.СпособОбложенияОПВР)
				ИЛИ ЗначениеЗаполнено(СтрокаНабора.ДоходНеПодлежащийНалогообложениюОПВР) Тогда
				
				ВызватьИсключение НСтр("ru = 'Установка параметров налогообложения обязательными пенсионными взносами работодателя доступны в настройках учетной политики с 2024 года.'");
				
			КонецЕсли;
			
		КонецЕсли;

		Если СтрокаНабора.Период < Дата('20250101') Тогда
			
			Если СтрокаНабора.ВидДохода = ПредопределенноеЗначение("Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента")
				И (ЗначениеЗаполнено(СтрокаНабора.СпособОбложенияСО)
				ИЛИ ЗначениеЗаполнено(СтрокаНабора.ДоходНеПодлежащийНалогообложениюСО)) Тогда
				
				ВызватьИсключение НСтр("ru = 'Установка параметров налогообложения социальными отчислениями для доходов от налогового агента доступна в настройках учетной политики с 2025 года.'");
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;
	
	// Обновляем кэш платформы для зачитывания актуальных настроек
	// используется в ОтражениеЗарплатыВУчетеПовтИсп.ТаблицаНачислениеУдержаниеВидОперации.
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецЕсли