// КС-РК
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЗначений = Новый СписокЗначений;
	Для Каждого ТипЗаявки Из Перечисления.ТипыЗаявокКабинетСотрудника Цикл
		Если ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.СправкаНДФЛ
			ИЛИ ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ЗаявлениеНаНалоговыеВычеты Тогда
			Продолжить;
		КонецЕсли;
		СписокЗначений.Добавить(ТипЗаявки);
	КонецЦикла;
	
	ДанныеВыбора = СписокЗначений;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
// КС-РК