#Область ПрограммныйИнтерфейс

#Область СозданиеМетаданныхФормы

Процедура ОбработатьСозданиеМетаданныхФормы(Форма, Отказ = Ложь, СтандартнаяОбработка = Истина) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормы(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормыЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормыПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормыОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормыСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормыДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)  Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормыРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСозданиеМетаданныхФормыОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры)  Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСозданиеМетаданныхФормыОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработатьСобытияФормПриСозданииЧтенииЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииЧтенииЖурналДокументов(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииЧтенииПланВидовРасчета(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииОбработки(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииЧтенииСправочник(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииЧтенииДокумент(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииЧтенииРегистрСведений(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииЧтенииОбщаяФорма(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьСобытияФормПриСозданииЧтенииПланаОбмена(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт

	МодификацияКонфигурацииЗУПКОРПК.ОбработатьСобытияФормПриСозданииЧтенииПланаОбмена(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Функция ВидыДоходовВыплатыБывшимСотрудникам(ВидыДоходов) Экспорт
	
КонецФункции

Функция ВидыДоходовВидыПрочихДоходовФизическихЛиц(ВидыДоходов) Экспорт
	
КонецФункции

Функция ИдентификаторИнтернетПоддержки() Экспорт 

	Возврат КонфигурацииЗарплатаКадры.ИдентификаторИнтернетПоддержки();
	
КонецФункции

#КонецОбласти
