#Область ПрограммныйИнтерфейс

#Область ПроцедурыИФункцииМеханизмаАтозаполнения

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
// Пример:
//	Если ИДОтчета = "РегламентированныйОтчет210Форма" Тогда
//		Если ИДРедакцииОтчета = "ФормаОтчета2102016Кв1" Тогда
//			ЗаполнитьФорма2102016Кв1(ПараметрыОтчета, Контейнер);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ЗаполнитьОтчетРК(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	РегламентированнаяОтчетностьЗарплатаКадры.ЗаполнитьОтчетЗарплатаКадры(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВоинскийУчет") Тогда
		РегламентированнаяОтчетностьВоинскийУчетВызовСервера.ЗаполнитьОтчетВоинскийУчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьСписокРегламентированныхОтчетовРК(СписокРегламентированныхОтчетов) Экспорт
	
	//Налоговая отчетность
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчет200Форма");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчет210Форма");
	//Статистическая отчетность
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистика1ТКвартальная");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистика1ТЗП");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистика2ТПРОФ");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистика1ТГодовая");
    СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистика2ТОплатаТруда");
    
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВоинскийУчет") Тогда
		
		СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетВУСписокПризывников");
		СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетВУСписокПринятыхУволенных");
		СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетВУСведенияОЧисленностиПризывников");
		
	КонецЕсли; 
	
	// Свернем список отчетов
	ТаблицаОтчетов = Новый ТаблицаЗначений;
	ТаблицаОтчетов.Колонки.Добавить("Отчет", Новый ОписаниеТипов("Строка"));
	
	Для Каждого ТекОтчет Из СписокРегламентированныхОтчетов Цикл
		ТаблицаОтчетов.Добавить().Отчет = ТекОтчет.Значение;
	КонецЦикла;
	
	ТаблицаОтчетов.Свернуть("Отчет", "");
	
	СписокРегламентированныхОтчетов.ЗагрузитьЗначения(ТаблицаОтчетов.ВыгрузитьКолонку("Отчет"));
	
	Возврат СписокРегламентированныхОтчетов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСписокСтруктурныхЕдиниц(РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям", Налогоплательщик = Неопределено, НалоговыйКомитет = Неопределено, Дата = Неопределено) Экспорт
	
	Если РежимВыбораСтруктурныхЕдиниц = "ПоГоловнымОрганизациям" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация",  Налогоплательщик);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	1 КАК ВидСтроки,
		|	Организации.Ссылка КАК Ссылка,
		|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	Организации.Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	2,
		|	Организации.Ссылка,
		|	Организации.ГоловнаяОрганизация,
		|	Организации.Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ГоловнаяОрганизация = &Организация
		|	И Организации.ЕстьОбособленныеПодразделения = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидСтроки";
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НовыйЭлемент 				= СписокСтруктурныхЕдиниц.Добавить();
			НовыйЭлемент.Значение 		= Выборка.Ссылка;
			НовыйЭлемент.Представление 	= Выборка.Наименование;
		КонецЦикла;
		
	ИначеЕсли РежимВыбораСтруктурныхЕдиниц = "ПоНалогоплательщику" Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Налогоплательщик",  Налогоплательщик);
		Запрос.УстановитьПараметр("Дата", Дата);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения = """"
		|			ТОГДА ВЫРАЗИТЬ(ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК Справочник.Организации).Наименование
		|		ИНАЧЕ РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения
		|	КОНЕЦ КАК Наименование,
		|	1 КАК ВидСтроки,
		|	РегистрацииВНалоговомОргане.Владелец КАК Владелец,
		|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&Дата, ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.Организации)) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница.ГоловнаяОрганизация = &Налогоплательщик
		|   ИЛИ ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = &Налогоплательщик
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения = """"
		|			ТОГДА ВЫРАЗИТЬ(ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).Наименование
		|		ИНАЧЕ РегистрацииВНалоговомОргане.НаименованиеОбособленногоПодразделения
		|	КОНЕЦ,
		|	2,
		|	РегистрацииВНалоговомОргане.Владелец,
		|	РегистрацииВНалоговомОргане.Ссылка
		|ИЗ
		|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(
		|			&Дата,
		|			ТИПЗНАЧЕНИЯ(СтруктурнаяЕдиница) = ТИП(Справочник.ПодразделенияОрганизаций)
		|				И ВЫРАЗИТЬ(СтруктурнаяЕдиница КАК Справочник.ПодразделенияОрганизаций).ОбособленноеПодразделение) КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница.ГоловнаяОрганизация = &Налогоплательщик
		|   ИЛИ ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница = &Налогоплательщик
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидСтроки,
		|	Владелец,
		|	Наименование";
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НовыйЭлемент 				= СписокСтруктурныхЕдиниц.Добавить();
			НовыйЭлемент.Значение 		= Выборка.Ссылка;
			НовыйЭлемент.Представление 	= Выборка.Наименование;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат СписокСтруктурныхЕдиниц;
	
КонецФункции

Функция РегистрацияВНалоговомОргане(СтруктурнаяЕдиница, Знач ДатаАктуальности = Неопределено, РегистрацияВНалоговомОргане = Неопределено) Экспорт
	
	Возврат ЗарплатаКадры.РегистрацияВНалоговомОргане(СтруктурнаяЕдиница, ДатаАктуальности);
	
КонецФункции

Функция ИндивидуальныйПредприниматель(Организация) Экспорт
	
	Возврат Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
КонецФункции

Функция ЮридическоеЛицо(Организация) Экспорт
	
	Возврат Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходамДо2017() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток КАК ЗадолженностьПоДоходам
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
	|			КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)) КАК ВзаиморасчетыССотрудникамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|	ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(
	|			КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)) КАК ВзаиморасчетыСДепонентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходамДо2023() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	// 200.01 - остатки (в 200.01 - остатки на конец отчетного квартала, в 200.02, 200.05 только за отчетный квартал)	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток КАК ЗадолженностьПоДоходам
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыССотрудникамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|	ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСДепонентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходамДо2025() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы"))
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	// 200.01 - остатки (в 200.01 - остатки на конец отчетного квартала, в 200.02, 200.05 только за отчетный квартал)	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток КАК ЗадолженностьПоДоходам
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыССотрудникамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудникамиОстатки.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	(ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|	ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСДепонентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентамиОстатки.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентамиОстатки.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходам() Экспорт

	ЭтоКонфигурацияЗарплатногоУчета = ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета();
	
	// 200.01 - остатки (в 200.01 - остатки на конец отчетного квартала, в 200.02, 200.05 только за отчетный квартал)	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОстатки.СуммаВзаиморасчетовОстаток КАК ЗадолженностьПоДоходам
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыССотрудникамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудникамиОстатки.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудникамиОстатки.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|ГДЕ
	|	((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|ГДЕ
	|	((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(
	|			&парамПериодПо,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСДепонентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентамиОстатки.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентамиОстатки.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(&парамПериодПо, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходамПоФизическомуЛицуДо2023(ИспользуетсяВидДохода = Ложь) Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		СоединениеДивиденды = "И ЛОЖЬ";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;

	// 200.01 - остатки (в 200.01 - остатки на конец отчетного квартала, в 200.02, 200.05 только за отчетный квартал)	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОбороты.Период КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыССотрудникамиОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
	|	ВзаиморасчетыССотрудникамиОбороты.СуммаКВыплатеОборот КАК ЗадолженностьЗаКвартал,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения
	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоДоходам
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ПериодВзаиморасчетов МЕЖДУ &парамПериодС И &парамПериодПо
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыССотрудникамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	(ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			И НачислениеЗарплаты.Ссылка ЕСТЬ NULL
	|			ТОГДА 0 
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			И НачислениеПоДоговорам.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.ВыплатаБывшимСотрудникам
	|			И ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.РегистрацияПрочихДоходов 
	|			И РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ТОГДА 0 
	|		ИНАЧЕ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СуммаВзаиморасчетовОборот
	|	КОНЕЦ),
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = ВыплатаБывшимСотрудникам.Ссылка
	|			И (ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|			И ВыплатаБывшимСотрудникам.ПериодРегистрации МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = РегистрацияПрочихДоходов.Ссылка
	|			И (РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|			И РегистрацияПрочихДоходов.ПериодРегистрации МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = НачислениеЗарплаты.Ссылка
	|			И НачислениеЗарплаты.МесяцНачисления МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПоДоговорам КАК НачислениеПоДоговорам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = НачислениеПоДоговорам.Ссылка
	|			И НачислениеПоДоговорам.МесяцНачисления МЕЖДУ &парамПериодС И &парамПериодПо
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|				ИЛИ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентамиОстатки.Период,
	|	ВзаиморасчетыСДепонентамиОстатки.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВзаиморасчетыСДепонентамиОстатки.СуммаОборот,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСДепонентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентамиОстатки.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьПоДоходам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ЗадолженностьПоДоходам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗадолженностьПоДоходам.ФизЛицоСтруктурногоПодразделения КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользуетсяВидДохода, "
	|	ЗадолженностьПоДоходам.ВидДохода КАК ВидДохода,", "") + "
	|	СУММА(ЗадолженностьПоДоходам.ЗадолженностьЗаКвартал) КАК ЗадолженностьЗаКвартал
	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоДоходамФизЛицу
	|ИЗ
	|	ВТ_ЗадолженностьПоДоходам КАК ЗадолженностьПоДоходам
	|ГДЕ
	|	ЗадолженностьПоДоходам.ЗадолженностьЗаКвартал <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадолженностьПоДоходам.МесяцНалоговогоПериода,
	|	ЗадолженностьПоДоходам.ФизическоеЛицо,  
	|	ЗадолженностьПоДоходам.ФизЛицоСтруктурногоПодразделения
	|" + ?(ИспользуетсяВидДохода, ",
	|	ЗадолженностьПоДоходам.ВидДохода", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗадолженностьПоДоходам
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходамПоФизическомуЛицуДо2025(ИспользуетсяВидДохода = Ложь) Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы"))
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		СоединениеДивиденды = "И ЛОЖЬ";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;

	// 200.01 - остатки (в 200.01 - остатки на конец отчетного квартала, в 200.02, 200.05 только за отчетный квартал)	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОбороты.Период КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыССотрудникамиОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
	|	ВзаиморасчетыССотрудникамиОбороты.СуммаКВыплатеОборот КАК ЗадолженностьЗаКвартал,
	|	ВзаиморасчетыССотрудникамиОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения
	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоДоходам
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ПериодВзаиморасчетов МЕЖДУ &парамПериодС И &парамПериодПо
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыССотрудникамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудникамиОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудникамиОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	(ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			И НачислениеЗарплаты.Ссылка ЕСТЬ NULL
	|			ТОГДА 0 
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			И НачислениеПоДоговорам.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.ВыплатаБывшимСотрудникам
	|			И ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.РегистрацияПрочихДоходов 
	|			И РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ТОГДА 0 
	|		ИНАЧЕ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СуммаВзаиморасчетовОборот
	|	КОНЕЦ),
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = ВыплатаБывшимСотрудникам.Ссылка
	|			И (ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|			И ВыплатаБывшимСотрудникам.ПериодРегистрации МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = РегистрацияПрочихДоходов.Ссылка
	|			И (РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|			И РегистрацияПрочихДоходов.ПериодРегистрации МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = НачислениеЗарплаты.Ссылка
	|			И НачислениеЗарплаты.МесяцНачисления МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПоДоговорам КАК НачислениеПоДоговорам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = НачислениеПоДоговорам.Ссылка
	|			И НачислениеПоДоговорам.МесяцНачисления МЕЖДУ &парамПериодС И &парамПериодПо
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|				ИЛИ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентамиОбороты.Период,
	|	ВзаиморасчетыСДепонентамиОбороты.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВзаиморасчетыСДепонентамиОбороты.СуммаОборот,
	|	ВзаиморасчетыСДепонентамиОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСДепонентамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ),) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентамиОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентамиОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьПоДоходам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ЗадолженностьПоДоходам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗадолженностьПоДоходам.Организация КАК Организация,
	|	ЗадолженностьПоДоходам.ФизЛицоСтруктурногоПодразделения КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользуетсяВидДохода, "
	|	ЗадолженностьПоДоходам.ВидДохода КАК ВидДохода,", "") + "
	|	СУММА(ЗадолженностьПоДоходам.ЗадолженностьЗаКвартал) КАК ЗадолженностьЗаКвартал
	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоДоходамФизЛицу
	|ИЗ
	|	ВТ_ЗадолженностьПоДоходам КАК ЗадолженностьПоДоходам
	|ГДЕ
	|	ЗадолженностьПоДоходам.ЗадолженностьЗаКвартал <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадолженностьПоДоходам.МесяцНалоговогоПериода,
	|	ЗадолженностьПоДоходам.ФизическоеЛицо,  
	|	ЗадолженностьПоДоходам.Организация,
	|	ЗадолженностьПоДоходам.ФизЛицоСтруктурногоПодразделения
	|" + ?(ИспользуетсяВидДохода, ",
	|	ЗадолженностьПоДоходам.ВидДохода", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗадолженностьПоДоходам";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗадолженностьПоДоходамПоФизическомуЛицу(ИспользуетсяВидДохода = Ложь, ЗаполнятьДанные200_05 = Ложь) Экспорт

	ЭтоКонфигурацияЗарплатногоУчета = ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета();
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		СоединениеДивиденды = "И ЛОЖЬ";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;

	// 200.01 - остатки (в 200.01 - остатки на конец отчетного квартала, в 200.02, 200.05 только за отчетный квартал)	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыССотрудникамиОбороты.ПериодВзаиморасчетов КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыССотрудникамиОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
	|	ВзаиморасчетыССотрудникамиОбороты.СуммаКВыплатеОборот КАК ЗадолженностьЗаКвартал,
	|	ВзаиморасчетыССотрудникамиОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения
	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоДоходам
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате.Обороты(
	|			,
	|			,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ПериодВзаиморасчетов МЕЖДУ &парамПериодС И &парамПериодПо
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыССотрудникамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудникамиОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудникамиОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудникамиОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудникамиОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудникамиОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудникамиОбороты.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|ГДЕ
	|	((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			И НачислениеЗарплаты.Ссылка ЕСТЬ NULL
	|			ТОГДА 0 
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			И НачислениеПоДоговорам.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.ВыплатаБывшимСотрудникам
	|			И ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.РегистрацияПрочихДоходов 
	|			И РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ТОГДА 0 
	|		ИНАЧЕ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СуммаВзаиморасчетовОборот
	|	КОНЕЦ),
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = ВыплатаБывшимСотрудникам.Ссылка
	|			И (ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|			И ВыплатаБывшимСотрудникам.ПериодРегистрации МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = РегистрацияПрочихДоходов.Ссылка
	|			И (РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|			И РегистрацияПрочихДоходов.ПериодРегистрации МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = НачислениеЗарплаты.Ссылка
	|			И НачислениеЗарплаты.МесяцНачисления МЕЖДУ &парамПериодС И &парамПериодПо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПоДоговорам КАК НачислениеПоДоговорам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование = НачислениеПоДоговорам.Ссылка
	|			И НачислениеПоДоговорам.МесяцНачисления МЕЖДУ &парамПериодС И &парамПериодПо
	|ГДЕ
	|	((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|				ИЛИ ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаиморасчетыСДепонентамиОбороты.Период,
	|	ВзаиморасчетыСДепонентамиОбороты.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВзаиморасчетыСДепонентамиОбороты.СуммаОборот,
	|	ВзаиморасчетыСДепонентамиОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК ВзаиморасчетыСДепонентамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентамиОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентамиОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентамиОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОбороты.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|ГДЕ
	|	ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадолженностьПоДоходам.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ЗадолженностьПоДоходам.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗадолженностьПоДоходам.Организация КАК Организация,
	|	ЗадолженностьПоДоходам.ФизЛицоСтруктурногоПодразделения КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользуетсяВидДохода, "
	|	ЗадолженностьПоДоходам.ВидДохода КАК ВидДохода,", "") + "
	|	СУММА(ЗадолженностьПоДоходам.ЗадолженностьЗаКвартал) КАК ЗадолженностьЗаКвартал
	|ПОМЕСТИТЬ ВТ_ЗадолженностьПоДоходамФизЛицу
	|ИЗ
	|	ВТ_ЗадолженностьПоДоходам КАК ЗадолженностьПоДоходам
	|ГДЕ
	|	ЗадолженностьПоДоходам.ЗадолженностьЗаКвартал <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадолженностьПоДоходам.МесяцНалоговогоПериода,
	|	ЗадолженностьПоДоходам.ФизическоеЛицо,  
	|	ЗадолженностьПоДоходам.Организация,
	|	ЗадолженностьПоДоходам.ФизЛицоСтруктурногоПодразделения
	|" + ?(ИспользуетсяВидДохода, ",
	|	ЗадолженностьПоДоходам.ВидДохода", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗадолженностьПоДоходам";
	
	Если ЗаполнятьДанные200_05 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "парамПериодС", "парамПериодСНачалаГода");
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаДо2017() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ)
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ)") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание В (&ВидыОперацийИПН)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоКонтрагентамАкционерамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ИЗ
	|	ВТ_ВыплаченоДоходов КАК ВТ_ВыплаченоДоходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаДо2018() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ)
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ)") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание В (&ВидыОперацийИПН)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоКонтрагентамАкционерамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ИЗ
	|	ВТ_ВыплаченоДоходов КАК ВТ_ВыплаченоДоходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаДо2019() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ)
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ)") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоКонтрагентамАкционерамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ИЗ
	|	ВТ_ВыплаченоДоходов КАК ВТ_ВыплаченоДоходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаДо2023() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		// В УПК дивиденды не проходят через взаиморасчеты, всегда признаем как выплаченные по месяцу начисления
		СоединениеДивиденды = "";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов", "
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентами.ФизическоеЛицо ЕСТЬ NULL
	|				ТОГДА ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов") + "
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(&парамПериодПо, Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)) КАК ВзаиморасчетыСДепонентами
	|		ПО ВзаиморасчетыССотрудниками.Организация = ВзаиморасчетыСДепонентами.Организация
	|			И ВзаиморасчетыССотрудниками.Регистратор = ВзаиморасчетыСДепонентами.Ведомость
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ)
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ)") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|", "") + "
	// запрос используем в УПК и ЗУПК без привязки к ИспользоватьВедомостиДляВыплатыПрочихДоходов:
	// в ЗУПК всегда не выплачивается любой вид прочего дохода (признак РегистрироватьВыплатуВедомостью всегда ЛОЖЬ) признаем как выплаченные в месяце начисления
	// в УПК дивиденды не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления всегда
	// в УПК прочие доходы с признаком документа НЕ РегистрироватьВыплатуВедомостью не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|			ИЛИ ((НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам))") + ")
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ИЗ
	|	ВТ_ВыплаченоДоходов КАК ВТ_ВыплаченоДоходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаДо2025() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		// В УПК дивиденды не проходят через взаиморасчеты, всегда признаем как выплаченные по месяцу начисления
		СоединениеДивиденды = "";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;
	
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы"))
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов", "
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентами.ФизическоеЛицо ЕСТЬ NULL
	|				ТОГДА ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов") + "
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудниками.Организация = ПорядокОбложенияДоходовРаботников.Организация
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(&парамПериодПо, Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)) КАК ВзаиморасчетыСДепонентами
	|		ПО ВзаиморасчетыССотрудниками.Организация = ВзаиморасчетыСДепонентами.Организация
	|			И ВзаиморасчетыССотрудниками.Регистратор = ВзаиморасчетыСДепонентами.Ведомость
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ)
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентами.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ)") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|", "") + "
	// запрос используем в УПК и ЗУПК без привязки к ИспользоватьВедомостиДляВыплатыПрочихДоходов:
	// в ЗУПК всегда не выплачивается любой вид прочего дохода (признак РегистрироватьВыплатуВедомостью всегда ЛОЖЬ) признаем как выплаченные в месяце начисления
	// в УПК дивиденды не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления всегда
	// в УПК прочие доходы с признаком документа НЕ РегистрироватьВыплатуВедомостью не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|			ИЛИ ((НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам))") + ")
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ИЗ
	|	ВТ_ВыплаченоДоходов КАК ВТ_ВыплаченоДоходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДохода() Экспорт

	ЭтоКонфигурацияЗарплатногоУчета = ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета();
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		// В УПК дивиденды не проходят через взаиморасчеты, всегда признаем как выплаченные по месяцу начисления
		СоединениеДивиденды = "";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов", "
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентами.ФизическоеЛицо ЕСТЬ NULL
	|				ТОГДА ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов") + "
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудниками.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентами.Обороты(&парамПериодС, &парамПериодПо,, Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|			И ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_СписокРаботников.ФизическоеЛицо
	|			ИЗ
	|				ВТ_СписокРаботников)) КАК ВзаиморасчетыСДепонентами
	|		ПО ВзаиморасчетыССотрудниками.Организация = ВзаиморасчетыСДепонентами.Организация
	|			И ВзаиморасчетыССотрудниками.Регистратор = ВзаиморасчетыСДепонентами.Ведомость
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ)
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентами.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ)") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоВсехФизлиц КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// запрос используем в УПК и ЗУПК без привязки к ИспользоватьВедомостиДляВыплатыПрочихДоходов:
	// в ЗУПК всегда не выплачивается любой вид прочего дохода (признак РегистрироватьВыплатуВедомостью всегда ЛОЖЬ) признаем как выплаченные в месяце начисления
	// в УПК дивиденды не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления всегда
	// в УПК прочие доходы с признаком документа НЕ РегистрироватьВыплатуВедомостью не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL)
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ИЗ
	|	ВТ_ВыплаченоДоходов КАК ВТ_ВыплаченоДоходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаФизическомуЛицуДо2018() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ),
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо") + " 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание В (&ВидыОперацийИПН)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоКонтрагентамАкционерамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплаченоФизЛицу
	|ИЗ
	|	ВТ_ВыплаченоДоходовФизЛицу КАК ВТ_ВыплаченоДоходов
	|ГДЕ
	|	ВТ_ВыплаченоДоходов.ВыплаченоДоходов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаФизическомуЛицуДо2019() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ),
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоКонтрагентамАкционерамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоКонтрагентамАкционерамОбороты.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплаченоФизЛицу
	|ИЗ
	|	ВТ_ВыплаченоДоходовФизЛицу КАК ВТ_ВыплаченоДоходов
	|ГДЕ
	|	ВТ_ВыплаченоДоходов.ВыплаченоДоходов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаФизическомуЛицуДо2020() Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		СоединениеДивиденды = "И ЛОЖЬ";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ),
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|", "") + "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов,
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	|			ИЛИ ((НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам)
	|				И НЕ " + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "ИСТИНА", "ЛОЖЬ") + "))
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВыплаченоФизЛицу
	|ИЗ
	|	ВТ_ВыплаченоДоходовФизЛицу КАК ВТ_ВыплаченоДоходов
	|ГДЕ
	|	ВТ_ВыплаченоДоходов.ВыплаченоДоходов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо";  

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаФизическомуЛицуДо2021(ИспользуетсяВидДохода = Ложь) Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		СоединениеДивиденды = "И ЛОЖЬ";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов", "
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентами.ФизическоеЛицо ЕСТЬ NULL
	|				ТОГДА ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов") + "
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(&парамПериодПо, Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)) КАК ВзаиморасчетыСДепонентами
	|		ПО ВзаиморасчетыССотрудниками.Организация = ВзаиморасчетыСДепонентами.Организация
	|			И ВзаиморасчетыССотрудниками.Регистратор = ВзаиморасчетыСДепонентами.Ведомость
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ),
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|			И (НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ВТ_Гражданство.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО (ДивидендыФизическимЛицам.Ссылка = ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование)
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|", "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL 
	|			ТОГДА РегистрацияПрочихДоходовНалогиВзносыОтчисления.ВидДохода 
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНРасчетыСБывшимиСотрудниками)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСРасчетыСБывшимиСотрудниками)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды)
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыКонтрагентов)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыКонтрагентов)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов.НалогиВзносыОтчисления КАК РегистрацияПрочихДоходовНалогиВзносыОтчисления
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходовНалогиВзносыОтчисления.Ссылка
	|			И (НЕ РегистрацияПрочихДоходовНалогиВзносыОтчисления.Ссылка.РегистрироватьВыплатуВедомостью)
	|			И РегистрацияПрочихДоходовНалогиВзносыОтчисления.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ИПН)
	|			И НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо = РегистрацияПрочихДоходовНалогиВзносыОтчисления.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	|			ИЛИ ((НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам)))
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL 
	|			ТОГДА РегистрацияПрочихДоходовНалогиВзносыОтчисления.ВидДохода 
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНРасчетыСБывшимиСотрудниками)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСРасчетыСБывшимиСотрудниками)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВРасчетыСБывшимиСотрудниками)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды)
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыКонтрагентов)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыКонтрагентов)
	|				ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользуетсяВидДохода, "
	|	ВТ_ВыплаченоДоходов.ВидДохода КАК ВидДохода,", "") + "
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ПОМЕСТИТЬ ВТ_ВыплаченоФизЛицу
	|ИЗ
	|	ВТ_ВыплаченоДоходовФизЛицу КАК ВТ_ВыплаченоДоходов
	|ГДЕ
	|	ВТ_ВыплаченоДоходов.ВыплаченоДоходов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо,  
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения
	|" + ?(ИспользуетсяВидДохода, ",
	|	ВТ_ВыплаченоДоходов.ВидДохода", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаФизическомуЛицуДо2023(ИспользуетсяВидДохода = Ложь) Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		// В УПК дивиденды не проходят через взаиморасчеты, всегда признаем как выплаченные по месяцу начисления
		СоединениеДивиденды = "";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов", "
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентами.ФизическоеЛицо ЕСТЬ NULL
	|				ТОГДА ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов") + "
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(&парамПериодПо, Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)) КАК ВзаиморасчетыСДепонентами
	|		ПО ВзаиморасчетыССотрудниками.Организация = ВзаиморасчетыСДепонентами.Организация
	|			И ВзаиморасчетыССотрудниками.Регистратор = ВзаиморасчетыСДепонентами.Ведомость
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ),
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	// дивиденды не проходят через взаиморасчеты в УПК
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование = ВыплатаБывшимСотрудникам.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование = РегистрацияПрочихДоходов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|			И (НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ВТ_Гражданство.Период)
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|", "") + "
	// запрос используем в УПК и ЗУПК без привязки к ИспользоватьВедомостиДляВыплатыПрочихДоходов:
	// в ЗУПК всегда не выплачивается любой вид прочего дохода (признак РегистрироватьВыплатуВедомостью всегда ЛОЖЬ) признаем как выплаченные в месяце начисления
	// в УПК дивиденды не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления всегда
	// в УПК прочие доходы с признаком документа НЕ РегистрироватьВыплатуВедомостью не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	// в УПК если регистрация через прочие доходы и не регистрируется ведомостью, то сумма удержаний уже сидит в начисленных доходах
	|					" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, " ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)", "") + "
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	// в УПК случае отсутствия выплат через ведомость уменьшим на сумму удержания, тк она уже сидит в сумме начисления
	|		КОНЕЦ " + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, " - ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)
	|				И ((НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|					И НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|				ИЛИ (НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|					И НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью))
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ", "") + ") КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью
	|				ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью
	|				ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	// В УПК отрежем НачислениеЗарплаты, НачислениеПоДоговорам тк они всегда идут через ведомости, но удержания признаем как выплаченный доход
	|			ИЛИ ((НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам)
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, " И ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)", "") + ")
	// удержания всегда признаем выплаченные, во взаиморасчетах они не отражаются, тк идут приходом с минусовой суммой
	|			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)
	|)
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользуетсяВидДохода, "
	|	ВТ_ВыплаченоДоходов.ВидДохода КАК ВидДохода,", "") + "
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ПОМЕСТИТЬ ВТ_ВыплаченоФизЛицу
	|ИЗ
	|	ВТ_ВыплаченоДоходовФизЛицу КАК ВТ_ВыплаченоДоходов
	|ГДЕ
	|	ВТ_ВыплаченоДоходов.ВыплаченоДоходов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо,  
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения
	|" + ?(ИспользуетсяВидДохода, ",
	|	ВТ_ВыплаченоДоходов.ВидДохода", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаФизическомуЛицуДо2025(ИспользуетсяВидДохода = Ложь) Экспорт

	ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		// В УПК дивиденды не проходят через взаиморасчеты, всегда признаем как выплаченные по месяцу начисления
		СоединениеДивиденды = "";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;
	
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьВедомостиДляВыплатыПрочихДоходов")
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы"))
		ИЛИ НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИспользоватьВедомостиДляВыплатыПрочихДоходов = Истина;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
	|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов", "
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентами.ФизическоеЛицо ЕСТЬ NULL
	|				ТОГДА ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов") + "
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудниками.Организация = ПорядокОбложенияДоходовРаботников.Организация
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентами.Остатки(&парамПериодПо, Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)) КАК ВзаиморасчетыСДепонентами
	|		ПО ВзаиморасчетыССотрудниками.Организация = ВзаиморасчетыСДепонентами.Организация
	|			И ВзаиморасчетыССотрудниками.Регистратор = ВзаиморасчетыСДепонентами.Ведомость
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ),
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
	|	ВзаиморасчетыССотрудниками.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВзаиморасчетыСДепонентами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентами.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ВзаиморасчетыСДепонентами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	НачисленияУдержанияПоСотрудникамОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|			ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, "
	// дивиденды не проходят через взаиморасчеты в УПК
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование = ВыплатаБывшимСотрудникам.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование = РегистрацияПрочихДоходов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|			И (НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ВТ_Гражданство.Период)
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И (ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|", "") + "
	// запрос используем в УПК и ЗУПК без привязки к ИспользоватьВедомостиДляВыплатыПрочихДоходов:
	// в ЗУПК всегда не выплачивается любой вид прочего дохода (признак РегистрироватьВыплатуВедомостью всегда ЛОЖЬ) признаем как выплаченные в месяце начисления
	// в УПК дивиденды не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления всегда
	// в УПК прочие доходы с признаком документа НЕ РегистрироватьВыплатуВедомостью не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	НачисленияУдержанияПоКонтрагентамАкционерам.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	// в УПК если регистрация через прочие доходы и не регистрируется ведомостью, то сумма удержаний уже сидит в начисленных доходах
	|					" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, " ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)", "") + "
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	// в УПК случае отсутствия выплат через ведомость уменьшим на сумму удержания, тк она уже сидит в сумме начисления
	|		КОНЕЦ " + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, " - ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)
	|				И ((НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|					И НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|				ИЛИ (НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|					И НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью))
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ", "") + ") КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью
	|				ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью
	|				ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	// В УПК отрежем НачислениеЗарплаты, НачислениеПоДоговорам тк они всегда идут через ведомости, но удержания признаем как выплаченный доход
	|			ИЛИ ((НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам)
	|" + ?(ИспользоватьВедомостиДляВыплатыПрочихДоходов, " И ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)", "") + ")
	// удержания всегда признаем выплаченные, во взаиморасчетах они не отражаются, тк идут приходом с минусовой суммой
	|			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)
	|)
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	НачисленияУдержанияПоКонтрагентамАкционерам.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ВыплаченоДоходов.Организация КАК Организация,
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользуетсяВидДохода, "
	|	ВТ_ВыплаченоДоходов.ВидДохода КАК ВидДохода,", "") + "
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ПОМЕСТИТЬ ВТ_ВыплаченоФизЛицу
	|ИЗ
	|	ВТ_ВыплаченоДоходовФизЛицу КАК ВТ_ВыплаченоДоходов
	|ГДЕ
	|	ВТ_ВыплаченоДоходов.ВыплаченоДоходов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо,  
	|	ВТ_ВыплаченоДоходов.Организация,
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения
	|" + ?(ИспользуетсяВидДохода, ",
	|	ВТ_ВыплаченоДоходов.ВидДохода", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВыплаченоДоходовФизЛицу";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаВыплаченоДоходаФизическомуЛицу(ИспользуетсяВидДохода = Ложь, ЗаполнятьДанные200_05 = Ложь) Экспорт

	ЭтоКонфигурацияЗарплатногоУчета = ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета();
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		ИмяДокументаДивиденды = "НачислениеДивидендов";	
		// В УПК дивиденды не проходят через взаиморасчеты, всегда признаем как выплаченные по месяцу начисления
		СоединениеДивиденды = "";	
	Иначе
		ИмяДокументаДивиденды = "ДивидендыФизическимЛицам";
		СоединениеДивиденды = "И (НЕ ДивидендыФизическимЛицам.РегистрироватьВыплатуВедомостью)";	
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя) КАК ВидДохода,
	|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК ВыплаченоДоходов", "
	|	СУММА(ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентами.ФизическоеЛицо ЕСТЬ NULL
	|				ТОГДА ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыплаченоДоходов") + "
	|ПОМЕСТИТЬ ВТ_ВыплаченоДоходовФизЛицу
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыССотрудниками.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыССотрудниками.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыССотрудниками.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентами.Обороты(&парамПериодС, &парамПериодПо,, Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|			И ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_СписокРаботников.ФизическоеЛицо
	|			ИЗ
	|				ВТ_СписокРаботников)) КАК ВзаиморасчетыСДепонентами
	|		ПО ВзаиморасчетыССотрудниками.Организация = ВзаиморасчетыСДепонентами.Организация
	|			И ВзаиморасчетыССотрудниками.Регистратор = ВзаиморасчетыСДепонентами.Ведомость
	|			И ВзаиморасчетыССотрудниками.ФизическоеЛицо = ВзаиморасчетыСДепонентами.ФизическоеЛицо") + "
	|ГДЕ
	|	ВзаиморасчетыССотрудниками.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыССотрудниками.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыССотрудниками.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ),
	|	ВзаиморасчетыССотрудниками.ФизическоеЛицо,
	|	ВзаиморасчетыССотрудниками.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	// в УПК исключим регистр ВзаиморасчетыСДепонентами
	|" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, "", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя),
	|	ВзаиморасчетыСДепонентами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСДепонентами.Сумма)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСДепонентами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И ВзаиморасчетыСДепонентами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО ВзаиморасчетыСДепонентами.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|ГДЕ
	|	ВзаиморасчетыСДепонентами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСДепонентами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСДепонентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ВзаиморасчетыСДепонентами.ФизическоеЛицо В
	|			(ВЫБРАТЬ
	|				ВТ_Гражданство.ФИО
	|			ИЗ
	|				ВТ_Гражданство)
	|	И ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В(&парамСписокСтруктурныхЕдиниц)
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.Период, МЕСЯЦ),
	|	ВзаиморасчетыСДепонентами.ФизическоеЛицо,
	|	ВзаиморасчетыСДепонентами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	ЕСТЬNULL(НалогообложениеНачислений.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)),
	|	НачисленияУдержанияПоСотрудникамОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Удержания
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА ПланВидовРасчета.Начисления
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме)
	|					ИЛИ НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание ССЫЛКА Перечисление.ВидыОсобыхНачисленийИУдержаний
	|						И НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание В (&ВидыОсобыхНачисленийУдержаний)
	|				ТОГДА НачисленияУдержанияПоСотрудникамОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
	|			&парамПериодС,
	|			&парамПериодПо,
	|			Месяц,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_СписокОрганизаций.Ссылка
	|					ИЗ
	|						ВТ_СписокОрганизаций)
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						ВТ_Гражданство.ФИО
	|					ИЗ
	|						ВТ_Гражданство)
	|				И ФизическоеЛицо <> &парамИндивидуальныйПредприниматель) КАК НачисленияУдержанияПоСотрудникамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ВТ_Гражданство.Период
	|			И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПорядокОбложенияДоходовРаботников КАК ПорядокОбложенияДоходовРаботников
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.Организация = ПорядокОбложенияДоходовРаботников.Организация
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ) = ПорядокОбложенияДоходовРаботников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ), ) КАК НалогообложениеНачислений
	|		ПО НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание = НалогообложениеНачислений.Начисление
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникамОбороты.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.Общеустановленный)
	|			ИЛИ (ПорядокОбложенияДоходовРаботников.ПорядокОбложенияДоходов = ЗНАЧЕНИЕ(Перечисление.ПорядокОбложенияДоходовРаботников.ЕдиныйПлатеж)
	|				И ЕСТЬNULL(ВТ_Гражданство.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыФизическихЛицНалогоплательщиков.Нерезидент)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникамОбороты.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоСотрудникамОбороты.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникамОбороты.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникамОбороты.Организация,
	|	ЕСТЬNULL(НалогообложениеНачислений.ВидДохода, ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)),
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// дивиденды не проходят через взаиморасчеты в УПК
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов) КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование = ВыплатаБывшимСотрудникам.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование = РегистрацияПрочихДоходов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Гражданство КАК ВТ_Гражданство
	|		ПО ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо = ВТ_Гражданство.ФИО
	|			И (НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ) = ВТ_Гражданство.Период)
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентамиАкционерами.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо,
	|	ВзаиморасчетыСКонтрагентамиАкционерами.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	// запрос используем в УПК и ЗУПК без привязки к ИспользоватьВедомостиДляВыплатыПрочихДоходов:
	// в ЗУПК всегда не выплачивается любой вид прочего дохода (признак РегистрироватьВыплатуВедомостью всегда ЛОЖЬ) признаем как выплаченные в месяце начисления
	// в УПК дивиденды не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления всегда
	// в УПК прочие доходы с признаком документа НЕ РегистрироватьВыплатуВедомостью не проходят через взаиморасчеты и их суммы нужно учесть как выплаченные в месяце начисления
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	НачисленияУдержанияПоКонтрагентамАкционерам.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыВыплатБывшимСотрудникам
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание ССЫЛКА Справочник.ВидыПрочихДоходовФизическихЛиц
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги)
	|					ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание = ЗНАЧЕНИЕ(Перечисление.ВидыОсобыхНачисленийИУдержаний.Дивиденды)
	// в УПК если регистрация через прочие доходы и не регистрируется ведомостью, то сумма удержаний уже сидит в начисленных доходах
	|					" + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, " ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)", "") + "
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ - ВЫБОР
	|			КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание В (&ВидыНалоговВзносов)
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	// в УПК случае отсутствия выплат через ведомость уменьшим на сумму удержания, тк она уже сидит в сумме начисления
	|		КОНЕЦ " + ?(НЕ ЭтоКонфигурацияЗарплатногоУчета, " - ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)
	|				И ((НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|					И НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью)
	|				ИЛИ (НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|					И НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью))
	|				ТОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ", "") + ") КАК ВыплаченоДоходов
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам КАК НачисленияУдержанияПоКонтрагентамАкционерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыплатаБывшимСотрудникам КАК ВыплатаБывшимСотрудникам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ВыплатаБывшимСотрудникам.Ссылка
	|			И (НЕ ВыплатаБывшимСотрудникам.РегистрироватьВыплатуВедомостью
	|				ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеВыплатаБывшимСотрудникам
	|		ПО ВыплатаБывшимСотрудникам.ВидВыплаты = НалогообложениеВыплатаБывшимСотрудникам.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПрочихДоходов КАК РегистрацияПрочихДоходов
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = РегистрацияПрочихДоходов.Ссылка
	|			И (НЕ РегистрацияПрочихДоходов.РегистрироватьВыплатуВедомостью
	|				ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодПо, МЕСЯЦ)) КАК НалогообложениеРегистрацияПрочихДоходов
	|		ПО РегистрацияПрочихДоходов.ВидПрочегоДохода = НалогообложениеРегистрацияПрочихДоходов.Начисление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ." + ИмяДокументаДивиденды + " КАК ДивидендыФизическимЛицам
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор = ДивидендыФизическимЛицам.Ссылка
	|			" + СоединениеДивиденды + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоОрганизациям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Организация = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияРегистрацийВНалоговомОргане КАК ИсторияРегистрацийВНалоговомОрганеПоПодразделениям
	|		ПО НачисленияУдержанияПоКонтрагентамАкционерам.Подразделение = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.СтруктурнаяЕдиница
	|			И НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ) = ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.Период
	|ГДЕ
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо <> &парамИндивидуальныйПредприниматель
	|	И ((ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)
	|				И ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане ЕСТЬ NULL)
	|			ИЛИ (ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане В (&парамСписокСтруктурныхЕдиниц)))
	|	И (НЕ РегистрацияПрочихДоходов.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ВыплатаБывшимСотрудникам.Ссылка ЕСТЬ NULL
	|			ИЛИ НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL
	// В УПК отрежем НачислениеЗарплаты, НачислениеПоДоговорам тк они всегда идут через ведомости, но удержания признаем как выплаченный доход
	|			ИЛИ ((НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам)
	|			И ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания))
	// удержания всегда признаем выплаченные, во взаиморасчетах они не отражаются, тк идут приходом с минусовой суммой
	|			ИЛИ ТИПЗНАЧЕНИЯ(НачисленияУдержанияПоКонтрагентамАкционерам.НачислениеУдержание) = ТИП(ПланВидовРасчета.Удержания)
	|)
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Период МЕЖДУ &парамПериодС И &парамПериодПо
	|	И НачисленияУдержанияПоКонтрагентамАкционерам.Организация В
	|			(ВЫБРАТЬ
	|				ВТ_СписокОрганизаций.Ссылка
	|			ИЗ
	|				ВТ_СписокОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоКонтрагентамАкционерам.Период, МЕСЯЦ),
	|	НачисленияУдержанияПоКонтрагентамАкционерам.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеЗарплаты
	|			ИЛИ НачисленияУдержанияПоКонтрагентамАкционерам.Регистратор ССЫЛКА Документ.НачислениеПоДоговорам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтНалоговогоАгента) 
	|		КОГДА НЕ НалогообложениеРегистрацияПрочихДоходов.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеРегистрацияПрочихДоходов.ВидДохода 
	|		КОГДА НЕ НалогообложениеВыплатаБывшимСотрудникам.ВидДохода ЕСТЬ NULL 
	|			ТОГДА НалогообложениеВыплатаБывшимСотрудникам.ВидДохода 
	|		КОГДА НЕ ДивидендыФизическимЛицам.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыДоходов.Дивиденды) 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПрочиеДоходы)
	|	КОНЕЦ,
	|	НачисленияУдержанияПоКонтрагентамАкционерам.Организация,
	|	ВЫБОР
	|		КОГДА ИсторияРегистрацийВНалоговомОрганеПоОрганизациям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|				ИЛИ ИсторияРегистрацийВНалоговомОрганеПоПодразделениям.РегистрацияВНалоговомОргане <> &парамРегистрацияГоловнойОрганизации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТ_ВыплаченоДоходов.Организация КАК Организация,
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения КАК ФизЛицоСтруктурногоПодразделения,
	|" + ?(ИспользуетсяВидДохода, "
	|	ВТ_ВыплаченоДоходов.ВидДохода КАК ВидДохода,", "") + "
	|	СУММА(ВТ_ВыплаченоДоходов.ВыплаченоДоходов) КАК ВыплаченоДоходов
	|ПОМЕСТИТЬ ВТ_ВыплаченоФизЛицу
	|ИЗ
	|	ВТ_ВыплаченоДоходовФизЛицу КАК ВТ_ВыплаченоДоходов
	|ГДЕ
	|	ВТ_ВыплаченоДоходов.ВыплаченоДоходов <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыплаченоДоходов.МесяцНалоговогоПериода,
	|	ВТ_ВыплаченоДоходов.ФизическоеЛицо,  
	|	ВТ_ВыплаченоДоходов.Организация,
	|	ВТ_ВыплаченоДоходов.ФизЛицоСтруктурногоПодразделения
	|" + ?(ИспользуетсяВидДохода, ",
	|	ВТ_ВыплаченоДоходов.ВидДохода", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВыплаченоДоходовФизЛицу";

	Если ЗаполнятьДанные200_05 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "парамПериодС", "парамПериодСНачалаГода");
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстСтруктурныхЕдиницПоГоловнойОрганизации () Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	1 КАК ВидСтроки,
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ГоловнаяОрганизация КАК Владелец,
	|	Организации.Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2,
	|	Организации.Ссылка,
	|	Организации.ГоловнаяОрганизация,
	|	Организации.Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &Организация
	|	И Организации.ЕстьОбособленныеПодразделения = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСтроки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ДанныеДляЗаполненияРегламентированнойОтчетностиЗарплатаКадры(Вариант, ПараметрыОтчета, ДанныеОтчета) Экспорт
	
	СхемаКомпоновки = Отчеты.СтатистикаПерсонала.ПолучитьМакет("СхемаКомпоновкиДанныхКадрыЗарплата");
	
	ПараметрыОтчета.Вставить("Вариант", Вариант);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, СхемаКомпоновки.ВариантыНастроек[Вариант].Настройки);
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, НастройкиВарианта) Экспорт 
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаВыборки;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.мДатаКонцаПериодаОтчета;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", Вариант);
	
	ПараметрПериод = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "Период");
	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ПериодОтчета");
	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("ЭтоШтатноеРасписание") Тогда
		ЗначениеПараметра = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ДатаАктуальности");
		Если ЗначениеПараметра <> Неопределено Тогда
			Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("Дата") 
				Или ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала") Тогда
				ДатаАктуальности = Дата(ЗначениеПараметра.Значение);
				Если ДатаАктуальности = '00010101' Тогда
					ЗначениеПараметра.Значение = КонецКвартала(ДатаКонцаПериодаОтчета);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПараметрыОтчета.Свойство("ЭтоКадроваяИстория") И ПараметрыОтчета.ЭтоКадроваяИстория Тогда
		ПараметрПериод.Значение.ДатаНачала = '19000101';
		ПараметрПериод.Значение.ДатаОкончания = ДатаНачалаПериодаОтчета-86400;
		КоллекцияПользовательскихПолей = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы;
		Если ПараметрыОтчета.Свойство("Годовая1Т") Тогда
			СтруктураПользовательскихПолей = Новый Структура;
			СоответствияПолейНомерамПользовательскихКолонок = Новый Соответствие;
			Для Каждого ПользовательскоеПоле Из КоллекцияПользовательскихПолей Цикл
				СтруктураПользовательскихПолей.Вставить(ПользовательскоеПоле.Заголовок, ПользовательскоеПоле);
				СоответствияПолейНомерамПользовательскихКолонок.Вставить(ПользовательскоеПоле.Заголовок, СтрЗаменить(ПользовательскоеПоле.ПутьКДанным, ".", ""));
			КонецЦикла;
			ПараметрыОтчета.Вставить("СоответствияПолейНомерамПользовательскихКолонок", СоответствияПолейНомерамПользовательскихКолонок);
			Если ПараметрыОтчета.мДатаНачалаПериодаОтчета >= Дата('20250101') Тогда
				РегламентированнаяОтчетностьЗарплатаКадры.НастроитьСоответствияПоРазделу_7_8_1ТГодовая_2025Кв1(СтруктураПользовательскихПолей);
			Иначе
				РегламентированнаяОтчетностьЗарплатаКадры.НастроитьСоответствияПоРазделу_7_8_1ТГодовая_2019Кв1(СтруктураПользовательскихПолей);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
		ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;
		
		Если ПараметрыОтчета.Свойство("СНачалаГода") Тогда
			ПараметрСНачалаГода = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "СНачалаГода");
			Если ПараметрСНачалаГода <> Неопределено Тогда
				ПараметрСНачалаГода.Значение = ПараметрыОтчета.СНачалаГода;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыОтчета.Свойство("ИсключаемыеСостояния") Тогда
			ПараметрИсключаемыеСостояния = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ИсключаемыеСостояния");
			ПараметрИсключаемыеСостояния.Значение = ПараметрыОтчета.ИсключаемыеСостояния;
		КонецЕсли;

		Если ПараметрыОтчета.Свойство("КодОКВЭД") Тогда
			ПараметрКодОКВЭД = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "КодОКВЭД");
			ПараметрКодОКВЭД.Значение = ПараметрыОтчета.КодОКВЭД;
		КонецЕсли;

		Если ПараметрыОтчета.Свойство("ЗП") Тогда
			КоллекцияПользовательскихПолей = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы;
			Для Каждого ПользовательскоеПоле Из КоллекцияПользовательскихПолей Цикл
				Если ПользовательскоеПоле.Заголовок = "РазмерНачисленнойЗП" Тогда
					РегламентированнаяОтчетностьЗарплатаКадры.ПолучитьВариантыРазмераНачисленнойЗП(ПользовательскоеПоле.Варианты.Элементы);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
		
		Если ПараметрыОтчета.Свойство("ПРОФ") Тогда
			КоллекцияПользовательскихПолей = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы;
			СтруктураПользовательскихПолей = Новый Структура;
			СоответствияПолейНомерамПользовательскихКолонок = Новый Соответствие;
			Для Каждого ПользовательскоеПоле Из КоллекцияПользовательскихПолей Цикл
				СтруктураПользовательскихПолей.Вставить(ПользовательскоеПоле.Заголовок, ПользовательскоеПоле);
				СоответствияПолейНомерамПользовательскихКолонок.Вставить(ПользовательскоеПоле.Заголовок, СтрЗаменить(ПользовательскоеПоле.ПутьКДанным, ".", ""));
			КонецЦикла;
			ПараметрыОтчета.Вставить("СоответствияПолейНомерамПользовательскихКолонок", СоответствияПолейНомерамПользовательскихКолонок);
			Если ПараметрыОтчета.мДатаНачалаПериодаОтчета < Дата('20180901') Тогда
				РегламентированнаяОтчетностьЗарплатаКадры.НастроитьСоответствияДолжностиПоКодуЗанятий_2017Кв3(СтруктураПользовательскихПолей, ПараметрыОтчета.КодОКВЭД);
			Иначе
				РегламентированнаяОтчетностьЗарплатаКадры.НастроитьСоответствияДолжностиПоКодуЗанятий_2018Кв3(СтруктураПользовательскихПолей, ПараметрыОтчета.КодОКВЭД, ДатаКонцаПериодаОтчета);
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ПараметрыОтчета.Свойство("Годовая1Т") Тогда
			КоллекцияПользовательскихПолей = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы;
			СтруктураПользовательскихПолей = Новый Структура;
			СоответствияПолейНомерамПользовательскихКолонок = Новый Соответствие;
			Для Каждого ПользовательскоеПоле Из КоллекцияПользовательскихПолей Цикл
				СтруктураПользовательскихПолей.Вставить(ПользовательскоеПоле.Заголовок, ПользовательскоеПоле);
				СоответствияПолейНомерамПользовательскихКолонок.Вставить(ПользовательскоеПоле.Заголовок, СтрЗаменить(ПользовательскоеПоле.ПутьКДанным, ".", ""));
			КонецЦикла;
			ПараметрыОтчета.Вставить("СоответствияПолейНомерамПользовательскихКолонок", СоответствияПолейНомерамПользовательскихКолонок);
			РегламентированнаяОтчетностьЗарплатаКадры.НастроитьСоответствияПоРазделам_1ТГодовая_2019Кв1(СтруктураПользовательскихПолей);
			
			
		КонецЕсли; 

	КонецЕсли; 
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.ВСписке, ПараметрыОтчета.СписокСтруктурныхЕдиниц);
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

Функция РазрешитьНастройкуВыгрузкиОтчетов(ИмяОтчета) Экспорт
    
    РазрешитьНастройкуВыгрузки = Ложь;
    
    Если ИмяОтчета = "РегламентированныйОтчет200Форма" Тогда
        
        РазрешитьНастройкуВыгрузки = Истина;   	
    
    КонецЕсли;
    
    Возврат РазрешитьНастройкуВыгрузки; 
    
КонецФункции

#КонецОбласти

#КонецОбласти