
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьФормуИсторииБухучетЗарплатыСотрудников(Сотрудник, ВладелецФормы, ОповещениеОЗакрытии) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр", ВладелецФормы.Толькопросмотр);
	ПараметрыФормы.Вставить("Сотрудник", Сотрудник);
	ОткрытьФорму("РегистрСведений.БухучетЗарплатыСотрудников.Форма.ИсторияИзменений",
			ПараметрыФормы,
			ВладелецФормы,,,,
			ОповещениеОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
#КонецОбласти
