#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаОРасчетахСФизическимЛицом2026");
	НастройкиВарианта.Описание = НСтр("ru = 'Справка о расчетах с физическим лицом выдается налоговым агентом в ситуациях, когда физическому лицу необходимо подтвердить свои доходы, произведенные выплаты или удержанный ИПН'"); 
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СправкаОРасчетахСФизическимЛицом2025");
	НастройкиВарианта.Описание = НСтр("ru = 'Справка о расчетах с физическим лицом выдается налоговым агентом в ситуациях, когда физическому лицу необходимо подтвердить свои доходы, произведенные выплаты или удержанный ИПН'"); 
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаОРасчетахСФизическимЛицом2026") Тогда
		
		ПечатаемыйДокумент = Неопределено;
		ПараметрыПечати.Свойство("ПечатаемыйДокумент", ПечатаемыйДокумент);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СправкаОРасчетахСФизическимЛицом2026",
			НСтр("ru = 'Справка о расчетах с физическим лицом'"),
			ПечатаемыйДокумент);
												
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли