#Если Не ТолстыйКлиентУправляемоеПриложение Или Сервер Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Если Не СтандартнаяОбработка Тогда
		Возврат
	КонецЕсли;
	
	ТекстЗапросаВыплаченногоДохода = РегламентированнаяОтчетностьПереопределяемыйРК.ТекстЗапросаВыплаченоДоходаФизическомуЛицу(Истина);
	
	ТекстЗамены = "ВЫБРАТЬ
	            |	ВыплаченоФизЛицу.Организация КАК Организация
	            |ПОМЕСТИТЬ ВТ_Взаиморасчеты
	            |ИЗ
	            |	ВТ_ВыплаченоФизЛицу КАК ВыплаченоФизЛицу";
	
	ТекстЗапроса = ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, ТекстЗапросаВыплаченногоДохода);
	ЭтотОбъект.СхемаКомпоновкиДанных.НаборыДанных.Данные.Запрос = ТекстЗапроса;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КлючВарианта = НастройкиОтчета.ДополнительныеСвойства.КлючВарианта;
	
    ПараметрОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	Налогоплательщик = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрОрганизация);
	Если Налогоплательщик <> Неопределено Тогда
		Налогоплательщик = Налогоплательщик.Значение;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрПериод = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	НачалоНП = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериод);
	Если НачалоНП <> Неопределено Тогда
		КонецНП = НачалоНП.Значение.ДатаОкончания;
		НачалоНП = НачалоНП.Значение.ДатаНачала;
	Иначе
		КонецНП = Дата(1, 1, 1);
		НачалоНП = Дата(1, 1, 1);
	КонецЕсли;
		
	НП2026 = Дата(2026, 1, 1);
	НП2025 = Дата(2025, 1, 1);
	
	СтандартнаяОбработка = Ложь;
	
	Если КлючВарианта = "СправкаОРасчетахСФизическимЛицом2026" 
		И НачалоНП < НП2026 Тогда 
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Вариант отчета используется с 2026 года'"));
		Возврат;
	ИначеЕсли КлючВарианта = "СправкаОРасчетахСФизическимЛицом2025" 
		И (НачалоНП < НП2025 
		ИЛИ НачалоНП >= НП2026
		ИЛИ НачалоДня(КонецНП) >= НП2026) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Вариант отчета используется до 2026 года'"));
		Возврат;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МассивВидыОсобыхНачисленийУдержаний = Новый Массив;
	МассивВидыОсобыхНачисленийУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.КомпенсацияЗаЗадержкуЗарплаты);
	МассивВидыОсобыхНачисленийУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПогашениеЗаймаИзЗарплаты);
	МассивВидыОсобыхНачисленийУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПроцентыПоЗайму);
	МассивВидыОсобыхНачисленийУдержаний.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.МатериальнаяВыгодаПоЗаймам);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыОсобыхНачисленийУдержаний", МассивВидыОсобыхНачисленийУдержаний);
	
	МассивВидыНалоговВзносов = Новый Массив;
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПН);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПНДоходыКонтрагентов);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПНРасчетыСБывшимиСотрудниками);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ИПНДивиденды);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВ);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВДоходыКонтрагентов);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ОПВРасчетыСБывшимиСотрудниками);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМС);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМСДоходыКонтрагентов);
	МассивВидыНалоговВзносов.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ВОСМСРасчетыСБывшимиСотрудниками);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыНалоговВзносов", МассивВидыНалоговВзносов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", Налогоплательщик.ГоловнаяОрганизация);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	РегистрацииОрганизаций = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		РегистрацияОрганизации = РегламентированнаяОтчетностьРК.РегистрацияВНалоговомОргане(Выборка.Ссылка, КонецМесяца(КонецНП));
		РегистрацииОрганизаций.Добавить(РегистрацияОрганизации);
		
		Если Выборка.Ссылка = Налогоплательщик Тогда
			РегистрацияГоловнойОрганизации = РегистрацияОрганизации;
		КонецЕсли;
	КонецЦикла;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("парамРегистрацияГоловнойОрганизации", РегистрацияГоловнойОрганизации);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("парамСписокСтруктурныхЕдиниц", РегистрацииОрганизаций);
	
	Если РегламентированнаяОтчетностьРК.ИндивидуальныйПредприниматель(Налогоплательщик) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("парамИндивидуальныйПредприниматель", Налогоплательщик.ИндивидуальныйПредприниматель);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("парамИндивидуальныйПредприниматель", Неопределено);
	КонецЕсли;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
				
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ДанныеОтчета = Новый ДеревоЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если КлючВарианта = "СправкаОРасчетахСФизическимЛицом2026" Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.СправкаОРасчетахСФизическимЛицом.СправкаОРасчетахСФизическимЛицом2026");
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.СправкаОРасчетахСФизическимЛицом.СправкаОРасчетахСФизическимЛицом2025");
	КонецЕсли;
	
	Макеты = Новый Структура("Шапка,ШапкаТЧ,СтрокаТЧ,ПодвалТЧ,Подвал");
	Макеты.Шапка	 = Макет.ПолучитьОбласть("Шапка");
	Макеты.ШапкаТЧ	 = Макет.ПолучитьОбласть("ШапкаТЧ");
	Макеты.СтрокаТЧ	 = Макет.ПолучитьОбласть("СтрокаТЧ");
	Макеты.ПодвалТЧ	 = Макет.ПолучитьОбласть("ПодвалТЧ");
	Макеты.Подвал	 = Макет.ПолучитьОбласть("Подвал");
	
	Организация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Налогоплательщик, "НаименованиеПолное, ИНН");
	Макеты.Шапка.Параметры.Организация			= Организация.НаименованиеПолное;
	Макеты.Шапка.Параметры.БИННалогоплательщика	= Организация.ИНН;
	Если МакетКомпоновкиДанных.ЗначенияПараметров.ФизЛицо.Значение <> Неопределено Тогда
		ФизЛицо = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МакетКомпоновкиДанных.ЗначенияПараметров.ФизЛицо.Значение, "ФИО, ИНН");
		Макеты.Шапка.Параметры.ФизЛицо 			= ФизЛицо.ФИО; 
		Макеты.Шапка.Параметры.ИИН 				= ФизЛицо.ИНН;
	КонецЕсли;
	Макеты.Шапка.Параметры.НачалоПериода 		= НачалоНП; 
	Макеты.Шапка.Параметры.КонецПериода 		= КонецНП;
	
	ДокументРезультат.Вывести(Макеты.Шапка);
	ДокументРезультат.Вывести(Макеты.ШапкаТЧ);
	
	Если КлючВарианта = "СправкаОРасчетахСФизическимЛицом2026" Тогда
		
		СуммаДохода = 0;
		ОблагаемаяСуммаДохода = 0;
		
		Для Каждого СтрокаФизЛица из ДанныеОтчета.Строки Цикл 
			
			Если СтрокаФизЛица.Период <> Неопределено Тогда
			
				ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры, СтрокаФизЛица);
				
				СуммаДохода = СуммаДохода + СтрокаФизЛица.Доход;
				ОблагаемаяСуммаДохода = ОблагаемаяСуммаДохода + СтрокаФизЛица.ОбъектИсчисления;
				
				Макеты.СтрокаТЧ.Параметры.Месяц			 	= СтрокаФизЛица.Период;
				Макеты.СтрокаТЧ.Параметры.Доход				= СтрокаФизЛица.Доход;
				Если СтрокаФизЛица.Доход <> 0 Тогда
					Макеты.СтрокаТЧ.Параметры.СуммаДохода	= СуммаДохода;
				Иначе
					Макеты.СтрокаТЧ.Параметры.СуммаДохода	= "-";      
				КонецЕсли;
				Макеты.СтрокаТЧ.Параметры.СуммаВычетов 		= СтрокаФизЛица.СуммаПримененныхВычетов;
				Макеты.СтрокаТЧ.Параметры.ОПВ 				= СтрокаФизЛица.ПримененныйВычетОПВ;
				Макеты.СтрокаТЧ.Параметры.ВОСМС 			= СтрокаФизЛица.ПримененныйВычетВОСМС;
				Макеты.СтрокаТЧ.Параметры.СО 				= СтрокаФизЛица.ПримененныйВычетСО;
				Макеты.СтрокаТЧ.Параметры.БазовыйВычет 		= СтрокаФизЛица.ПримененныйВычетБазовыйНалоговыйВычет;
				Макеты.СтрокаТЧ.Параметры.СоцВычет	 		= СтрокаФизЛица.ПримененныйВычетСоциальныйНалоговыйВычет;
				Макеты.СтрокаТЧ.Параметры.ОблагаемыйДоход 	= СтрокаФизЛица.ОбъектИсчисления;
				Если СтрокаФизЛица.ОбъектИсчисления <> 0 Тогда
					Макеты.СтрокаТЧ.Параметры.ОблагаемаяСуммаДохода	= ОблагаемаяСуммаДохода;
				Иначе
					Макеты.СтрокаТЧ.Параметры.ОблагаемаяСуммаДохода	= "-";      
				КонецЕсли;
				Макеты.СтрокаТЧ.Параметры.ИПН 				= СтрокаФизЛица.ИПН;
				Макеты.СтрокаТЧ.Параметры.ПовышенныйИПН 	= СтрокаФизЛица.ИПНПоПовышеннойСтавке;
				Макеты.СтрокаТЧ.Параметры.ВыплаченныйДоход 	= СтрокаФизЛица.ДоходКВыплате; 
				
				ДокументРезультат.Вывести(Макеты.СтрокаТЧ); 
				
			Иначе
				
				ЗаполнитьЗначенияСвойств(Макеты.ПодвалТЧ.Параметры, СтрокаФизЛица); 
								
				Макеты.ПодвалТЧ.Параметры.Доход				= СтрокаФизЛица.Доход;
				Макеты.ПодвалТЧ.Параметры.СуммаВычетов 		= СтрокаФизЛица.СуммаПримененныхВычетов;
				Макеты.ПодвалТЧ.Параметры.ОПВ 				= СтрокаФизЛица.ПримененныйВычетОПВ;
				Макеты.ПодвалТЧ.Параметры.ВОСМС 			= СтрокаФизЛица.ПримененныйВычетВОСМС;
				Макеты.ПодвалТЧ.Параметры.СО 				= СтрокаФизЛица.ПримененныйВычетСО;
				Макеты.ПодвалТЧ.Параметры.БазовыйВычет 		= СтрокаФизЛица.ПримененныйВычетБазовыйНалоговыйВычет;
				Макеты.ПодвалТЧ.Параметры.СоцВычет	 		= СтрокаФизЛица.ПримененныйВычетСоциальныйНалоговыйВычет;
				Макеты.ПодвалТЧ.Параметры.ОблагаемыйДоход 	= СтрокаФизЛица.ОбъектИсчисления;
				Макеты.ПодвалТЧ.Параметры.ИПН 				= СтрокаФизЛица.ИПН;
				Макеты.ПодвалТЧ.Параметры.ПовышенныйИПН 	= СтрокаФизЛица.ИПНПоПовышеннойСтавке;
				Макеты.ПодвалТЧ.Параметры.ВыплаченныйДоход 	= СтрокаФизЛица.ДоходКВыплате; 
				
				ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли КлючВарианта = "СправкаОРасчетахСФизическимЛицом2025" Тогда
	
		Для Каждого СтрокаФизЛица из ДанныеОтчета.Строки Цикл 
			
			Если СтрокаФизЛица.Период <> Неопределено Тогда
			
				ЗаполнитьЗначенияСвойств(Макеты.СтрокаТЧ.Параметры, СтрокаФизЛица); 
				
				Макеты.СтрокаТЧ.Параметры.Месяц			 	= СтрокаФизЛица.Период;
				Макеты.СтрокаТЧ.Параметры.Доход				= СтрокаФизЛица.Доход;
				Макеты.СтрокаТЧ.Параметры.Корректировка 	= СтрокаФизЛица.ПримененнаяКорректировка;
				Макеты.СтрокаТЧ.Параметры.СуммаВычетов 		= СтрокаФизЛица.СуммаПримененныхВычетов;
				Макеты.СтрокаТЧ.Параметры.ОПВ 				= СтрокаФизЛица.ПримененныйВычетОПВ;
				Макеты.СтрокаТЧ.Параметры.ВОСМС 			= СтрокаФизЛица.ПримененныйВычетВОСМС;
				Макеты.СтрокаТЧ.Параметры.СО 				= СтрокаФизЛица.ПримененныйВычетСО;
				Макеты.СтрокаТЧ.Параметры.СтандартныйВычет 	= СтрокаФизЛица.ПримененныйВычетСтандартные;
				Макеты.СтрокаТЧ.Параметры.ПрочиеВычеты 		= СтрокаФизЛица.ПримененныйВычетПрочиеСтандартные;
				Макеты.СтрокаТЧ.Параметры.ДляМногодетных 	= СтрокаФизЛица.ПримененныйВычетВычетдляМногодетнойСемьи;
				Макеты.СтрокаТЧ.Параметры.СуммаПрочих 		= СтрокаФизЛица.ПримененныйВычетПредварительнаяСуммаПрочихВычетов;
				Макеты.СтрокаТЧ.Параметры.ОблагаемыйДоход 	= СтрокаФизЛица.ОбъектИсчисления;
				Макеты.СтрокаТЧ.Параметры.ИПН 				= СтрокаФизЛица.ИПН;
				Макеты.СтрокаТЧ.Параметры.ВыплаченныйДоход 	= СтрокаФизЛица.ДоходКВыплате; 
				
				ДокументРезультат.Вывести(Макеты.СтрокаТЧ); 
				
			Иначе
				
				ЗаполнитьЗначенияСвойств(Макеты.ПодвалТЧ.Параметры, СтрокаФизЛица); 
				
				Макеты.ПодвалТЧ.Параметры.Доход				= СтрокаФизЛица.Доход;
				Макеты.ПодвалТЧ.Параметры.Корректировка 	= СтрокаФизЛица.ПримененнаяКорректировка;
				Макеты.ПодвалТЧ.Параметры.СуммаВычетов 		= СтрокаФизЛица.СуммаПримененныхВычетов;
				Макеты.ПодвалТЧ.Параметры.ОПВ 				= СтрокаФизЛица.ПримененныйВычетОПВ;
				Макеты.ПодвалТЧ.Параметры.ВОСМС 			= СтрокаФизЛица.ПримененныйВычетВОСМС;
				Макеты.ПодвалТЧ.Параметры.СО 				= СтрокаФизЛица.ПримененныйВычетСО;
				Макеты.ПодвалТЧ.Параметры.СтандартныйВычет 	= СтрокаФизЛица.ПримененныйВычетСтандартные;
				Макеты.ПодвалТЧ.Параметры.ПрочиеВычеты 		= СтрокаФизЛица.ПримененныйВычетПрочиеСтандартные;
				Макеты.ПодвалТЧ.Параметры.ДляМногодетных 	= СтрокаФизЛица.ПримененныйВычетВычетдляМногодетнойСемьи;
				Макеты.ПодвалТЧ.Параметры.СуммаПрочих 		= СтрокаФизЛица.ПримененныйВычетПредварительнаяСуммаПрочихВычетов;
				Макеты.ПодвалТЧ.Параметры.ОблагаемыйДоход 	= СтрокаФизЛица.ОбъектИсчисления;
				Макеты.ПодвалТЧ.Параметры.ИПН 				= СтрокаФизЛица.ИПН;
				Макеты.ПодвалТЧ.Параметры.ВыплаченныйДоход 	= СтрокаФизЛица.ДоходКВыплате; 
				
				ДокументРезультат.Вывести(Макеты.ПодвалТЧ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	ДатаПодписи = МакетКомпоновкиДанных.ЗначенияПараметров.ДатаВыдачи.Значение;
	ОтветственныеЛица = Новый Структура("Организация,Руководитель", Налогоплательщик);
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ОтветственныеЛица, ДатаПодписи);
	
	Макеты.Подвал.Параметры.ФИОРуководитель 	= ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(ОтветственныеЛица.Руководитель);
	Макеты.Подвал.Параметры.ФИОИсполнителя	 	= ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(Пользователи.ТекущийПользователь().ФизическоеЛицо);
    Макеты.Подвал.Параметры.ДатаВыдачи 			= ДатаПодписи;
	
	ДокументРезультат.Вывести(Макеты.Подвал);

КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ЗначениеВДанныеФормы(ЭтотОбъект, Форма.Отчет);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли