#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ЛичныеДанныеКандидата)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеОПриемеНаРаботу(ДокументСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументРешение.Ссылка КАК Ссылка,
		|	ДокументРешение.Организация КАК Организация,
		|	ЕСТЬNULL(ФизическиеЛицаКандидатов.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК
		|		ФизическоеЛицо,
		|	ДокументРешение.ДолжностьПоШтатномуРасписанию КАК Позиция,
		|	ДокументРешение.ДатаПриема КАК ДатаПриема,
		|	ДокументРешение.РабочееМесто
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК ДокументРешение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|		ПО ДокументРешение.Кандидат.ЛичныеДанные = ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата
		|		И НЕ ФизическиеЛицаКандидатов.ФизическоеЛицо.ПометкаУдаления
		|ГДЕ
		|	ДокументРешение.Ссылка = &ДокументСсылка";
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

Функция ДанныеЗаполненияПриемаНаРаботуПоДокументуРешения(РешениеОПриемеОбъект, Сотрудник, ФизическоеЛицо) Экспорт

	РеквизитыПриказа = НовыйРеквизитыПриказа();
	
	ЗаполнитьЗначенияСвойств(РеквизитыПриказа, РешениеОПриемеОбъект);
	
	РеквизитыПриказа.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		РешениеОПриемеОбъект.ДолжностьПоШтатномуРасписанию, "Подразделение");
	РеквизитыПриказа.ФизическоеЛицо = ФизическоеЛицо;
	РеквизитыПриказа.Сотрудник = Сотрудник;
	РеквизитыПриказа.Решение = РешениеОПриемеОбъект.Ссылка;
	РеквизитыПриказа.РаботаетДистанционно = РешениеОПриемеОбъект.ДистанционнаяРабота;
	РеквизитыПриказа.ДлительностьИспытательногоСрока = РешениеОПриемеОбъект.ИспытательныйСрок;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(РеквизитыПриказа.ФизическоеЛицо), 
		НСтр("ru = 'При формировании реквизитов нового приказа о приеме на работу не заполнено физическое лицо.'"), 
		Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(РеквизитыПриказа.Сотрудник),
		НСтр("ru = 'При формировании реквизитов нового приказа о приеме на работу не заполнен сотрудник.'"), 
		Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
	
	Возврат РеквизитыПриказа;
	
КонецФункции

Функция НайтиФизическоеЛицо(ДокументСсылка, Кандидат) Экспорт
	
	ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Приказ = КадровыеРешения.СвязанныйСРешениемПриказ(ДокументСсылка); // ДокументСсылка.ПриемНаРаботу
		УстановитьПривилегированныйРежим(Ложь);
		Если Приказ <> Неопределено Тогда
			ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Приказ, "ФизическоеЛицо");
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат ФизическоеЛицо;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Кандидат) Тогда
		ФизическоеЛицо = Справочники.Кандидаты.ФизическоеЛицоКандидата(Кандидат, Ложь, Истина);
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

// Находит решение о приеме на работу по кандидату, исключая заданное решение.
// 
// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты -
//  ИсключаяРешение - Неопределено, ДокументСсылка.РешениеОПриемеНаРаботу -
// 
// Возвращаемое значение:
//  ДокументСсылка.РешениеОПриемеНаРаботу, Произвольный - Решение по кандидату
Функция РешениеПоКандидату(Кандидат, ИсключаяРешение = Неопределено) Экспорт
	Возврат РешенияПоКандидатам(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат), ИсключаяРешение)[Кандидат];
КонецФункции

// Находит решения о приеме на работу по кандидатам.
// 
// Параметры:
//  Кандидаты - Массив из СправочникСсылка.Кандидаты -
//  ИсключаяРешение - Неопределено, ДокументСсылка.РешениеОПриемеНаРаботу -
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
// 		* Ключ - СправочникСсылка.Кандидаты
// 		* Значение - ДокументСсылка.РешениеОПриемеНаРаботу
Функция РешенияПоКандидатам(Кандидаты, ИсключаяРешение = Неопределено) Экспорт
	
	РешенияПоКандидатам = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("ИсключаяРешение", ИсключаяРешение);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Решение.Кандидат КАК Кандидат,
		|	Решение.Ссылка КАК Решение,
		|	Решение.Дата КАК Дата
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК Решение
		|ГДЕ
		|	Решение.Кандидат В(&Кандидаты)
		|	И НЕ Решение.ПометкаУдаления
		|	И Решение.Ссылка <> &ИсключаяРешение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кандидат,
		|	Дата УБЫВ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Кандидат") Цикл
		РешенияПоКандидатам.Вставить(Выборка.Кандидат, Выборка.Решение);
	КонецЦикла;
	
	Возврат РешенияПоКандидатам;
	
КонецФункции

// Находит кандидатов по решениям о приеме на работу.
// 
// Параметры:
//  Решения - Массив из СправочникСсылка.РешениеОПриемеНаРаботу
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
// 		* Ключ - СправочникСсылка.РешениеОПриемеНаРаботу
// 		* Значение - ДокументСсылка.Кандидаты
Функция КандидатыПоРешениям(Решения) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Решения, "Кандидат", Истина);
	
КонецФункции

// Сотрудник по решению о приеме на работу.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники
// 
// Возвращаемое значение:
//  ДокументСсылка.РешениеОПриемеНаРаботу, Неопределено - Решение о приеме на работу по сотруднику
Функция РешениеОПриемеНаРаботуПоСотруднику(Сотрудник) Экспорт
	Возврат РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.РешенияОПриемеНаРаботуПоСотрудникам(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник))[Сотрудник];
КонецФункции

// Сотрудник по решению о приеме на работу.
// 
// Параметры:
//  Решение - ДокументСсылка.РешениеОПриемеНаРаботу
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники, Неопределено - Сотрудник по решению о приеме на работу
Функция СотрудникПоРешениюОПриемеНаРаботу(Решение) Экспорт
	Возврат РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.СотрудникиПоРешениямОПриемеНаРаботу(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Решение))[Решение];
КонецФункции

// Связать сотрудника с решением о приеме на работу.
// 
// Параметры:
//  Решение - ДокументСсылка.РешениеОПриемеНаРаботу
//  Сотрудник - СправочникСсылка.Сотрудники
Процедура СвязатьСотрудникаСРешениемОПриемеНаРаботу(Решение, Сотрудник) Экспорт
	СотрудникиПоРешениям = Новый Соответствие();
	СотрудникиПоРешениям.Вставить(Решение, Сотрудник);
	РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.СвязатьСотрудниковСРешениямиОПриемеНаРаботу(СотрудникиПоРешениям);
КонецПроцедуры

// Отвязать сотрудника от решения о приеме на работу.
// 
// Параметры:
//  Решение - ДокументСсылка.РешениеОПриемеНаРаботу
Процедура ОтвязатьСотрудникаОтРешенияОПриемеНаРаботу(Решение) Экспорт
	
	СотрудникиПоРешениям = Новый Соответствие();
	СотрудникиПоРешениям.Вставить(Решение, Неопределено);
	РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.СвязатьСотрудниковСРешениямиОПриемеНаРаботу(СотрудникиПоРешениям);
	
КонецПроцедуры

#Область ОбработчикиРегистрацииФизическихЛиц

Функция ПринадлежностиОбъекта() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация");
КонецФункции

#КонецОбласти

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки, ,
		АдаптацияУвольнение.РазделыДанныхОбъектовПодсистемы());
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистрацииДвижений(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСовместноРегистрируемыхОбъектов(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

// Заполняет кандидатов в решениях о приеме на работу при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
//  
// Возвращаемое значение:
//  Булево - Истина если все документы уже обработаны, иначе Ложь.
Функция ЗаполнитьКандидатов(ПараметрыОбновления) Экспорт
	
	ОбработанныеДокументы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОбновления, "ОбработанныеДокументы", Новый Массив); // Массив Из ДокументСсылка.РешениеОПриемеНаРаботу
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ОбрабатываемыеДокументы = ДокументыБезКандидатов(ОбработанныеДокументы);
		
		Если ОбрабатываемыеДокументы.Количество() = 0 Тогда
			ЗафиксироватьТранзакцию();
			Возврат Истина;
		КонецЕсли;
		
		ФизическиеЛица = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
			ОбрабатываемыеДокументы.ВыгрузитьКолонку("ФизическоеЛицо"));
		
		Кандидаты = ПодборПерсонала.КандидатыФизическихЛиц(ФизическиеЛица);
		
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаСотрудников = КадровыйУчет.СотрудникиФизическихЛиц(ФизическиеЛица);
		УстановитьПривилегированныйРежим(Ложь);
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаСотрудников, "ФизическоеЛицо");
	
		ИсключаемыеКандидаты = КандидатыРешенийОПриеме();
		
		КоличествоОбработанныхДокументов = 0;
		Для Каждого СтрокаТаблицы Из ОбрабатываемыеДокументы Цикл
			
			Кандидат = КандидатФизическогоЛица(СтрокаТаблицы.ФизическоеЛицо, Кандидаты, ИсключаемыеКандидаты,
				ТаблицаСотрудников);

			Если ЗначениеЗаполнено(Кандидат) Тогда
				ЗаполнитьКандидатаВДокументе(СтрокаТаблицы.Документ, Кандидат);
				НоваяСтрока = ИсключаемыеКандидаты.Добавить();
				НоваяСтрока.Кандидат = Кандидат;
			КонецЕсли;
			
			КоличествоОбработанныхДокументов = КоличествоОбработанныхДокументов + 1;
			ОбработанныеДокументы.Добавить(СтрокаТаблицы.Документ);
			
		КонецЦикла;

		ПараметрыОбновления.Вставить("ОбработанныеДокументы", ОбработанныеДокументы);
		ЗафиксироватьТранзакцию();
		
		Возврат КоличествоОбработанныхДокументов = 0;
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения кандидатов в документах Решение о приеме на работу'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.РешениеОПриемеНаРаботу);
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

// Исправляет ситуацию, когда существуют несколько решений о приеме на работу с одинаковым кандидатом.
// В результате остается один документ по кандидату.
// В остальных документах кандидат, при возможности, заменяется на другого или очищается.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ИсправитьРешенияОПриемеСОдинаковымиКандидатами(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		РезультатЗапроса = РезультатЗапросаКандидатовСНесколькимиРешениями();
		
		Если РезультатЗапроса = Неопределено Или РезультатЗапроса.Пустой() Тогда
			ЗафиксироватьТранзакцию();
			ПараметрыОбновления.ОбработкаЗавершена = Истина;
			Возврат;
		КонецЕсли;
		
		ДокументыРешения = Новый Массив; // Массив из ДокументСсылка.РешениеОПриемеНаРаботу
		
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.СледующийПоЗначениюПоля("Документ") Цикл
			ДокументыРешения.Добавить(Выборка.Документ);
		КонецЦикла;
		СотрудникиРешений = РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.СотрудникиПоРешениямОПриемеНаРаботу(
			ДокументыРешения);
		
		ВыборкаКандидатов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		КоличествоОбработанныхДокументов = 0;
		
		Пока ВыборкаКандидатов.Следующий() Цикл
			
			ИсключаемыеКандидаты = Новый ТаблицаЗначений();
			ИсключаемыеКандидаты.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
			
			ФизическоеЛицо =  Неопределено;
			
			ВыборкаДокументы = ВыборкаКандидатов.Выбрать();
			Пока ВыборкаДокументы.Следующий() Цикл
				
				Кандидат = Справочники.Кандидаты.ПустаяСсылка();
				
				СотрудникРешения = СотрудникиРешений.Получить(ВыборкаДокументы.Документ);
				
				Если СотрудникРешения <> Неопределено Тогда
					
					КандидатыСотрудника = ПодборПерсонала.ПриоритетныеКандидатыПоСотрудникам(
						ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СотрудникРешения), ,
						ИсключаемыеКандидаты.ВыгрузитьКолонку("Кандидат"));
						
					Если КандидатыСотрудника.Количество() > 0 Тогда
						Кандидат = КандидатыСотрудника[0].Кандидат;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Кандидат) Тогда
					Если ВыборкаДокументы.ФизическоеЛицо <> ФизическоеЛицо Тогда
						ФизическоеЛицо =  ВыборкаДокументы.ФизическоеЛицо;
						ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
						Кандидаты = ПодборПерсонала.КандидатыФизическихЛиц(ФизическиеЛица);
						ТаблицаСотрудников = КадровыйУчет.СотрудникиФизическихЛиц(ФизическиеЛица);
					КонецЕсли;
					Кандидат = КандидатФизическогоЛица(ФизическоеЛицо, Кандидаты, ИсключаемыеКандидаты, ТаблицаСотрудников);
				КонецЕсли;
				
				Если ВыборкаКандидатов.Кандидат <> Кандидат Тогда
					ЗаполнитьКандидатаВДокументе(ВыборкаДокументы.Документ, Кандидат);
					КоличествоОбработанныхДокументов = КоличествоОбработанныхДокументов + 1;
				КонецЕсли;
				
				НоваяСтрока = ИсключаемыеКандидаты.Добавить();
				НоваяСтрока.Кандидат = Кандидат;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		ПараметрыОбновления.ОбработкаЗавершена = КоличествоОбработанныхДокументов = 0;
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка при исправлении решений о приеме на работу с одинаковыми кандидатами'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.РешениеОПриемеНаРаботу);
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

Функция КандидатыРешенийОПриеме()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РешениеОПриемеНаРаботу.Кандидат
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.Проведен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Кандидаты = РезультатЗапроса.Выгрузить();
	Кандидаты.Индексы.Добавить("Кандидат");
	
	Возврат Кандидаты;
	
КонецФункции

Процедура ЗаполнитьКандидатаВДокументе(РешениеОПриеме, Кандидат)
	
	ДокументОбъект = РешениеОПриеме.ПолучитьОбъект();
	ДокументОбъект.Кандидат = Кандидат;
	ДокументОбъект.ЛичныеДанныеКандидата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ЛичныеДанные");
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
	
КонецПроцедуры

// Параметры:
//  ОбработанныеДокументы - Массив из ДокументСсылка.РешениеОПриемеНаРаботу
//  
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * Документ - ДокументСсылка.РешениеОПриемеНаРаботу
//    * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
Функция ДокументыБезКандидатов(ОбработанныеДокументы)
	
	Если Метаданные.Документы.РешениеОПриемеНаРаботу.Реквизиты.Найти("УдалитьФизическоеЛицо") = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РешениеОПриемеНаРаботу.Ссылка КАК Документ,
		|	РешениеОПриемеНаРаботу.УдалитьФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.УдалитьФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И РешениеОПриемеНаРаботу.Кандидат = ЗНАЧЕНИЕ(Справочник.Кандидаты.ПустаяСсылка)
		|	И НЕ РешениеОПриемеНаРаботу.Ссылка В (&ОбработанныеДокументы)";
	
	Запрос.УстановитьПараметр("ОбработанныеДокументы", ОбработанныеДокументы);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

Функция РезультатЗапросаКандидатовСНесколькимиРешениями()
	
	Если Метаданные.Документы.РешениеОПриемеНаРаботу.Реквизиты.Найти("УдалитьФизическоеЛицо") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РешениеОПриемеНаРаботу.Ссылка) КАК Ссылка,
		|	РешениеОПриемеНаРаботу.Кандидат
		|ПОМЕСТИТЬ ВТКандидаты
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|ГДЕ
		|	РешениеОПриемеНаРаботу.Проведен
		|	И РешениеОПриемеНаРаботу.Кандидат <> ЗНАЧЕНИЕ(Справочник.Кандидаты.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	РешениеОПриемеНаРаботу.Кандидат
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РешениеОПриемеНаРаботу.Ссылка) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РешениеОПриемеНаРаботу.Ссылка КАК Документ,
		|	РешениеОПриемеНаРаботу.Кандидат КАК Кандидат,
		|	РешениеОПриемеНаРаботу.УдалитьФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКандидаты КАК ВТКандидаты
		|		ПО РешениеОПриемеНаРаботу.Кандидат = ВТКандидаты.Кандидат
		|ИТОГИ
		|ПО
		|	Кандидат";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция КандидатФизическогоЛица(ФизическоеЛицо, Кандидаты, ИсключаемыеКандидаты, ТаблицаСотрудников)
	
	Кандидат = Справочники.Кандидаты.ПустаяСсылка();
	
	НайденныеСтроки = Кандидаты.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Кандидат;
	КонецЕсли;
	
	ДоступныеКандидаты = Новый Массив;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		
		Если НайденнаяСтрока.ПометкаУдаления
			Или НайденнаяСтрока.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИсключаемыеКандидаты.Найти(НайденнаяСтрока.Кандидат, "Кандидат") = Неопределено Тогда
			ДоступныеКандидаты.Добавить(НайденнаяСтрока.Кандидат);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДоступныеКандидаты.Количество() = 0 Тогда
		Возврат Кандидат;
	ИначеЕсли ДоступныеКандидаты.Количество() = 1 Тогда
		Кандидат = ДоступныеКандидаты[0];
	Иначе
		НайденныеСотрудники = ТаблицаСотрудников.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Если НайденныеСотрудники.Количество() = 0 Тогда
			Кандидат = ДоступныеКандидаты[0];
		Иначе
			Сотрудники = Новый Массив;
			Для Каждого СтрокаТаблицыСотрудников Из НайденныеСотрудники Цикл
				Сотрудники.Добавить(СтрокаТаблицыСотрудников.Сотрудник);
			КонецЦикла;
			КандидатыСотрудников = ПодборПерсонала.ПриоритетныеКандидатыПоСотрудникам(Сотрудники, ,
				ИсключаемыеКандидаты.ВыгрузитьКолонку("Кандидат"));
			Если КандидатыСотрудников.Количество() > 0 Тогда
				Кандидат = КандидатыСотрудников[0].Кандидат;
			Иначе
				Кандидат = ДоступныеКандидаты[0].Кандидат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Кандидат;
	
КонецФункции

#КонецОбласти

Функция ПараметрыЗаполненияМероприятий(Объект, ФизическоеЛицо) Экспорт
	
	ПараметрыЗаполнения = АдаптацияУвольнение.ПараметрыЗаполненияМероприятий();
	
	ПараметрыЗаполнения.Организация = Объект.Организация;
	ПараметрыЗаполнения.ФизическоеЛицо = ФизическоеЛицо;
	ПараметрыЗаполнения.ВидСобытия = ВидСобытияАдаптацииУвольнения();
	ПараметрыЗаполнения.ДатаСобытия = Объект.ДатаПриема;
	
	Если Не Объект.НоваяПозиция Тогда
		ПараметрыЗаполнения.Позиция = Объект.ДолжностьПоШтатномуРасписанию;
	Иначе
		ПараметрыЗаполнения.Должность = Объект.Должность;
		ПараметрыЗаполнения.Подразделение = Объект.Подразделение;
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ВидСобытияАдаптацииУвольнения() Экспорт
	
	Возврат АдаптацияУвольнение.СобытиеПрием();
	
КонецФункции

Функция ПоляПроверкиУникальности() Экспорт
	
	ПоляПроверки = Новый Массив();
	ПоляПроверки.Добавить("Кандидат");
	Возврат ПоляПроверки;
	
КонецФункции

Функция НовыйРеквизитыПриказа()
	
	РеквизитыПриказа = Новый Структура;
	РеквизитыПриказа.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	РеквизитыПриказа.Вставить("Сотрудник", Справочники.Сотрудники.ПустаяСсылка());
	РеквизитыПриказа.Вставить("ФизическоеЛицо", Справочники.ФизическиеЛица.ПустаяСсылка());
	РеквизитыПриказа.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	РеквизитыПриказа.Вставить("Территория", Справочники.ТерриторииВыполненияРабот.ПустаяСсылка());
	РеквизитыПриказа.Вставить("Должность", Справочники.Должности.ПустаяСсылка());
	РеквизитыПриказа.Вставить("ДолжностьПоШтатномуРасписанию", Справочники.ШтатноеРасписание.ПустаяСсылка());
	РеквизитыПриказа.Вставить("ДатаПриема", Дата(1, 1, 1));
	РеквизитыПриказа.Вставить("Решение", ПустаяСсылка());
	РеквизитыПриказа.Вставить("РабочееМесто", Справочники.РабочиеМестаОхраныТруда.ПустаяСсылка());
	РеквизитыПриказа.Вставить("РаботаетДистанционно", Ложь);
	РеквизитыПриказа.Вставить("ДлительностьИспытательногоСрока", 0);
	
	Возврат РеквизитыПриказа;
	
КонецФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

