#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПраваНаПроведение(Отказ, РежимЗаписи, РежимПроведения);
	ПроверитьЛичныеДанныеКандидата();
	ПроверитьФизическоеЛицо(РежимЗаписи);
	
	ЗаполнитьПрежниеДанные();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	АдаптацияУвольнение.ПриЗаписи(ЭтотОбъект, Отказ);

	ОбновитьСотрудника();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДатаПриема = ТекущаяДатаСеанса();
	ВариантОплатыТруда = Перечисления.ВариантыОплатыТруда.СогласованныйДоход;
	ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения, СтандартнаяОбработка);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	АдаптацияУвольнение.СформироватьДвиженияМероприятияАдаптацииУвольненияПоДокументу(Движения,
		ДанныеДляПроведения.ДанныеМероприятийАдаптацииУвольнения);
	АдаптацияУвольнение.ЗарегистрироватьДокументДляОбновленияЗаданийАдаптацииУвольнения(Движения);
	
	Если ЗапланироватьПрограммуОбучения Тогда
		ОбучениеРазвитие.СформироватьДвиженияПланаПоСотрудникам(Движения,
			ДанныеДляПроведения.ПлановыеДвиженияСотрудников);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаПриема, "Объект.ДатаПриема", Отказ, НСтр("ru = 'Дата приема'"),
		, , Ложь);
	
	АдаптацияУвольнение.ПроверитьЗаполнениеМероприятийАдаптацииВРешенииОПриеме(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	Если Не Отказ Тогда
		КадровыеРешения.ПроверитьНаличиеДубляДокумента(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ОбучениеРазвитие.ПроверитьЗаполнениеПрограммыОбученияВРешенииОПриеме(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	Если НоваяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДолжностьПоШтатномуРасписанию");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	АдаптацияУвольнение.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения() Экспорт
	
	ФизическоеЛицо = ДополнительныеСвойства.ФизическоеЛицо;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	Мероприятия.Мероприятие,
	|	Мероприятия.ДатаНачала,
	|	Мероприятия.ДатаОкончания,
	|	Мероприятия.Исполнитель
	|ИЗ
	|	Документ.РешениеОПриемеНаРаботу.МероприятияАдаптацииУвольнения КАК Мероприятия
	|ГДЕ
	|	Мероприятия.Ссылка = &Ссылка";
		
	ДанныеМероприятий = Запрос.Выполнить().Выгрузить();
	
	ДанныеМероприятий.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ДанныеМероприятий.ЗаполнитьЗначения(ФизическоеЛицо, "ФизическоеЛицо");
	
	ДанныеМероприятий.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(
		Метаданные.ОпределяемыеТипы.СобытияАдаптацииУвольнения.Тип));
	ДанныеМероприятий.ЗаполнитьЗначения(Ссылка, "ДокументОснование");
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДанныеМероприятийАдаптацииУвольнения", ДанныеМероприятий);
	ДанныеДляПроведения.Вставить("ПлановыеДвиженияСотрудников",
		ДанныеДляПроведенияПланОбученияСотрудников(ФизическоеЛицо));
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Функция ДанныеДляПроведенияПланОбученияСотрудников(ФизическоеЛицо)
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Подразделение КАК Подразделение,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.ДатаНачала КАК ДатаНачала,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.ДатаОкончания КАК ДатаОкончания,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Ответственный КАК Ответственный,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.КоличествоУчебныхЧасов КАК КоличествоУчебныхЧасов,
		|	РешениеОПриемеНаРаботуПрограммаОбучения.СуммаРасходов КАК СуммаРасходов
		|ИЗ
		|	Документ.РешениеОПриемеНаРаботу.ПрограммаОбучения КАК РешениеОПриемеНаРаботуПрограммаОбучения
		|ГДЕ
		|	РешениеОПриемеНаРаботуПрограммаОбучения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Подразделение",
		ОрганизационнаяСтруктура.МестоПозицииВСтруктуреПредприятия(ДолжностьПоШтатномуРасписанию));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРезультат.ЗаполнитьЗначения(ФизическоеЛицо, "ФизическоеЛицо");
	
	Возврат ТаблицаРезультат;

КонецФункции

Процедура ПроверитьПраваНаПроведение(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.РешениеОПриемеНаРаботу)  Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Проведен Тогда
			Отказ = Истина;
			ВызватьИсключение(НСтр("ru = 'Нет прав на проведение непроведенного документа.'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЛичныеДанныеКандидата()

	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидата) И ЗначениеЗаполнено(Кандидат) Тогда
		ЛичныеДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(Кандидат).ЛичныеДанныеКандидата;
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ЛичныеДанныеКандидата),
			СтрШаблон(НСтр("ru = 'Для кандидата %1 не найдены личные данные.'"), Кандидат));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьФизическоеЛицо(РежимЗаписи)
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;

	ФизическоеЛицо = Документы.РешениеОПриемеНаРаботу.НайтиФизическоеЛицо(Ссылка, Кандидат);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ФизическоеЛицо),
		СтрШаблон(НСтр("ru = 'Для кандидата %1 не найдено физическое лицо.'"), Кандидат));
		
	ДополнительныеСвойства.Вставить("ФизическоеЛицо", ФизическоеЛицо);
		
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеЗаполнения.Свойство("Кандидат") Тогда
		ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения.Кандидат, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ЗаполнитьПоДаннымКандидата(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(ДанныеЗаполнения);
	Если ДанныеКандидата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКандидата.Состояние <> Перечисления.СостоянияСогласования.Согласовано Тогда
		ВызватьИсключение НСтр("ru = 'Кандидат не утвержден. 
                                |Решение о приеме на работу вводится для утвержденных (одобренных) кандидатов.'");
	КонецЕсли;
	
	ПараметрыДанных = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
	ПараметрыДанных.Согласование = Истина;
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(ДанныеКандидата.Вакансия, ПараметрыДанных);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеВакансий") Тогда
		Если Не ЗначениеЗаполнено(ДанныеКандидата.Вакансия) Тогда
			ВызватьИсключение НСтр("ru = 'Вакансия не заполнена. 
	                                |Решение о приеме на работу вводится для кандидата на согласованную вакансию.'");
		КонецЕсли;
		Если ДанныеВакансии.Согласование = Неопределено 
			Или ДанныеВакансии.Согласование.СостояниеСогласования <> Перечисления.СостоянияСогласования.Согласовано Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Вакансия %1 не согласована. 
	                  |Решение о приеме на работу вводится для кандидата на согласованную вакансию.'"),
				ДанныеКандидата.Вакансия);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	Кандидат = ДанныеКандидата.Кандидат;
	ЛичныеДанныеКандидата = ДанныеКандидата.ЛичныеДанныеКандидата;
	Подразделение = ДанныеВакансии.Подразделение;
	Должность = ДанныеВакансии.Должность;
	ПрофильДолжности = ДанныеВакансии.ПрофильДолжности;
	НоваяПозиция = ДанныеВакансии.НоваяПозиция;
	РабочееМесто = ДанныеВакансии.РабочееМесто;
	ИспытательныйСрок = ДанныеВакансии.ИспытательныйСрок;
	
	СуммаВВалютеПоУмолчанию = ПодборПерсоналаКлиентСервер.СуммаВВалютеПоУмолчанию(
		ДанныеКандидата.ОжидаемыйДоход, ДанныеКандидата.ВалютаДохода);
	СогласованныйДоход = ПодборПерсоналаКлиентСервер.ОжидаемыйДоходВМесяц(
		СуммаВВалютеПоУмолчанию, ДанныеКандидата.ПериодичностьДохода);
	
	Если Не ДанныеВакансии.НоваяПозиция Тогда
		ДолжностьПоШтатномуРасписанию = ДанныеВакансии.Позиция;
		ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ДанныеВакансии.Позиция);
		Организация = ДанныеПозиции.Организация;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПрежниеДанные()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ПрежниеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, 
		"ПрежниеДанные", Новый Структура);

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Кандидат, Проведен");
	ПрежниеДанные.Вставить("Кандидат", ЗначенияРеквизитов.Кандидат);
	ПрежниеДанные.Вставить("Проведен", ЗначенияРеквизитов.Проведен);

	ДополнительныеСвойства.Вставить("ПрежниеДанные", ПрежниеДанные);
	
КонецПроцедуры

Процедура ОбновитьСотрудника()

	ПрежниеДанные = СвойствоСтруктуры(ДополнительныеСвойства, "ПрежниеДанные", Новый Структура());
	
	Если СвойствоСтруктуры(ПрежниеДанные, "Кандидат") = Кандидат 
		И СвойствоСтруктуры(ПрежниеДанные, "Проведен", Ложь) = Проведен Тогда
		Возврат;
	КонецЕсли;

	ПрежнийСотрудник = Неопределено;
	Если СвойствоСтруктуры(ПрежниеДанные, "Проведен", Ложь) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ПрежнийСотрудник = Документы.РешениеОПриемеНаРаботу.СотрудникПоРешениюОПриемеНаРаботу(Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Если Не Проведен Тогда
		ОтвязатьСотрудника(ПрежнийСотрудник);
		Возврат;
	КонецЕсли;

	Если СвойствоСтруктуры(ПрежниеДанные, "Кандидат") <> Кандидат Тогда
		ОтвязатьСотрудника(ПрежнийСотрудник);
	КонецЕсли;

	СведенияОСотруднике = СвойствоСтруктуры(ДополнительныеСвойства, "СведенияОСотруднике", Новый Структура());
	
	// Из формы пользователь выбрал существующего сотрудника.
	ПривязатьСотрудника(СвойствоСтруктуры(СведенияОСотруднике, "Сотрудник"), 
		СвойствоСтруктуры(СведенияОСотруднике, "ПриказОПриеме"));

КонецПроцедуры

Процедура ПривязатьСотрудника(Сотрудник, ПриказОПриеме)

	УстановитьПривилегированныйРежим(Истина);
	
	Если Сотрудник = Неопределено Тогда
		// Новый сотрудник
		ФизическоеЛицо = Справочники.Кандидаты.ФизическоеЛицоКандидата(Кандидат);
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ФизическоеЛицо), 
			НСтр("ru = 'Физическое лицо не обнаружено, проведение документа невозможно'"), 
			Метаданные.Документы.РешениеОПриемеНаРаботу.ПолноеИмя());
		Сотрудник = КадровыйУчет.НовыйСотрудникФизическогоЛица(ФизическоеЛицо, Организация);
	КонецЕсли;

	Документы.РешениеОПриемеНаРаботу.СвязатьСотрудникаСРешениемОПриемеНаРаботу(Ссылка, Сотрудник);
	Если ПриказОПриеме <> Неопределено Тогда
		ПриказОбъект = ПриказОПриеме.ПолучитьОбъект();
		ПриказОбъект.Решение = Ссылка;
		ПриказОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтвязатьСотрудника(Сотрудник)

	Если Сотрудник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Ложь, 
		Сотрудник, "ДатаНачалаУчета, ВАрхиве", ТекущаяДатаСеанса());
	УстановитьПривилегированныйРежим(Ложь);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Сотрудник = Неопределено Или Не ЗначениеЗаполнено(ДанныеСотрудника.ДатаНачалаУчета), 
		СтрШаблон(НСтр("ru = 'С документом связан сотрудник %1, по которому зарегистрированы трудовые отношения. 
			 |Операции с решением о приеме на работу более и невозможны, и не имеют смысла.'"), Сотрудник));

	УстановитьПривилегированныйРежим(Истина);
	КадровыйУчет.ПоместитьСотрудникаВАрхив(Сотрудник, Истина);
	Документы.РешениеОПриемеНаРаботу.ОтвязатьСотрудникаОтРешенияОПриемеНаРаботу(Ссылка);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции

#Область ОбменДанными

Функция СовместноРегистрируемыеОбъекты() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат);
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли