&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мИдГруппы21  = "П0002100001";
	СтруктураРеквизитовФормы.мИдГруппы22  = "П0002200001";
	СтруктураРеквизитовФормы.мИдГруппы23  = "П0002300001";
	СтруктураРеквизитовФормы.мИдГруппы24  = "П0002400002";
	СтруктураРеквизитовФормы.мИдГруппы25  = "П0002500002";
	СтруктураРеквизитовФормы.мИдГруппы26  = "П0002600002";
	СтруктураРеквизитовФормы.мИдГруппы27  = "П0002700002";
	СтруктураРеквизитовФормы.мИдГруппы28  = "П0002800002";
	
	//200.02
	КолИсхСтрокИдГруппы21  = 1;
	КолИсхСтрокИдГруппы22  = 1;
	КолИсхСтрокИдГруппы23  = 1;
	КолИсхСтрокИдГруппы24  = 1;
	КолИсхСтрокИдГруппы25  = 1;
	КолИсхСтрокИдГруппы26  = 1;
	КолИсхСтрокИдГруппы27  = 1;
	КолИсхСтрокИдГруппы28  = 1;
	
	//200.02
	КолКолонокИдГруппы21 = 5;
	КолКолонокИдГруппы22 = 5;
	КолКолонокИдГруппы23 = 5;
	КолКолонокИдГруппы24 = 5;
	КолКолонокИдГруппы25 = 5;
	КолКолонокИдГруппы26 = 4;
	КолКолонокИдГруппы27 = 4;
	КолКолонокИдГруппы28 = 5;
	
	СтруктураДанныхФорма200Страница1        = Новый Структура;
	СтруктураДанныхФорма200Страница2        = Новый Структура;
	СтруктураДанныхФорма200Страница3        = Новый Структура;
	СтруктураДанныхФорма200_01Страница1     = Новый Структура;
	СтруктураДанныхФорма200_01Страница2     = Новый Структура;
	
	СтруктураДанныхФорма200_02Страница1     = Новый Структура;
	СтруктураДанныхФорма200_02Страница2     = Новый Структура;
	СтруктураДанныхФорма200_02Страница3     = Новый Структура;
	СтруктураДанныхФорма200_02Страница4     = Новый Структура;
	СтруктураДанныхФорма200_02Страница5     = Новый Структура;
	СтруктураДанныхФорма200_02Страница6     = Новый Структура;
	СтруктураДанныхФорма200_02Страница7     = Новый Структура;
	СтруктураДанныхФорма200_02Страница8     = Новый Структура;
	
	мСтруктураФорма200_03Страница1и2 = Новый Структура;
	мСтруктураФорма200_03Страница1и2.Вставить("Форма200_03", "ТаблицаСтраницыФорма200_03");
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;

	//200.02
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21,  СтруктураРеквизитовФормы.мИдГруппы21);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22,  СтруктураРеквизитовФормы.мИдГруппы22);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23,  СтруктураРеквизитовФормы.мИдГруппы23);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы24,  СтруктураРеквизитовФормы.мИдГруппы24);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы25,  СтруктураРеквизитовФормы.мИдГруппы25);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы26,  СтруктураРеквизитовФормы.мИдГруппы26);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы27,  СтруктураРеквизитовФормы.мИдГруппы27);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы28,  СтруктураРеквизитовФормы.мИдГруппы28);

	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	
	//200.02
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолИсхСтрокИдГруппы21);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22, КолИсхСтрокИдГруппы22);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23, КолИсхСтрокИдГруппы23);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы24, КолИсхСтрокИдГруппы24);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы25, КолИсхСтрокИдГруппы25);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы26, КолИсхСтрокИдГруппы26);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы27, КолИсхСтрокИдГруппы27);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы28, КолИсхСтрокИдГруппы28);

	мСтруктураКолвоКолонокРазделов = Новый Структура;
	//200.02
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолКолонокИдГруппы21);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы22, КолКолонокИдГруппы22);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы23, КолКолонокИдГруппы23);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы24, КолКолонокИдГруппы24);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы25, КолКолонокИдГруппы25);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы26, КолКолонокИдГруппы26);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы27, КолКолонокИдГруппы27);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы28, КолКолонокИдГруппы28);

	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента             = 0;
	мСписокСтруктурныхЕдиниц                          = Параметры.СписокСтруктурныхЕдиниц;
	СтруктураРеквизитовФормы.НалоговыйКомитет		  = Параметры.НалоговыйКомитет;
	НалоговыйКомитетФорма							  = Параметры.НалоговыйКомитет;
	
	ИмяРаздела = "Форма200Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");                   
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы21");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы22");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы23");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы24");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы25");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы26");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы27");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы28");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница1";
	СтрокаУровня1.Представление            = "Форма 200.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница2";
	СтрокаУровня1.Представление            = "Форма 200.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница3";
	СтрокаУровня1.Представление            = "Форма 200.00 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_01Страница1";
	СтрокаУровня1.Представление            = "Форма 200.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_01Страница2";
	СтрокаУровня1.Представление            = "Форма 200.01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница1";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница2";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница3";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница4";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница5";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 5";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница6";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 6";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница7";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 7";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница8";
	СтрокаУровня1.Представление            = "Форма 200.02 Страница 8";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_03Страница1";
	СтрокаУровня1.Представление            = "Форма 200.03";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма200Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_01Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы21;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы22;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы23;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы24;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница5";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы25;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница6";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы26;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница7";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы27;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница8";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы28;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 2;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_03Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_03Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если ЭтоРазделРодитель(ЭлементДереваСтраницОтчета.ИмяСтраницы) Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				ЭлементРазделовОтчета.РазделМногостраничный = Ложь;
				ЭлементРазделовОтчета.РазделМногострочный = МногострочныйРаздел(ЭлементДереваСтраницОтчета.ИмяСтраницы);
				
				Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
				КонецЦикла;
				
			ИначеЕсли ЭлементДереваСтраницОтчета.ИмяСтраницы = "Форма200_03Страница1" Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				
				Если Форма["ТаблицаСтраницыФорма200_03"].Количество() > 0 Тогда
					Форма200_03Количество = Форма["ТаблицаСтраницыФорма200_03"].Количество();
				Иначе
					Форма200_03Количество = 1;
				КонецЕсли;
				
				ЭлементРазделовОтчета.РазделМногостраничный = Истина;
				ЭлементРазделовОтчета.РазделМногострочный = Ложь;
				
				ЭлементРазделовОтчета.КолонкаНомерСтраницыРазделаОтчета = 1;
				
				Для НомерСтраницы = 1 По Форма200_03Количество Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = "Форма 200.03 Лист " + НомерСтраницы;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = "Форма200_03Страница1";
					СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
					
					ПодстраницаРазделаОтчет1 = СтраницаРазделаОтчета.ПолучитьЭлементы().Добавить();
					
					ПодстраницаРазделаОтчет1.КолонкаРазделыОтчета      = "Форма 200.03 Страница 1";
					ПодстраницаРазделаОтчет1.КолонкаРазделыОтчетаСокрНаим      = "Форма200_03Страница1";
					ПодстраницаРазделаОтчет1.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					ПодстраницаРазделаОтчет1.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					ПодстраницаРазделаОтчет1.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
					
					ПодстраницаРазделаОтчет2 = СтраницаРазделаОтчета.ПолучитьЭлементы().Добавить();
					
					ПодстраницаРазделаОтчет2.КолонкаРазделыОтчета      = "Форма 200.03 Страница 2";
					ПодстраницаРазделаОтчет2.КолонкаРазделыОтчетаСокрНаим      = "Форма200_03Страница2";
					ПодстраницаРазделаОтчет2.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					ПодстраницаРазделаОтчет2.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					ПодстраницаРазделаОтчет2.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма200Страница1")
			Или (ИмяРаздела = "Форма200_01Страница1")
			ИЛИ (ИмяРаздела = "Форма200_02Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция МногострочныйРаздел(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма200_02Страница1")
			ИЛИ (ИмяРаздела = "Форма200_02Страница2")
			ИЛИ (ИмяРаздела = "Форма200_02Страница3")
			ИЛИ (ИмяРаздела = "Форма200_02Страница4")
			ИЛИ (ИмяРаздела = "Форма200_02Страница5")
			ИЛИ (ИмяРаздела = "Форма200_02Страница6")
			ИЛИ (ИмяРаздела = "Форма200_02Страница7")
			ИЛИ (ИмяРаздела = "Форма200_02Страница8");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма200Страница1" Тогда
		Возврат 3;
	ИначеЕсли Родитель = "Форма200_01Страница1" Тогда
		Возврат 2;
	ИначеЕсли Родитель = "Форма200_02Страница1" Тогда
		Возврат 8;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мКвартал = Лев(СтрПериодОтчета,1);
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//200Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение1;Приложение2;Приложение3");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "Признак7A;Признак7B;Признак7C;Признак7D;Признак7E");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("РезидентУчереждение", "Резидент;Нерезидент");

	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010001401", "П000010001101;П000010001201;П000010001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002401", "П000010002101;П000010002201;П000010002301");
	//200Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020003401", "П000020003101;П000020003201;П000020003301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020004401", "П000020004101;П000020004201;П000020004301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020005401", "П000020005101;П000020005201;П000020005301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020006401", "П000020006101;П000020006201;П000020006301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020007401", "П000020007101;П000020007201;П000020007301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020008401", "П000020008101;П000020008201;П000020008301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020009401", "П000020009101;П000020009201;П000020009301");
	//200Стр3
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030010401", "П000030010101;П000030010201;П000030010301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000030011401", "П000030011101;П000030011201;П000030011301");
	//200.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110001401", "П000110001101;П000110001201;П000110001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110002401", "П000110002101;П000110002201;П000110002301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110006401", "П000110006101;П000110006201;П000110006301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110007401", "П000110007101;П000110007201;П000110007301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110008401", "П000110008101;П000110008201;П000110008301");
	//200.01Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120009401", "П000120009101;П000120009201;П000120009301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120013401", "П000120013101;П000120013201;П000120013301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120014401", "П000120014101;П000120014201;П000120014301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120015401", "П000120015101;П000120015201;П000120015301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120016401", "П000120016101;П000120016201;П000120016301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120017401", "П000120017101;П000120017201;П000120017301");
	//200.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210000101_1", "П000210000102_1;П000210000103_1;П000210000104_1;П000210000105_1");//Заполнение 1й строки в многострочной форме
	//200.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220000101_1", "П000220000102_1;П000220000103_1;П000220000104_1;П000220000105_1");//Заполнение 1й строки в многострочной форме
	//200.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000230000101_1", "П000230000102_1;П000230000103_1;П000230000104_1;П000230000105_1");//Заполнение 1й строки в многострочной форме
	//200.02Стр4
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000201_1", "П000240000202_1;П000240000203_1;П000240000204_1;П000240000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000103", "П000240000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000104", "П000240000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000240000105", "П000240000205");
	//200.02Стр5
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000201_1", "П000250000202_1;П000250000203_1;П000250000204_1;П000250000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000102", "П000250000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000103", "П000250000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000104", "П000250000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000250000105", "П000250000205");
	//200.02Стр6
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000201_1", "П000260000202_1;П000260000203_1;П000260000204_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000102", "П000260000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000103", "П000260000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000260000104", "П000260000204");
	//200.02Стр7
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000201_1", "П000270000202_1;П000270000203_1;П000270000204_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000102", "П000270000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000103", "П000270000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000104", "П000270000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000270000204", "П000240000203;П000270000203;П000240000205");
	//200.02Стр8
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000201_1", "П000280000202_1;П000280000203_1;П000280000204_1;П000280000205_1");//Заполнение 1й строки в многострочной форме
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000102", "П000280000202");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000103", "П000280000203");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000104", "П000280000204");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000280000105", "П000280000205");

	//200.03Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000310001401", "П000310001101;П000310001201;П000310001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000310002401", "П000310002101;П000310002201;П000310002301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000310003401", "П000310003101;П000310003201;П000310003301");
	//200.03Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320004401", "П000320004101;П000320004201;П000320004301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320005401", "П000320005101;П000320005201;П000320005301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320006401", "П000320006101;П000320006201;П000320006301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000320007401", "П000320007101;П000320007201;П000320007301");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		НачальныеОперацииСМногострочнымиБлоками();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма200Страница1","Очередная");
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук,КБЕ";
	СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);

	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Квартал"].Значение) Тогда
		ТабличныйДокумент.Области["Квартал"].Значение = СтруктураРеквизитовФормы.мКвартал;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено Тогда
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			НачПозиция = 1;
			Для Шаг = 1 По 3 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		Иначе
			НачПозиция = 1;
			Для Шаг = 1 По 2 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	Резидент = ?(Лев(СведенияОбОрганизации.КБе,1) = "2", Ложь, Истина);
	
	Если ТабличныйДокумент.Области.Найти("Резидент") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Резидент"].Значение) Тогда
		ТабличныйДокумент.Области["Резидент"].Значение = ?(Резидент,    "Х", "");
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Нерезидент") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Нерезидент"].Значение) Тогда
		ТабличныйДокумент.Области["Нерезидент"].Значение = ?(НЕ Резидент, "Х", "");
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередная"].Значение = "" И
				  ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
				  ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
				  ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
				
				ТабличныйДокумент.Области["Очередная"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОрганаИПН") <> Неопределено И ТабличныйДокумент.Области.Найти("КодНалоговогоОрганаОПВиСО") <> Неопределено 
																				   И СтруктураРеквизитовФормы.НаимТекущегоРаздела ="Форма200Страница3" Тогда
		КодНалоговогоОргана = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
		Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОрганаИПН"].Значение) Тогда
			ТабличныйДокумент.Области["КодНалоговогоОрганаИПН"].Значение = КодНалоговогоОргана;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОрганаОПВиСО"].Значение) Тогда
			ТабличныйДокумент.Области["КодНалоговогоОрганаОПВиСО"].Значение = КодНалоговогоОргана;
		КонецЕсли;
	КонецЕсли;

	Если ТабличныйДокумент.Области.Найти("ДатаПодачи") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ДатаПодачи"].Значение) Тогда
		ТабличныйДокумент.Области.ДатаПодачи.Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем СтруктураФорма200_03;
	Перем СписокСтруктурныхЕдиниц;
	Перем СписокРегистраций;
	Перем НалоговыйКомитет;
		
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("СписокСтруктурныхЕдиниц", СписокСтруктурныхЕдиниц);
	СписокСохранения.Свойство("СписокРегистраций", СписокРегистраций);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	

	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если Раздел.ИмяСтраницы = "Форма200_03Страница1"
			ИЛИ Раздел.ИмяСтраницы = "Форма200_03Страница2" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
	КонецЦикла;
	
	СтруктураФорма200_03 = Новый Структура;
	Если СписокСохранения.Свойство("Форма200_03", СтруктураФорма200_03) Тогда
		
		Для Каждого ЭлементСтруктуры Из СтруктураФорма200_03 Цикл
			
			Если ЭлементСтруктуры.Ключ = "Форма200_03" Тогда
				
				Для Каждого ЭлементФорма200_03 Из ЭлементСтруктуры.Значение Цикл
					
					Страница1 = Новый СписокЗначений;
					
					Страница1.Добавить(ЭлементФорма200_03.Страница1);
					
					ЭлементФорма200_03.Страница1 = Страница1;
					
					Страница2 = Новый СписокЗначений;
					
					Страница2.Добавить(ЭлементФорма200_03.Страница2);
					
					ЭлементФорма200_03.Страница2 = Страница2;
					
				КонецЦикла;
				
				ТаблСтрФорма200_03 = ЭтаФорма["ТаблицаСтраницыФорма200_03"];
				
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ТаблСтрФорма200_03);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	мСписокСтруктурныхЕдиниц = СписокСтруктурныхЕдиниц;
	НалоговыйКомитетФорма = НалоговыйКомитет;
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;

	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногостраничный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета = 1)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета) ;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
		
	//многострочные разделы
	Если ИмяТекРаздела = "Форма200_02Страница1"
		ИЛИ ИмяТекРаздела = "Форма200_02Страница2"
		ИЛИ ИмяТекРаздела = "Форма200_02Страница3"
		ИЛИ ИмяТекРаздела = "Форма200_02Страница4"
		ИЛИ ИмяТекРаздела = "Форма200_02Страница5"
		ИЛИ ИмяТекРаздела = "Форма200_02Страница6"
		ИЛИ ИмяТекРаздела = "Форма200_02Страница7"
		ИЛИ ИмяТекРаздела = "Форма200_02Страница8" Тогда
		
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ИмяТекРаздела = "Форма200_03Страница1" Тогда
		
		Если ЭтаФорма[мСтруктураФорма200_03Страница1и2.Форма200_03].Количество() = 0 Тогда
			ПостроениеПервоначальнойСтруктурыНаСервере(Истина, ИмяТекРаздела);
		КонецЕсли;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрСледующаяСтраница = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		СтрСледующаяСтраница.АктивнаяСтраница = Истина;
		
		СтруктураДанныхСледующаяСтраница = СтрСледующаяСтраница.Страница1[0].Значение;
		
		Если СтруктураДанныхСледующаяСтраница <> Неопределено Тогда
			Для Каждого Элемент Из СтруктураДанныхСледующаяСтраница Цикл
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;
												
				Попытка
					ТабличныйДокумент.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		УстановитьДоступностьКнопкиУдалитьСтраницу(ТаблицаСтраницРаздела);
		
	ИначеЕсли ИмяТекРаздела = "Форма200_03Страница2" Тогда
		
		Если ЭтаФорма[мСтруктураФорма200_03Страница1и2.Форма200_03].Количество() = 0 Тогда
			ПостроениеПервоначальнойСтруктурыНаСервере(Истина, ИмяТекРаздела);
			НомерСтраницыФорма200_03Страница2Отчета = 1;
		КонецЕсли;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		СтрСледующаяСтраница = СтрТаблицаСтраницы.Страница2[0].Значение;
		
		СтрТаблицаСтраницы.АктивнаяСтраница = Истина;
		
		Если СтрСледующаяСтраница <> Неопределено Тогда
			
			Для Каждого Элемент Из СтрСледующаяСтраница Цикл
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;
					
				Попытка
					ТабличныйДокумент.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
		
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
		
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
		
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВТаблице + 1, "ЧГ=");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
		
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
			
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
		
		Постфикс = Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=");
		
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
							
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Постфикс;
				
			КонецЕсли;
			
		КонецЦикла;
						
	КонецЦикла;	
		
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ИзменятьАктивнуюСтраницу = Истина)
	
	// Многострочные разделы.
	Если НаимРаздела = "Форма200_02Страница1"
		ИЛИ НаимРаздела = "Форма200_02Страница2"
		ИЛИ НаимРаздела = "Форма200_02Страница3"
		ИЛИ НаимРаздела = "Форма200_02Страница4"
		ИЛИ НаимРаздела = "Форма200_02Страница5"
		ИЛИ НаимРаздела = "Форма200_02Страница6"
		ИЛИ НаимРаздела = "Форма200_02Страница7"
		ИЛИ НаимРаздела = "Форма200_02Страница8" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
		
	ИначеЕсли НаимРаздела = "Форма200_03Страница1"
		ИЛИ НаимРаздела = "Форма200_03Страница2" Тогда	
		
		СохранитьАктивнуюФорму200_03НаСервере(НаимРаздела);
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если СтрТаблицаСтраницы.Количество() > 0 Тогда
			
			СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
			
			СтрТаблицаСтраницы.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;
		
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьАктивнуюФорму200_03НаСервере(ИмяСтраницы)
	
	СохранитьАктивнуюФорму200_03(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьАктивнуюФорму200_03(Форма, ИмяСтраницы)
	Перем ТаблицаСтраницРаздела;
	
	Если Не Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	ТекТабличноеПоле      = Форма.ТабличныйДокумент;
	
	СтрТаблицаСтраницы    = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
					
		СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");
		
		Если ИмяСтраницы = "Форма200_03Страница2" Тогда
			
			Если СтрТаблицаСтраницы.Страница2.Количество() > 0 Тогда
				СтрТаблицаСтраницы.Страница2[0].Значение = СтруктураДанныхТекущейТаблицы;
			Иначе
				СтрТаблицаСтраницы.Страница2.Добавить(СтруктураДанныхТекущейТаблицы);
			КонецЕсли;	
				
		КонецЕсли;
		
		Если ИмяСтраницы = "Форма200_03Страница1" Тогда
			
			Если СтрТаблицаСтраницы.Страница1.Количество() > 0 Тогда
				СтрТаблицаСтраницы.Страница1[0].Значение = СтруктураДанныхТекущейТаблицы;
			Иначе
				СтрТаблицаСтраницы.Страница1.Добавить(СтруктураДанныхТекущейТаблицы);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
	Если ИмяСтраницыПанели = "Форма200_02Страница7" Тогда
		//0000000(X)Y
		Если ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(ЭтаФорма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000204, Лев(ОбластьИмя,13)) > 0 Тогда
			
			Префикс = Сред(ОбластьИмя,Найти(ОбластьИмя,"_"),СтрДлина(ОбластьИмя) - (Найти(ОбластьИмя,"_")-1));
			Индекс = Число(Прав(Префикс,СтрДлина(Префикс)-1)) - 1;
			
			ОкрП000240000203 = 0;
			ОкрП000240000205 = 0;
			ОкрП000270000203 = 0;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "ФормаФорма200_02Страница4" Тогда
				ОкрП000240000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.ТабличныйДокумент.Области["П000240000203" + Префикс].Значение);
			Иначе
				ОкрП000240000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.П0002400002[Индекс].П000240000203);
			КонецЕсли;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница4" Тогда
				ОкрП000240000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.ТабличныйДокумент.Области["П000240000205" + Префикс].Значение);
			Иначе
				ОкрП000240000205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.П0002400002[Индекс].П000240000205);
			КонецЕсли;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница7" Тогда
				ОкрП000270000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.ТабличныйДокумент.Области["П000270000203" + Префикс].Значение);
			Иначе
				ОкрП000270000203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(ЭтаФорма, ЭтаФорма.П0002700002[Индекс].П000270000203);
			КонецЕсли;
			
			П000270000204 = ОкрП000240000203 - ОкрП000270000203 - ОкрП000240000205;
			
			ЭтаФорма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000204" + Префикс, П000270000204);
			
			ЭтаФорма.П0002700002[Индекс].П000270000204 = П000270000204;
			
			Если ЭтаФорма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница7" Тогда
				ЭтаФорма.ТабличныйДокумент.Области["П000270000204" + Префикс].Значение = П000270000204;
			КонецЕсли;
			
			Расчет(ЭтаФорма, "Форма200_02Страница7", "П000270000204");  //перерасчет 7й стр. форма 200.02
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	Перем ТаблицаСтраницРаздела;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма200Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Очередная",           Очередная);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Ликвидационная", Ликвидационная);
			
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];

			ТаблицаСтраницРаздела[0].Страница1[0].Значение.Вставить("Первоначальная", Первоначальная);
			ТаблицаСтраницРаздела[0].Страница1[0].Значение.Вставить("Очередная",           Очередная);
			ТаблицаСтраницРаздела[0].Страница1[0].Значение.Вставить("Дополнительная", Дополнительная);
			ТаблицаСтраницРаздела[0].Страница1[0].Значение.Вставить("ПоУведомлению",   ПоУведомлению);
			ТаблицаСтраницРаздела[0].Страница1[0].Значение.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				ТаблицаСтраницРаздела[0].Страница1[0].Значение.Вставить("НомерУведомления", "");
				ТаблицаСтраницРаздела[0].Страница1[0].Значение.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма200Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма200Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение1 = "";
			Приложение2 = "";
			Приложение3 = "";
			
			Если ОбластьИмя = "Приложение1" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Приложение1 = Форма.ТабличныйДокумент.Области.Приложение1.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Приложение1") Тогда
					Приложение1 = Форма.СтруктураДанныхФорма200Страница1.Приложение1;
				КонецЕсли;
				
				Приложение1 = ?(Приложение1 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение1", Приложение1);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение1.Значение = Приложение1;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение2" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Приложение2 = Форма.ТабличныйДокумент.Области.Приложение2.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Приложение2") Тогда
					Приложение2 = Форма.СтруктураДанныхФорма200Страница1.Приложение2;
				КонецЕсли;
				
				Приложение2 = ?(Приложение2 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", Приложение2);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение2.Значение = Приложение2;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение3" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Приложение3 = Форма.ТабличныйДокумент.Области.Приложение3.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Приложение3") Тогда
					Приложение3 = Форма.СтруктураДанныхФорма200Страница1.Приложение3;
				КонецЕсли;
				
				Приложение3 = ?(Приложение3 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение3", Приложение3);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение3.Значение = Приложение3;
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			Признак7A = "";
			Признак7B = "";
			Признак7C = "";
			Признак7D = "";
			Признак7E = "";
			
			Если ОбластьИмя = "Признак7A" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7A = Форма.ТабличныйДокумент.Области.Признак7A.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7A") Тогда
					Признак7A = Форма.СтруктураДанныхФорма200Страница1.Признак7A;
				КонецЕсли;
				
				Признак7A = ?(Признак7A = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7A", Признак7A);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7A.Значение = Признак7A;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7B" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7B = Форма.ТабличныйДокумент.Области.Признак7B.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7B") Тогда
					Признак7B = Форма.СтруктураДанныхФорма200Страница1.Признак7B;
				КонецЕсли;
				
				Признак7B = ?(Признак7B = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7B", Признак7B);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7B.Значение = Признак7B;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7C" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7C = Форма.ТабличныйДокумент.Области.Признак7C.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7C") Тогда
					Признак7C = Форма.СтруктураДанныхФорма200Страница1.Признак7C;
				КонецЕсли;
				
				Признак7C = ?(Признак7C = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7C", Признак7C);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7C.Значение = Признак7C;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7D" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7D = Форма.ТабличныйДокумент.Области.Признак7D.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7D") Тогда
					Признак7D = Форма.СтруктураДанныхФорма200Страница1.Признак7D;
				КонецЕсли;
				
				Признак7D = ?(Признак7D = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7D", Признак7D);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7D.Значение = Признак7D;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7E" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7E = Форма.ТабличныйДокумент.Области.Признак7E.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7E") Тогда
					Признак7E = Форма.СтруктураДанныхФорма200Страница1.Признак7E;
				КонецЕсли;
				
				Признак7E = ?(Признак7E = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7E", Признак7E);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7E.Значение = Признак7E;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.РезидентУчереждение, ОбластьИмя) > 0 Тогда
			
			Резидент                = "";
			Нерезидент              = "";
			
			Если ОбластьИмя = "Резидент" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Резидент = Форма.ТабличныйДокумент.Области.Резидент.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Резидент") Тогда
					Резидент = Форма.СтруктураДанныхФорма200Страница1.Резидент;
				КонецЕсли;
				
				Резидент = ?(Резидент = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Резидент", Резидент);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Резидент.Значение = Резидент;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Нерезидент", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Нерезидент.Значение = "";
				КонецЕсли;
				
				
			ИначеЕсли ОбластьИмя = "Нерезидент" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Нерезидент = Форма.ТабличныйДокумент.Области.Нерезидент.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Нерезидент") Тогда
					Нерезидент = Форма.СтруктураДанныхФорма200Страница1.Нерезидент;
				КонецЕсли;
				
				Нерезидент = ?(Нерезидент = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Нерезидент", Нерезидент);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Нерезидент.Значение = Нерезидент;
				КонецЕсли;
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Резидент", "");
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Резидент.Значение = "";
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
		
		
		//200.00.001 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010001401, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001101 = 0;
			ОкрП000010001201 = 0;
			ОкрП000010001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010001101") Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010001201") Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010001301") Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010001301);
			КонецЕсли;
			
			П000010001401 = ОкрП000010001101 + ОкрП000010001201 + ОкрП000010001301;
			
			Форма.СтруктураДанныхФорма200Страница1.Вставить("П000010001401", П000010001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010001401.Значение = П000010001401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.002 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002401, ОбластьИмя) > 0 Тогда
			
			ОкрП000010002101 = 0;
			ОкрП000010002201 = 0;
			ОкрП000010002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010002101") Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010002201") Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010002301") Тогда
				ОкрП000010002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010002301);
			КонецЕсли;
			
			П000010002401 = ОкрП000010002101 + ОкрП000010002201 + ОкрП000010002301;
			
			Форма.СтруктураДанныхФорма200Страница1.Вставить("П000010002401", П000010002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002401.Значение = П000010002401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200Страница2" Тогда
		
		//200.00.003 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020003401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020003101 = 0;
			ОкрП000020003201 = 0;
			ОкрП000020003301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020003101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020003101") Тогда
				ОкрП000020003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020003201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020003201") Тогда
				ОкрП000020003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020003301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020003301") Тогда
				ОкрП000020003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020003301);
			КонецЕсли;
			
			П000020003401 = ОкрП000020003101 + ОкрП000020003201 + ОкрП000020003301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020003401", П000020003401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020003401.Значение = П000020003401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.004 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020004401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020004101 = 0;
			ОкрП000020004201 = 0;
			ОкрП000020004301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020004101") Тогда
				ОкрП000020004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020004101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020004201") Тогда
				ОкрП000020004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020004201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020004301") Тогда
				ОкрП000020004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020004301);
			КонецЕсли;
			
			П000020004401 = ОкрП000020004101 + ОкрП000020004201 + ОкрП000020004301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020004401", П000020004401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020004401.Значение = П000020004401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.005 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020005401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020005101 = 0;
			ОкрП000020005201 = 0;
			ОкрП000020005301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020005101") Тогда
				ОкрП000020005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020005201") Тогда
				ОкрП000020005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020005201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020005301") Тогда
				ОкрП000020005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020005301);
			КонецЕсли;
			
			П000020005401 = ОкрП000020005101 + ОкрП000020005201 + ОкрП000020005301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020005401", П000020005401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020005401.Значение = П000020005401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.006 IV
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020006401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020006101 = 0;
			ОкрП000020006201 = 0;
			ОкрП000020006301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020006101") Тогда
				ОкрП000020006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020006201") Тогда
				ОкрП000020006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020006301") Тогда
				ОкрП000020006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020006301);
			КонецЕсли;
			
			П000020006401 = ОкрП000020006101 + ОкрП000020006201 + ОкрП000020006301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020006401", П000020006401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020006401.Значение = П000020006401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.007 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020007401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020007101 = 0;
			ОкрП000020007201 = 0;
			ОкрП000020007301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020007101") Тогда
				ОкрП000020007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020007201") Тогда
				ОкрП000020007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020007301") Тогда
				ОкрП000020007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020007301);
			КонецЕсли;
			
			П000020007401 = ОкрП000020007101 + ОкрП000020007201 + ОкрП000020007301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020007401", П000020007401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020007401.Значение = П000020007401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.008 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020008401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020008101 = 0;
			ОкрП000020008201 = 0;
			ОкрП000020008301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020008101") Тогда
				ОкрП000020008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020008101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020008201") Тогда
				ОкрП000020008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020008201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020008301") Тогда
				ОкрП000020008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020008301);
			КонецЕсли;
			
			П000020008401 = ОкрП000020008101 + ОкрП000020008201 + ОкрП000020008301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020008401", П000020008401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020008401.Значение = П000020008401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.009 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020009401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020009101 = 0;
			ОкрП000020009201 = 0;
			ОкрП000020009301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020009101") Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020009201") Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020009301") Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020009301);
			КонецЕсли;
			
			П000020009401 = ОкрП000020009101 + ОкрП000020009201 + ОкрП000020009301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020009401", П000020009401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020009401.Значение = П000020009401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200Страница3" Тогда
		
		//200.00.010 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030010401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030010101 = 0;
			ОкрП000030010201 = 0;
			ОкрП000030010301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				ОкрП000030010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030010101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница3.Свойство("П000030010101") Тогда
				ОкрП000030010101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница3.П000030010101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				ОкрП000030010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030010201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница3.Свойство("П000030010201") Тогда
				ОкрП000030010201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница3.П000030010201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				ОкрП000030010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030010301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница3.Свойство("П000030010301") Тогда
				ОкрП000030010301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница3.П000030010301);
			КонецЕсли;
			
			П000030010401 = ОкрП000030010101 + ОкрП000030010201 + ОкрП000030010301;
			
			Форма.СтруктураДанныхФорма200Страница3.Вставить("П000030010401", П000030010401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030010401.Значение = П000030010401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.011 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000030011401, ОбластьИмя) > 0 Тогда
			
			ОкрП000030011101 = 0;
			ОкрП000030011201 = 0;
			ОкрП000030011301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				ОкрП000030011101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030011101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница3.Свойство("П000030011101") Тогда
				ОкрП000030011101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница3.П000030011101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				ОкрП000030011201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030011201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница3.Свойство("П000030011201") Тогда
				ОкрП000030011201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница3.П000030011201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				ОкрП000030011301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000030011301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница3.Свойство("П000030011301") Тогда
				ОкрП000030011301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница3.П000030011301);
			КонецЕсли;
			
			П000030011401 = ОкрП000030011101 + ОкрП000030011201 + ОкрП000030011301;
			
			Форма.СтруктураДанныхФорма200Страница3.Вставить("П000030011401", П000030011401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница3" Тогда
				Форма.ТабличныйДокумент.Области.П000030011401.Значение = П000030011401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_01Страница1" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение1", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение1.Значение = "Х";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110001401, ОбластьИмя) > 0 Тогда
			//200.01.001 IV
			ОкрП000110001101 = 0;
			ОкрП000110001201 = 0;
			ОкрП000110001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110001101") Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110001201") Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110001301") Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110001301);
			КонецЕсли;
			
			П000110001401 = ОкрП000110001101 + ОкрП000110001201 + ОкрП000110001301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110001401", П000110001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110001401.Значение = П000110001401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110002401, ОбластьИмя) > 0 Тогда
			//200.01.002 IV
			ОкрП000110002101 = 0;
			ОкрП000110002201 = 0;
			ОкрП000110002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110002101") Тогда
				ОкрП000110002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110002201") Тогда
				ОкрП000110002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110002301") Тогда
				ОкрП000110002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110002301);
			КонецЕсли;
			
			П000110002401 = ОкрП000110002101 + ОкрП000110002201 + ОкрП000110002301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110002401", П000110002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110002401.Значение = П000110002401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110006401, ОбластьИмя) > 0 Тогда
			//200.01.006 IV
			ОкрП000110006101 = 0;
			ОкрП000110006201 = 0;
			ОкрП000110006301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110006101") Тогда
				ОкрП000110006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110006201") Тогда
				ОкрП000110006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110006301") Тогда
				ОкрП000110006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110006301);
			КонецЕсли;
			
			П000110006401 = ОкрП000110006101 + ОкрП000110006201 + ОкрП000110006301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110006401", П000110006401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110006401.Значение = П000110006401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110007401, ОбластьИмя) > 0 Тогда
			//200.01.007 IV
			ОкрП000110007101 = 0;
			ОкрП000110007201 = 0;
			ОкрП000110007301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110007101") Тогда
				ОкрП000110007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110007201") Тогда
				ОкрП000110007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110007301") Тогда
				ОкрП000110007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110007301);
			КонецЕсли;
			
			П000110007401 = ОкрП000110007101 + ОкрП000110007201 + ОкрП000110007301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110007401", П000110007401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110007401.Значение = П000110007401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110008401, ОбластьИмя) > 0 Тогда
			//200.01.008 IV
			ОкрП000110008101 = 0;
			ОкрП000110008201 = 0;
			ОкрП000110008301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110008101") Тогда
				ОкрП000110008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110008101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110008201") Тогда
				ОкрП000110008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110008201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110008301") Тогда
				ОкрП000110008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110008301);
			КонецЕсли;
			
			П000110008401 = ОкрП000110008101 + ОкрП000110008201 + ОкрП000110008301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110008401", П000110008401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110008401.Значение = П000110008401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_01Страница2" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение1", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение1.Значение = "Х";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120009401, ОбластьИмя) > 0 Тогда
			//200.01.009 IV
			ОкрП000120009101 = 0;
			ОкрП000120009201 = 0;
			ОкрП000120009301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120009101") Тогда
				ОкрП000120009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120009201") Тогда
				ОкрП000120009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120009301") Тогда
				ОкрП000120009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120009301);
			КонецЕсли;
			
			П000120009401 = ОкрП000120009101 + ОкрП000120009201 + ОкрП000120009301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120009401", П000120009401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120009401.Значение = П000120009401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120013401, ОбластьИмя) > 0 Тогда
			//200.01.013 IV
			ОкрП000120013101 = 0;
			ОкрП000120013201 = 0;
			ОкрП000120013301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120013101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120013101") Тогда
				ОкрП000120013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120013101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120013201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120013201") Тогда
				ОкрП000120013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120013201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120013301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120013301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120013301") Тогда
				ОкрП000120013301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120013301);
			КонецЕсли;
			
			П000120013401 = ОкрП000120013101 + ОкрП000120013201 + ОкрП000120013301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120013401", П000120013401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120013401.Значение = П000120013401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120014401, ОбластьИмя) > 0 Тогда
			//200.01.014 IV
			ОкрП000120014101 = 0;
			ОкрП000120014201 = 0;
			ОкрП000120014301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120014101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120014101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120014101") Тогда
				ОкрП000120014101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120014101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120014201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120014201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120014201") Тогда
				ОкрП000120014201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120014201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120014301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120014301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120014301") Тогда
				ОкрП000120014301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120014301);
			КонецЕсли;
			
			П000120014401 = ОкрП000120014101 + ОкрП000120014201 + ОкрП000120014301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120014401", П000120014401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120014401.Значение = П000120014401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120015401, ОбластьИмя) > 0 Тогда
			//200.01.015 IV
			ОкрП000120015101 = 0;
			ОкрП000120015201 = 0;
			ОкрП000120015301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120015101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120015101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120015101") Тогда
				ОкрП000120015101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120015101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120015201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120015201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120015201") Тогда
				ОкрП000120015201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120015201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120015301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120015301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120015301") Тогда
				ОкрП000120015301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120015301);
			КонецЕсли;
			
			П000120015401 = ОкрП000120015101 + ОкрП000120015201 + ОкрП000120015301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120015401", П000120015401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120015401.Значение = П000120015401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120016401, ОбластьИмя) > 0 Тогда
			//200.01.016 IV
			ОкрП000120015101 = 0;
			ОкрП000120015201 = 0;
			ОкрП000120015301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120016101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120016101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120016101") Тогда
				ОкрП000120016101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120016101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120016201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120016201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120016201") Тогда
				ОкрП000120016201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120016201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120016301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120016301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120016301") Тогда
				ОкрП000120016301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120016301);
			КонецЕсли;
			
			П000120016401 = ОкрП000120016101 + ОкрП000120016201 + ОкрП000120016301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120016401", П000120016401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120016401.Значение = П000120016401;
			КонецЕсли;
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120017401, ОбластьИмя) > 0 Тогда
			//200.01.015 IV
			ОкрП000120017101 = 0;
			ОкрП000120017201 = 0;
			ОкрП000120017301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120017101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120017101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120017101") Тогда
				ОкрП000120017101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120017101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120017201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120017201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120017201") Тогда
				ОкрП000120017201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120017201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120017301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120017301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120017301") Тогда
				ОкрП000120017301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120017301);
			КонецЕсли;
			
			П000120017401 = ОкрП000120017101 + ОкрП000120017201 + ОкрП000120017301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120017401", П000120017401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120017401.Значение = П000120017401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_03Страница1" Тогда
		
		Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		
		//Форма.СтруктураДанныхФорма200Страница1.Вставить("КоличествоПриложений200_03", ТаблицаСтраницРаздела.Количество());
		//Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение3", "X");
		//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			//Форма.ТабличныйДокумент.Области.КоличествоПриложений200_03.Значение = ТаблицаСтраницРаздела.Количество();
			//Форма.ТабличныйДокумент.Области.Приложение3.Значение = "X";
		//КонецЕсли;
		
		Если ОбластьИмя = "УдалитьСтраницу" Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Первоначальная", Первоначальная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Очередная",           Очередная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Дополнительная", Дополнительная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("ПоУведомлению",   ПоУведомлению);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("НомерУведомления", "");
				СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000310001401, ОбластьИмя) > 0 Тогда
			//200.03.001 IV
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000310001101 = 0;
			ОкрП000310001201 = 0;
			ОкрП000310001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310001101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310001101") Тогда
				ОкрП000310001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310001201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310001201") Тогда
				ОкрП000310001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310001301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310001301") Тогда
				ОкрП000310001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310001301);
			КонецЕсли;
			
			П000310001401 = ОкрП000310001101 + ОкрП000310001201 + ОкрП000310001301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000310001401", П000310001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000310001401.Значение = П000310001401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000310002401, ОбластьИмя) > 0 Тогда
			//200.03.002 IV
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000310002101 = 0;
			ОкрП000310002201 = 0;
			ОкрП000310002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310002101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310002101") Тогда
				ОкрП000310002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310002201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310002201") Тогда
				ОкрП000310002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310002301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310002301") Тогда
				ОкрП000310002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310002301);
			КонецЕсли;
			
			П000310002401 = ОкрП000310002101 + ОкрП000310002201 + ОкрП000310002301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000310002401",П000310002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000310002401.Значение = П000310002401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000310003401, ОбластьИмя) > 0 Тогда
			//200.03.003 IV
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000310003101 = 0;
			ОкрП000310003201 = 0;
			ОкрП000310003301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310003101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310003101") Тогда
				ОкрП000310003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310003201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310003201") Тогда
				ОкрП000310003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				ОкрП000310003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000310003301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000310003301") Тогда
				ОкрП000310003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000310003301);
			КонецЕсли;
			
			П000310003401 = ОкрП000310003101 + ОкрП000310003201 + ОкрП000310003301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000310003401",П000310003401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000310003401.Значение = П000310003401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница1" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210000101_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000210000101_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница2" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220000101_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000220000101_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница3"  Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000230000101_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000230000101_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница4" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000240000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001M
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000240000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
					СуммаП000240000103 = СуммаП000240000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000240000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000240000103.Значение = СуммаП000240000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
					СуммаП000240000103 = СуммаП000240000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]][Ном - 1].П000240000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000103", СуммаП000240000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001N
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000240000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
					СуммаП000240000104 = СуммаП000240000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000240000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000240000104.Значение = СуммаП000240000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
					СуммаП000240000104 = СуммаП000240000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]][Ном - 1].П000240000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000104", СуммаП000240000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001O
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000240000105, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000240000105 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
					СуммаП000240000105 = СуммаП000240000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000240000205_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000240000105.Значение = СуммаП000240000105;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]].Количество() Цикл
					СуммаП000240000105 = СуммаП000240000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы24]][Ном - 1].П000240000205);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000105", СуммаП000240000105);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если    "П000240000203" = Лев(ОбластьИмя,13)
			ИЛИ "П000240000205" = Лев(ОбластьИмя,13) Тогда
		
			Расчет(Форма, "Форма200_02Страница7", ОбластьИмя);  //перерасчет 7й стр. форма 200.01
		
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница5" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000250000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		//00000001P
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000250000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000102 = СуммаП000250000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000250000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000250000102.Значение = СуммаП000250000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000102 = СуммаП000250000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]][Ном - 1].П000250000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000102", СуммаП000250000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001Q
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000250000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000103 = СуммаП000250000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000250000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000250000103.Значение = СуммаП000250000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000103 = СуммаП000250000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]][Ном - 1].П000250000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000103", СуммаП000250000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001R
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000250000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000104 = СуммаП000250000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000250000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000250000104.Значение = СуммаП000250000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000104 = СуммаП000250000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]][Ном - 1].П000250000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000104", СуммаП000250000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001S
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000250000105, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000250000105 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000105 = СуммаП000250000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000250000205_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000250000105.Значение = СуммаП000250000105;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]].Количество() Цикл
					СуммаП000250000105 = СуммаП000250000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы25]][Ном - 1].П000250000205);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000105", СуммаП000250000105);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница6" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000260000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		//00000001T
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000260000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
					СуммаП000260000102 = СуммаП000260000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000260000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000260000102.Значение = СуммаП000260000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
					СуммаП000260000102 = СуммаП000260000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]][Ном - 1].П000260000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000102", СуммаП000260000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001U
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000260000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
					СуммаП000260000103 = СуммаП000260000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000260000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000260000103.Значение = СуммаП000260000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
					СуммаП000260000103 = СуммаП000260000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]][Ном - 1].П000260000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000103", СуммаП000260000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001T
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000260000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000260000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
					СуммаП000260000104 = СуммаП000260000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000260000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000260000104.Значение = СуммаП000260000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]].Количество() Цикл
					СуммаП000260000104 = СуммаП000260000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы26]][Ном - 1].П000260000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000104", СуммаП000260000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница7" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000270000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001W
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000270000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
					СуммаП000270000102 = СуммаП000270000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000270000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000270000102.Значение = СуммаП000270000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
					СуммаП000270000102 = СуммаП000270000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]][Ном - 1].П000270000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000102", СуммаП000270000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001X
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000270000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
					СуммаП000270000103 = СуммаП000270000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000270000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000270000103.Значение = СуммаП000270000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
					СуммаП000270000103 = СуммаП000270000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]][Ном - 1].П000270000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000103", СуммаП000270000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001Y
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000270000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000270000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
					СуммаП000270000104 = СуммаП000270000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000270000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000270000104.Значение = СуммаП000270000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]].Количество() Цикл
					СуммаП000270000104 = СуммаП000270000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы27]][Ном - 1].П000270000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000104", СуммаП000270000104);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница8" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000201_1, ОбластьИмя)> 0 Тогда 
			
			НомерСтроки = 2;
			Форма.СтруктураДанныхФорма200_02Страница1.Вставить("П000210000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница2.Вставить("П000220000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница3.Вставить("П000230000101_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница4.Вставить("П000240000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница5.Вставить("П000250000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница6.Вставить("П000260000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница7.Вставить("П000270000201_1", НомерСтроки);
			Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000201_1", НомерСтроки);
			
			Форма.П0002100001[0].П000210000101 = НомерСтроки;
			Форма.П0002200001[0].П000220000101 = НомерСтроки;
			Форма.П0002300001[0].П000230000101 = НомерСтроки;
			Форма.П0002400002[0].П000240000201 = НомерСтроки;
			Форма.П0002500002[0].П000250000201 = НомерСтроки;
			Форма.П0002600002[0].П000260000201 = НомерСтроки;
			Форма.П0002700002[0].П000270000201 = НомерСтроки;
			Форма.П0002800002[0].П000280000201 = НомерСтроки;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				Форма.ТабличныйДокумент.Области.П000280000201_1.Значение = 2;
			КонецЕсли;
			
		КонецЕсли;
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение2", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение2.Значение = "Х";
		КонецЕсли;
		
		//00000001Z
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000102, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000280000102 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000102 = СуммаП000280000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000280000202_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000280000102.Значение = СуммаП000280000102;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000102 = СуммаП000280000102 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]][Ном - 1].П000280000202);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000102", СуммаП000280000102);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001AA
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000103, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000280000103 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000103 = СуммаП000280000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000280000203_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000280000103.Значение = СуммаП000280000103;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000103 = СуммаП000280000103 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]][Ном - 1].П000280000203);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000103", СуммаП000280000103);
				
			КонецЕсли;
			
		КонецЕсли;
		
		//00000001AB
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000104, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000280000104 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000104 = СуммаП000280000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000280000204_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000280000104.Значение = СуммаП000280000104;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000104 = СуммаП000280000104 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]][Ном - 1].П000280000204);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000104", СуммаП000280000104);
				
			КонецЕсли;
			
		КонецЕсли;

		//00000001AС
		Если Не ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000280000105, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000280000105 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяСтраницыПанели Тогда
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000105 = СуммаП000280000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000280000205_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000280000105.Значение = СуммаП000280000105;
				
			Иначе
				
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]].Количество() Цикл
					СуммаП000280000105 = СуммаП000280000105 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы28]][Ном - 1].П000280000205);
				КонецЦикла;
				
				Форма.СтруктураДанныхФорма200_02Страница8.Вставить("П000280000105", СуммаП000280000105);
				
			КонецЕсли;
			
		КонецЕсли;

	ИначеЕсли ИмяСтраницыПанели = "Форма200_03Страница2" Тогда
		
		Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		
		//Форма.СтруктураДанныхФорма200Страница1.Вставить("КоличествоПриложений200_03", ТаблицаСтраницРаздела.Количество());
		//Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение3", "Х");
		//Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			//Форма.ТабличныйДокумент.Области.КоличествоПриложений200_03.Значение = ТаблицаСтраницРаздела.Количество();
			//Форма.ТабличныйДокумент.Области.Приложение3.Значение = "Х";
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320004401, ОбластьИмя) > 0 Тогда
			//200.03.004 IV
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000320004101 = 0;
			ОкрП000320004201 = 0;
			ОкрП000320004301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320004101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320004101") Тогда
				ОкрП000320004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320004101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320004201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320004201") Тогда
				ОкрП000320004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320004201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320004301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320004301") Тогда
				ОкрП000320004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320004301);
			КонецЕсли;
			
			П000320004401 = ОкрП000320004101 + ОкрП000320004201 + ОкрП000320004301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000320004401",П000320004401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000320004401.Значение = П000320004401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320005401, ОбластьИмя) > 0 Тогда
			//200.03.005 IV
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000320005101 = 0;
			ОкрП000320005201 = 0;
			ОкрП000320005301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320005101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320005101") Тогда
				ОкрП000320005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320005201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320005201") Тогда
				ОкрП000320005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320005201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320005301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320005301") Тогда
				ОкрП000320005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320005301);
			КонецЕсли;
			
			П000320005401 = ОкрП000320005101 + ОкрП000320005201 + ОкрП000320005301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000320005401",П000320005401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000320005401.Значение = П000320005401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320006401, ОбластьИмя) > 0 Тогда
			//200.03.006 IV
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000320006101 = 0;
			ОкрП000320006201 = 0;
			ОкрП000320006301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320006101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320006101") Тогда
				ОкрП000320006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320006201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320006201") Тогда
				ОкрП000320006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320006301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320006301") Тогда
				ОкрП000320006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320006301);
			КонецЕсли;
			
			П000320006401 = ОкрП000320006101 + ОкрП000320006201 + ОкрП000320006301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000320006401",П000320006401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000320006401.Значение = П000320006401;
			КонецЕсли;
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000320007401, ОбластьИмя) > 0 Тогда
			//200.03.007 IV
			Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000320007101 = 0;
			ОкрП000320007201 = 0;
			ОкрП000320007301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320007101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320007101") Тогда
				ОкрП000320007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320007201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320007201") Тогда
				ОкрП000320007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				ОкрП000320007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000320007301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000320007301") Тогда
				ОкрП000320007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000320007301);
			КонецЕсли;
			
			П000320007401 = ОкрП000320007101 + ОкрП000320007201 + ОкрП000320007301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000320007401",П000320007401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000320007401.Значение = П000320007401;
			КонецЕсли;
			
		КонецЕсли;
		
	//Авторасчет
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		
		Расчет(Форма,"Форма200Страница1", "");
		Расчет(Форма,"Форма200Страница2", "");
		Расчет(Форма,"Форма200Страница3", "");
		Расчет(Форма,"Форма200_01Страница1", "");
		Расчет(Форма,"Форма200_01Страница2", "");
		Расчет(Форма,"Форма200_02Страница1", "");
		Расчет(Форма,"Форма200_02Страница2", "");
		Расчет(Форма,"Форма200_02Страница3", "");
		Расчет(Форма,"Форма200_02Страница4", "");
		Расчет(Форма,"Форма200_02Страница5", "");
		Расчет(Форма,"Форма200_02Страница6", "");
		Расчет(Форма,"Форма200_02Страница7", "");
		Расчет(Форма,"Форма200_02Страница8", "");
		
		Для Индекс = 1 По Форма.П0002700002.Количество() Цикл
			Расчет(Форма,"Форма200_02Страница7", "П000240000203_" + Индекс);
		КонецЦикла;

		Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		Для Каждого СтрокаТЗ из ТаблицаСтраницРаздела Цикл
			СтрокаТЗ.АктивнаяСтраница = Истина;
			Расчет(Форма,"Форма200_03Страница1", "");
			Расчет(Форма,"Форма200_03Страница2", "");
			СтрокаТЗ.АктивнаяСтраница = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка (ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	СформироватьСписокФормБезИерархии();
	
	ТекстВыгрузки =  УниверсальнаяВыгрузкаНаСервере();
	
	Если ТекстВыгрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма200_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции

&НаКлиенте
Функция СформироватьМногострочнуюСтруктуруДляВыгрузки (ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Возврат СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы);	
	
КонецФункции

&НаСервере
Функция СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы, ТаблицаМногострочнойФормы = Неопределено) Экспорт
	
	Перем ТаблицаСтраницРаздела;
	
	Если ТекущееИмяФормы = Неопределено тогда
		ТекущееИмяФормы = "Форма200_03";
	КонецЕсли;	
	
	Если ТекущееИмяФормы = "Форма200_03" Тогда
		Если ЭтаФорма["ТаблицаСтраницы"+ТекущееИмяФормы] = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		КоличествоСтраниц = 0;
		Для каждого ЭлементДерева из мСписокФормБезИерархии.ПолучитьЭлементы() Цикл
			
			Если ЭлементДерева.КодФормы = ТекущееИмяФормы Тогда
				КоличествоСтраниц = ЭлементДерева.КоличествоСтраницПриложения;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		МногострочнаяСтруктура = Новый Структура;
		
		Для Ном = 1 По КоличествоСтраниц Цикл
			
			ДанныеСтраницы = Новый Структура;
			
			ДанныеСтраницы.Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
			
			ТаблицаЗначений = Новый ТаблицаЗначений;
			
			Для каждого СтрокаСписка из ТаблицаСтраницРаздела.Выгрузить(,("Страница"+Ном)) Цикл
				
				НоваяСтрокаТЗ = ТаблицаЗначений.Добавить();
				
				СтруктураСтраницы = СтрокаСписка["Страница"+Ном][0].Значение;
				
				Для Каждого ЭлементСтрутуры из СтруктураСтраницы Цикл
					
					Если ТаблицаЗначений.Колонки.Найти(ЭлементСтрутуры.Ключ) = Неопределено Тогда
						ТипКолонки = Новый Массив;
						ТипКолонки.Добавить(ТипЗнч(ЭлементСтрутуры.Значение));
						ТаблицаЗначений.Колонки.Добавить(ЭлементСтрутуры.Ключ, Новый ОписаниеТипов(ТипКолонки));
					КонецЕсли;
					
					НоваяСтрокаТЗ[ЭлементСтрутуры.Ключ] = ЭлементСтрутуры.Значение;
					
				КонецЦикла;
				
			КонецЦикла;
			
			ДанныеСтраницы.Вставить("Строки",      ТаблицаЗначений);
			
			МногострочнаяСтруктура.Вставить("Страница"+Ном, ДанныеСтраницы);
			
		КонецЦикла;
		
	Иначе
		МногострочнаяСтруктура = Новый Структура;
		
		ТекущийЛист = Неопределено;
		НомерСтроки = 0;
		КоличествоСтрок = ТаблицаМногострочнойФормы.Количество();
		
		Пока Истина Цикл 
			
			Если НомерСтроки >= КоличествоСтрок Тогда 
				Прервать;
			КонецЕсли;
			
			СтрокаТЗ = ТаблицаМногострочнойФормы[НомерСтроки];
			
			Если Не СтрокаТЗ.ИмяЛиста = ТекущийЛист Тогда
				
				МногострочнаяСтруктура.Вставить(СтрокаТЗ.ИмяЛиста, Новый Структура);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("Строки", Новый ТаблицаЗначений);
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста].Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
				
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Значение");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяОбласти");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("ИмяПараметра");
				МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Колонки.Добавить("Итог");
				
				
				ТекущийЛист = СтрокаТЗ.ИмяЛиста;
				
			КонецЕсли;
			
			Если СтрокаТЗ.КоличествоROW = "0" Тогда
				//Заполняем таблицу значений параметров шапки
				Если ЗначениеЗаполнено(СтрокаТЗ.ИмяЯчейки) Тогда
					//Добавим новую строку в ТЗ значений шапки таблицы
					НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["ШапкаИПодвал"].Добавить();
					
					//Получим значение параметра из структуры формы
					ЗначениеПараметра = ЭтаФорма["СтруктураДанных" + СтрокаТЗ.КодФормы + ?(СтрокаТЗ.КодФормы = "Форма200_02", СтрокаТЗ.ИмяЛиста, "Страница1")][СтрокаТЗ.ИмяЯчейки];
					
					НоваяСтрока.Значение 		= ЗначениеПараметра;
					НоваяСтрока.ИмяПараметра 	= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.ИмяОбласти 		= СтрокаТЗ.ИмяЯчейки;
					НоваяСтрока.Итог 			= Ложь;
				КонецЕсли;
			Иначе 
				//А это уже строки таблицы
				//Определим состав колонок многострочной формы
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ИмяЛиста", СтрокаТЗ.ИмяЛиста);
				СтруктураПоиска.Вставить("КоличествоROW", "15");
				СтрокиТаблицы = ТаблицаМногострочнойФормы.НайтиСтроки(СтруктураПоиска);
				
				ИмяТаблицы = Сред(СтрокаТЗ.ИмяЯчейки, 1, 11);
				
				//Проверям есть ли у нас вообще записи в многострочной форме
				//И формируем набор колонок таблицы значений
				ЕстьЗаписи = Ложь;
				Если Не ЭтотОбъект[ИмяТаблицы].Количество() = 0 Тогда
					Для Каждого Строка Из СтрокиТаблицы Цикл
						ИмяЯчейки = Сред(Строка.ИмяЯчейки, 1, 13);
						МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Колонки.Добавить(ИмяЯчейки);
						Если ЗначениеЗаполнено(ЭтотОбъект[ИмяТаблицы][0][ИмяЯчейки]) Тогда 
							ЕстьЗаписи = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ЕстьЗаписи Тогда
					//Если записи обнаружены то заполняем таблицу значений
					Для Каждого СтрокаТаблицы Из ЭтотОбъект[ИмяТаблицы] Цикл 
						НоваяСтрока = МногострочнаяСтруктура[СтрокаТЗ.ИмяЛиста]["Строки"].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					КонецЦикла;
				КонецЕсли;
				
				НомерСтроки = НомерСтроки + СтрокиТаблицы.Количество() - 1;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
	КонецЕсли;
		
	Возврат МногострочнаяСтруктура;

КонецФункции

&НаСервере
Процедура СформироватьСписокФормБезИерархии()
	
	мСписокФормБезИерархии.ПолучитьЭлементы().Очистить();
	
	МакетПоказателей = Отчеты[Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("Показатели");
	Префикс = Прав(ЭтаФорма.СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	ОбластьПоказателей = МакетПоказателей.Область("Форма200_" + Префикс);
	
	Для Ном = ОбластьПоказателей.Верх По ОбластьПоказателей.Низ Цикл
		
		НоваяСтрока = мСписокФормБезИерархии.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяФормы			= СокрП(МакетПоказателей.Область(Ном, 1).Текст);
		НоваяСтрока.Выгружать			= ?(СокрП(МакетПоказателей.Область(Ном, 2).Текст)= "1",Истина,Ложь);
		НоваяСтрока.Многострочность		= ?(СокрП(МакетПоказателей.Область(Ном, 3).Текст)= "1",Истина,Ложь);
		НоваяСтрока.КодФормы			= СокрП(МакетПоказателей.Область(Ном, 4).Текст);
		НоваяСтрока.КоличествоНаЛисте	= Число(СокрП(МакетПоказателей.Область(Ном, 5).Текст));
		НоваяСтрока.КоличествоСтраницПриложения = Число(СокрП(МакетПоказателей.Область(Ном, 6).Текст));
		
		Если НоваяСтрока.Многострочность <> Истина Тогда
			Для КолСтр = 1 По НоваяСтрока.КоличествоСтраницПриложения  Цикл
				Для Каждого Элемент Из ЭтаФорма["СтруктураДанных"+ НоваяСтрока.КодФормы + "Страница" + КолСтр] Цикл
					НовыйЭлемент = НоваяСтрока.Значение.Добавить();
					НовыйЭлемент.ИмяОбласти = Элемент.Ключ;
					НовыйЭлемент.Значение = Элемент.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция  УниверсальнаяВыгрузкаНаСервере()
	Возврат РегламентированнаяОтчетностьРК.ВыгрузитьОтчетВXMLДляСОНО(ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма200Страница1.Очистить();
	СтруктураДанныхФорма200Страница2.Очистить();
	СтруктураДанныхФорма200_01Страница1.Очистить();
	СтруктураДанныхФорма200_01Страница2.Очистить();
	СтруктураДанныхФорма200_02Страница1.Очистить();
	СтруктураДанныхФорма200_02Страница2.Очистить();
	СтруктураДанныхФорма200_02Страница3.Очистить();
	СтруктураДанныхФорма200_02Страница4.Очистить();
	СтруктураДанныхФорма200_02Страница5.Очистить();
	СтруктураДанныхФорма200_02Страница6.Очистить();
	СтруктураДанныхФорма200_02Страница7.Очистить();
	СтруктураДанныхФорма200_02Страница8.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200Страница1", 1);
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
		ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	мПараметры.Вставить("СписокСтруктурныхЕдиниц", Истина);
	мПараметры.Вставить("РежимВыбораСтруктурныхЕдиниц", "ПоНалогоплательщику");
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("СтруктурныеЕдиницы",        мСписокСтруктурныхЕдиниц);
	ПараметрыФормы.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	ПараметрыФормы.Вставить("мПараметры",                мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница1";
	СтрокаУровня1.Представление            = "Форма 200.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);

	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_01Страница1";
	СтрокаУровня1.Представление            = "Форма 200.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница1";
	СтрокаУровня1.Представление            = "Форма 200.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_03Страница1";
	СтрокаУровня1.Представление            = "Форма 200.03";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200_03Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьАвтоПослеСохранениеОтчета", 
		ЭтотОбъект, 
		ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ЗаполнитьАвтоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);

	ЗаполнитьПустыеСтруктурыДанных();
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц",  мСписокСтруктурныхЕдиниц);
	ПараметрыОтчета.Вставить("НалоговыйКомитет",		 СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма200Страница1", СтруктураДанныхФорма200Страница1);
	Контейнер.Вставить("Форма200Страница2", СтруктураДанныхФорма200Страница2);
	Контейнер.Вставить("Форма200Страница3", СтруктураДанныхФорма200Страница3);
	Контейнер.Вставить("Форма200_01Страница1", СтруктураДанныхФорма200_01Страница1);
	Контейнер.Вставить("Форма200_01Страница2", СтруктураДанныхФорма200_01Страница2);
	Контейнер.Вставить("Форма200_02Страница1", СтруктураДанныхФорма200_02Страница1);
	Контейнер.Вставить("Форма200_02Страница1_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002100001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_02Страница2", СтруктураДанныхФорма200_02Страница2);
	Контейнер.Вставить("Форма200_02Страница2_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002200001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_02Страница3", СтруктураДанныхФорма200_02Страница3);
	Контейнер.Вставить("Форма200_02Страница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002300001, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_02Страница4", СтруктураДанныхФорма200_02Страница4);
	Контейнер.Вставить("Форма200_02Страница4_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002400002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_02Страница5", СтруктураДанныхФорма200_02Страница5);
	Контейнер.Вставить("Форма200_02Страница5_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002500002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_02Страница6", СтруктураДанныхФорма200_02Страница6);
	Контейнер.Вставить("Форма200_02Страница6_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002600002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_02Страница7", СтруктураДанныхФорма200_02Страница7);
	Контейнер.Вставить("Форма200_02Страница7_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002700002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_02Страница8", СтруктураДанныхФорма200_02Страница8);
	Контейнер.Вставить("Форма200_02Страница8_ДанныеДопСтрок", ДанныеФормыВЗначение(П0002800002, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма200_03", ТаблицаСтраницыФорма200_03);
	
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(ИмяОтчета(ЭтаФорма.ИмяФормы), ИмяФормыОтчета(ЭтаФорма.ИмяФормы), ПараметрыОтчета, Контейнер);
	
	Для Каждого ЭлементКонтейнера Из Контейнер Цикл
		
		ИмяСтраницы = ЭлементКонтейнера.Ключ;
		
		Если ИмяСтраницы = "Форма200_03" Тогда
			Продолжить
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница1_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002100001);
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница2_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002200001);
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002300001);
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница4_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002400002);
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница5_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002500002);
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница6_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002600002);
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница7_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002700002);
		ИначеЕсли ИмяСтраницы = "Форма200_02Страница8_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0002800002);
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяСтраницы] = ЭлементКонтейнера.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);

	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200Страница1", 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
	РасчетНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	ТаблицаСтраницыФорма200_03.Очистить();
	ПостроениеПервоначальнойСтруктурыНаСервере(,"Форма200_03Страница1");
	
	П0002100001.Очистить();
	П0002200001.Очистить();
	П0002300001.Очистить();
	П0002400002.Очистить();
	П0002500002.Очистить();
	П0002600002.Очистить();
	П0002700002.Очистить();
	П0002800002.Очистить();

	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
			
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
		
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Вставить("СписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СписокСохранения.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	
	МассивТиповНеопределено = Новый Массив;
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	// вставляем данные многостраничных разделов
	Форма200_03 = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураФорма200_03Страница1и2 Цикл
		
		Форма200_03.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
		ТаблЗнач = Неопределено;
		
		Если Форма200_03.Свойство(ЭлементСтруктуры.Ключ, ТаблЗнач) Тогда
			
			Если НЕ ТаблЗнач.Колонки.Найти("Страница1") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("Страница1");
				ТаблЗнач.Колонки.Добавить("Страница1", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Страница1 = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Страница1[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ТаблЗнач.Колонки.Найти("Страница2") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("Страница2");
				ТаблЗнач.Колонки.Добавить("Страница2", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Страница2 = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Страница2[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокСохранения.Вставить("Форма200_03", Форма200_03);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;

	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если Раздел.ИмяСтраницы = "Форма200_03Страница1"
			ИЛИ Раздел.ИмяСтраницы = "Форма200_03Страница2" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
				   И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			
			Если ЭлеменетДерева.ИмяСтраницы = "Форма200_03Страница1" Тогда 
				
				Для Номер = 0 По ТаблицаСтраницыФорма200_03.Количество()-1 Цикл
					
				ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы,Номер+1);	
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  "Форма 200.03 Лист "+ (Номер+1) +" Страница 1");
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        "Форма200_03Страница1");
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200_03Страница2",Номер+1);	
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  "Форма 200.03 Лист "+ (Номер+1) +" Страница 2");
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        "Форма200_03Страница2");
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				КонецЦикла;
				
			Иначе
				ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 Тогда
		ДобавитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Гиперссылка Тогда
		УдалитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 И Область.Текст <> "" Тогда
		ДобавитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Текст <> "" Тогда
		УдалитьСтраницу("");
	КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7A") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7B") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7C") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7D") > 0) 
	 ИЛИ (Найти(ИмяЯчейки, "Признак7E") > 0) 
	 ИЛИ (Найти(ИмяЯчейки, "Приложение1") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Приложение2") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Приложение3") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Резидент") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Нерезидент") > 0) Тогда
		РасчетНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела,ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтраницуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Удалить текущий Лист?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РазделыОтчета.ТекущиеДанные;
	
	НомерУдоляемойСтраницы = ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
	Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьЭлементы().Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДанныхФормыДерево = ТекущиеДанные.ПолучитьЭлементы();
	ЭлементДереваПослеУдаления = ЭлементыДанныхФормыДерево.Получить(?(НомерУдоляемойСтраницы-1 = 0,1,НомерУдоляемойСтраницы-1) - 1).ПолучитьИдентификатор();
	УдаляемыйЛистДерева = ЭлементыДанныхФормыДерево.Получить(НомерУдоляемойСтраницы - 1);
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Форма200_03Страница1" Тогда
		УдалитьДопЛистФорма200_03НаСервере("Форма200_03Страница1");
	КонецЕсли;
	
	ТекущиеДанные.ПолучитьЭлементы().Удалить(ТекущиеДанные.ПолучитьЭлементы().Индекс(УдаляемыйЛистДерева));
	
	Элементы.РазделыОтчета.ТекущаяСтрока = ЭлементДереваПослеУдаления;
	НомерСтраницы = 1;
	Для Каждого СтраницаРаздела Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		СтраницаРаздела.КолонкаРазделыОтчета = "Форма 200.03 Лист " + НомерСтраницы ;
		СтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
		
		Для Каждого ПодСтраницаРаздела Из СтраницаРаздела.ПолучитьЭлементы() Цикл
			
			Если ПодСтраницаРаздела.КолонкаРазделыОтчетаСокрНаим = "Форма200_03Страница1" Тогда
				
				ПодСтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
				
			Иначе
				
				ПодСтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	РасчетНаКлиенте("Форма200_03Страница1","УдалитьСтраницу");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДопЛистФорма200_03НаСервере(ИмяТекущейСтраницыПанели = Неопределено)
	
	УдалитьДопЛистФорма200_03(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДопЛистФорма200_03(Форма, ИмяТекущейСтраницыПанели)
	
	Перем ТаблицаСтраницРаздела;
	
	Если Не Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	ИмяТекТабличногоПоля     = "ТабличныйДокумент";
	ТекТабличноеПоле         = Форма[ИмяТекТабличногоПоля];
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина))[0];
	ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
	
	Если СтрТаблицаСтраницы <> Неопределено Тогда
		
		Если ИмяТекущейСтраницыПанели = "Форма200_03Страница1" Тогда
			
			Если ТаблицаСтраницРаздела.Количество() <= 1 Тогда
				Возврат;
			КонецЕсли;
			
			ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
			ТаблицаСтраницРаздела.Удалить(СтрТаблицаСтраницы);
			
		КонецЕсли;
		
		// очищаем редактируемые ячейки удаляемой страницы
		ОчиститьТабличноеПоле(Форма, ИмяТекущейСтраницыПанели);
		
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	
	Модифицированность = Истина;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_03Страница1" Тогда
		
		ДобавитьЛистВФорму200_03НаСервере();
		
	КонецЕсли;
	
	Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "х";
	Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "Удалить Лист";
	
	РасчетНаКлиенте("Форма200_03Страница1");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЛистВФорму200_03НаСервере()
	
	ВставитьДопЛистФорма200_03НаСервере("Форма200_03Страница1");
	СохранитьАктивнуюФорму200_03НаСервере("Форма200_03Страница1");
	ОчиститьТабличноеПолеНаСервере("Форма200_03Страница2");
	СохранитьАктивнуюФорму200_03НаСервере("Форма200_03Страница2");
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДопЛистФорма200_03НаСервере(ИмяТекущейСтраницыПанели)
	
	ВставитьЛистВФорму200_03(ЭтаФорма, ИмяТекущейСтраницыПанели);
	ПослеВставкиДополнительногоЛистаВФорму200_03НаСервере(ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьЛистВФорму200_03(Форма, ИмяТекущейСтраницыПанели)

	Перем ТаблицаСтраницРаздела;
	Перем ТаблицаСтраница1;

	Если Не Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЛистовРаздела = Форма[ТаблицаСтраницРаздела];
	
	ТекТабличноеПоле     = Форма.ТабличныйДокумент;
	// находим активную страницу
	ТекущийЛист = ТаблицаЛистовРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если ИмяТекущейСтраницыПанели = "Форма200_03Страница1" Тогда
		
		СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");
		ТекущийЛист[0].АктивнаяСтраница = Ложь;
		
		НовыйЛист = ТаблицаЛистовРаздела.Добавить();
		НовыйЛист.Представление      = "";
		НовыйЛист.АктивнаяСтраница   = Истина; // Активная страница
		
		СтруктураДанных = Новый Структура;
		НовыйЛист.Страница2.Добавить(СтруктураДанных);
		
		ОчиститьТабличноеПоле(Форма, ИмяТекущейСтраницыПанели);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеВставкиДополнительногоЛистаВФорму200_03НаСервере(ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист = Истина)
	
	ПослеВставкиДополнительногоЛистаВФорму200_03(ЭтаФорма, ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПослеВставкиДополнительногоЛистаВФорму200_03(Форма, ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист)
	
	ТекущийЭлемент = Форма.РазделыОтчета.НайтиПоИдентификатору(Форма.Элементы.РазделыОтчета.ТекущаяСтрока);
	
	Родитель = ТекущийЭлемент.ПолучитьРодителя();

	Если НЕ Родитель = Неопределено Тогда
		
		РодительРодителя = Родитель.ПолучитьРодителя();
		
		Если Не РодительРодителя = Неопределено Тогда 
			
			ТекущийЭлемент = РодительРодителя;
			
		Иначе
			
			ТекущийЭлемент = Родитель;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	НомерДобавляемойСтраницы = ТекущийЭлемент.ПолучитьЭлементы().Количество() + 1;
	
	ДобавляемаяСтраница = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяСтраница.КолонкаРазделыОтчета              = "Форма 200.03 Лист " + НомерДобавляемойСтраницы;
	ДобавляемаяСтраница.КолонкаРазделыОтчетаСокрНаим      = ТекущийЭлемент.КолонкаРазделыОтчетаСокрНаим;
	ДобавляемаяСтраница.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяСтраница.РазделМногостраничный             = ТекущийЭлемент.РазделМногостраничный;
	
	ИдентификаторДобавляемойСтраницы = ДобавляемаяСтраница.ПолучитьИдентификатор();
	
	ТекущийЭлемент = ДобавляемаяСтраница;
	
	ДобавляемаяПодСтраница1 = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяПодСтраница1.КолонкаРазделыОтчета              = "Форма 200.03 Страница 1";
	ДобавляемаяПодСтраница1.КолонкаРазделыОтчетаСокрНаим      = "Форма200_03Страница1";
	ДобавляемаяПодСтраница1.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяПодСтраница1.РазделМногостраничный             = Истина;
	
	ДобавляемаяПодСтраница2 = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяПодСтраница2.КолонкаРазделыОтчета              = "Форма 200.03 Страница 2";
	ДобавляемаяПодСтраница2.КолонкаРазделыОтчетаСокрНаим      = "Форма200_03Страница2";
	ДобавляемаяПодСтраница2.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяПодСтраница2.РазделМногостраничный             = Истина;
	
	
	Если НЕ ИмяТекущейСтраницыПанели = "Форма200_03Страница1" Тогда
		ИдентификаторДобавляемойСтраницы = ДобавляемаяСтраница.ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ПерейтиНаВставленныйЛист Тогда
		Форма.Элементы.РазделыОтчета.ТекущаяСтрока = ИдентификаторДобавляемойСтраницы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроениеПервоначальнойСтруктурыНаСервере(Первый = Истина, НаимРаздела)
	
	ПостроениеПервоначальнойСтруктуры(ЭтаФорма, Первый, НаимРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПостроениеПервоначальнойСтруктуры(Форма, Первый = Истина, НаимРаздела)
	Перем ТаблицаСтраницРаздела;
	Перем ТаблицаДоходовИсточника;

	Если Не Форма.мСтруктураФорма200_03Страница1и2.Свойство("Форма200_03", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];

	Если Первый Тогда
				
		ОчиститьТабличноеПоле(Форма, НаимРаздела);
		СтруктураДанныхТекущейТаблицыРаздел1 = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");

		СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
		СтрНоваяСтраница.Представление      = "";
		СтрНоваяСтраница.АктивнаяСтраница   = Истина;
		СтрНоваяСтраница.АвтоматическоеПредставление = Истина;
		СтрНоваяСтраница.Страница1.Добавить(СтруктураДанныхТекущейТаблицыРаздел1);
		
		СтруктураДанных = Новый Структура;
		СтрНоваяСтраница.Страница2.Добавить(СтруктураДанных);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ИмяТабличногоПоля)

	ТабличноеПоле = Форма[ИмяТабличногоПоля];
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Инд = 0 По ТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;

		ИмяПоказателя      = ТекущаяОбласть.Имя;
		ЗначениеПоказателя = ТекущаяОбласть.Значение;

		СтруктураДанныхПоля.Вставить(ИмяПоказателя, ЗначениеПоказателя);

	КонецЦикла;

	Возврат СтруктураДанныхПоля;

КонецФункции

&НаСервере
Процедура УстановитьДоступностьКнопкиУдалитьСтраницу(Таблица)
	
	Обл = ТабличныйДокумент.Области.Найти("УдалитьСтраницуЗначок");
	Если Обл = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Таблица.Количество() = 1 Тогда 
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
	Иначе
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Истина;
		Обл.Текст = "Удалить Лист";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=");

	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];

	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;

	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				
					ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
				
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		
			
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
	
	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	МассивПересчета = Новый Массив;
	МассивПересчета.Добавить("Форма200_02Страница4");
	МассивПересчета.Добавить("Форма200_02Страница5");
	МассивПересчета.Добавить("Форма200_02Страница6");
	МассивПересчета.Добавить("Форма200_02Страница7");
	МассивПересчета.Добавить("Форма200_02Страница8");
	
	Для каждого Элемент из МассивПересчета Цикл
		РасчетНаКлиенте(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;

	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;

	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;

	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли

	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;

	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");

		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];

		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.

		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;

		Если СпециальноеДобавление Тогда
			
		Иначе
					
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;

		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;

		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда

			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл

				ТекСтрока = СтруктураГруппы[НСтр - 1];

				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк

		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
		
		КонецЦикла;

		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
	
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае

	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
		
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];

	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;

	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма200_02Страница1" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы21;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма200_02Страница2" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы22;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма200_02Страница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы23;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма200_02Страница4" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы24;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма200_02Страница5" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы25;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма200_02Страница6" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы26;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма200_02Страница7" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы27;
	ИначеЕсли ИмятекущейСтраницыПанели = "Форма200_02Страница8" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы28;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	ИдГрупп.Вставить("мИдГруппы22", СтруктураРеквизитовФормы.мИдГруппы22);
	ИдГрупп.Вставить("мИдГруппы23", СтруктураРеквизитовФормы.мИдГруппы23);
	ИдГрупп.Вставить("мИдГруппы24", СтруктураРеквизитовФормы.мИдГруппы24);
	ИдГрупп.Вставить("мИдГруппы25", СтруктураРеквизитовФормы.мИдГруппы25);
	ИдГрупп.Вставить("мИдГруппы26", СтруктураРеквизитовФормы.мИдГруппы26);
	ИдГрупп.Вставить("мИдГруппы27", СтруктураРеквизитовФормы.мИдГруппы27);
	ИдГрупп.Вставить("мИдГруппы28", СтруктураРеквизитовФормы.мИдГруппы28);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы21 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница1";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы22 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница2";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы23 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница3";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы24 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница4";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы25 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница5";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы26 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница6";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы27 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница7";
		
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппы28 Тогда
		
		ТекТабличноеПоле = "Форма200_02Страница8";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002200001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002300001"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002400002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002500002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002600002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002700002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		СтруктураГруппы = Форма["П0002800002"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	Если Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002200001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002300001"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002400002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002500002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002600002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002700002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		СтруктураГруппы = Форма["П0002800002"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,5,1)) = 2 Тогда
		
		СтруктураГруппы = Форма["П0002100001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000210000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002200001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000220000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002300001"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000230000101 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002400002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000240000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002500002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000250000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002600002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000260000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002700002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000270000201 = Индекс + 2;
		КонецЦикла;
		
		СтруктураГруппы = Форма["П0002800002"];
		Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
			СтруктураГруппы[Индекс].П000280000201 = Индекс + 2;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	
	Попытка
		ИмяЯчейки = ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.Имя;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Активизируйте нужную ячейку отчета для расшифровки.'"));
		Возврат;
	КонецПопытки;
	
	ЦветРасшифровки = Новый Цвет(225, 253, 253);
	Если ЭтотОбъект.ТекущийЭлемент.ТекущаяОбласть.ЦветФона = ЦветРасшифровки Тогда 
		
		Если РегламентированнаяОтчетностьРК.ИндивидуальныйПредприниматель(СтруктураРеквизитовФормы.Организация) Тогда
			
			Если Лев(ИмяЯчейки,10) =  "П000020005"
				ИЛИ Лев(ИмяЯчейки,10)= "П000120013" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки поддерживается только для юридических лиц.'"));
					Возврат;
			КонецЕсли;
			
		ИначеЕсли РегламентированнаяОтчетностьРК.ЮридическоеЛицо(СтруктураРеквизитовФормы.Организация) Тогда
			
			Если Лев(ИмяЯчейки,10)= "П000020004"
				ИЛИ Лев(ИмяЯчейки,10)= "П000020007"
				ИЛИ Лев(ИмяЯчейки,10)= "П000020009"
				ИЛИ Лев(ИмяЯчейки,10)= "П000120009"
				ИЛИ Лев(ИмяЯчейки,10)= "П000120015" Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки поддерживается только для индивидуального предпринимателя.'"));
					Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		ОткрытьФормуРасшифровки(ИмяЯчейки);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Расшифровка данной ячейки не поддерживается.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРасшифровки(ИмяЯчейки)
	
	ПараметрыОтчета = Новый Структура();
	НомерФормы = Сред(ИмяЯчейки,5,1);
	НомерМесяца = Сред(ИмяЯчейки,11,1);
	
	Если НомерФормы = "2" Тогда
		ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
		ДатаОкончания = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	ИначеЕсли НомерМесяца = "1" Тогда // месяц 1
		ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
		ДатаОкончания = КонецМесяца(ДатаНачала);
	ИначеЕсли НомерМесяца = "2" Тогда // месяц 2
		ДатаНачала = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,1);
		ДатаОкончания = КонецМесяца(ДатаНачала);
	ИначеЕсли НомерМесяца = "3" Тогда // месяц 3
		ДатаНачала = ДобавитьМесяц(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,2);
		ДатаОкончания = КонецМесяца(ДатаНачала);
	Иначе // итог или другие ячейки
		ДатаНачала = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
		ДатаОкончания = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	КонецЕсли;
	
	
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета",  ДатаНачала);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета",   ДатаОкончания);
	ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц",  мСписокСтруктурныхЕдиниц);
	ПараметрыОтчета.Вставить("НалоговыйКомитет",         СтруктураРеквизитовФормы.НалоговыйКомитет);
	ПараметрыОтчета.Вставить("Форма",                    НомерФормы);
	
	ПараметрыОтчета.Вставить("ЗаголовокРасшифровки",     "Расшифровка ""Регламентированный отчет форма 200.0" + НомерФормы + """");
	
	Если РегламентированнаяОтчетностьРК.ИндивидуальныйПредприниматель(СтруктураРеквизитовФормы.Организация) Тогда
		ПараметрыОтчета.Вставить("ИндивидуальныйПредприниматель",Истина);
	Иначе
		ПараметрыОтчета.Вставить("ИндивидуальныйПредприниматель",Ложь);
	КонецЕсли;
	
	ИДИменПоказателей = Новый Массив();
	ИДИменПоказателей.Добавить(ИмяЯчейки);
	
	
	ПараметрыОтчета.Вставить("ИмяОтчетаРасшифровки","РегистрНалоговогоУчетаПоИПНиСН");
	ПараметрыОтчета.Вставить("ИДИменПоказателей",ИДИменПоказателей);
	ПараметрыОтчета.Вставить("ИмяСКД","ОсновнаяСхемаКомпоновкиДанных");
		
	ФормаРасшифровки = ПолучитьФорму("ОбщаяФорма.РасшифровкаРегламентированногоОтчетаЗарплата", ПараметрыОтчета);
	
	Если ФормаРасшифровки = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Для выбранной ячейки расшифровка не существует.'"),,
		НСтр("ru = 'Расшифровка регламентированных отчетов'"));
	Иначе
		ФормаРасшифровки.Открыть();
	КонецЕсли;
	
КонецПроцедуры
