// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Кадровый перевод при создании формы на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
Процедура КадровыйПереводПриСозданииФормыНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	ЗаполнитьФормуКадровогоПереводаНаОснованииРешенияОКадровомПереводе(Форма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработка проверки заполнения на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  ПроверяемыеРеквизиты - Массив из Строка
Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	ТекущийОбъект = Форма.РеквизитФормыВЗначение("Объект"); // ДокументОбъект
	
	Если Не ТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		КадровыеРешения.ПроверитьНаличиеДубляДокумента(ТекущийОбъект, Отказ);
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Объект"));
	
КонецПроцедуры

// Форма документа после записи на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ОбъектНазначения - Произвольный
//  ПараметрыЗаписи - Структура
Процедура ФормаДокументаПослеЗаписиНаСервере(Форма, ОбъектНазначения, ПараметрыЗаписи) Экспорт
	ФормаДокументаПриПолученииДанных(Форма);
	АдаптацияУвольнениеФормы.ФормаДокументаПриПолученииДанных(Форма);
КонецПроцедуры

// Заполнить ссылку на кадровый приказ.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
Процедура ФормаДокументаПриПолученииДанных(Форма) Экспорт
	
	АдаптацияУвольнениеФормы.ФормаДокументаПриПолученииДанных(Форма);
	
	Приказ = КадровыеРешения.СвязанныйСРешениемПриказ(Форма.Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Приказ) Тогда
		Форма.КадровыйПриказИнфоНадпись = Новый ФорматированнаяСтрока(Строка(Приказ), , , , ПолучитьНавигационнуюСсылку(Приказ));
	Иначе
		Форма.КадровыйПриказИнфоНадпись = "";
	КонецЕсли;
	
	Форма.Элементы.КадровыйПриказИнфоНадпись.Видимость = ЗначениеЗаполнено(Форма.КадровыйПриказИнфоНадпись);
	
КонецПроцедуры

// Заполнить форму кадрового перевода на основании решения о кадровом переводе.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ЗаполнитьФормуКадровогоПереводаНаОснованииРешенияОКадровомПереводе(Форма)
	
	Если Не Форма.Параметры.Свойство("Ключ") Или Не Форма.Параметры.Ключ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "Основание")) 
		<> Тип("ДокументСсылка.РешениеОКадровомПереводе") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Параметры.ПереводВПодразделение = Форма.Объект.Подразделение;
	Форма.Параметры.ПереводНаПозицию = Форма.Объект.ДолжностьПоШтатномуРасписанию;
	Форма.Параметры.ПереводНаРабочееМесто = Форма.Объект.РабочееМесто;
	
КонецПроцедуры

#КонецОбласти