#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление();
	РегистрыСведений.СкрытыеРегламентированныеОтчеты.СкрытьВосстановитьОтчеты();
	Если Количество() > 0 Тогда
		Константы.ИспользоватьОсобыеУсловияТруда.УстановитьИспользованиеОсобыхУсловийТруда(ЭтотОбъект[0].ИспользоватьНесчастныеСлучаиНаПроизводстве);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли