#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗУПК
	СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// ЗУПК
	
	ПрочитатьНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкиСпециальнойОценкиУсловийТрудаИспользоватьСпециальнуюОценкуУсловийТрудаПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("НастройкиСпециальнойОценкиУсловийТруда");
	
	ОбновитьНастройкиСпециальнойОценкиУсловийТруда();
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНесчастныхСлучаевНаПроизводствеИспользоватьНесчастныеСлучаиНаПроизводствеПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("НастройкиНесчастныхСлучаевНаПроизводстве");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиИнструктажейПоОхранеТрудаИспользоватьИнструктажиПоОхранеТрудаПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьИнструктажиПоОхранеТруда");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМедицинскиеОсмотрыПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьМедицинскиеОсмотры");
	
	ОбновитьНастройкиМедицинскихОсмотров();
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПсихиатрическиеОсвидетельствованияПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("ИспользоватьПсихиатрическиеОсвидетельствования");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьУникальностьНомеровРабочихМестПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("КонтролироватьУникальностьНомеровРабочихМест");
	
	ОбновитьНастройкиКонтроляУникальностиНомеровРабочихМест();
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособКонтроляУникальностиНомеровРабочихМестПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаКлиенте("СпособКонтроляУникальностиНомеровРабочихМест");
	
	ПодключитьОбработчикОжиданияОбновленияИнтерфейса();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройки()
	
	Настройки = РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	ЗначениеВРеквизитФормы(Настройки, "НастройкиСпециальнойОценкиУсловийТруда");
	
	Настройки = РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	ЗначениеВРеквизитФормы(Настройки, "НастройкиНесчастныхСлучаевНаПроизводстве");
	
	ИспользоватьИнструктажиПоОхранеТруда = Константы.ИспользоватьИнструктажиПоОхранеТруда.Получить();
	ИспользоватьМедицинскиеОсмотры = Константы.ИспользоватьМедицинскиеОсмотры.Получить();
	
	ОбновитьНастройкиМедицинскихОсмотров();
	ОбновитьНастройкиСпециальнойОценкиУсловийТруда();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиМедицинскихОсмотров()
	
	Если ИспользоватьМедицинскиеОсмотры Тогда
		ИспользоватьПсихиатрическиеОсвидетельствования = Константы.ИспользоватьПсихиатрическиеОсвидетельствования.Получить();
	Иначе
		ИспользоватьПсихиатрическиеОсвидетельствования = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИспользоватьПсихиатрическиеОсвидетельствования",
		"ТолькоПросмотр",
		Не ИспользоватьМедицинскиеОсмотры);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиСпециальнойОценкиУсловийТруда()
	
	Если НастройкиСпециальнойОценкиУсловийТруда.ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		КонтролироватьУникальностьНомеровРабочихМест = Константы.КонтролироватьУникальностьНомеровРабочихМест.Получить();
		СпособКонтроляУникальностиНомеровРабочихМест = Константы.СпособКонтроляУникальностиНомеровРабочихМест.Получить();
	Иначе
		КонтролироватьУникальностьНомеровРабочихМест = Ложь;
		СпособКонтроляУникальностиНомеровРабочихМест = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КонтролироватьУникальностьНомеровРабочихМестГруппа",
		"Видимость",
		НастройкиСпециальнойОценкиУсловийТруда.ИспользоватьСпециальнуюОценкуУсловийТруда);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СпособКонтроляУникальностиНомеровРабочихМест",
		"ТолькоПросмотр",
		Не КонтролироватьУникальностьНомеровРабочихМест);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиКонтроляУникальностиНомеровРабочихМест()
	
	Если КонтролироватьУникальностьНомеровРабочихМест Тогда
		СпособКонтроляУникальностиНомеровРабочихМест = Константы.СпособКонтроляУникальностиНомеровРабочихМест.Получить();
	Иначе
		СпособКонтроляУникальностиНомеровРабочихМест = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СпособКонтроляУникальностиНомеровРабочихМест",
		"ТолькоПросмотр",
		Не КонтролироватьУникальностьНомеровРабочихМест);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияОбновленияИнтерфейса() Экспорт
	
	ТребуетсяОбновлениеИнтерфейса = Истина;
	
	#Если НЕ ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновленияИнтерфейса", 1, Истина);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте 
Процедура ОбработчикОжиданияОбновленияИнтерфейса()
	
	ОбновитьИнтерфейс();
	
	ТребуетсяОбновлениеИнтерфейса = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиНаКлиенте(ИмяНастройки)
	
	ЗаписатьНастройкиНаСервере(ИмяНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере(ИмяНастройки)
	
	ПараметрыНастроек = Обработки.ПанельНастроекУправлениеПерсоналом.ЗаполнитьСтруктуруПараметровНастроек(ИмяНастройки);
	
	ПараметрыНастроек.НастройкиСпециальнойОценкиУсловийТруда = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(НастройкиСпециальнойОценкиУсловийТруда, Метаданные.РегистрыСведений.НастройкиСпециальнойОценкиУсловийТруда);
	ПараметрыНастроек.НастройкиНесчастныхСлучаевНаПроизводстве = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(НастройкиНесчастныхСлучаевНаПроизводстве, Метаданные.РегистрыСведений.НастройкиНесчастныхСлучаевНаПроизводстве);
	ПараметрыНастроек.ИспользоватьИнструктажиПоОхранеТруда = ИспользоватьИнструктажиПоОхранеТруда;
	ПараметрыНастроек.ИспользоватьМедицинскиеОсмотры = ИспользоватьМедицинскиеОсмотры;
	ПараметрыНастроек.ИспользоватьПсихиатрическиеОсвидетельствования = ИспользоватьПсихиатрическиеОсвидетельствования;
	ПараметрыНастроек.КонтролироватьУникальностьНомеровРабочихМест = КонтролироватьУникальностьНомеровРабочихМест;
	ПараметрыНастроек.СпособКонтроляУникальностиНомеровРабочихМест = СпособКонтроляУникальностиНомеровРабочихМест;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	Обработки.ПанельНастроекУправлениеПерсоналом.ЗаписатьНастройки(ПараметрыНастроек, АдресХранилища);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти
