#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОСтавкахОСМС();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСтавкахОСМС() Экспорт
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахОСМС.СоздатьНаборЗаписей();

	// ДоходыОтРаботодателя
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20170701', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	0, 1);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20180101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	0, 1.5);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20190101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	0, 1.5);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20200101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	1, 2);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	2, 2);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20220101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтРаботодателя, 	2, 3);  
	
	// ДоходыОтНалоговогоАгента
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20170701', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 5, 0);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20180101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 0, 0);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20190101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 0, 0);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20200101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 1, 0);
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходыОтНалоговогоАгента, 2, 0);
	
	// ДоходыСубъектаПредпринимательства
	ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, '20210101', Справочники.Организации.ПустаяСсылка(), Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства, 5, 0);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьСведенияОСтавкахОСМС(НаборЗаписей, Период, Организация, ВидДохода, СтавкаВзносы, СтавкаОтчисления)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.ВидДохода = ВидДохода;
	НоваяЗапись.СтавкаВзносы = СтавкаВзносы;
	НоваяЗапись.СтавкаОтчисления = СтавкаОтчисления;
	
КонецПроцедуры	

Процедура ДобавитьСведенияОСтавкахОСМССПроверкой(Период, Организация, ВидДохода, СтавкаВзносы, СтавкаОтчисления) 
	
	НаборЗаписей = РегистрыСведений.СведенияОСтавкахОСМС.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ВидДохода.Установить(ВидДохода, Истина);
	НаборЗаписей.Отбор.Организация.Установить(Организация, Истина);
	НаборЗаписей.Отбор.Период.Установить(Период, Истина);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Движение = НаборЗаписей.Добавить();
		// Свойства
		Движение.Период = Период;
		//Измерения
		Движение.Организация = Организация;
		Движение.ВидДохода = ВидДохода;
		// Ресурсы
		Движение.СтавкаВзносы = СтавкаВзносы;
		Движение.СтавкаОтчисления = СтавкаОтчисления;
		
		Попытка
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли