#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20200101')
			И ЗначениеЗаполнено(СтрокаНабора.Организация) Тогда
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Невозможно указать сведения о ставках ВОСМС/ОСМС для организации ""%1"" за период %2 года. 
										|Сведения о ставках ВОСМС/ОСМС в разрезе организации указываются только с 01.01.2020 года.'"),СтрокаНабора.Организация, Формат(СтрокаНабора.Период,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20210101')
			И СтрокаНабора.ВидДохода = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства Тогда
			
			ТекстОшибки = НСтр("ru = 'Невозможно указать сведения о ставке ВОСМС для вида дохода ""Доход субъекта предпринимательства"" указываются только с 01.01.2021 года.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
