#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ОчередностьВзысканияУдержаний = Новый Массив;
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ОчередностьВзысканияУдержаний Цикл
		
		Если НЕ ЗначениеПеречисления = Перечисления.ОчередностьВзысканияУдержаний.ПерваяОчередьПроцент70 Тогда
			ОчередностьВзысканияУдержаний.Добавить(ЗначениеПеречисления);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеВыбора, ОчередностьВзысканияУдержаний);
	
КонецПроцедуры

#КонецОбласти

	
#КонецЕсли