&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	СтруктураДанныхФорма200Страница1        = Новый Структура;
	СтруктураДанныхФорма200Страница2        = Новый Структура;
	СтруктураДанныхФорма200Страница3        = Новый Структура;
	СтруктураДанныхФорма200_01Страница1        = Новый Структура;
	СтруктураДанныхФорма200_01Страница2        = Новый Структура;
	
	мСтруктураФорма200_02Страница1и2 = Новый Структура;
	мСтруктураФорма200_02Страница1и2.Вставить("Форма200_02", "ТаблицаСтраницыФорма200_02");
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента             = 0;
	мСписокСтруктурныхЕдиниц                          = Параметры.СписокСтруктурныхЕдиниц;
	СтруктураРеквизитовФормы.НалоговыйКомитет		  = Параметры.НалоговыйКомитет;
	НалоговыйКомитетФорма							  = Параметры.НалоговыйКомитет;
	
	ИмяРаздела = "Форма200Страница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");                   
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("НалоговыйКомитет");
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница1";
	СтрокаУровня1.Представление            = "Форма 200.00 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница2";
	СтрокаУровня1.Представление            = "Форма 200.00 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница3";
	СтрокаУровня1.Представление            = "Форма 200.00 Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_01Страница1";
	СтрокаУровня1.Представление            = "Форма 200.01 Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_01Страница2";
	СтрокаУровня1.Представление            = "Форма 200.01 Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница1";
	СтрокаУровня1.Представление            = "Форма 200.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма200Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200Страница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_01Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_01Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма200_02Страница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если ЭтоРазделРодитель(ЭлементДереваСтраницОтчета.ИмяСтраницы) Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				ЭлементРазделовОтчета.РазделМногостраничный = Ложь;
				
				Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					
				КонецЦикла;
				
			ИначеЕсли ЭлементДереваСтраницОтчета.ИмяСтраницы = "Форма200_02Страница1" Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				
				Если Форма["ТаблицаСтраницыФорма200_02"].Количество() > 0 Тогда
					Форма200_02Количество = Форма["ТаблицаСтраницыФорма200_02"].Количество();
				Иначе
					Форма200_02Количество = 1;
				КонецЕсли;
				
				ЭлементРазделовОтчета.РазделМногостраничный = Истина;
				
				ЭлементРазделовОтчета.КолонкаНомерСтраницыРазделаОтчета = 1;
				
				Для НомерСтраницы = 1 По Форма200_02Количество Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = "Форма 200.02 Лист " + НомерСтраницы;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = "Форма200_02Страница1";
					СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					
					
					ПодстраницаРазделаОтчет1 = СтраницаРазделаОтчета.ПолучитьЭлементы().Добавить();
					
					ПодстраницаРазделаОтчет1.КолонкаРазделыОтчета      = "Форма 200.02 Страница 1";
					ПодстраницаРазделаОтчет1.КолонкаРазделыОтчетаСокрНаим      = "Форма200_02Страница1";
					ПодстраницаРазделаОтчет1.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					ПодстраницаРазделаОтчет1.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					
					ПодстраницаРазделаОтчет2 = СтраницаРазделаОтчета.ПолучитьЭлементы().Добавить();
					
					ПодстраницаРазделаОтчет2.КолонкаРазделыОтчета      = "Форма 200.02 Страница 2";
					ПодстраницаРазделаОтчет2.КолонкаРазделыОтчетаСокрНаим      = "Форма200_02Страница2";
					ПодстраницаРазделаОтчет2.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
					ПодстраницаРазделаОтчет2.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма200Страница1")
			Или (ИмяРаздела = "Форма200_01Страница1");
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма200Страница1" Тогда
		Возврат 3;
	ИначеЕсли Родитель = "Форма200_01Страница1" Тогда
		Возврат 2;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мКвартал = Лев(СтрПериодОтчета,1);
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	//200Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("ВидДекларации", "Первоначальная;Очередная;Дополнительная;ПоУведомлению;Ликвидационная");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("НаличиеПриложений", "Приложение01;Приложение02");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("КатегорияНалПл", "Признак7A;Признак7B;Признак7C");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010001401", "П000010001101;П000010001201;П000010001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010002401", "П000010002101;П000010002201;П000010002301");
	//200Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020003401", "П000020003101;П000020003201;П000020003301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020004401", "П000020004101;П000020004201;П000020004301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020005401", "П000020005101;П000020005201;П000020005301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020006401", "П000020006101;П000020006201;П000020006301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020007401", "П000020007101;П000020007201;П000020007301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020008401", "П000020008101;П000020008201;П000020008301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000020009401", "П000020009101;П000020009201;П000020009301");
	//200.01Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110001401", "П000110001101;П000110001201;П000110001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110002401", "П000110002101;П000110002201;П000110002301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110006401", "П000110006101;П000110006201;П000110006301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110007401", "П000110007101;П000110007201;П000110007301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000110008401", "П000110008101;П000110008201;П000110008301");
	//200.01Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120009401", "П000120009101;П000120009201;П000120009301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120013401", "П000120013101;П000120013201;П000120013301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120014401", "П000120014101;П000120014201;П000120014301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000120015401", "П000120015101;П000120015201;П000120015301");
	//200.02Стр1
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210001401", "П000210001101;П000210001201;П000210001301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210002401", "П000210002101;П000210002201;П000210002301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000210003401", "П000210003101;П000210003201;П000210003301");
	//200.02Стр2
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220004401", "П000220004101;П000220004201;П000220004301");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000220005401", "П000220005101;П000220005201;П000220005301");
	//СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("", "");
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма200Страница1","Очередная");
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200Страница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук";
	СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ИИН_БИН"].Значение) Тогда
		ТабличныйДокумент.Области["ИИН_БИН"].Значение = СведенияОбОрганизации.ИННЮЛ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Квартал"].Значение) Тогда
		ТабличныйДокумент.Области["Квартал"].Значение = СтруктураРеквизитовФормы.мКвартал;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год"].Значение) Тогда
		ТабличныйДокумент.Области["Год"].Значение = СтруктураРеквизитовФормы.мГод;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ОргНазв") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ОргНазв"].Значение) Тогда
		
		ТабличныйДокумент.Области["ОргНазв"].Значение = СведенияОбОрганизации.НаимЮЛПол;
		Если ТабличныйДокумент.Области.Найти("ОргНазв3") <> Неопределено Тогда
			НачПозиция = 1;
			Для Шаг = 1 По 3 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		Иначе
			НачПозиция = 1;
			Для Шаг = 1 По 2 Цикл
				ДлинаСтроки = ТабличныйДокумент.Области["ОргНазв" + Шаг].ТипЗначения.КвалификаторыСтроки.Длина;
				НазОрганизации = Сред(СведенияОбОрганизации.НаимЮЛПол, НачПозиция, ДлинаСтроки); 
				ТабличныйДокумент.Области["ОргНазв" + Шаг].Значение = НазОрганизации;
				НачПозиция =НачПозиция + ДлинаСтроки;
			КонецЦикла
		КонецЕсли;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Руководитель") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Руководитель"].Значение) Тогда
		ТабличныйДокумент.Области["Руководитель"].Значение = СведенияОбОрганизации.ФИОРук;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ПоУведомлению") <> Неопределено Тогда
		
		Если ТабличныйДокумент.Области["ПоУведомлению"].Значение = "Х" Тогда
			ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
			ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
		ИначеЕсли ТабличныйДокумент.Области["Очередная"].Значение = "" И
				  ТабличныйДокумент.Области["Дополнительная"].Значение = "" И 
				  ТабличныйДокумент.Области["Ликвидационная"].Значение = "" И
				  ТабличныйДокумент.Области["Первоначальная"].Значение = "" Тогда
				
				ТабличныйДокумент.Области["Очередная"].Значение = "Х";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("КодНалоговогоОрганаИПН") <> Неопределено И ТабличныйДокумент.Области.Найти("КодНалоговогоОрганаОПВиСО") <> Неопределено 
																				   И СтруктураРеквизитовФормы.НаимТекущегоРаздела ="Форма200Страница3" Тогда
		КодНалоговогоОргана = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
		Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОрганаИПН"].Значение) Тогда
			ТабличныйДокумент.Области["КодНалоговогоОрганаИПН"].Значение = КодНалоговогоОргана;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодНалоговогоОрганаОПВиСО"].Значение) Тогда
			ТабличныйДокумент.Области["КодНалоговогоОрганаОПВиСО"].Значение = КодНалоговогоОргана;
		КонецЕсли;
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("ДатаПодачи") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ДатаПодачи"].Значение)Тогда
		ТабличныйДокумент.Области.ДатаПодачи.Значение = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ПоказателиОтчета;
	Перем СтруктураФорма200_02;
	Перем СписокСтруктурныхЕдиниц;
	Перем СписокРегистраций;
	Перем НалоговыйКомитет;
		
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("СписокСтруктурныхЕдиниц", СписокСтруктурныхЕдиниц);
	СписокСохранения.Свойство("СписокРегистраций", СписокРегистраций);
	СписокСохранения.Свойство("НалоговыйКомитет", НалоговыйКомитет);
	
	Префикс = "ПолеТабличногоДокумента";
	
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если Раздел.ИмяСтраницы = "Форма200_02Страница1"
			ИЛИ Раздел.ИмяСтраницы = "Форма200_02Страница2" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
	КонецЦикла;
	
	СтруктураФорма200_02 = Новый Структура;
	Если СписокСохранения.Свойство("Форма200_02", СтруктураФорма200_02) Тогда
		
		Для Каждого ЭлементСтруктуры Из СтруктураФорма200_02 Цикл
			
			Если ЭлементСтруктуры.Ключ = "Форма200_02" Тогда
				
				Для Каждого ЭлементФорма200_02 Из ЭлементСтруктуры.Значение Цикл
					
					Страница1 = Новый СписокЗначений;
					
					Страница1.Добавить(ЭлементФорма200_02.Страница1);
					
					ЭлементФорма200_02.Страница1 = Страница1;
					
					Страница2 = Новый СписокЗначений;
					
					Страница2.Добавить(ЭлементФорма200_02.Страница2);
					
					ЭлементФорма200_02.Страница2 = Страница2;
					
				КонецЦикла;
				
				ТаблСтрФорма200_02 = ЭтаФорма["ТаблицаСтраницыФорма200_02"];
				
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ТаблСтрФорма200_02);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	мСписокСтруктурныхЕдиниц = СписокСтруктурныхЕдиниц;
	НалоговыйКомитетФорма = НалоговыйКомитет;
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногостраничный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета = 1)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета) ;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));
		
	Если ИмяТекРаздела = "Форма200_02Страница1" Тогда
		
		Если ЭтаФорма[мСтруктураФорма200_02Страница1и2.Форма200_02].Количество() = 0 Тогда
			ПостроениеПервоначальнойСтруктурыНаСервере(Истина, ИмяТекРаздела);
		КонецЕсли;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрСледующаяСтраница = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		СтрСледующаяСтраница.АктивнаяСтраница = Истина;
		
		СтруктураДанныхСледующаяСтраница = СтрСледующаяСтраница.Страница1[0].Значение;
		
		Если СтруктураДанныхСледующаяСтраница <> Неопределено Тогда
			Для Каждого Элемент Из СтруктураДанныхСледующаяСтраница Цикл
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;
												
				Попытка
					ТабличныйДокумент.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
		УстановитьДоступностьКнопкиУдалитьСтраницу(ТаблицаСтраницРаздела);
		
	ИначеЕсли ИмяТекРаздела = "Форма200_02Страница2" Тогда
		
		Если ЭтаФорма[мСтруктураФорма200_02Страница1и2.Форма200_02].Количество() = 0 Тогда
			ПостроениеПервоначальнойСтруктурыНаСервере(Истина, ИмяТекРаздела);
			НомерСтраницыФорма200_02Страница2Отчета = 1;
		КонецЕсли;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		СтрСледующаяСтраница = СтрТаблицаСтраницы.Страница2[0].Значение;
		
		СтрТаблицаСтраницы.АктивнаяСтраница = Истина;
		
		Если СтрСледующаяСтраница <> Неопределено Тогда
			
			Для Каждого Элемент Из СтрСледующаяСтраница Цикл
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;
					
				Попытка
					ТабличныйДокумент.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ИзменятьАктивнуюСтраницу = Истина)
	
	Если НаимРаздела = "Форма200_02Страница1"
		ИЛИ НаимРаздела = "Форма200_02Страница2" Тогда	
		
		СохранитьАктивнуюФорму200_02НаСервере(НаимРаздела);
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если СтрТаблицаСтраницы.Количество() > 0 Тогда
			
			СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
			
			СтрТаблицаСтраницы.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;
		
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьАктивнуюФорму200_02НаСервере(ИмяСтраницы)
	
	СохранитьАктивнуюФорму200_02(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьАктивнуюФорму200_02(Форма, ИмяСтраницы)
	Перем ТаблицаСтраницРаздела;
	
	Если Не Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	ТекТабличноеПоле      = Форма.ТабличныйДокумент;
	
	СтрТаблицаСтраницы    = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
					
		СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");
		
		Если ИмяСтраницы = "Форма200_02Страница2" Тогда
			
			Если СтрТаблицаСтраницы.Страница2.Количество() > 0 Тогда
				СтрТаблицаСтраницы.Страница2[0].Значение = СтруктураДанныхТекущейТаблицы;
			Иначе
				СтрТаблицаСтраницы.Страница2.Добавить(СтруктураДанныхТекущейТаблицы);
			КонецЕсли;	
				
		КонецЕсли;
		
		Если ИмяСтраницы = "Форма200_02Страница1" Тогда
			
			Если СтрТаблицаСтраницы.Страница1.Количество() > 0 Тогда
				СтрТаблицаСтраницы.Страница1[0].Значение = СтруктураДанныхТекущейТаблицы;
			Иначе
				СтрТаблицаСтраницы.Страница1.Добавить(СтруктураДанныхТекущейТаблицы);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	Перем ТаблицаСтраницРаздела;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСтраницыПанели = "Форма200Страница1" Тогда
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Первоначальная", Первоначальная);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Очередная",           Очередная);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Дополнительная", Дополнительная);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("ПоУведомлению",   ПоУведомлению);
			Форма.СтруктураДанныхФорма200Страница1.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				Форма.СтруктураДанныхФорма200Страница1.Вставить("НомерУведомления", "");
				Форма.СтруктураДанныхФорма200Страница1.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.НаличиеПриложений, ОбластьИмя) > 0 Тогда
			
			Приложение01 = "";
			Приложение02 = "";
			
			Если ОбластьИмя = "Приложение01" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Приложение01 = Форма.ТабличныйДокумент.Области.Приложение01.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Приложение01") Тогда
					Приложение01 = Форма.СтруктураДанныхФорма200Страница1.Приложение01;
				КонецЕсли;
				
				Приложение01 = ?(Приложение01 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение01", Приложение01);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение01.Значение = Приложение01;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Приложение02" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Приложение02 = Форма.ТабличныйДокумент.Области.Приложение02.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Приложение02") Тогда
					Приложение02 = Форма.СтруктураДанныхФорма200Страница1.Приложение02;
				КонецЕсли;
				
				Приложение02 = ?(Приложение02 = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение02", Приложение02);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Приложение02.Значение = Приложение02;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.КатегорияНалПл, ОбластьИмя) > 0 Тогда
			
			Признак7A = "";
			Признак7B = "";
			Признак7C = "";
			
			Если ОбластьИмя = "Признак7A" Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7A = Форма.ТабличныйДокумент.Области.Признак7A.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7A") Тогда
					Признак7A = Форма.СтруктураДанныхФорма200Страница1.Признак7A;
				КонецЕсли;
				
				Признак7A = ?(Признак7A = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7A", Признак7A);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7A.Значение = Признак7A;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7B" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7B = Форма.ТабличныйДокумент.Области.Признак7B.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7B") Тогда
					Признак7B = Форма.СтруктураДанныхФорма200Страница1.Признак7B;
				КонецЕсли;
				
				Признак7B = ?(Признак7B = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7B", Признак7B);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7B.Значение = Признак7B;
				КонецЕсли;
				
			ИначеЕсли ОбластьИмя = "Признак7C" Тогда 
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Признак7C = Форма.ТабличныйДокумент.Области.Признак7C.Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("Признак7C") Тогда
					Признак7C = Форма.СтруктураДанныхФорма200Страница1.Признак7C;
				КонецЕсли;
				
				Признак7C = ?(Признак7C = "Х","","Х");
				
				Форма.СтруктураДанныхФорма200Страница1.Вставить("Признак7C", Признак7C);
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
					Форма.ТабличныйДокумент.Области.Признак7C.Значение = Признак7C;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.001 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010001401, ОбластьИмя) > 0 Тогда
			
			ОкрП000010001101 = 0;
			ОкрП000010001201 = 0;
			ОкрП000010001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010001101") Тогда
				ОкрП000010001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010001201") Тогда
				ОкрП000010001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010001301") Тогда
				ОкрП000010001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010001301);
			КонецЕсли;
			
			П000010001401 = ОкрП000010001101 + ОкрП000010001201 + ОкрП000010001301;
			
			Форма.СтруктураДанныхФорма200Страница1.Вставить("П000010001401", П000010001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010001401.Значение = П000010001401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.002 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000010002401, ОбластьИмя) > 0 Тогда
			
			ОкрП000010002101 = 0;
			ОкрП000010002201 = 0;
			ОкрП000010002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010002101") Тогда
				ОкрП000010002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010002201") Тогда
				ОкрП000010002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				ОкрП000010002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000010002301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница1.Свойство("П000010002301") Тогда
				ОкрП000010002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница1.П000010002301);
			КонецЕсли;
			
			П000010002401 = ОкрП000010002101 + ОкрП000010002201 + ОкрП000010002301;
			
			Форма.СтруктураДанныхФорма200Страница1.Вставить("П000010002401", П000010002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000010002401.Значение = П000010002401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200Страница2" Тогда
		
		//200.00.003 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020003401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020003101 = 0;
			ОкрП000020003201 = 0;
			ОкрП000020003301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020003101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020003101") Тогда
				ОкрП000020003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020003201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020003201") Тогда
				ОкрП000020003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020003301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020003301") Тогда
				ОкрП000020003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020003301);
			КонецЕсли;
			
			П000020003401 = ОкрП000020003101 + ОкрП000020003201 + ОкрП000020003301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020003401", П000020003401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020003401.Значение = П000020003401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.004 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020004401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020004101 = 0;
			ОкрП000020004201 = 0;
			ОкрП000020004301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020004101") Тогда
				ОкрП000020004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020004101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020004201") Тогда
				ОкрП000020004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020004201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020004301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020004301") Тогда
				ОкрП000020004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020004301);
			КонецЕсли;
			
			П000020004401 = ОкрП000020004101 + ОкрП000020004201 + ОкрП000020004301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020004401", П000020004401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020004401.Значение = П000020004401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.005 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020005401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020005101 = 0;
			ОкрП000020005201 = 0;
			ОкрП000020005301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020005101") Тогда
				ОкрП000020005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020005201") Тогда
				ОкрП000020005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020005201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020005301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020005301") Тогда
				ОкрП000020005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020005301);
			КонецЕсли;
			
			П000020005401 = ОкрП000020005101 + ОкрП000020005201 + ОкрП000020005301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020005401", П000020005401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020005401.Значение = П000020005401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.006 IV
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020006401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020006101 = 0;
			ОкрП000020006201 = 0;
			ОкрП000020006301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020006101") Тогда
				ОкрП000020006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020006201") Тогда
				ОкрП000020006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020006301") Тогда
				ОкрП000020006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020006301);
			КонецЕсли;
			
			П000020006401 = ОкрП000020006101 + ОкрП000020006201 + ОкрП000020006301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020006401", П000020006401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020006401.Значение = П000020006401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.007 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020007401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020007101 = 0;
			ОкрП000020007201 = 0;
			ОкрП000020007301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020007101") Тогда
				ОкрП000020007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020007201") Тогда
				ОкрП000020007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020007301") Тогда
				ОкрП000020007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020007301);
			КонецЕсли;
			
			П000020007401 = ОкрП000020007101 + ОкрП000020007201 + ОкрП000020007301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020007401", П000020007401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020007401.Значение = П000020007401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.008 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020008401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020008101 = 0;
			ОкрП000020008201 = 0;
			ОкрП000020008301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020008101") Тогда
				ОкрП000020008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020008101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020008201") Тогда
				ОкрП000020008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020008201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020008301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020008301") Тогда
				ОкрП000020008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020008301);
			КонецЕсли;
			
			П000020008401 = ОкрП000020008101 + ОкрП000020008201 + ОкрП000020008301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020008401", П000020008401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020008401.Значение = П000020008401;
			КонецЕсли;
			
		КонецЕсли;
		
		//200.00.009 IV
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000020009401, ОбластьИмя) > 0 Тогда
			
			ОкрП000020009101 = 0;
			ОкрП000020009201 = 0;
			ОкрП000020009301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020009101") Тогда
				ОкрП000020009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020009201") Тогда
				ОкрП000020009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000020009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200Страница2.Свойство("П000020009301") Тогда
				ОкрП000020009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200Страница2.П000020009301);
			КонецЕсли;
			
			П000020009401 = ОкрП000020009101 + ОкрП000020009201 + ОкрП000020009301;
			
			Форма.СтруктураДанныхФорма200Страница2.Вставить("П000020009401", П000020009401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000020009401.Значение = П000020009401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_01Страница1" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110001401, ОбластьИмя) > 0 Тогда
			//200.01.001 IV
			ОкрП000110001101 = 0;
			ОкрП000110001201 = 0;
			ОкрП000110001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110001101") Тогда
				ОкрП000110001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110001201") Тогда
				ОкрП000110001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110001301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110001301") Тогда
				ОкрП000110001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110001301);
			КонецЕсли;
			
			П000110001401 = ОкрП000110001101 + ОкрП000110001201 + ОкрП000110001301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110001401", П000110001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110001401.Значение = П000110001401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110002401, ОбластьИмя) > 0 Тогда
			//200.01.002 IV
			ОкрП000110002101 = 0;
			ОкрП000110002201 = 0;
			ОкрП000110002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110002101") Тогда
				ОкрП000110002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110002201") Тогда
				ОкрП000110002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110002301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110002301") Тогда
				ОкрП000110002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110002301);
			КонецЕсли;
			
			П000110002401 = ОкрП000110002101 + ОкрП000110002201 + ОкрП000110002301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110002401", П000110002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110002401.Значение = П000110002401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110006401, ОбластьИмя) > 0 Тогда
			//200.01.006 IV
			ОкрП000110006101 = 0;
			ОкрП000110006201 = 0;
			ОкрП000110006301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110006101") Тогда
				ОкрП000110006101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110006101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110006201") Тогда
				ОкрП000110006201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110006201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110006301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110006301") Тогда
				ОкрП000110006301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110006301);
			КонецЕсли;
			
			П000110006401 = ОкрП000110006101 + ОкрП000110006201 + ОкрП000110006301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110006401", П000110006401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110006401.Значение = П000110006401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110007401, ОбластьИмя) > 0 Тогда
			//200.01.007 IV
			ОкрП000110007101 = 0;
			ОкрП000110007201 = 0;
			ОкрП000110007301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110007101") Тогда
				ОкрП000110007101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110007101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110007201") Тогда
				ОкрП000110007201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110007201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110007301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110007301") Тогда
				ОкрП000110007301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110007301);
			КонецЕсли;
			
			П000110007401 = ОкрП000110007101 + ОкрП000110007201 + ОкрП000110007301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110007401", П000110007401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110007401.Значение = П000110007401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000110008401, ОбластьИмя) > 0 Тогда
			//200.01.008 IV
			ОкрП000110008101 = 0;
			ОкрП000110008201 = 0;
			ОкрП000110008301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110008101") Тогда
				ОкрП000110008101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110008101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110008201") Тогда
				ОкрП000110008201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110008201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				ОкрП000110008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000110008301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница1.Свойство("П000110008301") Тогда
				ОкрП000110008301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница1.П000110008301);
			КонецЕсли;
			
			П000110008401 = ОкрП000110008101 + ОкрП000110008201 + ОкрП000110008301;
			
			Форма.СтруктураДанныхФорма200_01Страница1.Вставить("П000110008401", П000110008401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000110008401.Значение = П000110008401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_01Страница2" Тогда
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение01", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.Приложение01.Значение = "Х";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120009401, ОбластьИмя) > 0 Тогда
			//200.01.009 IV
			ОкрП000120009101 = 0;
			ОкрП000120009201 = 0;
			ОкрП000120009301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120009101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120009101") Тогда
				ОкрП000120009101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120009101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120009201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120009201") Тогда
				ОкрП000120009201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120009201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120009301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120009301") Тогда
				ОкрП000120009301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120009301);
			КонецЕсли;
			
			П000120009401 = ОкрП000120009101 + ОкрП000120009201 + ОкрП000120009301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120009401", П000120009401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120009401.Значение = П000120009401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120013401, ОбластьИмя) > 0 Тогда
			//200.01.013 IV
			ОкрП000120013101 = 0;
			ОкрП000120013201 = 0;
			ОкрП000120013301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120013101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120013101") Тогда
				ОкрП000120013101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120013101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120013201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120013201") Тогда
				ОкрП000120013201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120013201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120013301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120013301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120013301") Тогда
				ОкрП000120013301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120013301);
			КонецЕсли;
			
			П000120013401 = ОкрП000120013101 + ОкрП000120013201 + ОкрП000120013301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120013401", П000120013401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120013401.Значение = П000120013401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120014401, ОбластьИмя) > 0 Тогда
			//200.01.014 IV
			ОкрП000120014101 = 0;
			ОкрП000120014201 = 0;
			ОкрП000120014301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120014101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120014101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120014101") Тогда
				ОкрП000120014101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120014101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120014201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120014201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120014201") Тогда
				ОкрП000120014201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120014201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120014301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120014301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120014301") Тогда
				ОкрП000120014301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120014301);
			КонецЕсли;
			
			П000120014401 = ОкрП000120014101 + ОкрП000120014201 + ОкрП000120014301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120014401", П000120014401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120014401.Значение = П000120014401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000120015401, ОбластьИмя) > 0 Тогда
			//200.01.015 IV
			ОкрП000120015101 = 0;
			ОкрП000120015201 = 0;
			ОкрП000120015301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120015101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120015101.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120015101") Тогда
				ОкрП000120015101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120015101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120015201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120015201.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120015201") Тогда
				ОкрП000120015201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120015201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				ОкрП000120015301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000120015301.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма200_01Страница2.Свойство("П000120015301") Тогда
				ОкрП000120015301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма200_01Страница2.П000120015301);
			КонецЕсли;
			
			П000120015401 = ОкрП000120015101 + ОкрП000120015201 + ОкрП000120015301;
			
			Форма.СтруктураДанныхФорма200_01Страница2.Вставить("П000120015401", П000120015401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_01Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000120015401.Значение = П000120015401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница1" Тогда
		
		Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("КоличествоПриложений200_02", ТаблицаСтраницРаздела.Количество());
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.КоличествоПриложений200_02.Значение = ТаблицаСтраницРаздела.Количество();
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		Если ОбластьИмя = "УдалитьСтраницу" Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.ВидДекларации, ОбластьИмя) > 0 Тогда
			
			Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			Первоначальная = "";
			Очередная =      "";
			Дополнительная = "";
			ПоУведомлению =  "";
			Ликвидационная = "";
			
			
			Если ОбластьИмя = "Первоначальная" Тогда
				Первоначальная = "Х";
			ИначеЕсли ОбластьИмя = "Очередная" Тогда
				Очередная = "Х";
			ИначеЕсли ОбластьИмя = "Дополнительная" Тогда
				Дополнительная = "Х";
			ИначеЕсли ОбластьИмя = "ПоУведомлению" Тогда
				ПоУведомлению = "Х";
			ИначеЕсли ОбластьИмя = "Ликвидационная" Тогда
				Ликвидационная = "Х";
			Иначе
				Очередная = "Х";
			КонецЕсли;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Первоначальная", Первоначальная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Очередная",           Очередная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Дополнительная", Дополнительная);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("ПоУведомлению",   ПоУведомлению);
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("Ликвидационная", Ликвидационная);
			Если Не ПоУведомлению = "Х" Тогда
				СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("НомерУведомления", "");
				СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("ДатаУведомления", "");
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.Первоначальная.Значение = Первоначальная;
				Форма.ТабличныйДокумент.Области.Очередная.Значение = Очередная;
				Форма.ТабличныйДокумент.Области.Дополнительная.Значение = Дополнительная;
				Форма.ТабличныйДокумент.Области.ПоУведомлению.Значение = ПоУведомлению;
				Форма.ТабличныйДокумент.Области.Ликвидационная.Значение = Ликвидационная;
				Если ПоУведомлению = "Х" Тогда
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Ложь;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Ложь;
				Иначе
					Форма.ТабличныйДокумент.Области.НомерУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Значение = "";
					Форма.ТабличныйДокумент.Области.НомерУведомления.Защита = Истина;
					Форма.ТабличныйДокумент.Области.ДатаУведомления.Защита = Истина;
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210001401, ОбластьИмя) > 0 Тогда
			//200.02.001 IV
			Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000210001101 = 0;
			ОкрП000210001201 = 0;
			ОкрП000210001301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210001101") Тогда
				ОкрП000210001101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210001101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210001201") Тогда
				ОкрП000210001201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210001201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210001301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210001301") Тогда
				ОкрП000210001301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210001301);
			КонецЕсли;
			
			П000210001401 = ОкрП000210001101 + ОкрП000210001201 + ОкрП000210001301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000210001401", П000210001401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210001401.Значение = П000210001401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210002401, ОбластьИмя) > 0 Тогда
			//200.02.002 IV
			Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000210002101 = 0;
			ОкрП000210002201 = 0;
			ОкрП000210002301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210002101") Тогда
				ОкрП000210002101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210002101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210002201") Тогда
				ОкрП000210002201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210002201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210002301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210002301") Тогда
				ОкрП000210002301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210002301);
			КонецЕсли;
			
			П000210002401 = ОкрП000210002101 + ОкрП000210002201 + ОкрП000210002301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000210002401",П000210002401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210002401.Значение = П000210002401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000210003401, ОбластьИмя) > 0 Тогда
			//200.02.003 IV
			Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000210003101 = 0;
			ОкрП000210003201 = 0;
			ОкрП000210003301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210003101") Тогда
				ОкрП000210003101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210003101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210003201") Тогда
				ОкрП000210003201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210003201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000210003301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница1[0].Значение.Свойство("П000210003301") Тогда
				ОкрП000210003301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница1[0].Значение.П000210003301);
			КонецЕсли;
			
			П000210003401 = ОкрП000210003101 + ОкрП000210003201 + ОкрП000210003301;
			
			СтрТаблицаСтраницы[0].Страница1[0].Значение.Вставить("П000210003401",П000210003401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
				Форма.ТабличныйДокумент.Области.П000210003401.Значение = П000210003401;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма200_02Страница2" Тогда
		
		Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		
		Форма.СтруктураДанныхФорма200Страница1.Вставить("КоличествоПриложений200_02", ТаблицаСтраницРаздела.Количество());
		Форма.СтруктураДанныхФорма200Страница1.Вставить("Приложение02", "Х");
		Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200Страница1" Тогда
			Форма.ТабличныйДокумент.Области.КоличествоПриложений200_02.Значение = ТаблицаСтраницРаздела.Количество();
			Форма.ТабличныйДокумент.Области.Приложение02.Значение = "Х";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220004401, ОбластьИмя) > 0 Тогда
			//200.02.004 IV
			Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000220004101 = 0;
			ОкрП000220004201 = 0;
			ОкрП000220004301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				ОкрП000220004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220004101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220004101") Тогда
				ОкрП000220004101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220004101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				ОкрП000220004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220004201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220004201") Тогда
				ОкрП000220004201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220004201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				ОкрП000220004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220004301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220004301") Тогда
				ОкрП000220004301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220004301);
			КонецЕсли;
			
			П000220004401 = ОкрП000220004101 + ОкрП000220004201 + ОкрП000220004301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000220004401",П000220004401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220004401.Значение = П000220004401;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьИмя) ИЛИ СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000220005401, ОбластьИмя) > 0 Тогда
			//200.02.005 IV
			Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			
			ОкрП000220005101 = 0;
			ОкрП000220005201 = 0;
			ОкрП000220005301 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				ОкрП000220005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005101.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220005101") Тогда
				ОкрП000220005101 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220005101);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				ОкрП000220005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005201.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220005201") Тогда
				ОкрП000220005201 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220005201);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				ОкрП000220005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000220005301.Значение);
			ИначеЕсли СтрТаблицаСтраницы[0].Страница2[0].Значение.Свойство("П000220005301") Тогда
				ОкрП000220005301 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, СтрТаблицаСтраницы[0].Страница2[0].Значение.П000220005301);
			КонецЕсли;
			
			П000220005401 = ОкрП000220005101 + ОкрП000220005201 + ОкрП000220005301;
			
			СтрТаблицаСтраницы[0].Страница2[0].Значение.Вставить("П000220005401",П000220005401);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница2" Тогда
				Форма.ТабличныйДокумент.Области.П000220005401.Значение = П000220005401;
			КонецЕсли;
			
		КонецЕсли;
		
	//Авторасчет
	ИначеЕсли ИмяСтраницыПанели = "" Тогда
		
		Расчет(Форма,"Форма200Страница1", "");
		Расчет(Форма,"Форма200Страница2", "");
		Расчет(Форма,"Форма200Страница3", "");
		Расчет(Форма,"Форма200_01Страница1", "");
		Расчет(Форма,"Форма200_01Страница2", "");
		Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
		ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
		Для Каждого СтрокаТЗ из ТаблицаСтраницРаздела Цикл
			СтрокаТЗ.АктивнаяСтраница = Истина;
			Расчет(Форма,"Форма200_02Страница1", "");
			Расчет(Форма,"Форма200_02Страница2", "");
			СтрокаТЗ.АктивнаяСтраница = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция УниверсальнаяВыгрузка (ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина, ИмяФайлаВыгрузки = "", ВыгружатьСОшибками = Ложь) Экспорт
	
	ИмяФайлаВыгрузки = СформироватьИмяФайла();
	
	СформироватьСписокФормБезИерархии();
	
	ТекстВыгрузки =  УниверсальнаяВыгрузкаНаСервере();
	
	Если ТекстВыгрузки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СформироватьИмяФайла()
	
	Перем ПолученноеЗначение;
	
	ИмяФайлаXML = "Форма200_"+ Прав(Этаформа.ИмяФормы,7)+ "_" + СтрЗаменить(СтрЗаменить(Строка(ТекущаяДата())," ","_"),":","-") + ".xml";
	
	Возврат ИмяФайлаXML;
	
КонецФункции

&НаКлиенте
Функция СформироватьМногострочнуюСтруктуруДляВыгрузки (ТекущееИмяФормы) Экспорт
	
	Возврат СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы);	
	
КонецФункции

&НаСервере
Функция СформироватьМногострочнуюСтруктуруДляВыгрузкиНаСервере(ТекущееИмяФормы) Экспорт
	
	Перем ТаблицаСтраницРаздела;
	
	Если ТекущееИмяФормы = Неопределено тогда
		ТекущееИмяФормы = "Форма200_02";
	КонецЕсли;	
	
	Если ЭтаФорма["ТаблицаСтраницы"+ТекущееИмяФормы] = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела);
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	
	КоличествоСтраниц = 0;
	Для каждого ЭлементДерева из мСписокФормБезИерархии.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.КодФормы = ТекущееИмяФормы Тогда
			КоличествоСтраниц = ЭлементДерева.КоличествоСтраницПриложения;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	МногострочнаяСтруктура = Новый Структура;
	
	Для Ном = 1 По КоличествоСтраниц Цикл
		
		ДанныеСтраницы = Новый Структура;
		
		ДанныеСтраницы.Вставить("ШапкаИПодвал", Новый ТаблицаЗначений);
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		
		Для каждого СтрокаСписка из ТаблицаСтраницРаздела.Выгрузить(,("Страница"+Ном)) Цикл
			
			НоваяСтрокаТЗ = ТаблицаЗначений.Добавить();
			
			СтруктураСтраницы = СтрокаСписка["Страница"+Ном][0].Значение;
			
			Для Каждого ЭлементСтрутуры из СтруктураСтраницы Цикл
				
				Если ТаблицаЗначений.Колонки.Найти(ЭлементСтрутуры.Ключ) = Неопределено Тогда
					ТипКолонки = Новый Массив;
					ТипКолонки.Добавить(ТипЗнч(ЭлементСтрутуры.Значение));
					ТаблицаЗначений.Колонки.Добавить(ЭлементСтрутуры.Ключ, Новый ОписаниеТипов(ТипКолонки));
				КонецЕсли;
				
				НоваяСтрокаТЗ[ЭлементСтрутуры.Ключ] = ЭлементСтрутуры.Значение;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ДанныеСтраницы.Вставить("Строки",      ТаблицаЗначений);
		
		МногострочнаяСтруктура.Вставить("Страница"+Ном, ДанныеСтраницы);
		
	КонецЦикла;
		
	Возврат МногострочнаяСтруктура;

КонецФункции

&НаСервере
Процедура СформироватьСписокФормБезИерархии()
	
	мСписокФормБезИерархии.ПолучитьЭлементы().Очистить();
	
	МакетПоказателей = Отчеты[Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет("Показатели");
	Префикс = Прав(ЭтаФорма.СтруктураРеквизитовФормы.мВыбраннаяФорма,7);
	
	ОбластьПоказателей = МакетПоказателей.Область("Форма200_" + Префикс);
	
	Для Ном = ОбластьПоказателей.Верх По ОбластьПоказателей.Низ Цикл
		
		НоваяСтрока = мСписокФормБезИерархии.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ИмяФормы			= СокрП(МакетПоказателей.Область(Ном, 1).Текст);
		НоваяСтрока.Выгружать			= ?(СокрП(МакетПоказателей.Область(Ном, 2).Текст)= "1",Истина,Ложь);
		НоваяСтрока.Многострочность		= ?(СокрП(МакетПоказателей.Область(Ном, 3).Текст)= "1",Истина,Ложь);
		НоваяСтрока.КодФормы			= СокрП(МакетПоказателей.Область(Ном, 4).Текст);
		НоваяСтрока.КоличествоНаЛисте	= Число(СокрП(МакетПоказателей.Область(Ном, 5).Текст));
		НоваяСтрока.КоличествоСтраницПриложения = Число(СокрП(МакетПоказателей.Область(Ном, 6).Текст));
		
		Если НоваяСтрока.Многострочность <> Истина Тогда
			Для КолСтр = 1 По НоваяСтрока.КоличествоСтраницПриложения  Цикл
				Для Каждого Элемент Из ЭтаФорма["СтруктураДанных"+ НоваяСтрока.КодФормы + "Страница" + КолСтр] Цикл
					НовыйЭлемент = НоваяСтрока.Значение.Добавить();
					НовыйЭлемент.ИмяОбласти = Элемент.Ключ;
					НовыйЭлемент.Значение = Элемент.Значение;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция  УниверсальнаяВыгрузкаНаСервере()
	Возврат РегламентированнаяОтчетностьРК.ВыгрузитьОтчетВXMLДляСОНО(ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма200Страница1.Очистить();
	СтруктураДанныхФорма200Страница2.Очистить();
	СтруктураДанныхФорма200_01Страница1.Очистить();
	СтруктураДанныхФорма200_01Страница2.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200Страница1", 1);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
		//СформироватьДеревоРазделовОтчетаНаСервере();
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
		ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	мПараметры.Вставить("СписокСтруктурныхЕдиниц", Истина);
	мПараметры.Вставить("РежимВыбораСтруктурныхЕдиниц", "ПоНалогоплательщику");
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("СтруктурныеЕдиницы",        мСписокСтруктурныхЕдиниц);
	ПараметрыФормы.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	ПараметрыФормы.Вставить("мПараметры",                мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200Страница1";
	СтрокаУровня1.Представление            = "Форма 200.00";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);

	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_01Страница1";
	СтрокаУровня1.Представление            = "Форма 200.01";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200_01Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма200_02Страница1";
	СтрокаУровня1.Представление            = "Форма 200.02";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма200_02Страница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	//ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	//СформироватьПодменюПечать(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьАвтоПослеСохранениеОтчета", 
		ЭтотОбъект, 
		ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ЗаполнитьАвтоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);

	ЗаполнитьПустыеСтруктурыДанных();
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц",  мСписокСтруктурныхЕдиниц);
	ПараметрыОтчета.Вставить("НалоговыйКомитет",		 СтруктураРеквизитовФормы.НалоговыйКомитет);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма200Страница1", СтруктураДанныхФорма200Страница1);
	Контейнер.Вставить("Форма200Страница2", СтруктураДанныхФорма200Страница2);
	Контейнер.Вставить("Форма200Страница3", СтруктураДанныхФорма200Страница3);
	Контейнер.Вставить("Форма200_01Страница1", СтруктураДанныхФорма200_01Страница1);
	Контейнер.Вставить("Форма200_01Страница2", СтруктураДанныхФорма200_01Страница2);
	Контейнер.Вставить("Форма200_02", ТаблицаСтраницыФорма200_02);
	
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(ИмяОтчета(ЭтаФорма.ИмяФормы), ИмяФормыОтчета(ЭтаФорма.ИмяФормы), ПараметрыОтчета, Контейнер);
	
	Для Каждого ЭлементКонтейнера Из Контейнер Цикл
		
		ИмяСтраницы = ЭлементКонтейнера.Ключ;
		Если ИмяСтраницы <> "Форма200_02" Тогда
			ЭтаФорма["СтруктураДанных" + ИмяСтраницы] = ЭлементКонтейнера.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);

	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200Страница1", 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
	РасчетНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	ТаблицаСтраницыФорма200_02.Очистить();
	ПостроениеПервоначальнойСтруктурыНаСервере(,"Форма200_02Страница1");
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
			
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
		
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	
	СписокСохранения.Вставить("СписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СписокСохранения.Вставить("НалоговыйКомитет", 		 НалоговыйКомитетФорма);
	
	МассивТиповНеопределено = Новый Массив;
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	// вставляем данные многостраничных разделов
	Форма200_02 = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураФорма200_02Страница1и2 Цикл
		
		Форма200_02.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
		ТаблЗнач = Неопределено;
		
		Если Форма200_02.Свойство(ЭлементСтруктуры.Ключ, ТаблЗнач) Тогда
			
			Если НЕ ТаблЗнач.Колонки.Найти("Страница1") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("Страница1");
				ТаблЗнач.Колонки.Добавить("Страница1", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Страница1 = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Страница1[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ТаблЗнач.Колонки.Найти("Страница2") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("Страница2");
				ТаблЗнач.Колонки.Добавить("Страница2", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Страница2 = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Страница2[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокСохранения.Вставить("Форма200_02", Форма200_02);
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если Раздел.ИмяСтраницы = "Форма200_02Страница1"
			ИЛИ Раздел.ИмяСтраницы = "Форма200_02Страница2" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			
			Если ЭлеменетДерева.ИмяСтраницы = "Форма200_02Страница1" Тогда 
				
				Для Номер = 0 По ТаблицаСтраницыФорма200_02.Количество()-1 Цикл
					
				ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы,Номер+1);	
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  "Форма 200.02 Лист "+ (Номер+1) +" Страница 1");
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        "Форма200_02Страница1");
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма200_02Страница2",Номер+1);	
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  "Форма 200.02 Лист "+ (Номер+1) +" Страница 2");
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        "Форма200_02Страница2");
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				КонецЦикла;
				
			Иначе
				ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка,ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 И Область.Текст <> "" Тогда
		ДобавитьСтраницу("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Текст <> "" Тогда
		УдалитьСтраницу("");
	КонецЕсли;
	
	//Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
	//	Возврат;
	//КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
	Если (Найти(ИмяЯчейки, "Первоначальная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Очередная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Дополнительная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "ПоУведомлению") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Ликвидационная") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7A") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7B") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Признак7C") > 0) 
	 ИЛИ (Найти(ИмяЯчейки, "Приложение01") > 0)
	 ИЛИ (Найти(ИмяЯчейки, "Приложение02") > 0) Тогда
		РасчетНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела,ИмяЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтраницуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Удалить текущий Лист?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РазделыОтчета.ТекущиеДанные;
	
	НомерУдоляемойСтраницы = ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
	Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если ТекущиеДанные.ПолучитьЭлементы().Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДанныхФормыДерево = ТекущиеДанные.ПолучитьЭлементы();
	ЭлементДереваПослеУдаления = ЭлементыДанныхФормыДерево.Получить(?(НомерУдоляемойСтраницы-1 = 0,1,НомерУдоляемойСтраницы-1) - 1).ПолучитьИдентификатор();
	УдаляемыйЛистДерева = ЭлементыДанныхФормыДерево.Получить(НомерУдоляемойСтраницы - 1);
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Форма200_02Страница1" Тогда
		УдалитьДопЛистФорма200_02НаСервере("Форма200_02Страница1");
	КонецЕсли;
	
	ТекущиеДанные.ПолучитьЭлементы().Удалить(ТекущиеДанные.ПолучитьЭлементы().Индекс(УдаляемыйЛистДерева));
	
	Элементы.РазделыОтчета.ТекущаяСтрока = ЭлементДереваПослеУдаления;
	НомерСтраницы = 1;
	Для Каждого СтраницаРаздела Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		СтраницаРаздела.КолонкаРазделыОтчета = "Форма 200.02 Лист " + НомерСтраницы ;
		СтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
		
		Для Каждого ПодСтраницаРаздела Из СтраницаРаздела.ПолучитьЭлементы() Цикл
			
			Если ПодСтраницаРаздела.КолонкаРазделыОтчетаСокрНаим = "Форма200_02Страница1" Тогда
				
				ПодСтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
				
			Иначе
				
				ПодСтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	РасчетНаКлиенте("Форма200_02Страница1","УдалитьСтраницу");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДопЛистФорма200_02НаСервере(ИмяТекущейСтраницыПанели = Неопределено)
	
	УдалитьДопЛистФорма200_02(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
	//СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДопЛистФорма200_02(Форма, ИмяТекущейСтраницыПанели)
	
	Перем ТаблицаСтраницРаздела;
	
	Если Не Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	ИмяТекТабличногоПоля     = "ТабличныйДокумент";
	ТекТабличноеПоле         = Форма[ИмяТекТабличногоПоля];
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина))[0];
	ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
	
	Если СтрТаблицаСтраницы <> Неопределено Тогда
		
		Если ИмяТекущейСтраницыПанели = "Форма200_02Страница1" Тогда
			
			Если ТаблицаСтраницРаздела.Количество() <= 1 Тогда
				Возврат;
			КонецЕсли;
			
			ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
			ТаблицаСтраницРаздела.Удалить(СтрТаблицаСтраницы);
			
		КонецЕсли;
		
		// очищаем редактируемые ячейки удаляемой страницы
		ОчиститьТабличноеПоле(Форма, ИмяТекущейСтраницыПанели);
		
		
	КонецЕсли;
	
	//Расчет(Форма, ИмяТекущейСтраницыПанели);
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	
	Модифицированность = Истина;
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма200_02Страница1" Тогда
		
		ДобавитьЛистВФорму200_02НаСервере();
		
	КонецЕсли;
	
	Обл = ТабличныйДокумент.Области["УдалитьСтраницуЗначок"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "х";
	Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
	Обл.Гиперссылка = Истина;
	Обл.Текст = "Удалить Лист";
	
	РасчетНаКлиенте("Форма200_02Страница1");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЛистВФорму200_02НаСервере()
	
	ВставитьДопЛистФорма200_02НаСервере("Форма200_02Страница1");
	СохранитьАктивнуюФорму200_02НаСервере("Форма200_02Страница1");
	ОчиститьТабличноеПолеНаСервере("Форма200_02Страница2");
	СохранитьАктивнуюФорму200_02НаСервере("Форма200_02Страница2");
	//
	//СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДопЛистФорма200_02НаСервере(ИмяТекущейСтраницыПанели)
	
	ВставитьЛистВФорму200_02(ЭтаФорма, ИмяТекущейСтраницыПанели);
	ПослеВставкиДополнительногоЛистаВФорму200_02НаСервере(ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьЛистВФорму200_02(Форма, ИмяТекущейСтраницыПанели)

	Перем ТаблицаСтраницРаздела;
	Перем ТаблицаСтраница1;

	Если Не Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЛистовРаздела = Форма[ТаблицаСтраницРаздела];
	
	ТекТабличноеПоле     = Форма.ТабличныйДокумент;
	// находим активную страницу
	ТекущийЛист = ТаблицаЛистовРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
	
	Если ИмяТекущейСтраницыПанели = "Форма200_02Страница1" Тогда
		
		СтруктураДанныхТекущейТаблицы = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");
		ТекущийЛист[0].АктивнаяСтраница = Ложь;
		
		НовыйЛист = ТаблицаЛистовРаздела.Добавить();
		НовыйЛист.Представление      = "";
		НовыйЛист.АктивнаяСтраница   = Истина; // Активная страница
		
		СтруктураДанных = Новый Структура;
		НовыйЛист.Страница2.Добавить(СтруктураДанных);
		
		ОчиститьТабличноеПоле(Форма, ИмяТекущейСтраницыПанели);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеВставкиДополнительногоЛистаВФорму200_02НаСервере(ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист = Истина)
	
	ПослеВставкиДополнительногоЛистаВФорму200_02(ЭтаФорма, ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПослеВставкиДополнительногоЛистаВФорму200_02(Форма, ИмяТекущейСтраницыПанели, ПерейтиНаВставленныйЛист)
	
	ТекущийЭлемент = Форма.РазделыОтчета.НайтиПоИдентификатору(Форма.Элементы.РазделыОтчета.ТекущаяСтрока);
	
	Родитель = ТекущийЭлемент.ПолучитьРодителя();

	Если НЕ Родитель = Неопределено Тогда
		
		РодительРодителя = Родитель.ПолучитьРодителя();
		
		Если Не РодительРодителя = Неопределено Тогда 
			
			ТекущийЭлемент = РодительРодителя;
			
		Иначе
			
			ТекущийЭлемент = Родитель;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	НомерДобавляемойСтраницы = ТекущийЭлемент.ПолучитьЭлементы().Количество() + 1;
	
	ДобавляемаяСтраница = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяСтраница.КолонкаРазделыОтчета              = "Форма 200.02 Лист " + НомерДобавляемойСтраницы;
	ДобавляемаяСтраница.КолонкаРазделыОтчетаСокрНаим      = ТекущийЭлемент.КолонкаРазделыОтчетаСокрНаим;
	ДобавляемаяСтраница.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяСтраница.РазделМногостраничный             = ТекущийЭлемент.РазделМногостраничный;
	
	ИдентификаторДобавляемойСтраницы = ДобавляемаяСтраница.ПолучитьИдентификатор();
	
	ТекущийЭлемент = ДобавляемаяСтраница;
	
	ДобавляемаяПодСтраница1 = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяПодСтраница1.КолонкаРазделыОтчета              = "Форма 200.02 Страница 1";
	ДобавляемаяПодСтраница1.КолонкаРазделыОтчетаСокрНаим      = "Форма200_02Страница1";
	ДобавляемаяПодСтраница1.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяПодСтраница1.РазделМногостраничный             = Истина;
	
	ДобавляемаяПодСтраница2 = ТекущийЭлемент.ПолучитьЭлементы().Добавить();
	
	ДобавляемаяПодСтраница2.КолонкаРазделыОтчета              = "Форма 200.02 Страница 2";
	ДобавляемаяПодСтраница2.КолонкаРазделыОтчетаСокрНаим      = "Форма200_02Страница2";
	ДобавляемаяПодСтраница2.КолонкаНомерСтраницыРазделаОтчета = НомерДобавляемойСтраницы;
	ДобавляемаяПодСтраница2.РазделМногостраничный             = Истина;
	
	
	Если НЕ ИмяТекущейСтраницыПанели = "Форма200_02Страница1" Тогда
		ИдентификаторДобавляемойСтраницы = ДобавляемаяСтраница.ПолучитьИдентификатор();
	КонецЕсли;
	
	Если ПерейтиНаВставленныйЛист Тогда
		Форма.Элементы.РазделыОтчета.ТекущаяСтрока = ИдентификаторДобавляемойСтраницы;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПостроениеПервоначальнойСтруктурыНаСервере(Первый = Истина, НаимРаздела)
	
	ПостроениеПервоначальнойСтруктуры(ЭтаФорма, Первый, НаимРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПостроениеПервоначальнойСтруктуры(Форма, Первый = Истина, НаимРаздела)
	Перем ТаблицаСтраницРаздела;
	Перем ТаблицаДоходовИсточника;

	Если Не Форма.мСтруктураФорма200_02Страница1и2.Свойство("Форма200_02", ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];

	Если Первый Тогда
				
		ОчиститьТабличноеПоле(Форма, НаимРаздела);
		СтруктураДанныхТекущейТаблицыРаздел1 = СобратьДанныеТекущегоТаблПоля(Форма, "ТабличныйДокумент");

		СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
		СтрНоваяСтраница.Представление      = "";
		СтрНоваяСтраница.АктивнаяСтраница   = Истина;
		СтрНоваяСтраница.АвтоматическоеПредставление = Истина;
		СтрНоваяСтраница.Страница1.Добавить(СтруктураДанныхТекущейТаблицыРаздел1);
		
		СтруктураДанных = Новый Структура;
		СтрНоваяСтраница.Страница2.Добавить(СтруктураДанных);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ИмяТабличногоПоля)

	ТабличноеПоле = Форма[ИмяТабличногоПоля];
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Инд = 0 По ТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;

		ИмяПоказателя      = ТекущаяОбласть.Имя;
		ЗначениеПоказателя = ТекущаяОбласть.Значение;

		СтруктураДанныхПоля.Вставить(ИмяПоказателя, ЗначениеПоказателя);

	КонецЦикла;

	Возврат СтруктураДанныхПоля;

КонецФункции

&НаСервере
Процедура УстановитьДоступностьКнопкиУдалитьСтраницу(Таблица)
	
	Обл = ТабличныйДокумент.Области.Найти("УдалитьСтраницуЗначок");
	Если Обл = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Таблица.Количество() = 1 Тогда 
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
	Иначе
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
		Обл = ТабличныйДокумент.Области["УдалитьСтраницу"];
		Обл.Гиперссылка = Истина;
		Обл.Текст = "Удалить Лист";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры