#Область ПрограммныйИнтерфейс

// Формирует пустую временную таблицу ВТРаспределениеНачисленийТекущегоДокумента.
// 
// Параметры:
// 		МенеджерВременныхТаблиц - менеджер временных таблиц.
//  ЗУПК Аналог процедуры УчетНачисленнойЗарплаты.СоздатьПустуюВТРаспределениеНачисленийТекущегоДокумента()
Процедура СоздатьПустуюВТРаспределениеНачисленийНАТекущегоДокумента(МенеджерВременныхТаблиц) Экспорт

	ПустоеЗначениеТерриторияНаЯзыкеЗапросов = УчетНачисленнойЗарплатыВнутренний.ПустоеЗначениеТерриторияНаЯзыкеЗапросов();

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеУчетаЗатрат,
	|	&ПустоеЗначениеТерриторияНаЯзыкеЗапросов КАК Территория,
	|	&ПустоеЗначениеТерриторияНаЯзыкеЗапросов КАК МестоПолученияДохода,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка) КАК Начисление,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоходовИсполнительногоПроизводства.ПустаяСсылка) КАК ВидДоходаИсполнительногоПроизводства,
	|	0 КАК Сумма
	|ПОМЕСТИТЬ ВТРаспределениеНачисленийНАТекущегоДокумента";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустоеЗначениеТерриторияНаЯзыкеЗапросов", ПустоеЗначениеТерриторияНаЯзыкеЗапросов);
	Запрос.Выполнить();

КонецПроцедуры

// Формирует временную таблицу ВТРаспределениеНачисленийНАТекущегоДокумента.
// Если ведется учет по статьям финансирования, таблица не формируется.
//
// Параметры:
// 	ДанныеДляПроведения - Структура, описание см ОтражениеЗарплатыВУчете.ОписаниеДанныеДляПроведения.
//  ЗУПК Аналог процедуры УчетНачисленнойЗарплаты.СоздатьВТРаспределениеНачисленийТекущегоДокумента()
Процедура СоздатьВТРаспределениеНачисленийНАТекущегоДокумента(ДанныеДляПроведения) Экспорт

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата") Тогда
		Возврат;
	КонецЕсли;
	
	Движения 				= ДанныеДляПроведения.Движения;
	МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	ПериодРегистрации 		= ДанныеДляПроведения.ПериодРегистрации;
	Авансом 				= ДанныеДляПроведения.Авансом;
	
    ИмяТаблицыРегистра = "НачисленияУдержанияПоКонтрагентамАкционерам";
	
	ДвиженияНачисленийУдержаний = Движения[ИмяТаблицыРегистра];
	
	ТаблицаДокумента = ДвиженияНачисленийУдержаний.Выгрузить();
	
	Отбор = Новый Структура("ГруппаНачисленияУдержанияВыплаты,Период", Перечисления.ГруппыНачисленияУдержанияВыплаты.Начислено, ПериодРегистрации);
	Начисления = ТаблицаДокумента.Скопировать(Отбор);
	
	Отбор.ГруппаНачисленияУдержанияВыплаты = Перечисления.ГруппыНачисленияУдержанияВыплаты.Справочно;
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
		Если ТипЗнч(СтрокаТЗ.НачислениеУдержание) = Тип("ПланВидовРасчетаСсылка.Начисления") Или СтрокаТЗ.НачислениеУдержание = Перечисления.ВидыОсобыхНачисленийИУдержаний.СтоимостьПодарковПризов Тогда
			ЗаполнитьЗначенияСвойств(Начисления.Добавить(), СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Отбор.ГруппаНачисленияУдержанияВыплаты = Перечисления.ГруппыНачисленияУдержанияВыплаты.Льготы;
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(Начисления.Добавить(), СтрокаТЗ);
	КонецЦикла;
	
	Если ЗарплатаКадры.ВТСуществует(МенеджерВременныхТаблиц, "ВТРаспределениеНачисленийНАТекущегоДокумента") Тогда
		ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТРаспределениеНачисленийНАТекущегоДокумента");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачисленияДокумента", Начисления);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияДокумента.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияДокумента.Сотрудник КАК Сотрудник,
	|	НачисленияДокумента.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеУчетаЗатрат,
	|	НачисленияДокумента.ТерриторияВыполненияРаботВОрганизации КАК Территория,
	|	НачисленияДокумента.МестоПолученияДохода КАК МестоПолученияДохода,
	|	НачисленияДокумента.НачислениеУдержание КАК Начисление,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
	|	НачисленияДокумента.СтатьяРасходов КАК СтатьяРасходов,
	|	НачисленияДокумента.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	|	НачисленияДокумента.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТРаспределениеНачисленийНАТекущегоДокумента
	|ИЗ
	|	&НачисленияДокумента КАК НачисленияДокумента
    |";
	Запрос.Выполнить();
	
КонецПроцедуры 

// Заполняет документы-основания при проведении ограничения взысканий
//
// Параметры:
// 	
//  
Процедура ЗаполнитьДокументыОснованияОграниченияВзысканий(МесяцНачисления, Организация, Движения) Экспорт

    
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(МесяцНачисления));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВзаиморасчетыСКонтрагентамиАкционерами", Движения.ВзаиморасчетыСКонтрагентамиАкционерами);

	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Период КАК Период,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор КАК Регистратор,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.НомерСтроки КАК НомерСтроки,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Активность КАК Активность,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения КАК ВидДвижения,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ДокументОснование КАК ДокументОснование,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.ГруппаНачисленияУдержанияВыплаты КАК ГруппаНачисленияУдержанияВыплаты,
	               |	ВзаиморасчетыСКонтрагентамиАкционерами.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_ВзаиморасчетыСКонтрагентамиАкционерами
	               |ИЗ
	               |	&ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период КАК Период,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация КАК Организация,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СпособРасчетов КАК СпособРасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяФинансирования КАК СтатьяФинансирования,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяРасходов КАК СтатьяРасходов,
	               |	МАКСИМУМ(ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ДокументОснование) КАК ДокументОснование,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Подразделение КАК Подразделение,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	               |ПОМЕСТИТЬ ВТ_ВзаиморасчетыПоДокументамОснованиям
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиАкционерами.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			МЕСЯЦ,
	               |			(Организация, ФизическоеЛицо, СпособРасчетов, СтатьяФинансирования, СтатьяРасходов, ВидДоходаИсполнительногоПроизводства, Подразделение, ПериодВзаиморасчетов) В
	               |				(ВЫБРАТЬ
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
	               |					ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	               |				ИЗ
	               |					ВТ_ВзаиморасчетыСКонтрагентамиАкционерами КАК ВзаиморасчетыСКонтрагентамиАкционерами)) КАК ВзаиморасчетыСКонтрагентамиАкционерамиОбороты
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Период,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Организация,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ФизическоеЛицо,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СпособРасчетов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяФинансирования,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.СтатьяРасходов,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ВидДоходаИсполнительногоПроизводства,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.Подразделение,
	               |	ВзаиморасчетыСКонтрагентамиАкционерамиОбороты.ПериодВзаиморасчетов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Период КАК Период,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Регистратор КАК Регистратор,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Активность КАК Активность,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ВидДвижения КАК ВидДвижения,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Организация КАК Организация,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов КАК СпособРасчетов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования КАК СтатьяФинансирования,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов КАК СтатьяРасходов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение КАК Подразделение,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ГруппаНачисленияУдержанияВыплаты КАК ГруппаНачисленияУдержанияВыплаты,
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Сотрудник КАК Сотрудник,
	               |	ВТ_ВзаиморасчетыПоДокументамОснованиям.ДокументОснование КАК ДокументОснование
	               |ИЗ
	               |	ВТ_ВзаиморасчетыСКонтрагентамиАкционерами КАК ВТ_ВзаиморасчетыСКонтрагентамиАкционерами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВзаиморасчетыПоДокументамОснованиям КАК ВТ_ВзаиморасчетыПоДокументамОснованиям
	               |		ПО ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Период = ВТ_ВзаиморасчетыПоДокументамОснованиям.Период
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Организация = ВТ_ВзаиморасчетыПоДокументамОснованиям.Организация
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ФизическоеЛицо = ВТ_ВзаиморасчетыПоДокументамОснованиям.ФизическоеЛицо
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СпособРасчетов = ВТ_ВзаиморасчетыПоДокументамОснованиям.СпособРасчетов
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяФинансирования = ВТ_ВзаиморасчетыПоДокументамОснованиям.СтатьяФинансирования
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.СтатьяРасходов = ВТ_ВзаиморасчетыПоДокументамОснованиям.СтатьяРасходов
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ВидДоходаИсполнительногоПроизводства = ВТ_ВзаиморасчетыПоДокументамОснованиям.ВидДоходаИсполнительногоПроизводства
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.Подразделение = ВТ_ВзаиморасчетыПоДокументамОснованиям.Подразделение
	               |			И ВТ_ВзаиморасчетыСКонтрагентамиАкционерами.ПериодВзаиморасчетов = ВТ_ВзаиморасчетыПоДокументамОснованиям.ПериодВзаиморасчетов";
	
	Движения.ВзаиморасчетыСКонтрагентамиАкционерами.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
	
#КонецОбласти