#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем УдаляемыеРаботники;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыКадровыхСобытийУвольнение = Перечисления.ВидыКадровыхСобытий.Увольнение;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗапрашиваемыеЗначения = Новый Структура;
		ЗапрашиваемыеЗначения.Вставить("Организация", "Объект.Организация");
		ЗапрашиваемыеЗначения.Вставить("Ответственный", "Объект.Ответственный");
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗапрашиваемыеЗначения);
		
		ЗаполнитьНастройкиОрганизацииНаСервере();
		
		ПриПолученииДанныхНаСервере();
	Иначе
		НастройкиОрганизации = МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Объект.Организация);
		Сертификат = НастройкиОрганизации.Сертификат;
		ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьТекущиеПозицииРаботников();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия="ИзменениеДанныхФизическогоЛица" Тогда
		ЗаполнитьНаКлиенте(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр.ФизическоеЛицо));
	КонецЕсли;
	Если ИмяСобытия="ЗаписанСправочникОбразованиеФизическихЛиц" Тогда
		ЗаполнитьНаКлиенте(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Источник.Объект.Владелец));
	КонецЕсли;
	Если ИмяСобытия="ИзмененыСпециальностиФизическихЛиц" Тогда 
		ЗаполнитьНаКлиенте(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Источник.ФизическоеЛицо.Ссылка));
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
	ЗаполнитьНастройкиОрганизацииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере(Объект.Организация, Сертификат);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура РаботникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьНаКлиенте(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РаботникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботникиПередУдалением(Элемент, Отказ)
	
	УдаляемыеРаботники = Новый Массив;
	УдаляемыеСтроки = Элемент.ВыделенныеСтроки;
	Для Каждого Идентификатор Из УдаляемыеСтроки Цикл
		СтрокаРаботник = Объект.Работники.НайтиПоИдентификатору(Идентификатор);
		Если СтрокаРаботник <> Неопределено Тогда 
			УдаляемыеРаботники.Добавить(СтрокаРаботник.ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиПослеУдаления(Элемент)
	
	Для Каждого ФизическоеЛицо Из УдаляемыеРаботники Цикл
		СтрокиРаботников = Объект.Работники.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Если СтрокиРаботников.Количество() = 0 Тогда
			УдалитьСтрокиРаботника("ДокументыУдостоверяющиеЛичность", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ЛичноеДело", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ОбщееОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ПрофессиональноеОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ПослевузовскоеОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ДополнительноеПрофессиональноеОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("Сертификаты", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("Награды", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("Квалификация", "ФизическоеЛицо", ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
	УдаляемыеРаботники.Очистить();
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя="РаботникиФизическоеЛицо" Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.ФизическоеЛицо);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрыОткрытия);
		
	Иначе 
		
		СтандартнаяОбработка = Ложь;
		СведенияМедицинскогоРаботника(Команды.Найти("СведенияМедицинскогоРаботника"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СведенияМедицинскогоРаботника(Команда)
	
	ТекущиеДанные = Элементы.Работники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущийРаботник 	= ТекущиеДанные.ФизическоеЛицо;
	НовыйАдресХранилища = ДанныеМедицинскогоРаботника(ТекущийРаботник);
	
	ПараметрыРедактированияМедРаботника = Новый Структура;
	ПараметрыРедактированияМедРаботника.Вставить("Дата",	Объект.Дата);
	ПараметрыРедактированияМедРаботника.Вставить("Ссылка",	Объект.Ссылка);
	ПараметрыРедактированияМедРаботника.Вставить("ФизическоеЛицо", ТекущийРаботник);
	ПараметрыРедактированияМедРаботника.Вставить("Организация", Объект.Организация);
	ПараметрыРедактированияМедРаботника.Вставить("АдресХранилища", НовыйАдресХранилища);
	ПараметрыРедактированияМедРаботника.Вставить("НомерСтрокиРаботника", Элементы.Работники.ТекущаяСтрока);
	
	Оповещение = Новый ОписаниеОповещения("СведенияМедицинскогоРаботникаЗавершение", ЭтотОбъект, ПараметрыРедактированияМедРаботника);
	ОткрытьФорму("Документ.СведенияДляФРМР.Форма.ФормаСотрудника", ПараметрыРедактированияМедРаботника, ЭтаФорма, , , ,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СведенияМедицинскогоРаботникаЗавершение(РезультатОткрытияФормы, ПараметрыОповещения) Экспорт

	Если ПустаяСтрока(РезультатОткрытияФормы) Тогда
		Возврат;
	КонецЕсли;

	ОбновитьДанныеРаботника(РезультатОткрытияФормы, ПараметрыОповещения.ФизическоеЛицо);
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Работники.Количество() = 0 Тогда
		ЗаполнитьНаКлиенте();
		Возврат;
	КонецЕсли;
	
	// Если есть строки, то необходимо выяснить как именно заполнять: 
	// полным перезаполнением или обновлением.
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтаФорма);
	
	ТекстВопроса = НСтр("ru = 'Обновить данные работников 
							|или перезаполнить документ?'");
						 
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить("Заполнить", НСтр("ru = 'Заполнить'"));
	КнопкиОтвета.Добавить("Обновить", НСтр("ru = 'Обновить'"));
	КнопкиОтвета.Добавить("Отмена", НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, КнопкиОтвета, , "Заполнить", НСтр("ru = 'Заполнение документа'"));
	
КонецПроцедуры

// Завершение процесса заполнения документа.
// Старт осуществляется методом Заполнить.
//
&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = "Заполнить" Тогда
		
		ЗаполнитьНаКлиенте();
		
	ИначеЕсли Результат = "Обновить" Тогда
		
		СписокРаботников = Новый Массив;
		Для Каждого Работник Из Объект.Работники Цикл
			СписокРаботников.Добавить(Работник.ФизическоеЛицо);
		КонецЦикла;
		
		ЗаполнитьНаКлиенте(СписокРаботников);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	СтруктураОтбора = Новый Структура("ДатаПримененияОтбора", Объект.Дата);
	ПараметрыОткрытияФормы.Вставить("Отбор", СтруктураОтбора);
	
	КадровыйУчетКлиент.ВыбратьФизическихЛицОрганизации(
		Элементы.Работники, 
		Объект.Организация, 
		Истина, 
		, 
		АдресСпискаПодобранныхРаботников(), 
		, 
		ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФРМР(Команда)
	ОчиститьСообщения();
	ВыгрузитьВФРМРНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// Подключение универсальных механизмов.
&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	// КлючевыеРеквизитыЗаполненияФормы	
	ОписаниеКлючевыхРеквизитов = Неопределено;
	ТаблицыОчищаемыеПриИзменении = Неопределено;
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект, ОписаниеКлючевыхРеквизитов);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект, , ОписаниеКлючевыхРеквизитов, ТаблицыОчищаемыеПриИзменении);
	// КлючевыеРеквизитыЗаполненияФормы
	
	ЗаполнитьТекущиеПозицииРаботников();
		
КонецПроцедуры

#Область ЗаполнениеДокумента

&НаКлиенте
Процедура ЗаполнитьНаКлиенте(Знач СписокРаботников = Неопределено)

	Результат = РезультатЗаполненияВДлительнойОперации(СписокРаботников);
	
	Если Результат.ЗаданиеВыполнено Тогда
		
		ОповеститьОбИзменении(Объект.Ссылка);
		
	Иначе
		
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища		 = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗаполненияВДлительнойОперации(Знач СписокРаботников = Неопределено)
	
	ПараметрыЗаполнения = Новый Структура("ДанныеДляЗаполнения,Ссылка,Организация,ДатаАктуальности,СписокРаботников");
	ПараметрыЗаполнения.ДанныеДляЗаполнения = Новый Структура("Работники,ДокументыУдостоверяющиеЛичность,ЛичноеДело,ОбщееОбразование,ПрофессиональноеОбразование,ПослевузовскоеОбразование,ДополнительноеПрофессиональноеОбразование,Сертификаты,Награды,Квалификация");
	ПараметрыЗаполнения.Ссылка = Объект.Ссылка;
	ПараметрыЗаполнения.Организация = Объект.Организация;
	ПараметрыЗаполнения.ДатаАктуальности = Объект.Дата;
	ПараметрыЗаполнения.СписокРаботников = СписокРаботников;
	
	НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Сведения о медицинских работниках для ФРМР""'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Документы.СведенияДляФРМР.ПодготовитьДанныеДляЗаполнения",
		ПараметрыЗаполнения,
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗаполнениеПослеВыполненияДлительнойОперации();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
				ЗаполнениеПослеВыполненияДлительнойОперации();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал,
					Истина);
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		
		СообщенияПользователю = СообщенияФоновогоЗадания(ИдентификаторЗадания);
		Если СообщенияПользователю <> Неопределено Тогда
			Для Каждого СообщениеФоновогоЗадания Из СообщенияПользователю Цикл
				СообщениеФоновогоЗадания.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Функция СообщенияФоновогоЗадания(ИдентификаторЗадания)
	
	СообщенияПользователю = Новый Массив;
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СообщенияПользователю = ФоновоеЗадание.ПолучитьСообщенияПользователю();
	КонецЕсли;
	
	Возврат СообщенияПользователю;
	
КонецФункции

&НаСервере
Процедура ЗаполнениеПослеВыполненияДлительнойОперации()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьИзХранилища(АдресХранилища);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	ЗаполнитьТекущиеПозицииРаботников();
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);

	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СертификатПриИзмененииНаСервере(Организация, Сертификат = Неопределено)
	
	Если Не ЗначениеЗаполнено(Организация) Или Не ЗначениеЗаполнено(Сертификат) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОрганизации = МедицинскиеРегистры.СоздатьПустыеНастройкиОрганизации();
	НастройкиОрганизации.Сертификат = Сертификат;
	
	МедицинскиеРегистры.СохранитьНастройкиОрганизации(Организация, НастройкиОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОрганизацииНаСервере()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		НастройкиОрганизации = ПрочитатьНастройкиОрганизации(Объект.Организация);
		Объект.УИНОрганизации = НастройкиОрганизации.ИдентификаторДляМедрегистров;
		Сертификат = НастройкиОрганизации.Сертификат;
		ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьНастройкиОрганизацииНаКлиенте()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		НастройкиОрганизации = ПрочитатьНастройкиОрганизации(Объект.Организация);
		Объект.УИНОрганизации = НастройкиОрганизации.ИдентификаторДляМедрегистров;
		Сертификат = НастройкиОрганизации.Сертификат;
		ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПрочитатьНастройкиОрганизации(Организация)
	Возврат МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Организация)
КонецФункции 

#КонецОбласти

#Область Редактирования

&НаКлиенте
Процедура УдалитьСтрокиРаботника(ИмяТабличнойЧасти, ИмяПоля, Работник)

	УдаляемыеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(Новый Структура(ИмяПоля, Работник));
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		Объект[ИмяТабличнойЧасти].Удалить(УдаляемаяСтрока);
	КонецЦикла;	

КонецПроцедуры 

&НаСервере
Функция АдресСпискаПодобранныхРаботников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Работники.Выгрузить(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеРаботника(АдресДанныхРаботника, ТекущийРаботник)

	Если Не ПустаяСтрока(АдресДанныхРаботника) Тогда 
				
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		
		ДокументОбъект.ОчиститьДанныеРаботника(ТекущийРаботник);
		
		ДокументОбъект.ЗаполнитьИзХранилища(АдресДанныхРаботника);
		
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		ЗаполнитьТекущиеПозицииРаботников();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеПозицииРаботников()

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Работники.ФизическоеЛицо КАК ФизическоеЛицо
	               |ПОМЕСТИТЬ ВТРаботники
	               |ИЗ
	               |	&ТЗРаботники КАК Работники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛичноеДело.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ЛичноеДело.ТабельныйНомер КАК ТабельныйНомер,
	               |	ЛичноеДело.ДатаНачалаЗаписи КАК ДатаНачалаЗаписи
	               |ПОМЕСТИТЬ ВТЛичноеДело
	               |ИЗ
	               |	&ТЗЛичноеДело КАК ЛичноеДело
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбщееОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника
	               |ПОМЕСТИТЬ ВТОбщееОбразование
	               |ИЗ
	               |	&ТЗОбщееОбразование КАК ОбщееОбразование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПрофессиональноеОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника
	               |ПОМЕСТИТЬ ВТПрофессиональноеОбразование
	               |ИЗ
	               |	&ТЗПрофессиональноеОбразование КАК ПрофессиональноеОбразование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПослевузовскоеОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника
	               |ПОМЕСТИТЬ ВТПослевузовскоеОбразование
	               |ИЗ
	               |	&ТЗПослевузовскоеОбразование КАК ПослевузовскоеОбразование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительноеПрофессиональноеОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника
	               |ПОМЕСТИТЬ ВТДополнительноеПрофессиональноеОбразование
	               |ИЗ
	               |	&ТЗДополнительноеПрофессиональноеОбразование КАК ДополнительноеПрофессиональноеОбразование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сертификаты.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Сертификаты.Специальность КАК Специальность,
	               |	Сертификаты.ДатаПолучения КАК ДатаПолучения
	               |ПОМЕСТИТЬ ВТСертификаты
	               |ИЗ
	               |	&ТЗСертификаты КАК Сертификаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Награды.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Награды.Награда КАК Награда,
	               |	Награды.НомерПриказа КАК НомерПриказа,
	               |	Награды.ДатаПриказа КАК ДатаПриказа
	               |ПОМЕСТИТЬ ВТНаграды
	               |ИЗ
	               |	&ТЗНаграды КАК Награды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Квалификация.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Квалификация.ДатаПрисвоения КАК ДатаПрисвоения,
	               |	Квалификация.Специальность КАК Специальность
	               |ПОМЕСТИТЬ ВТКвалификация
	               |ИЗ
	               |	&ТЗКвалификация КАК Квалификация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Работники.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТРаботники КАК Работники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	               |		ПО Работники.ФизическоеЛицо = ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбщееОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТОбщееОбразование КАК ОбщееОбразование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	               |		ПО ОбщееОбразование.ОбразованиеРаботника = ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПрофессиональноеОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТПрофессиональноеОбразование КАК ПрофессиональноеОбразование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	               |		ПО ПрофессиональноеОбразование.ОбразованиеРаботника = ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПослевузовскоеОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТПослевузовскоеОбразование КАК ПослевузовскоеОбразование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	               |		ПО ПослевузовскоеОбразование.ОбразованиеРаботника = ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительноеПрофессиональноеОбразование.ОбразованиеРаботника КАК ОбразованиеРаботника,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыОбъектовДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТДополнительноеПрофессиональноеОбразование КАК ДополнительноеПрофессиональноеОбразование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыОбъектовДляФедеральныхМедрегистров
	               |		ПО ДополнительноеПрофессиональноеОбразование.ОбразованиеРаботника = ИдентификаторыОбъектовДляФедеральныхМедрегистров.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сертификаты.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Сертификаты.Специальность КАК Специальность,
	               |	Сертификаты.ДатаПолучения КАК ДатаПолучения,
	               |	ИдентификаторыСертификатовДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыСертификатовДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыСертификатовДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТСертификаты КАК Сертификаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров КАК ИдентификаторыСертификатовДляФедеральныхМедрегистров
	               |		ПО Сертификаты.ФизическоеЛицо = ИдентификаторыСертификатовДляФедеральныхМедрегистров.ФизическоеЛицо
	               |			И Сертификаты.Специальность = ИдентификаторыСертификатовДляФедеральныхМедрегистров.Специальность
	               |			И Сертификаты.ДатаПолучения = ИдентификаторыСертификатовДляФедеральныхМедрегистров.ДатаПолучения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Награды.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Награды.Награда КАК Награда,
	               |	Награды.ДатаПриказа КАК ДатаПриказа,
	               |	Награды.НомерПриказа КАК НомерПриказа,
	               |	ИдентификаторыНаградДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыНаградДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыНаградДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТНаграды КАК Награды
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыНаградДляФедеральныхМедрегистров КАК ИдентификаторыНаградДляФедеральныхМедрегистров
	               |		ПО Награды.ФизическоеЛицо = ИдентификаторыНаградДляФедеральныхМедрегистров.ФизическоеЛицо
	               |			И Награды.Награда = ИдентификаторыНаградДляФедеральныхМедрегистров.Награда
	               |			И Награды.ДатаПриказа = ИдентификаторыНаградДляФедеральныхМедрегистров.ДатаПриказа
	               |			И Награды.НомерПриказа = ИдентификаторыНаградДляФедеральныхМедрегистров.НомерПриказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Квалификация.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Квалификация.ДатаПрисвоения КАК ДатаПрисвоения,
	               |	Квалификация.Специальность КАК Специальность,
	               |	ИдентификаторыКвалификацийДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыКвалификацийДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыКвалификацийДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТКвалификация КАК Квалификация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров КАК ИдентификаторыКвалификацийДляФедеральныхМедрегистров
	               |		ПО Квалификация.ФизическоеЛицо = ИдентификаторыКвалификацийДляФедеральныхМедрегистров.ФизическоеЛицо
	               |			И Квалификация.ДатаПрисвоения = ИдентификаторыКвалификацийДляФедеральныхМедрегистров.ДатаПрисвоения
	               |			И Квалификация.Специальность = ИдентификаторыКвалификацийДляФедеральныхМедрегистров.Специальность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛичноеДело.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ЛичноеДело.ТабельныйНомер КАК ТабельныйНомер,
	               |	ЛичноеДело.ДатаНачалаЗаписи КАК ДатаНачалаЗаписи,
	               |	ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.Идентификатор КАК Идентификатор,
	               |	ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.МоментВыгрузки КАК МоментВыгрузки,
	               |	ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.МоментИзменения КАК МоментИзменения
	               |ИЗ
	               |	ВТЛичноеДело КАК ЛичноеДело
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров КАК ИдентификаторыЛичныхДелДляФедеральныхМедрегистров
	               |		ПО (ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.УИНОрганизации = &УИНОрганизации)
	               |			И ЛичноеДело.ФизическоеЛицо = ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.ФизическоеЛицо
	               |			И ЛичноеДело.ТабельныйНомер = ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.ТабельныйНомер
	               |			И ЛичноеДело.ДатаНачалаЗаписи = ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.ДатаНачалаЗаписи";
	
	Запрос.УстановитьПараметр("УИНОрганизации", Объект.УИНОрганизации);
	Запрос.УстановитьПараметр("ТЗРаботники", Объект.Работники.Выгрузить());
	Запрос.УстановитьПараметр("ТЗЛичноеДело", Объект.ЛичноеДело.Выгрузить());
	Запрос.УстановитьПараметр("ТЗОбщееОбразование", Объект.ОбщееОбразование.Выгрузить());
	Запрос.УстановитьПараметр("ТЗПрофессиональноеОбразование", Объект.ПрофессиональноеОбразование.Выгрузить());
	Запрос.УстановитьПараметр("ТЗПослевузовскоеОбразование", Объект.ПослевузовскоеОбразование.Выгрузить());
	Запрос.УстановитьПараметр("ТЗДополнительноеПрофессиональноеОбразование", Объект.ДополнительноеПрофессиональноеОбразование.Выгрузить());
	Запрос.УстановитьПараметр("ТЗСертификаты", Объект.Сертификаты.Выгрузить());
	Запрос.УстановитьПараметр("ТЗНаграды", Объект.Награды.Выгрузить());
	Запрос.УстановитьПараметр("ТЗКвалификация", Объект.Квалификация.Выгрузить());
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	ВсегоРезультатов = РезультатыЗапросов.Количество();
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 8].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеОбразования = Объект.ОбщееОбразование.НайтиСтроки(Новый Структура("ОбразованиеРаботника", Выборка.ОбразованиеРаботника));
		Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
			ЗаполнитьЗначенияСвойств(ТекущееОбразование, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 7].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеОбразования = Объект.ПрофессиональноеОбразование.НайтиСтроки(Новый Структура("ОбразованиеРаботника", Выборка.ОбразованиеРаботника));
		Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
			ЗаполнитьЗначенияСвойств(ТекущееОбразование, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 6].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеОбразования = Объект.ПослевузовскоеОбразование.НайтиСтроки(Новый Структура("ОбразованиеРаботника", Выборка.ОбразованиеРаботника));
		Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
			ЗаполнитьЗначенияСвойств(ТекущееОбразование, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 5].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеОбразования = Объект.ДополнительноеПрофессиональноеОбразование.НайтиСтроки(Новый Структура("ОбразованиеРаботника", Выборка.ОбразованиеРаботника));
		Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
			ЗаполнитьЗначенияСвойств(ТекущееОбразование, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 4].Выбрать();
	Пока Выборка.Следующий() Цикл
		СертификатыРаботника = Объект.Сертификаты.НайтиСтроки(Новый Структура("ФизическоеЛицо,Специальность,ДатаПолучения", Выборка.ФизическоеЛицо, Выборка.Специальность,  Выборка.ДатаПолучения));
		Для Каждого СертификатРаботника Из СертификатыРаботника Цикл
			ЗаполнитьЗначенияСвойств(СертификатРаботника, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 3].Выбрать();
	Пока Выборка.Следующий() Цикл
		НаградыРаботника = Объект.Награды.НайтиСтроки(Новый Структура("ФизическоеЛицо,Награда,ДатаПриказа,НомерПриказа", Выборка.ФизическоеЛицо, Выборка.Награда,  Выборка.ДатаПриказа,  Выборка.НомерПриказа));
		Для Каждого НаградаРаботника Из НаградыРаботника Цикл
			ЗаполнитьЗначенияСвойств(НаградаРаботника, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 2].Выбрать();
	Пока Выборка.Следующий() Цикл
		КвалификацииРаботника = Объект.Квалификация.НайтиСтроки(Новый Структура("ФизическоеЛицо,ДатаПрисвоения,Специальность", Выборка.ФизическоеЛицо, Выборка.ДатаПрисвоения, Выборка.Специальность));
		Для Каждого КвалификацияРаботника Из КвалификацииРаботника Цикл
			ЗаполнитьЗначенияСвойств(КвалификацияРаботника, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 1].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛичноеДелоРаботника = Объект.ЛичноеДело.НайтиСтроки(Новый Структура("ФизическоеЛицо,ТабельныйНомер,ДатаНачалаЗаписи", Выборка.ФизическоеЛицо, Выборка.ТабельныйНомер,  Выборка.ДатаНачалаЗаписи));
		Для Каждого СтрокаЛичногоДелаРаботника Из ЛичноеДелоРаботника Цикл
			ЗаполнитьЗначенияСвойств(СтрокаЛичногоДелаРаботника, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Выборка = РезультатыЗапросов[ВсегоРезультатов - 9].Выбрать();
	Пока Выборка.Следующий() Цикл
		ФильтрПоФизическомуЛицу = Новый Структура("ФизическоеЛицо", Выборка.ФизическоеЛицо);
		Работники = Объект.Работники.НайтиСтроки(ФильтрПоФизическомуЛицу);
		Для Каждого Работник Из Работники Цикл
			ЗаполнитьЗначенияСвойств(Работник, Выборка, "Идентификатор,МоментВыгрузки,МоментИзменения");
			
			ОбщееОбразованиеВыгружено = Истина;
			НайденныеОбразования = Объект.ОбщееОбразование.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
				Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда 
					ОбщееОбразованиеВыгружено = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ПрофессиональноеОбразованиеВыгружено = Истина;
			НайденныеОбразования = Объект.ПрофессиональноеОбразование.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
				Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда 
					ПрофессиональноеОбразованиеВыгружено = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ПослевузовскоеОбразованиеВыгружено = Истина;
			НайденныеОбразования = Объект.ПослевузовскоеОбразование.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
				Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда 
					ПослевузовскоеОбразованиеВыгружено = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ДополнительноеПрофессиональноеОбразованиеВыгружено = Истина;
			НайденныеОбразования = Объект.ДополнительноеПрофессиональноеОбразование.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого ТекущееОбразование Из НайденныеОбразования Цикл
				Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда 
					ДополнительноеПрофессиональноеОбразованиеВыгружено = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			СертификатыРаботникаВыгружены = Истина;
			СертификатыРаботника = Объект.Сертификаты.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого СертификатРаботника Из СертификатыРаботника Цикл
				Если ВыгрузкаНеобходима(СертификатРаботника.МоментВыгрузки, СертификатРаботника.МоментИзменения) Тогда 
					СертификатыРаботникаВыгружены = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			НаградыРаботникаВыгружены = Истина;
			НаградыРаботника = Объект.Награды.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого НаградаРаботника Из НаградыРаботника Цикл
				Если ВыгрузкаНеобходима(НаградаРаботника.МоментВыгрузки, НаградаРаботника.МоментИзменения) Тогда 
					НаградыРаботникаВыгружены = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			КвалификацииРаботникаВыгружены = Истина;
			КвалификацииРаботника = Объект.Квалификация.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого КвалификацияРаботника Из КвалификацииРаботника Цикл
				Если ВыгрузкаНеобходима(КвалификацияРаботника.МоментВыгрузки, КвалификацияРаботника.МоментИзменения) Тогда 
					КвалификацииРаботникаВыгружены = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			ЛичноеДелоРаботникаВыгружено = Истина;
			ЛичноеДелоРаботника = Объект.ЛичноеДело.НайтиСтроки(ФильтрПоФизическомуЛицу);
			Для Каждого СтрокаЛичногоДелаРаботника Из ЛичноеДелоРаботника Цикл
				Если ВыгрузкаНеобходима(СтрокаЛичногоДелаРаботника.МоментВыгрузки, СтрокаЛичногоДелаРаботника.МоментИзменения) Тогда 
					ЛичноеДелоРаботникаВыгружено = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		
			Если ВыгрузкаНеобходима(Работник.МоментВыгрузки, Работник.МоментИзменения) 
					Или Не ЛичноеДелоРаботникаВыгружено 
					Или Не ОбщееОбразованиеВыгружено 
					Или Не ПрофессиональноеОбразованиеВыгружено 
					Или Не ПослевузовскоеОбразованиеВыгружено 
					Или Не ДополнительноеПрофессиональноеОбразованиеВыгружено 
					Или Не СертификатыРаботникаВыгружены 
					Или Не НаградыРаботникаВыгружены 
					Или Не КвалификацииРаботникаВыгружены Тогда 
				Работник.СтадияВыгрузки = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДанныеМедицинскогоРаботника(ФизическоеЛицо)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыМедРаботника = Новый Структура;
	ДанныеДляЗаполнения = Новый Структура;
	СтруктураОтбораФизЛицо = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);	

	ДанныеДляЗаполнения.Вставить("Работники", ДокументОбъект.Работники.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ДокументыУдостоверяющиеЛичность", ДокументОбъект.ДокументыУдостоверяющиеЛичность.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ЛичноеДело", ДокументОбъект.ЛичноеДело.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ОбщееОбразование", ДокументОбъект.ОбщееОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ПрофессиональноеОбразование", ДокументОбъект.ПрофессиональноеОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ПослевузовскоеОбразование", ДокументОбъект.ПослевузовскоеОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ДополнительноеПрофессиональноеОбразование", ДокументОбъект.ДополнительноеПрофессиональноеОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("Сертификаты", ДокументОбъект.Сертификаты.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("Награды", ДокументОбъект.Награды.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("Квалификация", ДокументОбъект.Квалификация.Выгрузить(СтруктураОтбораФизЛицо));
	
	ПараметрыМедРаботника.Вставить("ДанныеДляЗаполнения", ДанныеДляЗаполнения); 

	Возврат ПоместитьВоВременноеХранилище(ПараметрыМедРаботника);

КонецФункции

#КонецОбласти

#Область Выгрузка

&НаКлиенте
Процедура ВыгрузитьВФРМРНаКлиенте() 
	
	Если Модифицированность Тогда
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ПараметрыОтбора = Новый Структура("ФизическоеЛицо", Неопределено);
	ПараметрыСервиса = ПараметрыСервиса();
	
	// Здесь удаление из ФРМР и (при успехе) из регистров лога.
	// Если удаляется весь медработник, то, наверное, предварительно удалять все его данные не нужно.
	// ---------
	
	// Здесь перечитывание регистров лога, чтобы не было недействительных идентификаторов после 
	// удаления строк из регистров лога (актуально для образований медработников).
	// Хорошо бы как-то более точечно, чем вызовом процедуры ЗаполнитьТекущиеПозицииРаботников().
//	ЗаполнитьТекущиеПозицииРаботников();

	Для Каждого Работник Из Объект.Работники Цикл
		
		СНИЛС = МедицинскиеРегистрыКлиент.ТолькоЦифры(Работник.СтраховойНомерПФР);
		
		ПараметрыОтбора.ФизическоеЛицо = Работник.ФизическоеЛицо;
		НайденныеСтрокиДокументыУдостоверяющиеЛичность = Объект.ДокументыУдостоверяющиеЛичность.НайтиСтроки(ПараметрыОтбора);
		
		НайденныеСтроки = Новый Структура("ЛичноеДело,ОбщееОбразование,ПрофессиональноеОбразование,ПослевузовскоеОбразование,ДополнительноеПрофессиональноеОбразование,Сертификаты,Награды,Квалификация");
		НайденныеСтроки.ЛичноеДело = Объект.ЛичноеДело.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки.ОбщееОбразование = Объект.ОбщееОбразование.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки.ПрофессиональноеОбразование = Объект.ПрофессиональноеОбразование.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки.ПослевузовскоеОбразование = Объект.ПослевузовскоеОбразование.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки.ДополнительноеПрофессиональноеОбразование = Объект.ДополнительноеПрофессиональноеОбразование.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки.Сертификаты = Объект.Сертификаты.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки.Награды = Объект.Награды.НайтиСтроки(ПараметрыОтбора);
		НайденныеСтроки.Квалификация = Объект.Квалификация.НайтиСтроки(ПараметрыОтбора);
		
#Область ПодборИдентификаторовФРМР
		
		РаботникИдентифицирован = Не ПустаяСтрока(Работник.Идентификатор);
		ВсеОбъектыИдентифицированы = Истина;
		Для Каждого ЭлементСтруктуры Из НайденныеСтроки Цикл
			Для Каждого БлокДанных Из ЭлементСтруктуры.Значение Цикл
				Если Не ЗначениеЗаполнено(БлокДанных.Идентификатор) Тогда 
					ВсеОбъектыИдентифицированы = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ВсеОбъектыИдентифицированы Тогда 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		PersonKey = PersonKey();
	    PersonKey.mo = Объект.УИНОрганизации;
	    PersonKey.mr = Работник.ЯвляетсяМедработником;
		
		Если ВсеОбъектыИдентифицированы И РаботникИдентифицирован Тогда 
			// Ничего дополнительно получать не нужно, все идентификаторы заполнены.
			PersonKey.oid = Работник.Идентификатор;
		Иначе
			Если ВсеОбъектыИдентифицированы И Не РаботникИдентифицирован Тогда 
				// Получаем только данные непосредственно работника для определения oid.
				PersonKey.snils = СНИЛС;
				ПараметрыВызова = GetPerson(PersonKey);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ОтветСервиса.Контент<>Неопределено Тогда
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("oid", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено И Работник.Идентификатор<>ПрисвоенныйИдентификатор Тогда
							Работник.Идентификатор = ПрисвоенныйИдентификатор;
							ЗаписатьРезультатВыгрузки(Работник.ФизическоеЛицо, ПрисвоенныйИдентификатор, Неопределено, Неопределено);
							PersonKey.oid = ПрисвоенныйИдентификатор;
							PersonKey.snils = Неопределено;
							РаботникИдентифицирован = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ОтветСервиса.КодСостояния>200 И ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Получение базовых данных медработника: %1'"), 
						ОтветСервиса.СообщениеОбОшибкеПользователю);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
				КонецЕсли;
			Иначе
				// Получаем полные данные работника (не важно по oid или по СНИЛСу) для заполнения
				// идентификаторов в ТЧ или идентификатора работника и идентификаторов в ТЧ.
				Если РаботникИдентифицирован Тогда  
					PersonKey.oid = Работник.Идентификатор;
			    Иначе 
					PersonKey.snils = СНИЛС;
				КонецЕсли;
				ПараметрыВызова = GetPersonFull(PersonKey);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ОтветСервиса.Контент<>Неопределено Тогда
						Если Не РаботникИдентифицирован Тогда
							ПрисвоенныйИдентификатор = Неопределено;
							ОтветСервиса.Контент.Свойство("oid", ПрисвоенныйИдентификатор);
							Если ПрисвоенныйИдентификатор<>Неопределено И Работник.Идентификатор<>ПрисвоенныйИдентификатор Тогда
								Работник.Идентификатор = ПрисвоенныйИдентификатор;
								ЗаписатьРезультатВыгрузки(Работник.ФизическоеЛицо, ПрисвоенныйИдентификатор, Неопределено, Неопределено);
								PersonKey.oid = ПрисвоенныйИдентификатор;
								PersonKey.snils = Неопределено;
								РаботникИдентифицирован = Истина;
							КонецЕсли;
						КонецЕсли;
						// Тут заполнение идентификаторов в ТЧ.
						Если НайденныеСтроки.ЛичноеДело.Количество()>0 Тогда 
							РазделЛичноеДело = Неопределено;
							Если ОтветСервиса.Контент.Свойство("personCard", РазделЛичноеДело) Тогда
								Если РазделЛичноеДело<>Неопределено Тогда 
									// Сертификатов может быть несколько. Нужно подбирать по специальности и дате получения.
									Для Каждого ЛичноеДелоФРМР Из РазделЛичноеДело Цикл 
									    ОрганизацияЛичногоДелаФРМР = Неопределено;
									    ИдентификаторЛичногоДелаФРМР = Неопределено;
									    ТабельныйНомерЛичногоДелаФРМР = Неопределено;
									    ДатаНачалаЗаписиЛичногоДелаФРМР = Неопределено;
										Если ЛичноеДелоФРМР.Свойство("oid", ОрганизацияЛичногоДелаФРМР) 
												И ЛичноеДелоФРМР.Свойство("id", ИдентификаторЛичногоДелаФРМР) 
												И ЛичноеДелоФРМР.Свойство("serviceNumber", ТабельныйНомерЛичногоДелаФРМР) 
												И ЛичноеДелоФРМР.Свойство("beginDate", ДатаНачалаЗаписиЛичногоДелаФРМР) Тогда
											Для Каждого ЛичноеДелоИБ Из НайденныеСтроки.ЛичноеДело Цикл
												Если Объект.УИНОрганизации=ОрганизацияЛичногоДелаФРМР 
														И ЛичноеДелоИБ.ТабельныйНомер=ТабельныйНомерЛичногоДелаФРМР 
														И ЛичноеДелоИБ.ДатаНачалаЗаписи=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаНачалаЗаписиЛичногоДелаФРМР) Тогда 
													ЛичноеДелоИБ.Идентификатор = ИдентификаторЛичногоДелаФРМР;
													ЗаписатьРезультатВыгрузкиЛичногоДела(Работник.ФизическоеЛицо, Объект.УИНОрганизации, ЛичноеДелоИБ.ТабельныйНомер, 
															ЛичноеДелоИБ.ДатаНачалаЗаписи, ЛичноеДелоИБ.Идентификатор, ЛичноеДелоИБ.МоментВыгрузки);
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НайденныеСтроки.ОбщееОбразование.Количество()>0 Тогда 
							РазделОбразование = Неопределено;
							Если ОтветСервиса.Контент.Свойство("educationCommon", РазделОбразование) Тогда
								Если РазделОбразование<>Неопределено Тогда 
									// Общее образование может быть только одно. Поэтому получили не массив, а простой объект json.
								    ПрисвоенныйИдентификаторРазделОбщееОбразование = Неопределено;
									Если РазделОбразование.Свойство("commonId", ПрисвоенныйИдентификаторРазделОбщееОбразование) Тогда 
										СтрокаОбщееОбразование = НайденныеСтроки.ОбщееОбразование[0];
										СтрокаОбщееОбразование.Идентификатор = ПрисвоенныйИдентификаторРазделОбщееОбразование;
										ЗаписатьРезультатВыгрузки(СтрокаОбщееОбразование.ОбразованиеРаботника, СтрокаОбщееОбразование.Идентификатор, 
												Неопределено, Неопределено);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НайденныеСтроки.ПрофессиональноеОбразование.Количество()>0 Тогда 
							РазделОбразование = Неопределено;
							Если ОтветСервиса.Контент.Свойство("educationProf", РазделОбразование) Тогда
								Если РазделОбразование<>Неопределено Тогда 
									// Профессиональных образований может быть несколько. Подбирать по дате диплома.
									Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл 
									    ИдентификаторФРМР = Неопределено;
									    Обучающийся = Неопределено;
									    ДатаДипломаФРМР = Неопределено;
									    ДатаСвидетельстваФРМР = Неопределено;
										Если ОбразованиеФРМР.Свойство("profId", ИдентификаторФРМР) 
												И ОбразованиеФРМР.Свойство("isStudentEducation", Обучающийся)
												И (ОбразованиеФРМР.Свойство("docDate", ДатаДипломаФРМР)
												Или ОбразованиеФРМР.Свойство("foreignCertDate", ДатаСвидетельстваФРМР)) Тогда
											Если Не Обучающийся Тогда
												Для Каждого ОбразованиеИБ Из НайденныеСтроки.ПрофессиональноеОбразование Цикл
													Если ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаДипломаФРМР)
															Или ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаСвидетельстваФРМР) Тогда 
														ОбразованиеИБ.Идентификатор = ИдентификаторФРМР;
														ЗаписатьРезультатВыгрузки(ОбразованиеИБ.ОбразованиеРаботника, ОбразованиеИБ.Идентификатор, 
																Неопределено, Неопределено);
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НайденныеСтроки.ПослевузовскоеОбразование.Количество()>0 Тогда 
							РазделОбразование = Неопределено;
							Если ОтветСервиса.Контент.Свойство("educationPostgraduate", РазделОбразование) Тогда
								Если РазделОбразование<>Неопределено Тогда 
									// Послевузовских образований может быть несколько. Подбирать по дате диплома.
									Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл 
									    ИдентификаторФРМР = Неопределено;
									    Обучающийся = Неопределено;
									    ДатаДипломаФРМР = Неопределено;
									    ДатаСвидетельстваФРМР = Неопределено;
										Если ОбразованиеФРМР.Свойство("postgraduateId", ИдентификаторФРМР) 
												И ОбразованиеФРМР.Свойство("isStudying", Обучающийся)
												И (ОбразованиеФРМР.Свойство("docDate", ДатаДипломаФРМР)
												Или ОбразованиеФРМР.Свойство("foreignCertDate", ДатаСвидетельстваФРМР)) Тогда
											Если Не Обучающийся Тогда
												Для Каждого ОбразованиеИБ Из НайденныеСтроки.ПослевузовскоеОбразование Цикл
													Если ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаДипломаФРМР)
															Или ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаСвидетельстваФРМР) Тогда 
														ОбразованиеИБ.Идентификатор = ИдентификаторФРМР;
														ЗаписатьРезультатВыгрузки(ОбразованиеИБ.ОбразованиеРаботника, ОбразованиеИБ.Идентификатор, 
																Неопределено, Неопределено);
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НайденныеСтроки.ДополнительноеПрофессиональноеОбразование.Количество()>0 Тогда 
							РазделОбразование = Неопределено;
							Если ОтветСервиса.Контент.Свойство("educationExt", РазделОбразование) Тогда
								Если РазделОбразование<>Неопределено Тогда 
									// Послевузовских образований может быть несколько. Подбирать по дате диплома.
									Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл 
									    ИдентификаторФРМР = Неопределено;
									    ДатаДипломаФРМР = Неопределено;
										Если ОбразованиеФРМР.Свойство("extId", ИдентификаторФРМР) 
												И (ОбразованиеФРМР.Свойство("docDate", ДатаДипломаФРМР)) Тогда
											Для Каждого ОбразованиеИБ Из НайденныеСтроки.ДополнительноеПрофессиональноеОбразование Цикл
												Если ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаДипломаФРМР) Тогда 
													ОбразованиеИБ.Идентификатор = ИдентификаторФРМР;
													ЗаписатьРезультатВыгрузки(ОбразованиеИБ.ОбразованиеРаботника, ОбразованиеИБ.Идентификатор, 
															Неопределено, Неопределено);
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НайденныеСтроки.Сертификаты.Количество()>0 Тогда 
							РазделСертификаты = Неопределено;
							Если ОтветСервиса.Контент.Свойство("educationCert", РазделСертификаты) Тогда
								Если РазделСертификаты<>Неопределено Тогда 
									// Сертификатов может быть несколько. Нужно подбирать по специальности и дате получения.
									Для Каждого СертификатФРМР Из РазделСертификаты Цикл 
									    ИдентификаторСертификатаФРМР = Неопределено;
									    ДатаПолученияСертификатаФРМР = Неопределено;
									    СпециальностьКодСертификатаФРМР = Неопределено;
										Если СертификатФРМР.Свойство("certId", ИдентификаторСертификатаФРМР) 
												И СертификатФРМР.Свойство("examDate", ДатаПолученияСертификатаФРМР) 
												И СертификатФРМР.Свойство("specId", СпециальностьКодСертификатаФРМР) Тогда
											Для Каждого СертификатИБ Из НайденныеСтроки.Сертификаты Цикл
												Если СертификатИБ.СпециальностьКод=Формат(СпециальностьКодСертификатаФРМР, "ЧГ=0") 
														И СертификатИБ.ДатаПолучения=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаПолученияСертификатаФРМР) Тогда 
													СертификатИБ.Идентификатор = ИдентификаторСертификатаФРМР;
													ЗаписатьРезультатВыгрузкиСертификата(Работник.ФизическоеЛицо, СертификатИБ.Специальность, 
															СертификатИБ.ДатаПолучения, СертификатИБ.Идентификатор, СертификатИБ.МоментВыгрузки);
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НайденныеСтроки.Награды.Количество()>0 Тогда 
							РазделНаграды = Неопределено;
							Если ОтветСервиса.Контент.Свойство("personNomination", РазделНаграды) Тогда
								Если РазделНаграды<>Неопределено Тогда 
									// Наград может быть несколько. Нужно подбирать по награде, номеру и дате.
									Для Каждого НаградаФРМР Из РазделНаграды Цикл 
									    ИдентификаторНаградыФРМР = Неопределено;
									    КодНаградыФРМР = Неопределено;
									    ДатаНаградыФРМР = Неопределено;
									    НомерНаградыФРМР = Неопределено;
										Если НаградаФРМР.Свойство("entityId", ИдентификаторНаградыФРМР) 
												И НаградаФРМР.Свойство("nomNumber", НомерНаградыФРМР) 
												И НаградаФРМР.Свойство("nomDate", ДатаНаградыФРМР) 
												И НаградаФРМР.Свойство("nominationId", КодНаградыФРМР) Тогда
											Для Каждого НаградаИБ Из НайденныеСтроки.Награды Цикл
												Если НаградаИБ.НаградаКод=Формат(КодНаградыФРМР, "ЧГ=0") 
														И НаградаИБ.НомерПриказа=НомерНаградыФРМР 
														И НаградаИБ.ДатаПриказа=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаНаградыФРМР) Тогда 
													НаградаИБ.Идентификатор = ИдентификаторНаградыФРМР;
													ЗаписатьРезультатВыгрузкиНаграды(Работник.ФизическоеЛицо, НаградаИБ.Награда, НаградаИБ.ДатаПриказа, 
															НаградаИБ.НомерПриказа, НаградаИБ.Идентификатор, НаградаИБ.МоментВыгрузки);
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						Если НайденныеСтроки.Квалификация.Количество()>0 Тогда 
							РазделКвалификация = Неопределено;
							Если ОтветСервиса.Контент.Свойство("personQualification", РазделКвалификация) Тогда
								Если РазделКвалификация<>Неопределено Тогда 
									// Квалификаций может быть несколько. Нужно подбирать по дате присвоения квалификационной категории, по специальности или по должности.
									// В отличие от ФРМР, в ИБ квалификация устанавливается только для специальности (не для должности), поэтому в каждой записи ИБ специальность
									// заполнена, однако при подготовке данных для выгрузки должность также подбирается в запросе и выгружается в ФРМР для немедицинских должностей.
									// Поэтому, строку в ИБ необходимо подобрать и по должности (если специальность не заполнена), 
									// однако результат будет всё равно залогирован по специальности.
									Для Каждого КвалификацияФРМР Из РазделКвалификация Цикл 
									    ИдентификаторКвалификацииФРМР = Неопределено;
										ДатаПрисвоенияФРМР = Неопределено;
										КодСпециальностиФРМР = Неопределено;
										КодДолжностиПоФедСправочникуФРМР = Неопределено;
										КодДолжностиФРМР = Неопределено;
										Если КвалификацияФРМР.Свойство("qualificationId", ИдентификаторКвалификацииФРМР) 
												И КвалификацияФРМР.Свойство("beginDate", ДатаПрисвоенияФРМР) Тогда
											УказанКодСпециальностиФРМР = КвалификацияФРМР.Свойство("specId", КодСпециальностиФРМР) И КодСпециальностиФРМР<>Неопределено;
											УказанКодДолжностиПоФедСправочникуФРМР = КвалификацияФРМР.Свойство("fedPostId", КодДолжностиПоФедСправочникуФРМР) 
											                                         И КодДолжностиПоФедСправочникуФРМР<>Неопределено;
											УказанКодДолжностиФРМР = КвалификацияФРМР.Свойство("postId", КодДолжностиФРМР) И КодДолжностиФРМР<>Неопределено;
											Для Каждого КвалификацияИБ Из НайденныеСтроки.Квалификация Цикл
												Если ДанныеКвалификацийСовпадают(КвалификацияИБ, ДатаПрисвоенияФРМР, КодДолжностиПоФедСправочникуФРМР, КодДолжностиФРМР, КодСпециальностиФРМР, 
													                             УказанКодДолжностиПоФедСправочникуФРМР, УказанКодДолжностиФРМР, УказанКодСпециальностиФРМР) Тогда
													КвалификацияИБ.Идентификатор = ИдентификаторКвалификацииФРМР;
													ЗаписатьРезультатВыгрузкиКвалификации(Работник.ФизическоеЛицо, КвалификацияИБ.ДатаПрисвоения, КвалификацияИБ.Специальность, 
															КвалификацияИБ.РазрядКатегория, КвалификацияИБ.Идентификатор, КвалификацияИБ.МоментВыгрузки);
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Получение подробных данных медработника: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
#КонецОбласти
#Область ПроведениеВыгрузкиВФРМР

		ВыгрузкаПроизводилась = Ложь;
		ВыгрузкаВыполнена = Истина;
		
		// Основные данные работника.
		Если ВыгрузкаНеобходима(Работник.МоментВыгрузки, Работник.МоментИзменения) Тогда
			ВыгрузкаПроизводилась = Истина;
			PersonData = ПодготовитьОбщиеДанныеРаботника(Работник, НайденныеСтрокиДокументыУдостоверяющиеЛичность);
			ПараметрыВызова = PostPutPerson(PersonKey, PersonData);
			ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
			ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
			Если ОтветСервиса.КодСостояния<400 Тогда 
				Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
					ПрисвоенныйИдентификатор = Неопределено;
					ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
					Если ПрисвоенныйИдентификатор<>Неопределено Тогда
						PersonKey.oid = ПрисвоенныйИдентификатор;
						PersonKey.snils = Неопределено;
						Работник.Идентификатор = ПрисвоенныйИдентификатор;
						Работник.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузки(Работник.ФизическоеЛицо, Работник.Идентификатор, Работник.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
					Работник.МоментВыгрузки = МоментВыгрузкиНаСервере();
					ЗаписатьРезультатВыгрузки(Работник.ФизическоеЛицо, Работник.Идентификатор, Работник.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
			Иначе 
				ВыгрузкаВыполнена = Ложь;
			КонецЕсли;
			Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
				СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка базовых данных медработника: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
			КонецЕсли;
		КонецЕсли;
		
		// Личное дело.
		Для Каждого ЛичноеДелоРаботника Из НайденныеСтроки.ЛичноеДело Цикл
			Если ВыгрузкаНеобходима(ЛичноеДелоРаботника.МоментВыгрузки, ЛичноеДелоРаботника.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonCardData = ПодготовитьДанныеЛичногоДела(ЛичноеДелоРаботника);
				ПараметрыВызова = PostPutPersonCard(PersonKey, PersonCardData);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено Тогда
							ЛичноеДелоРаботника.Идентификатор = ПрисвоенныйИдентификатор;
							ЛичноеДелоРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
							ЗаписатьРезультатВыгрузкиЛичногоДела(Работник.ФизическоеЛицо, Объект.УИНОрганизации, ЛичноеДелоРаботника.ТабельныйНомер, 
									ЛичноеДелоРаботника.ДатаНачалаЗаписи, ЛичноеДелоРаботника.Идентификатор, ЛичноеДелоРаботника.МоментВыгрузки)
						Иначе 
							ВыгрузкаВыполнена = Ложь;
						КонецЕсли;
					ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
						ЛичноеДелоРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузкиЛичногоДела(Работник.ФизическоеЛицо, Объект.УИНОрганизации, ЛичноеДелоРаботника.ТабельныйНомер, 
								ЛичноеДелоРаботника.ДатаНачалаЗаписи, ЛичноеДелоРаботника.Идентификатор, ЛичноеДелоРаботника.МоментВыгрузки)
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка личного дела медработника: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Общее образование.
		Для Каждого ТекущееОбразование Из НайденныеСтроки.ОбщееОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonCommonData = ПодготовитьДанныеОбщегоОбразования(ТекущееОбразование);
				ПараметрыВызова = PostPutPersonCommon(PersonKey, PersonCommonData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка основного (общего) образования медработника: %1'");
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, 
						ПараметрыСервиса, ТокенДоступа, Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке);
			КонецЕсли;
		КонецЦикла;
		
		// Профессиональное образование.
		Для Каждого ТекущееОбразование Из НайденныеСтроки.ПрофессиональноеОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonProfData = ПодготовитьДанныеПрофессиональногоОбразования(Работник, ТекущееОбразование);
				ПараметрыВызова = PostPutPersonProf(PersonKey, PersonProfData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка профессионального образования медработника: %1'");
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, 
						ПараметрыСервиса, ТокенДоступа, Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке);
			КонецЕсли;
		КонецЦикла;
		
		// Послевузовское образование.
		Для Каждого ТекущееОбразование Из НайденныеСтроки.ПослевузовскоеОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonPostgraduateData = ПодготовитьДанныеПослевузовскогоОбразования(ТекущееОбразование);
				ПараметрыВызова = PostPutPersonPostgraduate(PersonKey, PersonPostgraduateData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка послевузовского образования медработника: %1'");
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, 
						ПараметрыСервиса, ТокенДоступа, Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке);
			КонецЕсли;
		КонецЦикла;
		
		// Дополнительное профессиональное образование.
		Для Каждого ТекущееОбразование Из НайденныеСтроки.ДополнительноеПрофессиональноеОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonExtData = ПодготовитьДанныеДополнительногоПрофессиональногоОбразования(ТекущееОбразование);
				ПараметрыВызова = PostPutPersonExt(PersonKey, PersonExtData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка дополнительного профессионального образования медработника: %1'");
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, 
						ПараметрыСервиса, ТокенДоступа, Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке);
			КонецЕсли;
		КонецЦикла;
		
		// Сертификаты.
		Для Каждого СертификатРаботника Из НайденныеСтроки.Сертификаты Цикл
			Если ВыгрузкаНеобходима(СертификатРаботника.МоментВыгрузки, СертификатРаботника.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonCertData = ПодготовитьДанныеСертификата(СертификатРаботника);
				ПараметрыВызова = PostPutPersonCert(PersonKey, PersonCertData);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено Тогда
							СертификатРаботника.Идентификатор = ПрисвоенныйИдентификатор;
							СертификатРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
							ЗаписатьРезультатВыгрузкиСертификата(Работник.ФизическоеЛицо, СертификатРаботника.Специальность, 
									СертификатРаботника.ДатаПолучения, СертификатРаботника.Идентификатор, СертификатРаботника.МоментВыгрузки)
						Иначе 
							ВыгрузкаВыполнена = Ложь;
						КонецЕсли;
					ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
						СертификатРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузкиСертификата(Работник.ФизическоеЛицо, СертификатРаботника.Специальность, 
								СертификатРаботника.ДатаПолучения, СертификатРаботника.Идентификатор, СертификатРаботника.МоментВыгрузки)
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка сертификата медработника: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Награды.
		Для Каждого НаградаРаботника Из НайденныеСтроки.Награды Цикл
			Если ВыгрузкаНеобходима(НаградаРаботника.МоментВыгрузки, НаградаРаботника.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonNominationData = ПодготовитьДанныеНаграды(НаградаРаботника);
				ПараметрыВызова = PostPutPersonNomination(PersonKey, PersonNominationData);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено Тогда
							НаградаРаботника.Идентификатор = ПрисвоенныйИдентификатор;
							НаградаРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
							ЗаписатьРезультатВыгрузкиНаграды(Работник.ФизическоеЛицо, НаградаРаботника.Награда, НаградаРаботника.ДатаПриказа, 
									НаградаРаботника.НомерПриказа, НаградаРаботника.Идентификатор, НаградаРаботника.МоментВыгрузки)
						Иначе 
							ВыгрузкаВыполнена = Ложь;
						КонецЕсли;
					ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
						НаградаРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузкиНаграды(Работник.ФизическоеЛицо, НаградаРаботника.Награда, НаградаРаботника.ДатаПриказа, 
								НаградаРаботника.НомерПриказа, НаградаРаботника.Идентификатор, НаградаРаботника.МоментВыгрузки)
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка награды медработника: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Квалификация.
		Для Каждого КвалификацияРаботника Из НайденныеСтроки.Квалификация Цикл
			Если ВыгрузкаНеобходима(КвалификацияРаботника.МоментВыгрузки, КвалификацияРаботника.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonQualificationData = ПодготовитьДанныеКвалификации(КвалификацияРаботника);
				ПараметрыВызова = PostPutPersonQualification(PersonKey, PersonQualificationData);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено Тогда
							КвалификацияРаботника.Идентификатор = ПрисвоенныйИдентификатор;
							КвалификацияРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
							ЗаписатьРезультатВыгрузкиКвалификации(Работник.ФизическоеЛицо, КвалификацияРаботника.ДатаПрисвоения, КвалификацияРаботника.Специальность, 
									КвалификацияРаботника.РазрядКатегория, КвалификацияРаботника.Идентификатор, КвалификацияРаботника.МоментВыгрузки)
						Иначе 
							ВыгрузкаВыполнена = Ложь;
						КонецЕсли;
					ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
						КвалификацияРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузкиКвалификации(Работник.ФизическоеЛицо, КвалификацияРаботника.ДатаПрисвоения, КвалификацияРаботника.Специальность, 
								КвалификацияРаботника.РазрядКатегория, КвалификацияРаботника.Идентификатор, КвалификацияРаботника.МоментВыгрузки)
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка квалификации медработника: %1'"), ОтветСервиса.СообщениеОбОшибкеПользователю);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ВыгрузкаПроизводилась Тогда
			Работник.СтадияВыгрузки = ?(ВыгрузкаВыполнена, 2, 3);
		КонецЕсли;
		
#КонецОбласти
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеКвалификацийСовпадают(Знач КвалификацияИБ, Знач ДатаПрисвоенияФРМР, Знач КодДолжностиПоФедСправочникуФРМР, Знач КодДолжностиФРМР, 
	Знач КодСпециальностиФРМР, Знач УказанКодДолжностиПоФедСправочникуФРМР, Знач УказанКодДолжностиФРМР, Знач УказанКодСпециальностиФРМР)
	
	Возврат КвалификацияИБ.ДатаПрисвоения=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаПрисвоенияФРМР)
	И (Не УказанКодСпециальностиФРМР Или КвалификацияИБ.СпециальностьКод=Формат(КодСпециальностиФРМР, "ЧГ=0")) 
	И ((Не УказанКодДолжностиПоФедСправочникуФРМР Или КвалификацияИБ.ДолжностьПоФедСправочникуКод=Формат(КодДолжностиПоФедСправочникуФРМР, "ЧГ=0")) 
		Или (Не УказанКодДолжностиФРМР Или КвалификацияИБ.ДолжностьКод=Формат(КодДолжностиФРМР, "ЧГ=0")));

КонецФункции

&НаКлиенте
Функция ПодготовитьОбщиеДанныеРаботника(Работник, ДанныеДокументовУдостоверяющихЛичность)
	
	PersonData = PersonData();
	PersonData.mr = Работник.ЯвляетсяМедработником;
	PersonData.student = Ложь;
	PersonData.lastName = Работник.Фамилия;
	PersonData.firstName = Работник.Имя;
	PersonData.patronymic = Работник.Отчество;
	PersonData.gender = Работник.Пол;
	PersonData.birthDate = Работник.ДатаРождения;
	PersonData.snils = МедицинскиеРегистрыКлиент.ТолькоЦифры(Работник.СтраховойНомерПФР);
	PersonData.inn = Работник.ИНН;
	PersonData.citizenShipId.code = Работник.ГражданствоКод;
	PersonData.citizenShipId.name = Работник.ГражданствоНаименование;
	PersonData.oksmId.code = Работник.СтранаКод;
	PersonData.oksmId.name = Работник.СтранаНаименование;
	PersonData.militaryRelationId = ?(ПустаяСтрока(Работник.ОтношениеКВоинскойОбязанностиКод), Неопределено, Работник.ОтношениеКВоинскойОбязанностиКод);
	PersonData.phone = ?(ПустаяСтрока(Работник.НомерТелефона), Неопределено, НомерТелефонаЦифрами(Работник.НомерТелефона));
	PersonData.email = ?(ПустаяСтрока(Работник.АдресЭлектроннойПочтыПредставление), Неопределено, Работник.АдресЭлектроннойПочтыПредставление);
	PersonData.isDisabled = Неопределено;
	PersonData.disabledGroupId = Неопределено;
	PersonData.disabledGroupName = Неопределено;
	PersonData.disabledDate = Неопределено;
	PersonData.covid19 = Неопределено;
	PersonData.documents = Новый Массив;
	PersonData.addresses = Новый Массив;
	
	Для Каждого ДокументМедработника Из ДанныеДокументовУдостоверяющихЛичность Цикл 
		PersonDocumentData = PersonDocumentData();
		PersonDocumentData.serial = МедицинскиеРегистрыКлиент.ТолькоЦифры(ДокументМедработника.Серия);
		PersonDocumentData.number = ДокументМедработника.Номер;
		PersonDocumentData.passDate = ДокументМедработника.ДатаВыдачи;
		PersonDocumentData.passOrg = ДокументМедработника.КемВыдан;
		PersonDocumentData.codeOrg = ?(ПустаяСтрока(ДокументМедработника.КодПодразделения), Неопределено, ДокументМедработника.КодПодразделения);
		PersonDocumentData.documentId = ДокументМедработника.ВидДокументаКод;
		PersonData.documents.Добавить(PersonDocumentData);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Работник.АдресПостояннойРегистрации) Тогда
		ДанныеАдреса = АдреснаяИнформация(1, Работник.ДатаРегистрации, Работник.АдресПостояннойРегистрации);
		PersonData.addresses.Добавить(ДанныеАдреса);
	КонецЕсли;
	Если ЗначениеЗаполнено(Работник.АдресМестаПроживания) Тогда 
		ДанныеАдреса = АдреснаяИнформация(2, Работник.ДатаРегистрации, Работник.АдресМестаПроживания);
		PersonData.addresses.Добавить(ДанныеАдреса);
	КонецЕсли;
	Возврат PersonData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеЛичногоДела(ЛичноеДелоРаботника)
	
	PersonCardData = PersonCardData();
	Если ЗначениеЗаполнено(ЛичноеДелоРаботника.Идентификатор) Тогда 
		PersonCardData.id = ЛичноеДелоРаботника.Идентификатор;
	Иначе
		PersonCardData.id = Неопределено;
	КонецЕсли;
	PersonCardData.lastName = ЛичноеДелоРаботника.Фамилия;
	PersonCardData.oid = Объект.УИНОрганизации;
	PersonCardData.organization = Объект.Организация;
	PersonCardData.nrPmuDepartId = ЛичноеДелоРаботника.ИдентификаторПодразделения;
	Если ЛичноеДелоРаботника.ТипПодразделенияКод="2" Тогда 
		PersonCardData.nrPmuDepartHospitalSubdivisionId = ?(ЗначениеЗаполнено(ЛичноеДелоРаботника.ИдентификаторОтделенияИлиКабинета), ЛичноеДелоРаботника.ИдентификаторОтделенияИлиКабинета, Неопределено);
	ИначеЕсли ЛичноеДелоРаботника.ТипПодразделенияКод="1"
		Или ЛичноеДелоРаботника.ТипПодразделенияКод="3"
		Или ЛичноеДелоРаботника.ТипПодразделенияКод="4" Тогда
		PersonCardData.roomOid = ?(ЗначениеЗаполнено(ЛичноеДелоРаботника.ИдентификаторОтделенияИлиКабинета), ЛичноеДелоРаботника.ИдентификаторОтделенияИлиКабинета, Неопределено);
	КонецЕсли;
	PersonCardData.contractNumber = ЛичноеДелоРаботника.ТрудовойДоговорНомер;
	PersonCardData.contractDate = ЛичноеДелоРаботника.ТрудовойДоговорДата;
	PersonCardData.serviceNumber = ЛичноеДелоРаботника.ТабельныйНомер;
	PersonCardData.fedPositionId = ЛичноеДелоРаботника.ДолжностьПоФедСправочникуКод;
	PersonCardData.seniority = Неопределено;
	PersonCardData.services = Новый Массив;
	НоваяМедУслуга = PersonCardServices();
	НоваяМедУслуга.code = ЛичноеДелоРаботника.ОказываемыеМедУслугиКод;
	PersonCardData.services.Добавить(НоваяМедУслуга); 
	PersonCardData.positionTypeId = ЛичноеДелоРаботника.ТипЗанятияДолжностиКод;
	PersonCardData.postId = ЛичноеДелоРаботника.ДолжностьКод;
	PersonCardData.rate = ЛичноеДелоРаботника.КоличествоСтавок;
	PersonCardData.beginDate = ЛичноеДелоРаботника.ДатаНачалаЗаписи;
	PersonCardData.endDate = ?(ЗначениеЗаполнено(ЛичноеДелоРаботника.ДатаОкончанияЗаписи), ЛичноеДелоРаботника.ДатаОкончанияЗаписи, Неопределено);
	Если ЗначениеЗаполнено(ЛичноеДелоРаботника.ВидСобытияОкончания) Тогда 
		PersonCardData.endTypeId = ЛичноеДелоРаботника.ОснованиеОкончанияКод;
		Если ЛичноеДелоРаботника.ВидСобытияОкончания=ВидыКадровыхСобытийУвольнение Тогда 
			PersonCardData.fireReasonId = ЛичноеДелоРаботника.ПричинаУвольненияКод;
		КонецЕсли;
	КонецЕсли;
	PersonCardData.targeted = ЛичноеДелоРаботника.ЦелеваяПодготовка;
	PersonCardData.temporaryDerelictions = Неопределено;
	Возврат PersonCardData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеСертификата(СертификатРаботника)
	
	PersonCertData = PersonCertData();
	PersonCertData.certId = ЗначениеИдентификатора(СертификатРаботника);
	PersonCertData.institutionId = СертификатРаботника.УчебноеЗаведениеКод;
	PersonCertData.institutionName = СертификатРаботника.УчебноеЗаведениеНаименование;
	PersonCertData.certSerial = СертификатРаботника.Серия;
	PersonCertData.certNumber = СертификатРаботника.Номер;
	PersonCertData.examDate = СертификатРаботника.ДатаПолучения;
	PersonCertData.passDate = Неопределено;
	PersonCertData.endDate = СертификатРаботника.ДействуетПо;
	PersonCertData.specId = СертификатРаботника.СпециальностьКод;
	PersonCertData.specName = СертификатРаботника.СпециальностьНаименование;
	Возврат PersonCertData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеНаграды(НаградаРаботника)
	
	PersonNominationData = PersonNominationData();
	PersonNominationData.entityId = ЗначениеИдентификатора(НаградаРаботника);
	PersonNominationData.nominationId = НаградаРаботника.НаградаКод;
	PersonNominationData.nomDate = НаградаРаботника.ДатаПриказа;
	PersonNominationData.nomNumber = НаградаРаботника.НомерПриказа;
	Возврат PersonNominationData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеКвалификации(КвалификацияРаботника)
	
	PersonQualificationData = PersonQualificationData();
	PersonQualificationData.qualificationId = ЗначениеИдентификатора(КвалификацияРаботника);
	PersonQualificationData.qualifyCategoryId = КвалификацияРаботника.КвалификационнаяКатегорияКод;
	PersonQualificationData.beginDate = КвалификацияРаботника.ДатаПрисвоения;
	PersonQualificationData.endDate = КвалификацияРаботника.ДатаОкончания;
	Если КвалификацияРаботника.ЯвляетсяМедицинскойДолжностью Тогда 
		PersonQualificationData.specId = КвалификацияРаботника.СпециальностьКод;
		PersonQualificationData.fedPostId = Неопределено;
		PersonQualificationData.postId = Неопределено;
	Иначе 
		PersonQualificationData.specId = Неопределено;
		PersonQualificationData.fedPostId = КвалификацияРаботника.ДолжностьПоФедСправочникуКод;
		PersonQualificationData.postId = КвалификацияРаботника.ДолжностьКод;
	КонецЕсли;
	Возврат PersonQualificationData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеОбщегоОбразования(ТекущееОбразование)
	
	ИдентификаторОбразования = ЗначениеИдентификатора(ТекущееОбразование);
	
	PersonCommonData = PersonCommonData();
	PersonCommonData.commonId = ИдентификаторОбразования;
	PersonCommonData.institution = ТекущееОбразование.ОбразовательнаяОрганизация;
	PersonCommonData.docSerial = ТекущееОбразование.СерияАттестата;
	PersonCommonData.docNumber = ТекущееОбразование.НомерАттестата;
	PersonCommonData.docDate = ТекущееОбразование.ДатаВыдачиАттестата;
	PersonCommonData.profCourseSet = Неопределено;
	Возврат PersonCommonData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеПрофессиональногоОбразования(Работник, ТекущееОбразование)
	
	ИдентификаторОбразования = ЗначениеИдентификатора(ТекущееОбразование);
	
	PersonProfData = PersonProfData();
	PersonProfData.profId = ИдентификаторОбразования;
	PersonProfData.isStudentEducation = Ложь;
	Если Не Работник.ЯвляетсяМедработником Тогда 
		PersonProfData.hasDiploma = Истина;
	КонецЕсли;
	PersonProfData.isDuplicate = Ложь;
	PersonProfData.beginYear = Год(ТекущееОбразование.Начало);
	PersonProfData.docSerial = ?(ПустаяСтрока(ТекущееОбразование.СерияДиплома), Неопределено, ТекущееОбразование.СерияДиплома);
	PersonProfData.docNumber = ТекущееОбразование.НомерДиплома;
	PersonProfData.docDate = ТекущееОбразование.ДатаВыдачиДиплома;
	PersonProfData.educationTypeId.code = ТекущееОбразование.ВидОбразованияКод;
	PersonProfData.specId = ТекущееОбразование.СпециальностьКод;
	PersonProfData.qualificationId = ТекущееОбразование.КвалификацияКод;
	Если ТекущееОбразование.ЗаПределамиРФ Тогда
		PersonProfData.foreignInstitution = ТекущееОбразование.ОбразовательнаяОрганизация;
		Если ЗначениеЗаполнено(ТекущееОбразование.РеспубликаСССРКод) И Не ЗначениеЗаполнено(ТекущееОбразование.СтранаМираКод) Тогда 
			PersonProfData.educPlace = 1;
			PersonProfData.unionRepublicId = ТекущееОбразование.РеспубликаСССРКод;
		Иначе 
			PersonProfData.educPlace = 2;
			PersonProfData.oksmId = ТекущееОбразование.СтранаМираКод;
			PersonProfData.hasForeignCert = 2;
		КонецЕсли;
	Иначе 
		PersonProfData.educPlace = 0;
		PersonProfData.institutionId = ТекущееОбразование.УчебноеЗаведениеКод;
		PersonProfData.isTargeted = ЗначениеЗаполнено(ТекущееОбразование.ЗаказчикЦелевогоОбученияКод);
		Если PersonProfData.isTargeted Тогда
			PersonProfData.targetedRegionId = ТекущееОбразование.ЗаказчикЦелевогоОбученияКод;
			PersonProfData.dutyMonthsPeriod = РазмерПериода(ТекущееОбразование.Начало, ТекущееОбразование.Окончание);
			PersonProfData.isTargetTerminated = ЗначениеЗаполнено(ТекущееОбразование.ПричинаРасторженияКод);
			Если PersonProfData.isTargetTerminated Тогда 
				PersonProfData.terminationReasonId = ТекущееОбразование.ПричинаРасторженияКод;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат PersonProfData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеДополнительногоПрофессиональногоОбразования(ТекущееОбразование)
	
	ИдентификаторОбразования = ЗначениеИдентификатора(ТекущееОбразование);
	
	PersonExtData = PersonExtData();
	PersonExtData.extId = ИдентификаторОбразования;
	PersonExtData.profEducationKindId = ТекущееОбразование.ВидДополнительногоПрофессиональногоОбразованияКод;
	PersonExtData.institutionId = ТекущееОбразование.УчебноеЗаведениеКод;
	PersonExtData.hoursCount = ТекущееОбразование.КоличествоЧасов;
	PersonExtData.theme = ТекущееОбразование.Тематика;
	PersonExtData.docSerial = ?(ПустаяСтрока(ТекущееОбразование.СерияДиплома), Неопределено, ТекущееОбразование.СерияДиплома);
	PersonExtData.docNumber = ТекущееОбразование.НомерДиплома;
	PersonExtData.docDate = ТекущееОбразование.ДатаВыдачиДиплома;
	Возврат PersonExtData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеПослевузовскогоОбразования(ТекущееОбразование)
	
	ИдентификаторОбразования = ЗначениеИдентификатора(ТекущееОбразование);
	
	PersonPostgraduateData = PersonPostgraduateData();
	PersonPostgraduateData.postgraduateId = ИдентификаторОбразования;
	PersonPostgraduateData.isDuplicate = Ложь;
	PersonPostgraduateData.educationStageId = ТекущееОбразование.ТипОбразованияКод;
	PersonPostgraduateData.isStudying = Ложь;
	PersonPostgraduateData.beginYear = Год(ТекущееОбразование.Начало);
	PersonPostgraduateData.docSerial = ?(ПустаяСтрока(ТекущееОбразование.СерияДиплома), Неопределено, ТекущееОбразование.СерияДиплома);
	PersonPostgraduateData.docNumber = ТекущееОбразование.НомерДиплома;
	PersonPostgraduateData.docDate = ТекущееОбразование.ДатаВыдачиДиплома;
	PersonPostgraduateData.academicDegreeId = ?(ПустаяСтрока(ТекущееОбразование.УченаяСтепеньКод), Неопределено, ТекущееОбразование.УченаяСтепеньКод);
	PersonPostgraduateData.scienceBranchId = ?(ПустаяСтрока(ТекущееОбразование.ОтрасльНаукиКод), Неопределено, ТекущееОбразование.ОтрасльНаукиКод);
	PersonPostgraduateData.specId = ?(ПустаяСтрока(ТекущееОбразование.СпециальностьОрдинатурыКод), Неопределено, ТекущееОбразование.СпециальностьОрдинатурыКод);
	PersonPostgraduateData.doctSpecId = ?(ПустаяСтрока(ТекущееОбразование.СпециальностьДокторантурыКод), Неопределено, ТекущееОбразование.СпециальностьДокторантурыКод);
	Если ТекущееОбразование.ЗаПределамиРФ Тогда
		PersonPostgraduateData.foreignInstitution = ТекущееОбразование.ОбразовательнаяОрганизация;
		Если ЗначениеЗаполнено(ТекущееОбразование.РеспубликаСССРКод) И Не ЗначениеЗаполнено(ТекущееОбразование.СтранаМираКод) Тогда 
			PersonPostgraduateData.educPlace = 1;
			PersonPostgraduateData.unionRepublicId = ТекущееОбразование.РеспубликаСССРКод;
		Иначе 
			PersonPostgraduateData.educPlace = 2;
			PersonPostgraduateData.oksmId = ТекущееОбразование.СтранаМираКод;
			PersonPostgraduateData.hasForeignCert = 2;
		КонецЕсли;
	Иначе 
		PersonPostgraduateData.educPlace = 0;
		PersonPostgraduateData.institutionId = ТекущееОбразование.УчебноеЗаведениеКод;
		PersonPostgraduateData.isTargeted = ЗначениеЗаполнено(ТекущееОбразование.ЗаказчикЦелевогоОбученияКод);
		Если PersonPostgraduateData.isTargeted Тогда
			PersonPostgraduateData.targetedRegionId = ТекущееОбразование.ЗаказчикЦелевогоОбученияКод;
			PersonPostgraduateData.dutyMonthsPeriod = РазмерПериода(ТекущееОбразование.Начало, ТекущееОбразование.Окончание);
			PersonPostgraduateData.isTargetTerminated = ЗначениеЗаполнено(ТекущееОбразование.ПричинаРасторженияКод);
			Если PersonPostgraduateData.isTargetTerminated Тогда 
				PersonPostgraduateData.terminationReasonId = ТекущееОбразование.ПричинаРасторженияКод;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат PersonPostgraduateData;

КонецФункции

&НаКлиенте
Функция ЗначениеИдентификатора(ОбъектИдентификации)
	
	Если ЗначениеЗаполнено(ОбъектИдентификации.Идентификатор) Тогда 
		Возврат ОбъектИдентификации.Идентификатор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, ПараметрыСервиса, ТокенДоступа, Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке)
	
	ВыгрузкаВыполнена = Истина;
	ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
	ОтветСервиса = ВызватьМетод(ТокенДоступа, ПараметрыВызова);
	Если ОтветСервиса.КодСостояния<400 Тогда 
		Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
			ПрисвоенныйИдентификатор = Неопределено;
			ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
			Если ПрисвоенныйИдентификатор<>Неопределено Тогда
				ТекущееОбразование.Идентификатор = ПрисвоенныйИдентификатор;
				ТекущееОбразование.МоментВыгрузки = МоментВыгрузкиНаСервере();
				ЗаписатьРезультатВыгрузки(ТекущееОбразование.ОбразованиеРаботника, ТекущееОбразование.Идентификатор, ТекущееОбразование.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
			Иначе 
				ВыгрузкаВыполнена = Ложь;
			КонецЕсли;
		ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
			ТекущееОбразование.МоментВыгрузки = МоментВыгрузкиНаСервере();
			ЗаписатьРезультатВыгрузки(ТекущееОбразование.ОбразованиеРаботника, ТекущееОбразование.Идентификатор, ТекущееОбразование.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
		Иначе 
			ВыгрузкаВыполнена = Ложь;
		КонецЕсли;
	Иначе 
		ВыгрузкаВыполнена = Ложь;
	КонецЕсли;
	Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
		СообщениеОбОшибкеПользователю = СтрШаблон(ШаблонСообщенияОбОшибке, ОтветСервиса.СообщениеОбОшибкеПользователю);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", Работник.НомерСтроки-1));
	КонецЕсли;
	
	Возврат ВыгрузкаВыполнена;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыгрузкаНеобходима(МоментВыгрузки, МоментИзменения)
	
	ВыгрузкаНеПроводилась = МоментВыгрузки=Неопределено Или МоментВыгрузки=Дата('00010101');
	ЕстьИзменения = МоментВыгрузки<=МоментИзменения;
	Возврат ВыгрузкаНеПроводилась Или ЕстьИзменения;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузки(ОбъектСсылка, Идентификатор, МоментВыгрузки, РазделМедрегистра)
	
	Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(ОбъектСсылка);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.Объект = ОбъектСсылка;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	Если МоментВыгрузки<>Неопределено Тогда 
		РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	КонецЕсли;
	Если РазделМедрегистра<>Неопределено Тогда 
		РезультатВыгрузки.РазделМедрегистра = РазделМедрегистра;
	КонецЕсли;
	Набор.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиЛичногоДела(ФизическоеЛицо, УИНОрганизации, ТабельныйНомер, 
											   ДатаНачалаЗаписи, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.УИНОрганизации.Установить(УИНОрганизации);
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.ТабельныйНомер.Установить(ТабельныйНомер);
	Набор.Отбор.ДатаНачалаЗаписи.Установить(ДатаНачалаЗаписи);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.УИНОрганизации = УИНОрганизации;
		РезультатВыгрузки.ТабельныйНомер = ТабельныйНомер;
		РезультатВыгрузки.ДатаНачалаЗаписи = ДатаНачалаЗаписи;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиСертификата(ФизическоеЛицо, Специальность, ДатаПолучения, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.Специальность.Установить(Специальность);
	Набор.Отбор.ДатаПолучения.Установить(ДатаПолучения);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.Специальность = Специальность;
		РезультатВыгрузки.ДатаПолучения = ДатаПолучения;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиНаграды(ФизическоеЛицо, Награда, ДатаПриказа, НомерПриказа, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыНаградДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.Награда.Установить(Награда);
	Набор.Отбор.ДатаПриказа.Установить(ДатаПриказа);
	Набор.Отбор.НомерПриказа.Установить(НомерПриказа);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.Награда = Награда;
		РезультатВыгрузки.ДатаПриказа = ДатаПриказа;
		РезультатВыгрузки.НомерПриказа = НомерПриказа;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиКвалификации(ФизическоеЛицо, ДатаПрисвоения, Специальность, РазрядКатегория, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.ДатаПрисвоения.Установить(ДатаПрисвоения);
	Набор.Отбор.Специальность.Установить(Специальность);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.ДатаПрисвоения = ДатаПрисвоения;
		РезультатВыгрузки.Специальность = Специальность;
		РезультатВыгрузки.РазрядКатегория = РазрядКатегория;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Функция МоментВыгрузкиНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаСервереБезКонтекста
Функция РазмерПериода(ДатаНачала, ДатаОкончания)
	РазмерПериода = ОбщегоНазначенияБЗК.РазмерПериода(ДатаНачала, ДатаОкончания);
	Возврат РазмерПериода.Лет * 12 + РазмерПериода.Месяцев + ?(РазмерПериода.Дней=0, 0, 1);
КонецФункции

&НаКлиенте
Функция ТокенДоступа(ПараметрыСервиса)
	АдресСервиса = ?(ПараметрыСервиса.ИспользоватьЗащищенноеСоединение, "https://", "http://") + ПараметрыСервиса.Адрес + ПараметрыСервиса.ТочкаДоступа;
	Возврат МедицинскиеРегистрыКлиент.ТокенДоступа(ДанныеСертификата(Сертификат), Пароль, АдресСервиса, МоментВыпуска(), ИдентификаторИнформационнойСистемы);
КонецФункции

&НаСервереБезКонтекста
Функция МоментВыпуска() Экспорт
	Возврат МедицинскиеРегистры.МоментВыпуска();
КонецФункции

&НаСервереБезКонтекста
Функция НомерТелефонаЦифрами(НомерТелефонаJSON)
	ДанныеНомераТелефона = МедицинскиеРегистры.JSONВДанные(НомерТелефонаJSON);
	Возврат МедицинскиеРегистры.ТолькоЦифры(ДанныеНомераТелефона.areaCode) + МедицинскиеРегистры.ТолькоЦифры(ДанныеНомераТелефона.number);
КонецФункции

&НаСервереБезКонтекста
Функция АдреснаяИнформация(ТипАдреса, ДатаРегистрации, АдреснаяИнформацияJSON)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("БезПредставлений",               Истина);
	ДополнительныеПараметры.Вставить("КодыАдреса",                     Истина);
	ДополнительныеПараметры.Вставить("КодыКЛАДР",                      Ложь);
	ДополнительныеПараметры.Вставить("НаименованиеВключаетСокращение", Ложь);
	ДополнительныеПараметры.Вставить("ПроверитьАдрес",                 Ложь);
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(АдреснаяИнформацияJSON, ДополнительныеПараметры);
	
	PersonAddressData = МедицинскиеРегистрыФРМР.PersonAddressData();
	Если ДатаРегистрации<>Неопределено Тогда 
		PersonAddressData.regDate = ДатаРегистрации;
	КонецЕсли;
	PersonAddressData.addressTypeId = ТипАдреса;
	PersonAddressData.address.GARguid = СведенияОбАдресе.ИдентификаторДома;
	Если ЗначениеЗаполнено(СведенияОбАдресе.Идентификаторы.ГородИдентификатор) Тогда 
		PersonAddressData.address.aoidArea = СведенияОбАдресе.Идентификаторы.ГородИдентификатор;
		PersonAddressData.address.areaName = СведенияОбАдресе.Город;
		PersonAddressData.address.prefixArea = СведенияОбАдресе.ГородТипКраткий;
	Иначе 
		PersonAddressData.address.aoidArea = СведенияОбАдресе.Идентификаторы.НаселенныйПунктИдентификатор;
		PersonAddressData.address.areaName = СведенияОбАдресе.НаселенныйПункт;
		PersonAddressData.address.prefixArea = СведенияОбАдресе.НаселенныйПунктТипКраткий;
	КонецЕсли;
	PersonAddressData.address.aoidStreet = СведенияОбАдресе.Идентификаторы.УлицаИдентификатор;
	PersonAddressData.address.houseid = СведенияОбАдресе.ИдентификаторДома;
	PersonAddressData.address.region = Формат(Число(СведенияОбАдресе.КодРегиона), "ЧГ=0"); // Избавимся от лидирующего нуля.
	PersonAddressData.address.streetName = СведенияОбАдресе.Улица;
	PersonAddressData.address.prefixStreet = СведенияОбАдресе.УлицаТипКраткий;
	PersonAddressData.address.house = СведенияОбАдресе.Здание.Номер;
	PersonAddressData.address.building = Неопределено;
	PersonAddressData.address.struct = Неопределено;
	PersonAddressData.address.flat = Неопределено;
	
	Возврат PersonAddressData;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеСертификата(СертификатСсылка)
	Возврат МедицинскиеРегистры.ДанныеСертификата(СертификатСсылка);
КонецФункции

&НаСервереБезКонтекста
Функция ВызватьМетод(ТокенДоступа, ПараметрыВызова)
	Возврат МедицинскиеРегистры.ВызватьМетод(ТокенДоступа, ПараметрыВызова);
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыСервиса()
	Возврат МедицинскиеРегистры.ПараметрыСервиса();
КонецФункции

&НаСервереБезКонтекста
Функция PersonKey()
	Возврат МедицинскиеРегистрыФРМР.PersonKey();
КонецФункции

&НаСервереБезКонтекста
Функция PersonData()
	Возврат МедицинскиеРегистрыФРМР.PersonData();
КонецФункции

&НаСервереБезКонтекста
Функция GetPerson(PersonKey) 
	Возврат МедицинскиеРегистрыФРМР.GetPerson(PersonKey);
КонецФункции

&НаСервереБезКонтекста
Функция GetPersonFull(PersonKey) 
	Возврат МедицинскиеРегистрыФРМР.GetPersonFull(PersonKey);
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPerson(PersonKey, PersonData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPerson(PersonKey, PersonData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonDocumentData()
	Возврат МедицинскиеРегистрыФРМР.PersonDocumentData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonCommon(PersonKey, PersonCommonData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonCommon(PersonKey, PersonCommonData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonCommonData()
	Возврат МедицинскиеРегистрыФРМР.PersonCommonData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonProf(PersonKey, PersonProfData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonProf(PersonKey, PersonProfData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonProfData()
	Возврат МедицинскиеРегистрыФРМР.PersonProfData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonPostgraduate(PersonKey, PersonPostgraduateData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonPostgraduate(PersonKey, PersonPostgraduateData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonPostgraduateData()
	Возврат МедицинскиеРегистрыФРМР.PersonPostgraduateData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonExt(PersonKey, PersonExtData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonExt(PersonKey, PersonExtData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonExtData()
	Возврат МедицинскиеРегистрыФРМР.PersonExtData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonCert(PersonKey, PersonCertData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonCert(PersonKey, PersonCertData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonCertData()
	Возврат МедицинскиеРегистрыФРМР.PersonCertData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonNomination(PersonKey, PersonNominationData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonNomination(PersonKey, PersonNominationData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonNominationData()
	Возврат МедицинскиеРегистрыФРМР.PersonNominationData();
КонецФункции

&НаСервереБезКонтекста
Функция PersonQualificationData()
	Возврат МедицинскиеРегистрыФРМР.PersonQualificationData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonQualification(PersonKey, PersonQualificationData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonQualification(PersonKey, PersonQualificationData);
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonCard(PersonKey, PersonCardData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonCard(PersonKey, PersonCardData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonCardData()
	Возврат МедицинскиеРегистрыФРМР.PersonCardData();
КонецФункции

&НаСервереБезКонтекста
Функция PersonCardServices()
	Возврат МедицинскиеРегистрыФРМР.PersonCardServices();
КонецФункции

#КонецОбласти

#Область КлючевыеРеквизитыЗаполненияФормы

// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.Работники");
	Массив.Добавить("Объект.ДокументыУдостоверяющиеЛичность");
	Массив.Добавить("Объект.ЛичноеДело");
	Массив.Добавить("Объект.ОбщееОбразование");
	Массив.Добавить("Объект.ПрофессиональноеОбразование");
	Массив.Добавить("Объект.ПослевузовскоеОбразование");
	Массив.Добавить("Объект.ДополнительноеПрофессиональноеОбразование");
	Массив.Добавить("Объект.Сертификаты");
	Массив.Добавить("Объект.Награды");
	Массив.Добавить("Объект.Квалификация");
	
	Возврат Массив;
	
КонецФункции 

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация", НСтр("ru = 'организации'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Дата",        НСтр("ru = 'даты документа'")));
	
	Возврат Массив
	
КонецФункции

#КонецОбласти

#КонецОбласти



