#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры") Тогда
		
		МодульРезервОтпусков = ОбщегоНазначения.ОбщийМодуль("РезервОтпусков");
		НастройкиРезервовОтпусков = МодульРезервОтпусков.НастройкиРезервовОтпусков(Организация, ПериодРегистрации);
		Если НастройкиРезервовОтпусков.ФормироватьРезервБУ Тогда
			ТаблицаВыплатаЗаСчетРезерва = ВыплатаЗаСчетРезерва.Выгрузить();
			МодульРезервОтпусков.СформироватьДвиженияВыплатаОтпусковЗаСчетРезерва(Движения, Отказ, Организация, ПериодРегистрации, ТаблицаВыплатаЗаСчетРезерва);
			ДвиженияВыплатаЗаСчетРезерва = Движения.ОценочныеОбязательстваПоСотрудникам.Выгрузить();
			МодульРезервОтпусков.СформироватьДвиженияСписаниеРезерваОтпусков(Движения, Отказ, Организация, ПериодРегистрации, ДвиженияВыплатаЗаСчетРезерва);
		КонецЕсли;
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("РезервыПоОплатеТруда");
		Если Модуль.ФормируютсяРезервыВОрганизации(Организация, ПериодРегистрации)
			Или Модуль.ФормируютсяРезервыВОрганизации(Организация, ДобавитьМесяц(ПериодРегистрации, -12)) Тогда
			ТаблицаВыплатаЗаСчетРезерва = ВыплатаЗаСчетРезерва.Выгрузить();
			Модуль.СформироватьДвиженияВыплатаЗаСчетРезерва(Движения, Отказ, Организация, ПериодРегистрации, ТаблицаВыплатаЗаСчетРезерва);
			ДвиженияВыплатаЗаСчетРезерва = Движения.ОценочныеОбязательстваПоСотрудникам.Выгрузить();
			Модуль.СформироватьДвиженияСписаниеРезерва(Движения, Отказ, Организация, ПериодРегистрации, ДвиженияВыплатаЗаСчетРезерва);
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеДляОтражения = Новый Структура;
	ДанныеДляОтражения.Вставить("НачисленнаяЗарплатаИВзносы", НачисленнаяЗарплатаИВзносы.Выгрузить());
	ДанныеДляОтражения.Вставить("НачисленныйНДФЛ", НачисленныйНДФЛ.Выгрузить());
	ДанныеДляОтражения.Вставить("УдержаннаяЗарплата", УдержаннаяЗарплата.Выгрузить());
	// ЗУПК
	ДанныеДляОтражения.Вставить("РегламентированныеУдержания", РегламентированныеУдержания.Выгрузить());
	ДанныеДляОтражения.Вставить("ПеняПоВзносамИОтчислениям", ПеняПоВзносамИОтчислениям.Выгрузить());
	// ЗУПК
	ОтражениеЗарплатыВБухучетеПереопределяемый.СформироватьДвижения(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляОтражения);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная.ОтражениеРасчетовЗарплатыВБухучете") Тогда
		ДанныеДляОтражения.Вставить("ВыплатаЗаСчетРезерва", ВыплатаЗаСчетРезерва.Выгрузить());
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтражениеРасчетовЗарплатыВБухучете");
		Модуль.СформироватьДвижения(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляОтражения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ЗарплатаОтраженаВБухучете = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЗарплатаОтраженаВБухучете = Ложь;
	Бухгалтер = Справочники.Пользователи.ПустаяСсылка();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РезервыПоОплатеТруда");
		Модуль.ОбработкаПроверкиЗаполненияОтраженияВУчете(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
    // ЗУПК
	ИсключаемыеРеквизиты = Новый Массив;
	ИсключаемыеРеквизиты.Добавить("РегламентированныеУдержания.Подразделение");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ИсходнаяТаблица.ВидОперацииНалогиВзносы КАК ВидОперацииНалогиВзносы,
	|	ИсходнаяТаблица.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ТаблицаРегламентированныеУдержания
	|ИЗ
	|	&РегламентированныеУдержания КАК ИсходнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегламентированныеУдержания.НомерСтроки КАК НомерСтроки,
	|	РегламентированныеУдержания.ВидОперацииНалогиВзносы КАК ВидОперацииНалогиВзносы,
	|	РегламентированныеУдержания.Подразделение КАК Подразделение
	|ИЗ
	|	ТаблицаРегламентированныеУдержания КАК РегламентированныеУдержания
	|ГДЕ
	|	НЕ РегламентированныеУдержания.ВидОперацииНалогиВзносы В (&ВидОперацииНалогиВзносы)
	|	И РегламентированныеУдержания.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)");
	
	ТаблицаРегламентированныеУдержания = РегламентированныеУдержания.Выгрузить(, "НомерСтроки, ВидОперацииНалогиВзносы, Подразделение");
	Запрос.УстановитьПараметр("РегламентированныеУдержания", ТаблицаРегламентированныеУдержания);
	МассивВидовОпераций = Новый Массив;
	МассивВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ИПНДивиденды"));
	МассивВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ОПВДоходыСубъектаПредпринимательства"));
	МассивВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ВОСМСДоходыСубъектаПредпринимательства"));
	МассивВидовОпераций.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПоЗарплате.ИПНДоходыСубъектаПредпринимательства"));
	Запрос.УстановитьПараметр("ВидОперацииНалогиВзносы", МассивВидовОпераций);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не заполнена колонка ""Подразделение"" в строке %1 списка ""Удержания (регл)""'"),
			Выборка.НомерСтроки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			"РегламентированныеУдержания.[" + (Выборка.НомерСтроки - 1) + "].Подразделение",
			,
			Отказ);
		
	КонецЦикла;
    // ЗУПК
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли