
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() И НЕ Параметры.Свойство("СменаФормы") Тогда
		
		ЗначенияДляЗаполнения = Новый Структура("Месяц, Организация, Ответственный", 
		"Объект.Месяц",
		"Объект.Организация",
		"Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		УстановитьМесяцНаСервере();
		
		ПрочитатьВычетыПредыдущегоМесяца();
		
		ПриПолученииДанныхНаСервере();
		
	ИначеЕсли Параметры.Свойство("СменаФормы") Тогда
		
		Параметры.Свойство("Месяц",Объект.Месяц);
		Параметры.Свойство("Организация",Объект.Организация);
		Параметры.Свойство("Сотрудник",Объект.Сотрудник);
		Параметры.Свойство("Ответственный",Объект.Ответственный);
		Параметры.Свойство("Комментарий",Объект.Комментарий);
		Параметры.Свойство("Модифицированность",Модифицированность);
		
		ПрочитатьВычетыПредыдущегоМесяца();
		
		ПриПолученииДанныхНаСервере();
		
	КонецЕсли;
	
	УстановитьРасшифровкиВычетов();
	
	МассивАктуальныхВычетов = УчетНалоговВзносовОтчислений.ВычетыНалогоплательщика(Год(Объект.Месяц));
	СписокАктуальныхВычетов.ЗагрузитьЗначения(МассивАктуальныхВычетов);
	
	ДополнитьФорму();
	
	УчетНалоговВзносовОтчисленийРасширенный.УстановитьПараметрыВыбораСотрудниковВДокументахПредоставленияВычетов(ЭтаФорма, "ФизическоеЛицо");

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчетаБЗК.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Сообщения = ПолучитьСообщенияПользователю(Ложь);
	Для Каждого Сообщение Из Сообщения Цикл
		Если Сообщение.Поле = "Месяц" Тогда
			Сообщение.ПутьКДанным	= Сообщение.Поле + "Строкой";
			Сообщение.Поле			= "";
		КонецЕсли;
		Отказ = Истина;
	КонецЦикла;

	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчетаБЗК.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененыВычеты", Объект.Сотрудник, ЭтаФорма);
	УстановитьРасшифровкиВычетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "СписокВыборЗначения"
			И Источник = "ВидыВычетовИПН" Тогда
		
		Для каждого ВычетИПН Из Параметр Цикл
			
			Если Не ПроверитьДублированиеВидаВычета(ВычетИПН, Истина) Тогда
				НоваяСтрока = Объект.Вычеты.Добавить();
				НоваяСтрока.ВидВычетаИПН = ВычетИПН;
				НоваяСтрока.ПредоставлятьВычет = (НЕ СписокАктуальныхВычетов.НайтиПоЗначению(ВычетИПН) = Неопределено);
				Модифицированность = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Модифицированность Тогда
			УстановитьРасшифровкиВычетов();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	ЗарплатаКадрыРасширенныйКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
	ПрочитатьВычетыПредыдущегоМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОВозможностиПроведенияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОтменаЗаявления" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОтменитьЗаявлениеОПрекращенииВычетов();
		
		ПоказатьПредупреждение(, НСтр("ru='Заявление о прекращении предоставления вычетов отменено'"));
		
	КонецЕсли;
	
КонецПроцедуры

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура МесяцНачисленияСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.Месяц", "МесяцСтрокой", Модифицированность);
	
	КонтрольМесяца();
	
	ПроверитьКорректностьМесяцев();
	ПрочитатьВычетыПредыдущегоМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("МесяцСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.Месяц", "МесяцСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт 
	
	Если НЕ ЗначениеВыбрано Тогда
		Возврат;	
	КонецЕсли;
	
	КонтрольМесяца();
	
	ПроверитьКорректностьМесяцев();
	ПрочитатьВычетыПредыдущегоМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.Месяц", "МесяцСтрокой", Направление, Модифицированность);
	
	КонтрольМесяца();
	
	ПроверитьКорректностьМесяцев();
	ПрочитатьВычетыПредыдущегоМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	КонтрольМесяца();
	
	ПроверитьКорректностьМесяцев();
	ПрочитатьВычетыПредыдущегоМесяца();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцЗавершенияСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.МесяцЗавершения", "МесяцЗавершенияСтрокой", Модифицированность);
	УстановитьМесяцЗавершения();
	ПроверитьКорректностьМесяцев();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцЗавершенияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("МесяцЗавершенияСтрокойНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.МесяцЗавершения", "МесяцЗавершенияСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцЗавершенияСтрокойНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт 
	
	УстановитьМесяцЗавершения();
	ПроверитьКорректностьМесяцев();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцЗавершенияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.МесяцЗавершения", "МесяцЗавершенияСтрокой", Направление, Модифицированность);
	УстановитьМесяцЗавершения();
	ПроверитьКорректностьМесяцев();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцЗавершенияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцЗавершенияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	УстановитьМесяцЗавершения();
	ПроверитьКорректностьМесяцев();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВычеты

&НаКлиенте
Процедура ВычетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле.ГиперссылкаЯчейки И ЗначениеЗаполнено(ТекущиеДанные.Расшифровка) Тогда
		РедактированиеГрафикиВычетов(ТекущиеДанные);
		СтандартнаяОбработка = Ложь;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УдалитьПрочиеВычеты(ТекущиеДанные.ВидВычетаИПН);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидВычетаИПН) И 
			ПроверитьДублированиеВидаВычета(ТекущиеДанные.ВидВычетаИПН) Тогда
			
			Если ОтменаРедактирования Тогда
				ТекущиеДанные.ВидВычетаИПН = ПредопределенноеЗначение("Справочник.ВидыВычетовИПН.ПустаяСсылка");
			Иначе
				ТекстСообщения = НСтр("ru='В строке %1 повторно указан вид вычета, отраженный в документе.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ТекущиеДанные.НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,,,,Отказ);
			КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные.ПредоставлятьВычет = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыВидВычетаИПНПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Вычеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРасшифровкуВСтроке(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("РежимВыбора",        Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытия.Вставить("Месяц", 			 Объект.Месяц);
	
	ОткрытьФорму("Справочник.ВидыВычетовИПН.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтрольВеденияУчета

// СтандартныеПодсистемы.КонтрольВеденияУчета

&НаКлиенте
Процедура Подключаемый_ОткрытьОтчетПоПроблемам(ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка)
	
	КонтрольВеденияУчетаКлиентБЗК.ОткрытьОтчетПоПроблемамОбъекта(ЭтотОбъект, Объект.Ссылка, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.Месяц", "МесяцСтрокой");
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.МесяцЗавершения", "МесяцЗавершенияСтрокой");
	УстановитьИнформационнуюНадписьОВозможностиПроведения();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВычетыПредыдущегоМесяца()
	
	Если Объект.Сотрудник.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	МассивАктуальныхВычетов = УчетНалоговВзносовОтчислений.ВычетыНалогоплательщика(Год(Объект.Месяц));
	СписокАктуальныхВычетов.ЗагрузитьЗначения(МассивАктуальныхВычетов);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Месяц",								Объект.Месяц);
	Запрос.УстановитьПараметр("ФизическоеЛицо",						Объект.Сотрудник);
	Запрос.УстановитьПараметр("Ссылка",								Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаОграниченияПолученияДанных",		'20180101');
	Запрос.УстановитьПараметр("ПустаяДата",							Дата(1,1,1));
	Запрос.УстановитьПараметр("РасшифровкаПодробнее",				НСтр("ru = 'Подробнее'"));
	Запрос.УстановитьПараметр("АктуальныеВычеты",					МассивАктуальныхВычетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета КАК ВидВычетаИПН,
	|	ВычетыФизическихЛицИПНСрезПоследних.Основание,
	|	ВЫБОР
	|		КОГДА ВычетыФизическихЛицИПНСрезПоследних.ВидВычета В (&АктуальныеВычеты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПредоставлятьВычет,
	|	ВЫБОР
	|		КОГДА ВычетыФизическихЛицИПНСрезПоследних.ВидВычета.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам)
	|			ТОГДА &РасшифровкаПодробнее
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Расшифровка
	|ИЗ
	|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(
	|			&Месяц,
	|			Регистратор <> &Ссылка
	|				И ФизическоеЛицо = &ФизическоеЛицо) КАК ВычетыФизическихЛицИПНСрезПоследних
	|ГДЕ
	|	ВычетыФизическихЛицИПНСрезПоследних.Период >= &ДатаОграниченияПолученияДанных
	|	И ВЫБОР
	|			КОГДА ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо = &ПустаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо >= &Месяц
	|		КОНЕЦ
	|	И ВычетыФизическихЛицИПНСрезПоследних.ПредоставлятьВычет = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВычетыФизическихЛицИПНСрезПоследних.ВидВычета,
	|	ВычетыФизическихЛицИПНСрезПоследних.ДействуетПо";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.Вычеты.Очистить();
	МассивВычетов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.Вычеты.Добавить(), Выборка);
		Если Выборка.ПредоставлятьВычет Тогда
			МассивВычетов.Добавить(Выборка.ВидВычетаИПН);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеВычеты.ВидВычета КАК ВидВычетаИПН,
	|	ПрочиеВычеты.ДействуетС КАК ДействуетС,
	|	ПрочиеВычеты.Размер КАК Размер,
	|	ПрочиеВычеты.ДействуетПо КАК ДействуетПо,
	|	ПрочиеВычеты.Основание КАК ДокументПодтверждающийПравоНаВычет
	|ПОМЕСТИТЬ ВТ_ПрочиеВычеты
	|ИЗ
	|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(
	|			&Месяц,
	|			Регистратор <> &Ссылка
	|				И ФизическоеЛицо = &ФизическоеЛицо
	|				И ВидВычета В (&Вычеты)) КАК ПрочиеВычеты
	|ГДЕ
	|	ПрочиеВычеты.Период >= &ДатаОграниченияПолученияДанных
	|	И ПрочиеВычеты.Размер <> 0
	|	И ПрочиеВычеты.ДействуетПо > &Месяц
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидВычетаИПН,
	|	ДействуетС,
	|	ДействуетПо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеВычеты.ВидВычетаИПН КАК ВидВычетаИПН,
	|	ВЫБОР
	|		КОГДА ПрочиеВычеты.ДействуетС < &Месяц
	|			ТОГДА &Месяц
	|		ИНАЧЕ ПрочиеВычеты.ДействуетС
	|	КОНЕЦ КАК ДействуетС,
	|	ПрочиеВычеты.Размер КАК Размер,
	|	ПрочиеВычеты.ДействуетПо КАК ДействуетПо,
	|	ПрочиеВычеты.ДокументПодтверждающийПравоНаВычет КАК ДокументПодтверждающийПравоНаВычет
	|ИЗ
	|	ВТ_ПрочиеВычеты КАК ПрочиеВычеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПрочиеВычеты КАК ПересечениеПериодов
	|		ПО ПрочиеВычеты.ВидВычетаИПН = ПересечениеПериодов.ВидВычетаИПН
	|			И (ПересечениеПериодов.ДействуетС > ПрочиеВычеты.ДействуетС)
	|			И (ПересечениеПериодов.ДействуетС < ПрочиеВычеты.ДействуетПо)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПересечениеПериодов.ВидВычетаИПН ЕСТЬ NULL 
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидВычетаИПН,
	|	ДействуетС";
	
	Запрос.УстановитьПараметр("Вычеты",МассивВычетов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.ПрочиеВычеты.Очистить();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ПрочиеВычеты.Добавить(), Выборка);
	КонецЦикла;
	
	УстановитьИнформационнуюНадписьОВозможностиПроведения();

КонецПроцедуры

&НаСервере
Процедура ДополнитьФорму()
	
	ОписаниеКлючевыхРеквизитов = КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов();
	ТаблицыОчищаемыеПриИзменении = КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении();
	ЗарплатаКадрыРасширенный.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтаФорма, ОписаниеКлючевыхРеквизитов); 
	ЗарплатаКадрыРасширенныйКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма, , ОписаниеКлючевыхРеквизитов, ТаблицыОчищаемыеПриИзменении);
	
КонецПроцедуры

&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = КлючевыеРеквизитыОписаниеКлючевыхРеквизитов();
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = КлючевыеРеквизитыТаблицыОчищаемыеПриИзменении();
	Возврат Массив;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючевыеРеквизитыОписаниеКлючевыхРеквизитов() 
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "ФизическоеЛицо",		Нстр("ru = 'сотрудника'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "МесяцСтрокой", 			Нстр("ru = 'месяца'")));
	Возврат Массив;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючевыеРеквизитыТаблицыОчищаемыеПриИзменении() 
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.Вычеты");
	Массив.Добавить("Объект.ПрочиеВычеты");
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура УстановитьИнформационнуюНадписьОВозможностиПроведения()
	
	ИнформацияОВозможностиПроведения = "";
	
	МассивВычетов = Новый Массив;
	Для Каждого СтрокаВычет Из Объект.ПрочиеВычеты Цикл
		МассивВычетов.Добавить(СтрокаВычет.ВидВычетаИПН);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.ЗаявлениеНаПредоставлениеВычетовИПН.ТекстЗапросаКонфликтующиеРегистраторы();
	
	Запрос.УстановитьПараметр("ФизическоеЛицо",	Объект.Сотрудник);
	Запрос.УстановитьПараметр("Период",			Объект.Месяц);
	Запрос.УстановитьПараметр("Регистратор",	Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидыВычетов",	МассивВычетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ИнформацияОВозможностиПроведения = Новый ФорматированнаяСтрока(
			НСтр("ru='Документ не может быть проведен. На'") + " ",
			НРег(Формат(Объект.Месяц, "ДФ='ММММ гггг'")) + " ",
			НСтр("ru='уже введено заявление'")
		);
			
		Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЗаявлениеНаПредоставлениеВычетовИПН") Тогда
			
			ИнформацияОВозможностиПроведения = Новый ФорматированнаяСтрока(
				ИнформацияОВозможностиПроведения,
				" " + НСтр("ru='на вычеты'"),
				" (",
				Новый ФорматированнаяСтрока(Выборка.ПредставлениеРегистратора, , , , ПолучитьНавигационнуюСсылку(Выборка.Регистратор)),
				")"
			);
			
		Иначе
			
			ИнформацияОВозможностиПроведения = Новый ФорматированнаяСтрока(
				ИнформацияОВозможностиПроведения,
				" " + НСтр("ru='о прекращении вычетов'")
			);
			
			ОрганизацияРегистратора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Регистратор, "Организация");
			Если Объект.Организация = ОрганизацияРегистратора Тогда

				ИнформацияОВозможностиПроведения = Новый ФорматированнаяСтрока(
					ИнформацияОВозможностиПроведения,
					" (",
					Новый ФорматированнаяСтрока(Выборка.ПредставлениеРегистратора, , , , ПолучитьНавигационнуюСсылку(Выборка.Регистратор)),
					")"
				);
				
			Иначе
				
				ИнформацияОВозможностиПроведения = Новый ФорматированнаяСтрока(
					ИнформацияОВозможностиПроведения,
					" " + НСтр("ru='в другой организации. Если необходимо перенести применение вычетов в'") + " ",
					Строка(Объект.Организация) + ", ",
					Новый ФорматированнаяСтрока("отмените заявление", , , , "ОтменаЗаявления"),
					" " + НСтр("ru='о прекращении вычетов и проведите это заявление'") + "."
				);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИнформацияОВозможностиПроведения",
		"Заголовок",
		ИнформацияОВозможностиПроведения
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИнформацияОВозможностиПроведения",
		"Видимость",
		ЗначениеЗаполнено(ИнформацияОВозможностиПроведения)
	);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявлениеОПрекращенииВычетов()
	
	МассивВычетов = Новый Массив;
	Для Каждого СтрокаВычет Из Объект.ПрочиеВычеты Цикл
		МассивВычетов.Добавить(СтрокаВычет.КодВычета);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.ЗаявлениеНаПредоставлениеВычетовИПН.ТекстЗапросаКонфликтующиеРегистраторы();
	
	Запрос.УстановитьПараметр("ФизическоеЛицо",	Объект.Сотрудник);
	Запрос.УстановитьПараметр("Период",			Объект.Месяц);
	Запрос.УстановитьПараметр("Регистратор",	Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидыВычетов",	МассивВычетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Заявление = Выборка.Регистратор.ПолучитьОбъект();
		Заявление.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;
	
	УстановитьИнформационнуюНадписьОВозможностиПроведения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьМесяцев()
	
	Если ЗначениеЗаполнено(Объект.МесяцЗавершения)
		И ЗначениеЗаполнено(Объект.Месяц)
		И  Объект.Месяц > Объект.МесяцЗавершения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Месяц начала действия заявления превышает месяц окончания.'"));
		Объект.МесяцЗавершения = КонецМесяца(Объект.Месяц);
		
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.МесяцЗавершения", "МесяцЗавершенияСтрокой");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольМесяца()
	
	ДатаКонтроля = '2018-01-01';
	
	Если Объект.Месяц < ДатаКонтроля Тогда
		
		ТекстВопроса = НСтр("ru = 'Изменение месяца приведет к переоткрытию формы. Продолжить?'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("КонтрольМесяцаВопрос", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольМесяцаВопрос(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Месяц",Объект.Месяц);
		ПараметрыФормы.Вставить("Организация",Объект.Организация);
		ПараметрыФормы.Вставить("Сотрудник",Объект.Сотрудник);
		ПараметрыФормы.Вставить("Ответственный",Объект.Ответственный);
		ПараметрыФормы.Вставить("Комментарий",Объект.Комментарий);
		ПараметрыФормы.Вставить("СменаФормы",Истина);
		ПараметрыФормы.Вставить("Ключ",Объект.Ссылка);
		ПараметрыФормы.Вставить("Модифицированность",Модифицированность);
		
		ОткрытьФорму("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Форма.ФормаДокументаДо2018",ПараметрыФормы);
		Модифицированность = Ложь;
		Закрыть();
		
	Иначе
		Объект.Месяц = НачалоМесяца('2018-01-01');
		МесяцСтрокой = НСтр("ru='Январь 2018'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМесяцНаСервере()
	
	ДатаКонтроля = '2018-01-01';
	
	Если Объект.Месяц < ДатаКонтроля Тогда
		Объект.Месяц = НачалоМесяца(ДатаКонтроля);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМесяцЗавершения()
	Если ЗначениеЗаполнено(Объект.МесяцЗавершения) Тогда
		Объект.МесяцЗавершения = КонецМесяца(Объект.МесяцЗавершения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьРасшифровкиВычетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вычеты.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Вычеты.ВидВычетаИПН КАК Справочник.ВидыВычетовИПН) КАК ВидВычетаИПН
		|ПОМЕСТИТЬ ВТ_Расшифровки
		|ИЗ
		|	&Вычеты КАК Вычеты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Расшифровки.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ВТ_Расшифровки.ВидВычетаИПН.ПредоставлениеВычета = ЗНАЧЕНИЕ(Перечисление.ВидыПредоставленияВычетов.ПоПериодическимПлатежам)
		|			ТОГДА ""Подробнее""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Расшифровка
		|ИЗ
		|	ВТ_Расшифровки КАК ВТ_Расшифровки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Запрос.УстановитьПараметр("Вычеты",Объект.Вычеты.Выгрузить());
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из Объект.Вычеты Цикл
		ПараметрыОтбора = Новый Структура("НомерСтроки",Строка.НомерСтроки);
		МассивСтрок = ТаблицаРезультат.НайтиСтроки(ПараметрыОтбора);
		Строка.Расшифровка = ?(МассивСтрок.Количество()>0,МассивСтрок[0].Расшифровка,"");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеГрафикиВычетов(ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ВидВычетаИПН",					ДанныеСтроки.ВидВычетаИПН);
	ПараметрыОткрытия.Вставить("Месяц",							Объект.Месяц);
	ПараметрыОткрытия.Вставить("МесяцЗавершения",				Объект.МесяцЗавершения);
	ПараметрыОткрытия.Вставить("АдресВХранилищеПрочиеВычеты",	АдресВХранилищеПрочиеВычеты(ДанныеСтроки.ВидВычетаИПН));
	
	ПараметрыОткрытия.Вставить("ТолькоПросмотр",		ЭтаФорма.ТолькоПросмотр);
	
	Оповещение = Новый ОписаниеОповещения("РедактированиеГрафикиВычетовЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Форма.РедактированиеГрафикаВычетов", ПараметрыОткрытия, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеГрафикиВычетовЗавершение(РезультатыРедактирования,ДопПараметры) Экспорт
	
	Если РезультатыРедактирования <> Неопределено И РезультатыРедактирования.Модифицированность Тогда
		РедактированиеГрафикиВычетовЗавершениеНаСервере(РезультатыРедактирования);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РедактированиеГрафикиВычетовЗавершениеНаСервере(РезультатыРедактирования)
	
	УдалитьПрочиеВычеты(РезультатыРедактирования.ВидВычетаИПН);
	
	ТаблицаВидВычетаИПН = ПолучитьИзВременногоХранилища(РезультатыРедактирования.АдресВХранилищеПрочиеВычеты);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаВидВычетаИПН, Объект.ПрочиеВычеты);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилищеПрочиеВычеты(ВидВычетаИПН) Экспорт
	
	ТаблицаОтбора = Объект.ПрочиеВычеты.Выгрузить(Новый Структура("ВидВычетаИПН",ВидВычетаИПН),"ВидВычетаИПН,Размер,ДействуетПо,ДействуетС");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОтбора, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРасшифровкуВСтроке(Идентификатор)
	
	ТекущиеДанные = Объект.Вычеты.НайтиПоИдентификатору(Идентификатор);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Расшифровка = 
		?(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.ВидВычетаИПН, "ПредоставлениеВычета") = 
			Перечисления.ВидыПредоставленияВычетов.ПоПериодическимПлатежам, "Подробнее","");
			
КонецПроцедуры

&НаСервере
Процедура УдалитьПрочиеВычеты(ВидВычетаИПН)
	
	УдаляемыеСтроки = Объект.ПрочиеВычеты.НайтиСтроки(Новый Структура("ВидВычетаИПН", ВидВычетаИПН));
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		Объект.ПрочиеВычеты.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДублированиеВидаВычета(ВидВычетаИПН,ДоДобавления = Ложь)
	
	Возврат Объект.Вычеты.НайтиСтроки(Новый Структура("ВидВычетаИПН", ВидВычетаИПН)).Количество() > ?(ДоДобавления,0,1);
	
КонецФункции

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти