#Область ПрограммныйИнтерфейс

// Возвращает структуру настроек резервов отпусков
//
// Параметры:
//   Организация - Спр.Организации.СправочникСсылка - Организация.
//   Период - Дата - Период дат.
//
// Возвращаемое значение:
//  Структура - описанная в методе
//
Функция НастройкиРезервовОтпусков(Организация, Период) Экспорт
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("ФормироватьРезервБУ",
		Ложь);
	Настройки.Вставить("ФормироватьРезервНУ",
		Ложь);
	Настройки.Вставить("МетодНачисленияРезерваОтпусков",
		Перечисления.МетодыНачисленияРезервовПоОплатеТруда.НормативныйМетод);
	Настройки.Вставить("НормативОтчисленийВРезервОтпусков",
		0);
	Настройки.Вставить("ПредельнаяВеличинаОтчисленийВРезервОтпусков",
		0);
	Настройки.Вставить("ОпределятьИзлишкиЕжемесячно",
		Ложь);
	Настройки.Вставить("Резерв",
		Справочники.Резервы.ПустаяСсылка());

	// ЗУПК	
	Настройки.Вставить("КоэффициентРасчетаОплачиваемыхДнейОтпуска", 1);
	// ЗУПК	
	
	Если Не ЗначениеЗаполнено(Период) Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Настройки;
	КонецЕсли;
	
	НастройкиРасчетаРезервовОтпусков = РегистрыСведений.НастройкиРасчетаРезервовОтпусков.СрезПоследних(Период, Новый Структура("Организация", Организация));
	Если НастройкиРасчетаРезервовОтпусков.Количество() > 0 Тогда
		ТекущаяНастройка = НастройкиРасчетаРезервовОтпусков[0];
		ЗаполнитьЗначенияСвойств(Настройки, ТекущаяНастройка);
		Настройки.Вставить("ФормироватьРезервБУ", ТекущаяНастройка.ФормироватьРезервОтпусковБУ);
		Настройки.Вставить("ФормироватьРезервНУ", ТекущаяНастройка.ФормироватьРезервОтпусковНУ);
		Настройки.Резерв = Справочники.Резервы.РезервЕжегодныхОтпусков();
	КонецЕсли;
	
	РезервОтпусковПереопределяемый.ЗаполнитьНастройкиРезервовОтпусков(Настройки, Организация, Период);
	
	Возврат Настройки;
	
КонецФункции

// Возвращает ссылку на заполненный Док.НачислениеОценочныхОбязательствПоОтпускам.
// Если для заданного месяца и организации существует несколько 
// документов, возвращается хронологически первый.
// Если необходимого документа нет, он создается и записывается.
// В любом случае выполняется заполнение документа.
//
// Параметры:
//	ПериодРегистрации - Дата - Период регистрации.
//	Организация - СправочникСсылка.Организации - Ссылка на организацию.
//	ДополнительныеСвойства - Структура - дополнительные свойства записи документа
//
// Возвращаемое значение:
//  Ссылка - ссылка на документ.
//
Функция ДокументНачислениеОценочныхОбязательствПоОтпускам(ПериодРегистрации, Организация, ДополнительныеСвойства = Неопределено) Экспорт
	
	ДокументСсылка = Неопределено;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка КАК Документ
	|ИЗ
	|	Документ.НачислениеОценочныхОбязательствПоОтпускам КАК НачислениеОценочныхОбязательствПоОтпускам
	|ГДЕ
	|	НачислениеОценочныхОбязательствПоОтпускам.ПериодРегистрации = &ПериодРегистрации
	|	И НачислениеОценочныхОбязательствПоОтпускам.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачислениеОценочныхОбязательствПоОтпускам.Дата,
	|	НачислениеОценочныхОбязательствПоОтпускам.Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.НачислениеОценочныхОбязательствПоОтпускам.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.ПериодРегистрации = ПериодРегистрации;
		ДокументОбъект.Организация = Организация;
	КонецЕсли;
	
	ОписаниеДокумента = Новый Структура("Ссылка,
		|Организация, Дата, ПериодРегистрации,
		|КорректировкаОбязательств, ДоляРасходов");
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента, ДокументОбъект);
	
	ОписаниеДокумента.Вставить("РасчетРезерваОтпусков",               ДокументОбъект.РасчетРезерваОтпусков.ВыгрузитьКолонки());
	ОписаниеДокумента.Вставить("ОценочныеОбязательства",              ДокументОбъект.ОценочныеОбязательства.ВыгрузитьКолонки());
	ОписаниеДокумента.Вставить("ФизическиеЛица",                      ДокументОбъект.ФизическиеЛица.ВыгрузитьКолонки());
	ОписаниеДокумента.Вставить("ОценочныеОбязательстваПоСотрудникам", ДокументОбъект.ОценочныеОбязательстваПоСотрудникам.ВыгрузитьКолонки());
	
	ЗаполнитьДокументНачислениеОценочныхОбязательствПоОтпускам(ОписаниеДокумента);
	
	ДокументОбъект.РасчетРезерваОтпусков.Загрузить(ОписаниеДокумента.РасчетРезерваОтпусков);
	ДокументОбъект.ОценочныеОбязательства.Загрузить(ОписаниеДокумента.ОценочныеОбязательства);
	ДокументОбъект.ФизическиеЛица.Загрузить(ОписаниеДокумента.ФизическиеЛица);
	ДокументОбъект.ОценочныеОбязательстваПоСотрудникам.Загрузить(ОписаниеДокумента.ОценочныеОбязательстваПоСотрудникам);
	ДокументОбъект.ДоляРасходов = ОписаниеДокумента.ДоляРасходов;
	
	Если ДополнительныеСвойства <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДокументОбъект.ДополнительныеСвойства, ДополнительныеСвойства);
	КонецЕсли;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ДокументСсылка = ДокументОбъект.Ссылка;
	
	Возврат ДокументСсылка;
	
КонецФункции

// Возвращает признак того, можно вводить документ в заданном периоде или нет.
//
// Параметры:
//   Организация - Спр.Организации.СправочникСсылка - Организация.
//   Период - Дата - Период дат.
//
// Возвращаемое значение:
//  Булево - Истина, если документ вводить можно, Ложь - если надо использовать механизм резервов
//
Функция ДоступенВводДокументаРезервОтпусков(Организация, ПериодРегистрации) Экспорт
	
	ДокументДоступен = Не РезервыПоОплатеТруда.ЕстьНастройкиРезерваОтпусков(Организация, ПериодРегистрации);
	
	Возврат ДокументДоступен;
	
КонецФункции

// Возвращает признак того, что ест настройка резервов отпусков на заданную дату
//
// Параметры:
//   Организация - Спр.Организации.СправочникСсылка - Организация.
//   Период      - Дата - Период дат.
//
// Возвращаемое значение:
//  Булево - Истина - есть настройки резервов отпусков, Ложь - настройка отсутствует
//
Функция ЕстьНастройкиРезерваОтпусков(Организация, Период) Экспорт
	
	НастройкиРасчета = РегистрыСведений.НастройкиРасчетаРезервовОтпусков.СоздатьМенеджерЗаписи();
	НастройкиРасчета.Организация = Организация;
	НастройкиРасчета.Период = НачалоГода(Период);
	НастройкиРасчета.Прочитать();
	
	Возврат НастройкиРасчета.Выбран();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДатыЗапретаИзменения

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеОценочныхОбязательствПоОтпускам",		"ПериодРегистрации",	"БухгалтерскийУчетЗарплаты", "Организация");
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам, Истина);
	Списки.Вставить(Метаданные.Справочники.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиРасчетаРезервовОтпусков, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетРезерваОтпусков, Истина);
	
КонецПроцедуры

#КонецОбласти

// Процедура обеспечивает сбор сведений о хранении данных относящихся к персональным
//
// Параметры:
//		ТаблицаСведений - таблица значений с полями:
//			Объект 			- строка, содержащая полное имя объекта метаданных,
//			ПоляРегистрации - строка, в которой перечислены имена полей регистрации, 
//								отдельные поля регистрации отделяются запятой,
//								альтернативные - символом "|",
//			ПоляДоступа		- строка, в которой перечислены через запятую имена полей доступа.
//			ОбластьДанных	- строка с идентификатором области данных, необязательно для заполнения.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	// Документ.НачислениеОценочныхОбязательствПоОтпускам.
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	НовыеСведения.ПоляРегистрации	= "РасчетРезерваОтпусков.Сотрудник";
	НовыеСведения.ПоляДоступа		= "РасчетРезерваОтпусков.ОстатокОтпуска";
	НовыеСведения.ПоляДоступа		= "РасчетРезерваОтпусков.ОтпускАвансом";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	// Документ.НачислениеОценочныхОбязательствПоОтпускам.
	// Табличная часть РасчетРезерваОтпусков.
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	НовыеСведения.ПоляРегистрации	= "РасчетРезерваОтпусков.Сотрудник";
	НовыеСведения.ПоляДоступа		= "РасчетРезерваОтпусков.ФОТ,РасчетРезерваОтпусков.СтраховыеВзносы,
	|РасчетРезерваОтпусков.СуммаРезерва,РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносов,РасчетРезерваОтпусков.СреднийЗаработок,
	|РасчетРезерваОтпусков.СуммаРезерваНУ,РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНУ,РасчетРезерваОтпусков.СуммаРезерваНакоплено,
	|РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНакоплено,РасчетРезерваОтпусков.СуммаРезерваНакопленоНУ,
	|РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовНакопленоНУ,РасчетРезерваОтпусков.СуммаРезерваИсчислено,
	|РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовИсчислено,РасчетРезерваОтпусков.СуммаРезерваИсчисленоНУ,
	|РасчетРезерваОтпусков.СуммаРезерваСтраховыхВзносовИсчисленоНУ,РасчетРезерваОтпусков.ФССНесчастныеСлучаи,
	|РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаи,РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНУ,
	|РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНакоплено,РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиНакопленоНУ,
	|РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиИсчислено,РасчетРезерваОтпусков.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ";
	НовыеСведения.ПоляДоступа = СтрЗаменить(НовыеСведения.ПоляДоступа, Символы.ПС, "");
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	// Табличная часть ОценочныеОбязательстваПоСотрудникам.
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	НовыеСведения.ПоляРегистрации	= "ОценочныеОбязательстваПоСотрудникам.Сотрудник";
	НовыеСведения.ПоляДоступа		= "ОценочныеОбязательстваПоСотрудникам.Подразделение,ОценочныеОбязательстваПоСотрудникам.СпособОтраженияЗарплатыВБухучете,
	|ОценочныеОбязательстваПоСотрудникам.СтатьяФинансирования,ОценочныеОбязательстваПоСотрудникам.ОблагаетсяЕНВД,
	|ОценочныеОбязательстваПоСотрудникам.СуммаРезерва,ОценочныеОбязательстваПоСотрудникам.СуммаРезерваСтраховыхВзносов,ОценочныеОбязательстваПоСотрудникам.СуммаРезерваФССНесчастныеСлучаи,
	|ОценочныеОбязательстваПоСотрудникам.СуммаРезерваНУ,ОценочныеОбязательстваПоСотрудникам.СуммаРезерваСтраховыхВзносовНУ,ОценочныеОбязательстваПоСотрудникам.СуммаРезерваФССНесчастныеСлучаиНУ";
	НовыеСведения.ПоляДоступа = СтрЗаменить(НовыеСведения.ПоляДоступа, Символы.ПС, "");
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	// РегистрСведений.РасчетРезерваОтпусков.
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.РасчетРезерваОтпусков";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "ОстатокОтпуска";
	НовыеСведения.ПоляДоступа		= "ОтпускАвансом";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	// РегистрСведений.РасчетРезерваОтпусков.
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.РасчетРезерваОтпусков";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "ФОТ,СтраховыеВзносы,СуммаРезерва,СуммаРезерваСтраховыхВзносов,СреднийЗаработок,
	|СуммаРезерваНУ,СуммаРезерваСтраховыхВзносовНУ,СуммаРезерваНакоплено,СуммаРезерваСтраховыхВзносовНакоплено,СуммаРезерваНакопленоНУ,
	|СуммаРезерваСтраховыхВзносовНакопленоНУ,СуммаРезерваИсчислено,СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваИсчисленоНУ,
	|СуммаРезерваСтраховыхВзносовИсчисленоНУ,ФССНесчастныеСлучаи,СуммаРезерваФССНесчастныеСлучаи,СуммаРезерваФССНесчастныеСлучаиНУ,
	|СуммаРезерваФССНесчастныеСлучаиНакоплено,СуммаРезерваФССНесчастныеСлучаиНакопленоНУ,СуммаРезерваФССНесчастныеСлучаиИсчислено,
	|СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ";
	НовыеСведения.ПоляДоступа = СтрЗаменить(НовыеСведения.ПоляДоступа, Символы.ПС, "");
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	// РегистрНакопления.ОценочныеОбязательстваПоСотрудникам
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.ОценочныеОбязательстваПоСотрудникам";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "СтатьяФинансирования,СуммаРезерва,СуммаРезерваСтраховыхВзносов,СуммаРезерваФССНесчастныеСлучаи,
	|СуммаРезерваНУ,СуммаРезерваСтраховыхВзносовНУ,СуммаРезерваФССНесчастныеСлучаиНУ";
	НовыеСведения.ПоляДоступа = СтрЗаменить(НовыеСведения.ПоляДоступа, Символы.ПС, "");
	НовыеСведения.ОбластьДанных		= "Доходы";

КонецПроцедуры

// Списывает расходы по оплате отпуска за счет оценочных обязательств.
//
// Параметры:
//		ПараметрыДляСписанияРасходов - Структура - описание см РезервыПоОплатеТруда.ПараметрыДляСписанияРасходов().
//
Процедура СписатьРасходыПоОтпускамЗаСчетОценочныхОбязательств(ПараметрыДляСписанияРасходов) Экспорт

	Организация 					= ПараметрыДляСписанияРасходов.Организация;
	ПериодРегистрации 				= ПараметрыДляСписанияРасходов.ПериодРегистрации;
	НачисленнаяЗарплатаИВзносы 		= ПараметрыДляСписанияРасходов.НачисленнаяЗарплатаИВзносы;
	НачисленныеОтпуска 				= ПараметрыДляСписанияРасходов.НачисленныеОтпуска;
	ДокументСсылка 					= ПараметрыДляСписанияРасходов.ДокументСсылка;
	УчитыватьОперацииТекущегоМесяца = ПараметрыДляСписанияРасходов.УчитыватьОперацииТекущегоМесяца;
	
	НастройкиРезервовОтпусков = НастройкиРезервовОтпусков(Организация, ПериодРегистрации);
	Если Не НастройкиРезервовОтпусков.ФормироватьРезервБУ Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиКУдалению = Новый Массив;
	ТаблицаОтпусков = НачисленнаяЗарплатаИВзносы.СкопироватьКолонки();
	НачисленнаяЗарплатаИВзносы.Индексы.Добавить("ВидОперации");
	Отбор = Новый Структура("ВидОперации");
	
	Отбор.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск;
	НайденныеСтроки = НачисленнаяЗарплатаИВзносы.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОтпусков.Добавить(), СтрокаТЗ);
		СтрокиКУдалению.Добавить(СтрокаТЗ);
	КонецЦикла;
	
	Отбор.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска;
	НайденныеСтроки = НачисленнаяЗарплатаИВзносы.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОтпусков.Добавить(), СтрокаТЗ);
		СтрокиКУдалению.Добавить(СтрокаТЗ);
	КонецЦикла;
	
	НачисленнаяЗарплатаИВзносы.Индексы.Очистить();
	
	Если ТаблицаОтпусков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	КолонкиСуммирования = Новый Массив;
	КолонкиГруппировок = Новый Массив;
	Для каждого КолонкаТЗ Из ТаблицаОтпусков.Колонки Цикл
		Если КолонкаТЗ.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			КолонкиСуммирования.Добавить(КолонкаТЗ.Имя);
		Иначе
			КолонкиГруппировок.Добавить(КолонкаТЗ.Имя);
		КонецЕсли;
	КонецЦикла;
	КолонкиСуммирования = СтрСоединить(КолонкиСуммирования, ", ");
	КолонкиКопированияСтрока = СтрСоединить(КолонкиГруппировок, ", ");
	
	ТаблицаОтпусков.Свернуть("Сотрудник, СтатьяФинансирования", КолонкиСуммирования);
	Сотрудники = ТаблицаОтпусков.ВыгрузитьКолонку("Сотрудник");
	
	НакопленныеОценочныеОбязательства = РезервыПоОплатеТруда.НакопленныеОценочныеОбязательства(Сотрудники, ПараметрыДляСписанияРасходов);
	
	// ЗУПК
	ГруппыОбязательств = Новый Структура("Начисления, СтраховыеВзносы, ВзносыФСС_НС, СО, СН, ОППВ, ООСМС, ЕП, ОПВР");
	// ЗУПК
	
	ГруппыОбязательств.Начисления = Новый Массив;
	ГруппыОбязательств.Начисления.Добавить("Сумма");
	
	ГруппыОбязательств.ВзносыФСС_НС = Новый Массив;
	ГруппыОбязательств.ВзносыФСС_НС.Добавить("ФССНесчастныеСлучаи");
	
	КолонкиВзносов = Новый Массив;
	Для каждого ИмяПоля Из ОтражениеЗарплатыВУчете.КолонкиВзносов() Цикл
		Если ИмяПоля = "ФССНесчастныеСлучаи" Тогда
			Продолжить;
		КонецЕсли;
		// ЗУПК
		Если ИмяПоля = "СО" ИЛИ ИмяПоля = "СН" ИЛИ ИмяПоля = "ОППВ" 
			ИЛИ ИмяПоля = "ОПВР" ИЛИ ИмяПоля = "ООСМС" ИЛИ ИмяПоля = "ЕП" Тогда
			Продолжить;
		КонецЕсли;
		// ЗУПК
		КолонкиВзносов.Добавить(ИмяПоля);
	КонецЦикла;
	ГруппыОбязательств.СтраховыеВзносы = КолонкиВзносов;
	
	// ЗУПК
	ГруппыОбязательств.СО = Новый Массив;
	ГруппыОбязательств.СО.Добавить("СО");
	
	ГруппыОбязательств.СН = Новый Массив;
	ГруппыОбязательств.СН.Добавить("СН");
	
	ГруппыОбязательств.ОППВ = Новый Массив;
	ГруппыОбязательств.ОППВ.Добавить("ОППВ");
	
	ГруппыОбязательств.ОПВР = Новый Массив;
	ГруппыОбязательств.ОПВР.Добавить("ОПВР");
	
	ГруппыОбязательств.ООСМС = Новый Массив;
	ГруппыОбязательств.ООСМС.Добавить("ООСМС");
	
	ГруппыОбязательств.ЕП = Новый Массив;
	ГруппыОбязательств.ЕП.Добавить("ЕП");
	// ЗУПК
	
	НоваяТаблицаОтпусков = НачисленнаяЗарплатаИВзносы.СкопироватьКолонки();
	НоваяТаблицаОтпусков.Колонки.Добавить("СтрокаОбязательств", Новый ОписаниеТипов("Булево"));
	НоваяТаблицаОтпусков.Колонки.Добавить("СтрокаКорректировки", Новый ОписаниеТипов("Булево"));
	КолонкиГруппировок.Добавить("СтрокаОбязательств");
	КолонкиГруппировок.Добавить("СтрокаКорректировки");
	КолонкиГруппировокСтрока = СтрСоединить(КолонкиГруппировок, ", ");
	
	Отбор = Новый Структура("Сотрудник, СтатьяФинансирования");
	НакопленныеОценочныеОбязательства.Индексы.Добавить("Сотрудник,СтатьяФинансирования");
	
	ОтборОсновнойТаблицы = Новый Структура("Сотрудник,ВидОперации,СтатьяФинансирования");
	НачисленнаяЗарплатаИВзносы.Индексы.Добавить("Сотрудник,СтатьяФинансирования,ВидОперации");
	
	ФормироватьРезервНУ = НастройкиРезервовОтпусков.ФормироватьРезервНУ;
	
	Для каждого СтрокаТЗ Из ТаблицаОтпусков Цикл
		
		СуммаВзносовПоСтрокеРасчетная = 0;
		СуммаВзносовПоСтроке = 0;
		Для каждого КолонкаТЗ Из ТаблицаОтпусков.Колонки Цикл
			Если КолонкиВзносов.Найти(КолонкаТЗ.Имя) <> Неопределено Тогда
				СуммаВзносовПоСтроке = СуммаВзносовПоСтроке + СтрокаТЗ[КолонкаТЗ.Имя];
			КонецЕсли;
		КонецЦикла;
		
		Отбор.Сотрудник            = СтрокаТЗ.Сотрудник;
		Отбор.СтатьяФинансирования = СтрокаТЗ.СтатьяФинансирования;
		ОценочныеОбязательстваСотрудника = НакопленныеОценочныеОбязательства.Скопировать(Отбор);
		
		ТаблицаСтатейФинансирования = ОценочныеОбязательстваСотрудника.Скопировать();
		ТаблицаСтатейФинансирования.Свернуть("СтатьяФинансирования", "Сумма, СтраховыеВзносы, ФССНесчастныеСлучаи");
		
		ОтборОсновнойТаблицы.Сотрудник            = СтрокаТЗ.Сотрудник;
		ОтборОсновнойТаблицы.СтатьяФинансирования = СтрокаТЗ.СтатьяФинансирования;
		ОтборОсновнойТаблицы.ВидОперации          = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск;
		СтрокиОтпуска = НачисленнаяЗарплатаИВзносы.НайтиСтроки(ОтборОсновнойТаблицы);
		
		ОтборОсновнойТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска;
		СтрокиКомпенсации = НачисленнаяЗарплатаИВзносы.НайтиСтроки(ОтборОсновнойТаблицы);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиОтпуска, СтрокиКомпенсации);
		
		Если ОценочныеОбязательстваСотрудника.Количество() = 0 Тогда
			Сумма = 0;
			СтраховыеВзносы = 0;
			СуммаФСС_НС = 0;
			
			// ЗУПК
			СО = 0;
			СН = 0;
			ОППВ = 0;
			ОПВР = 0;
			ООСМС = 0;
			// ЗУПК
		Иначе
			Сумма = Макс(ОценочныеОбязательстваСотрудника.Итог("Сумма"), 0);
			СтраховыеВзносы = Макс(ОценочныеОбязательстваСотрудника.Итог("СтраховыеВзносы"), 0);
			СуммаФСС_НС = Макс(ОценочныеОбязательстваСотрудника.Итог("ФССНесчастныеСлучаи"), 0);
			
			// ЗУПК
			СО = Макс(ОценочныеОбязательстваСотрудника.Итог("СО"), 0);
			СН = Макс(ОценочныеОбязательстваСотрудника.Итог("СН"), 0);
			ОППВ = Макс(ОценочныеОбязательстваСотрудника.Итог("ОППВ"), 0);
			ОПВР = Макс(ОценочныеОбязательстваСотрудника.Итог("ОПВР"), 0);
			ООСМС = Макс(ОценочныеОбязательстваСотрудника.Итог("ООСМС"), 0);
			СтраховыеВзносы = СтраховыеВзносы + СО + СН + ОППВ + ОПВР + ООСМС;
			// ЗУПК
		КонецЕсли;
		
		// ЗУПК
		Если Сумма = 0 И СтраховыеВзносы = 0 И СуммаФСС_НС = 0
			И СО = 0 И СН = 0 И ОППВ = 0 И ОПВР = 0 И ООСМС = 0 Тогда
		// ЗУПК
			
			// нет накопленных сумм ОО
			Для каждого СтрокаОтпуска Из СтрокиОтпуска Цикл
				НоваяСтрокаНУ = НоваяТаблицаОтпусков.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаНУ, СтрокаОтпуска);
				Если ФормироватьРезервНУ И СтрокаОтпуска.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск Тогда
					// ведется учет резервов в НУ
					НоваяСтрокаНУ.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы;
				КонецЕсли;
			КонецЦикла;
			
		// ЗУПК
		ИначеЕсли Сумма >= СтрокаТЗ.Сумма И СтраховыеВзносы >= СуммаВзносовПоСтроке И СуммаФСС_НС >= СтрокаТЗ.ФССНесчастныеСлучаи
				И СО >= СтрокаТЗ.СО И СН >= СтрокаТЗ.СН И ОППВ >= СтрокаТЗ.ОППВ И ОПВР >= СтрокаТЗ.ОПВР И ООСМС >= СтрокаТЗ.ООСМС  Тогда
		// ЗУПК
			
			// суммы всех ОО достаточно для списания
			
			ТаблицаОтпусковВременная = НоваяТаблицаОтпусков.СкопироватьКолонки();
			
			Для каждого СтрокаОтпуска Из СтрокиОтпуска Цикл
				
				ЭтоСтрокаОтпуск = (СтрокаОтпуска.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск);
				Если ФормироватьРезервНУ Тогда
					ВидОперацииОбязательств  = ?(ЭтоСтрокаОтпуск,Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы,Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
				Иначе
					ВидОперацииОбязательств  = ?(ЭтоСтрокаОтпуск,Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства,Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
				КонецЕсли;
				
				НоваяСтрока = ТаблицаОтпусковВременная.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтпуска);
				НоваяСтрока.ВидОперации = ВидОперацииОбязательств;
				
			КонецЦикла;
			
			ТаблицаОтпусковВременная.Свернуть(КолонкиГруппировокСтрока,КолонкиСуммирования);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОтпусковВременная,НоваяТаблицаОтпусков);
			
		Иначе
			
			КоэффициентСуммы   = ?(СтрокаТЗ.Сумма = 0,0, Мин(Сумма/СтрокаТЗ.Сумма,1));
			КоэффициентВзносов = ?(СуммаВзносовПоСтроке = 0,0, Мин(СтраховыеВзносы/СуммаВзносовПоСтроке,1));
			КоэффициентФСС_НС  = ?(СтрокаТЗ.ФССНесчастныеСлучаи = 0,0, Мин(СуммаФСС_НС/СтрокаТЗ.ФССНесчастныеСлучаи,1));
			
            // ЗУПК
			КоэффициентСО      = ?(СтрокаТЗ.СО = 0,0, Мин(СО/СтрокаТЗ.СО,1));
			КоэффициентСН      = ?(СтрокаТЗ.СН = 0,0, Мин(СН/СтрокаТЗ.СН,1));
			КоэффициентОППВ    = ?(СтрокаТЗ.ОППВ = 0,0, Мин(ОППВ/СтрокаТЗ.ОППВ,1));
			КоэффициентОПВР    = ?(СтрокаТЗ.ОПВР = 0,0, Мин(ОПВР/СтрокаТЗ.ОПВР,1));
			КоэффициентООСМС   = ?(СтрокаТЗ.ООСМС = 0,0, Мин(ООСМС/СтрокаТЗ.ООСМС,1));
            // ЗУПК
			
			ТаблицаОтпусковВременная = НоваяТаблицаОтпусков.СкопироватьКолонки();
			
			Для каждого ГруппаОбязательств Из ГруппыОбязательств Цикл
				
				ТаблицаГруппыОбязательств = НоваяТаблицаОтпусков.СкопироватьКолонки();
				СуммаСписанныхОО = 0;
				
				Если ГруппаОбязательств.Ключ = "Начисления" Тогда
					КоэффициентБУ 	   = КоэффициентСуммы;
					СуммаНакопленныхОО = Сумма;
				ИначеЕсли ГруппаОбязательств.Ключ = "ВзносыФСС_НС" Тогда
					КоэффициентБУ      = КоэффициентФСС_НС;
					СуммаНакопленныхОО = СуммаФСС_НС;
					
                // ЗУПК
				ИначеЕсли ГруппаОбязательств.Ключ = "СО" Тогда
					КоэффициентБУ      = КоэффициентСО;
					СуммаНакопленныхОО = СО;
				ИначеЕсли ГруппаОбязательств.Ключ = "СН" Тогда
					КоэффициентБУ      = КоэффициентСН;
					СуммаНакопленныхОО = СН;
				ИначеЕсли ГруппаОбязательств.Ключ = "ОППВ" Тогда
					КоэффициентБУ      = КоэффициентОППВ;
					СуммаНакопленныхОО = ОППВ;
				ИначеЕсли ГруппаОбязательств.Ключ = "ОПВР" Тогда
					КоэффициентБУ      = КоэффициентОПВР;
					СуммаНакопленныхОО = ОПВР;
				ИначеЕсли ГруппаОбязательств.Ключ = "ООСМС" Тогда
					КоэффициентБУ      = КоэффициентООСМС;
					СуммаНакопленныхОО = ООСМС;
				ИначеЕсли ГруппаОбязательств.Ключ = "ЕП" Тогда
                // ЗУПК
					
				Иначе
					КоэффициентБУ      = КоэффициентВзносов;
					СуммаНакопленныхОО = СтраховыеВзносы;
				КонецЕсли;
				
				Для каждого СтрокаОтпуска Из СтрокиОтпуска Цикл
					
					ЭтоСтрокаОтпуск = (СтрокаОтпуска.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск);
					Если ФормироватьРезервНУ Тогда
						ВидОперацииОбязательств  = ?(ЭтоСтрокаОтпуск,Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы,Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
						ВидОперации = ?(ЭтоСтрокаОтпуск,Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы,Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска); 
					Иначе
						ВидОперацииОбязательств  = ?(ЭтоСтрокаОтпуск,Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства,Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);
						ВидОперации = ?(ЭтоСтрокаОтпуск,Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск, Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска);
					КонецЕсли;
					
					КолонкиСуммГруппыОбязательств = ГруппаОбязательств.Значение;
					Для каждого ИмяКолонки Из КолонкиСуммГруппыОбязательств Цикл
						
						Сумма_ОО = ОКР(СтрокаОтпуска[ИмяКолонки] * КоэффициентБУ, 2);
						
						Если Сумма_ОО > 0 Тогда
							
							НоваяСтрока = ТаблицаГруппыОбязательств.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтпуска, КолонкиКопированияСтрока);
							НоваяСтрока[ИмяКолонки] = Сумма_ОО;
							НоваяСтрока.ВидОперации = ВидОперацииОбязательств;
							НоваяСтрока.СтрокаОбязательств  = Истина;
							
							СуммаСписанныхОО = СуммаСписанныхОО + НоваяСтрока[ИмяКолонки];
							
							НоваяСтрока = ТаблицаГруппыОбязательств.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтпуска, КолонкиКопированияСтрока);
							НоваяСтрока.ВидОперации = ВидОперации;
							НоваяСтрока[ИмяКолонки] = СтрокаОтпуска[ИмяКолонки] - Сумма_ОО;
							НоваяСтрока.СтрокаКорректировки  = Истина;
							
						Иначе
							
							НоваяСтрока = ТаблицаГруппыОбязательств.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтпуска, КолонкиКопированияСтрока);
							НоваяСтрока.ВидОперации = ВидОперации;
							НоваяСтрока[ИмяКолонки] = СтрокаОтпуска[ИмяКолонки];
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
				ТаблицаГруппыОбязательств.Свернуть(КолонкиГруппировокСтрока,КолонкиСуммирования);
				РазницаСумма = СуммаСписанныхОО - СуммаНакопленныхОО;
				
				Если РазницаСумма > 0 Тогда
					// списали за счет ОО больше, чем накоплено
					
					СтрокаОбязательств  = ТаблицаГруппыОбязательств.НайтиСтроки(Новый Структура("СтрокаОбязательств", Истина))[0];
					СтрокаКорректировки = ТаблицаГруппыОбязательств.НайтиСтроки(Новый Структура("СтрокаКорректировки", Истина))[0];
					
					Для каждого ИмяКолонки Из КолонкиСуммГруппыОбязательств Цикл
						
						Если РазницаСумма = 0 Тогда
							Прервать;
						КонецЕсли;
						
						Корректировка = МИН(СтрокаОбязательств[ИмяКолонки], РазницаСумма);
						СтрокаОбязательств[ИмяКолонки] = СтрокаОбязательств[ИмяКолонки] - Корректировка;
						РазницаСумма = РазницаСумма - Корректировка;
						
						СтрокаКорректировки[ИмяКолонки] = СтрокаКорректировки[ИмяКолонки] + Корректировка;
						
					КонецЦикла;
					
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаГруппыОбязательств, ТаблицаОтпусковВременная);
				
			КонецЦикла;
			
			ТаблицаОтпусковВременная.Свернуть(КолонкиГруппировокСтрока,КолонкиСуммирования);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОтпусковВременная,НоваяТаблицаОтпусков);
			
		КонецЕсли;
	
	КонецЦикла;
	
	НачисленнаяЗарплатаИВзносы.Индексы.Удалить(0);
	
	Если НоваяТаблицаОтпусков.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтпускаЗаСчетРезервов = НоваяТаблицаОтпусков.СкопироватьКолонки();
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства);

	Отбор = Новый Структура("ВидОперации");
	НоваяТаблицаОтпусков.Индексы.Добавить("ВидОперации");
	Для каждого ВидОперации Из ВидыОпераций Цикл
		Отбор.ВидОперации = ВидОперации;
		НайденныеСтроки = НоваяТаблицаОтпусков.НайтиСтроки(Отбор);
		Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(ОтпускаЗаСчетРезервов.Добавить(), СтрокаТЗ);
		КонецЦикла;
	КонецЦикла;
	
	Если ОтпускаЗаСчетРезервов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТЗ Из ОтпускаЗаСчетРезервов Цикл
		НоваяСтрока = НачисленныеОтпуска.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		СтраховыеВзносы = 0;
		Для каждого ИмяКолонки Из ГруппыОбязательств.СтраховыеВзносы Цикл
			СтраховыеВзносы = СтраховыеВзносы + СтрокаТЗ[ИмяКолонки];
		КонецЦикла;
		НоваяСтрока.СтраховыеВзносы = СтраховыеВзносы;
	КонецЦикла;
	
	КолонкиСуммирования = Новый Массив;
	КолонкиГруппировок = Новый Массив;
	Для каждого КолонкаТЗ Из НачисленныеОтпуска.Колонки Цикл
		Если КолонкаТЗ.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			КолонкиСуммирования.Добавить(КолонкаТЗ.Имя);
		Иначе
			КолонкиГруппировок.Добавить(КолонкаТЗ.Имя);
		КонецЕсли;
	КонецЦикла;
	КолонкиСуммирования = СтрСоединить(КолонкиСуммирования, ", ");
	КолонкиГруппировок = СтрСоединить(КолонкиГруппировок, ", ");
	НачисленныеОтпуска.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	// удалим строки с нулевыми суммами
	Отбор = Новый Структура(КолонкиСуммирования);
	Для каждого ЭлементКоллекции Из Отбор Цикл
		Отбор[ЭлементКоллекции.Ключ] = 0;
	КонецЦикла;
	НайденныеСтроки = НачисленныеОтпуска.НайтиСтроки(Отбор);
	Для каждого СтрокаТЗ Из НайденныеСтроки Цикл
		НачисленныеОтпуска.Удалить(СтрокаТЗ);
	КонецЦикла;
	
	Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		НачисленнаяЗарплатаИВзносы.Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НоваяТаблицаОтпусков, НачисленнаяЗарплатаИВзносы);

КонецПроцедуры

// Формирует движения выплаты отпусков за счет резерва
//
// Параметры:
//			Движения - КоллекцияДвижений - Движения.
//			Отказ - Булево - Отказ.
//			Организация - СправочникСсылка.Организации - Организация.
//			ПериодРегистрации - Дата - ПериодРегистрации.
//			ВыплатаОтпусковЗаСчетРезерва - ТаблицаЗначений - из ОтражениеЗарплатыВБухучете.НоваяТаблицаНачисленоЗаСчетРезерва.
//
Процедура СформироватьДвиженияВыплатаОтпусковЗаСчетРезерва(Движения, Отказ, Организация, ПериодРегистрации, ВыплатаОтпусковЗаСчетРезерва) Экспорт
	
	Если ВыплатаОтпусковЗаСчетРезерва.Колонки.Найти("СтатьяФинансирования") = Неопределено Тогда
		ВыплатаОтпусковЗаСчетРезерва.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	КонецЕсли;
	
	РезервЕжегодныхОтпусков = Справочники.Резервы.РезервЕжегодныхОтпусков();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ПериодРегистрации);
	Запрос.УстановитьПараметр("РезервЕжегодныхОтпусков", РезервЕжегодныхОтпусков);
	Запрос.УстановитьПараметр("ВыплатаОтпусковЗаСчетРезерва", ВыплатаОтпусковЗаСчетРезерва);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыплатаОтпусковЗаСчетРезерва.Сотрудник КАК Сотрудник,
	|	ВыплатаОтпусковЗаСчетРезерва.ВидОперации КАК ВидОперации,
	|	ВыплатаОтпусковЗаСчетРезерва.Резерв КАК Резерв,
	|	ВыплатаОтпусковЗаСчетРезерва.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВыплатаОтпусковЗаСчетРезерва.Сумма КАК Сумма,
	|	ВыплатаОтпусковЗаСчетРезерва.СтраховыеВзносы КАК СтраховыеВзносы,
	// ЗУПК
	|	ВыплатаОтпусковЗаСчетРезерва.СО,
	|	ВыплатаОтпусковЗаСчетРезерва.СН,
	|	ВыплатаОтпусковЗаСчетРезерва.ОППВ,
	|	ВыплатаОтпусковЗаСчетРезерва.ОПВР,
	|	ВыплатаОтпусковЗаСчетРезерва.ООСМС,
	// ЗУПК
	|	ВыплатаОтпусковЗаСчетРезерва.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТВыплаты
	|ИЗ
	|	&ВыплатаОтпусковЗаСчетРезерва КАК ВыплатаОтпусковЗаСчетРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	Выплаты.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Выплаты.СтатьяФинансирования КАК СтатьяФинансирования,
	// ЗУПК
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.СО
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваСО,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.СН
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваСН,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.ОППВ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваОППВ,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.ОПВР
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваОПВР,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.ООСМС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваОтчисленияОСМС,
	// ЗУПК
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерва,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|			ТОГДА Выплаты.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваНУ,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.СтраховыеВзносы
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|			ТОГДА Выплаты.СтраховыеВзносы
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваСтраховыхВзносовНУ,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательства), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпускаОценочныеОбязательства))
	|			ТОГДА Выплаты.ФССНесчастныеСлучаи
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваФССНесчастныеСлучаи,
	|	ВЫБОР
	|		КОГДА Выплаты.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускОценочныеОбязательстваИРезервы), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоЗарплате.ЕжегодныйОтпускРезервы))
	|			ТОГДА Выплаты.ФССНесчастныеСлучаи
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРезерваФССНесчастныеСлучаиНУ,
	|	&РезервЕжегодныхОтпусков КАК Резерв
	|ИЗ
	|	ВТВыплаты КАК Выплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО Выплаты.Сотрудник = Сотрудники.Ссылка";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		
		Для Каждого СтрокаТЗ Из Результат Цикл
			
			НоваяСтрока = Движения.ОценочныеОбязательстваПоСотрудникам.ДобавитьРасход();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
			
		КонецЦикла;
		
		Движения.ОценочныеОбязательстваПоСотрудникам.Записывать = Истина;
	КонецЕсли;

КонецПроцедуры

// Формирует движения списания резерва отпусков в Рнк.ВыплатаОтпусковЗаСчетРезерва
//
// Параметры:
//			Движения - КоллекцияДвижений - Движения.
//			Отказ - Булево - Отказ.
//			Организация - СправочникСсылка.Организации - Организация.
//			ПериодРегистрации - Дата - ПериодРегистрации.
//			ТаблицаОбязательств - ТаблицаЗначений - Соответствует ресурсам Рнк.ОценочныеОбязательстваПоСотрудникам.
//
Процедура СформироватьДвиженияСписаниеРезерваОтпусков(Движения, Отказ, Организация, ПериодРегистрации, ТаблицаОбязательств) Экспорт
	
	Если ТаблицаОбязательств.Колонки.Найти("СтатьяФинансирования") = Неопределено Тогда
		ТаблицаОбязательств.Колонки.Добавить("СтатьяФинансирования", Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаОбязательств", ТаблицаОбязательств);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", ПериодРегистрации);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОбязательств.СуммаРезерва КАК СуммаРезерва,
	|	ТаблицаОбязательств.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ТаблицаОбязательств.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносов,
	|	ТаблицаОбязательств.СуммаРезерваФССНесчастныеСлучаи КАК СуммаРезерваФССНесчастныеСлучаи,
	|	ТаблицаОбязательств.СуммаРезерваНУ КАК СуммаРезерваНУ,
	|	ТаблицаОбязательств.СуммаРезерваСтраховыхВзносовНУ КАК СуммаРезерваСтраховыхВзносовНУ,
	|	ТаблицаОбязательств.СуммаРезерваФССНесчастныеСлучаиНУ КАК СуммаРезерваФССНесчастныеСлучаиНУ,
	// ЗУПК
	|	ТаблицаОбязательств.СуммаРезерваСО КАК СуммаРезерваСО,
	|	ТаблицаОбязательств.СуммаРезерваСН КАК СуммаРезерваСН,
	|	ТаблицаОбязательств.СуммаРезерваОППВ КАК СуммаРезерваОППВ,
	|	ТаблицаОбязательств.СуммаРезерваОПВР КАК СуммаРезерваОПВР,
	|	ТаблицаОбязательств.СуммаРезерваОтчисленияОСМС КАК СуммаРезерваОтчисленияОСМС,
	// ЗУПК
	|	ТаблицаОбязательств.Резерв КАК Резерв,
	|	&Организация КАК Организация,
	|	&Период КАК Период
	|ПОМЕСТИТЬ ВТ_ТаблицаОбязательств
	|ИЗ
	|	&ТаблицаОбязательств КАК ТаблицаОбязательств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация КАК Организация,
	|	ВТ_ТаблицаОбязательств.Период КАК Период,
	|	ВТ_ТаблицаОбязательств.Резерв КАК Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерва) КАК Сумма,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваНУ) КАК СуммаНУ,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВознаграждениям) КАК ТипОценочногоОбязательства,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерва <> 0
	|			ИЛИ ВТ_ТаблицаОбязательств.СуммаРезерваНУ <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ВТ_ТаблицаОбязательств.Резерв
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваСтраховыхВзносов),
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваСтраховыхВзносовНУ),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСтраховымВзносам),
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерваСтраховыхВзносов <> 0
	|			ИЛИ ВТ_ТаблицаОбязательств.СуммаРезерваСтраховыхВзносовНУ <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ВТ_ТаблицаОбязательств.Резерв
	// ЗУПК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваСО),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСО),
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерваСО <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваСН),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСН),
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерваСН <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваОППВ),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоОППВ),
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерваОППВ <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваОтчисленияОСМС),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоООСМС),
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерваОтчисленияОСМС <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваОПВР),
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоОПВР),
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерваОПВР <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования
	// ЗУПК
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.Резерв,
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваФССНесчастныеСлучаи),
	|	СУММА(ВТ_ТаблицаОбязательств.СуммаРезерваФССНесчастныеСлучаиНУ),
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВзносамФССНСиПЗ),
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств
	|ГДЕ
	|	(ВТ_ТаблицаОбязательств.СуммаРезерваФССНесчастныеСлучаи <> 0
	|			ИЛИ ВТ_ТаблицаОбязательств.СуммаРезерваФССНесчастныеСлучаиНУ <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаОбязательств.Организация,
	|	ВТ_ТаблицаОбязательств.Период,
	|	ВТ_ТаблицаОбязательств.СтатьяФинансирования,
	|	ВТ_ТаблицаОбязательств.Резерв
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Организация,
	|	СтатьяФинансирования,
	|	ТипОценочногоОбязательства";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		Движения.ОценочныеОбязательства.Загрузить(Результат);
		Движения.ОценочныеОбязательства.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Распределяет суммы начисленных резервов по способам отражения в учете
// при ручном редактировании сумм резервов.
//
// Параметры:
//			Объект - Объект - Движения.
//			ПересчитатьПолностью - булево, признак необходимости полного пересчета
//
Процедура ПеречитатьОценочныеОбязательства(Объект, ПересчитатьПолностью) Экспорт
	
	Сотрудники = Объект.ИзмененныеДанные.ВыгрузитьКолонку("Сотрудник");
	
	ПересчитатьПолностьюПоСотрудникам = Ложь;
	Если Сотрудники.Количество() = 0 Тогда
		РасчетРезерваОтпусков = Объект.РасчетРезерваОтпусков.Скопировать();
		Сотрудники = РасчетРезерваОтпусков.ВыгрузитьКолонку("Сотрудник");
		ПересчитатьПолностьюПоСотрудникам = Истина;
		ПересчитатьПолностью              = Истина;
	Иначе
		РасчетРезерваОтпусков = Объект.РасчетРезерваОтпусков.СкопироватьКолонки();
		Для Каждого Сотрудник Из Сотрудники Цикл
			МассивСтрок = Объект.РасчетРезерваОтпусков.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
			РасчетРезерваОтпусковВременный = Объект.РасчетРезерваОтпусков.Скопировать(МассивСтрок);
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РасчетРезерваОтпусковВременный, РасчетРезерваОтпусков);
		КонецЦикла;
		
		СотрудникиРасчета     = Объект.РасчетРезерваОтпусков.Скопировать().ВыгрузитьКолонку("Сотрудник");
		РассчитанныеСотрудники = Объект.ОценочныеОбязательстваПоСотрудникам.Скопировать().ВыгрузитьКолонку("Сотрудник");
		ИсключенныеСотрудники = ОбщегоНазначенияКлиентСервер.РазностьМассивов(РассчитанныеСотрудники, СотрудникиРасчета);
		Если ИсключенныеСотрудники.Количество() <> 0 Тогда
			ПересчитатьПолностьюПоСотрудникам = Истина;
			ПересчитатьПолностью              = Истина;
			Для Каждого Сотрудник Из ИсключенныеСотрудники Цикл
				ИсключаемаяСтрока = Объект.ОценочныеОбязательстваПоСотрудникам.Найти(Новый Структура("Сотрудник", Сотрудник));
				Если ИсключаемаяСтрока <> Неопределено Тогда
					Объект.ОценочныеОбязательстваПоСотрудникам.Удалить(ИсключаемаяСтрока);
				КонецЕсли
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицыРасчетаОбязательств = ОтражениеЗарплатыВБухучете.ПараметрыДляРасчетаОценочныхОбязательствОтпусков(Объект.Организация, Объект.ПериодРегистрации, Сотрудники);
	
	ТаблицаСостоянияСотрудников = РезервыПоОплатеТруда.СостоянияСотрудниковДляРасчетаОценочныхОбязательств(Объект.Организация, Сотрудники, Объект.ПериодРегистрации);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОстаткиОтпусков",                 ТаблицыРасчетаОбязательств.ОстаткиОтпусков);
	Запрос.УстановитьПараметр("ФондОплатыТрудаИСтраховыеВзносы", ТаблицыРасчетаОбязательств.ФондОплатыТрудаИСтраховыеВзносы);
	Запрос.УстановитьПараметр("ТаблицаСостоянияСотрудников",     ТаблицаСостоянияСотрудников);
	Запрос.УстановитьПараметр("Регистратор",                     Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиОтпусков.Организация КАК Организация,
	|	ОстаткиОтпусков.Сотрудник КАК Сотрудник,
	|	ОстаткиОтпусков.ОстатокОтпусков КАК ОстатокОтпусков,
	|	ОстаткиОтпусков.ОтпускАвансом КАК ОтпускАвансом,
	|	ОстаткиОтпусков.Подразделение КАК Подразделение,
	|	ОстаткиОтпусков.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ОстаткиОтпусков.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ОстаткиОтпусков.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ОстаткиОтпусков.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТ_ОстаткиОтпусков
	|ИЗ
	|	&ОстаткиОтпусков КАК ОстаткиОтпусков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФондОплатыТрудаИСтраховыеВзносы.Организация КАК Организация,
	|	ФондОплатыТрудаИСтраховыеВзносы.Сотрудник КАК Сотрудник,
	|	ФондОплатыТрудаИСтраховыеВзносы.Подразделение КАК Подразделение,
	|	ФондОплатыТрудаИСтраховыеВзносы.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ФондОплатыТрудаИСтраховыеВзносы.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ФондОплатыТрудаИСтраховыеВзносы.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ФондОплатыТрудаИСтраховыеВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ФондОплатыТрудаИСтраховыеВзносы.ФондОплатыТруда КАК ФондОплатыТруда,
	|	ФондОплатыТрудаИСтраховыеВзносы.СтраховыеВзносы КАК СтраховыеВзносы,
    // ЗУПК
	|	ФондОплатыТрудаИСтраховыеВзносы.СО,
	|	ФондОплатыТрудаИСтраховыеВзносы.СН,
	|	ФондОплатыТрудаИСтраховыеВзносы.ОППВ,
	|	ФондОплатыТрудаИСтраховыеВзносы.ОПВР,
	|	ФондОплатыТрудаИСтраховыеВзносы.ООСМС,
    // ЗУПК
	|	ФондОплатыТрудаИСтраховыеВзносы.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТ_ФондОплатыТрудаИСтраховыеВзносы
	|ИЗ
	|	&ФондОплатыТрудаИСтраховыеВзносы КАК ФондОплатыТрудаИСтраховыеВзносы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСостоянияСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаСостоянияСотрудников.Уволен КАК Уволен,
	|	ТаблицаСостоянияСотрудников.Перемещен КАК Перемещен,
	|	ТаблицаСостоянияСотрудников.Зачислен КАК Зачислен
	|ПОМЕСТИТЬ ВТ_СостоянияСотрудников
	|ИЗ
	|	&ТаблицаСостоянияСотрудников КАК ТаблицаСостоянияСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СпособОтраженияЗарплатыВБухучете
	|	КОНЕЦ КАК СпособОтраженияЗарплатыВБухучете,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СтатьяФинансирования
	|	КОНЕЦ КАК СтатьяФинансирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ФондОплатыТруда
	|	КОНЕЦ КАК ФОТ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СтраховыеВзносы
	|	КОНЕЦ КАК СтраховыеВзносы,
    // ЗУПК
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СО
	|	КОНЕЦ КАК СО,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СН
	|	КОНЕЦ КАК СН,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ОППВ
	|	КОНЕЦ КАК ОППВ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ОПВР
	|	КОНЕЦ КАК ОПВР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ООСМС
	|	КОНЕЦ КАК ОтчисленияОСМС,
    // ЗУПК
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ОблагаетсяЕНВД
	|	КОНЕЦ КАК ОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.МестоВСтруктуреПредприятия
	|	КОНЕЦ КАК МестоВСтруктуреПредприятия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ФССНесчастныеСлучаи
	|	КОНЕЦ КАК ФССНесчастныеСлучаи,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиОтпусков.ОстатокОтпусков, 0)
	|	КОНЕЦ КАК ОстатокОтпуска,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиОтпусков.ОтпускАвансом, 0)
	|	КОНЕЦ КАК ОтпускАвансом,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ) КАК Уволен,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ) КАК Перемещен,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зачислен, ЛОЖЬ) КАК Зачислен
	|ИЗ
	|	ВТ_ФондОплатыТрудаИСтраховыеВзносы КАК ВТ_ФондОплатыТрудаИСтраховыеВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиОтпусков КАК ВТ_ОстаткиОтпусков
	|		ПО (ВТ_ОстаткиОтпусков.Организация = ВТ_ФондОплатыТрудаИСтраховыеВзносы.Организация)
	|			И (ВТ_ОстаткиОтпусков.Сотрудник = ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияСотрудников КАК ВТ_СостоянияСотрудников
	|		ПО ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник = ВТ_СостоянияСотрудников.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиОтпусков.Сотрудник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СпособОтраженияЗарплатыВБухучете
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СтатьяФинансирования
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
    // ЗУПК
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
    // ЗУПК
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОблагаетсяЕНВД
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.МестоВСтруктуреПредприятия
	|	КОНЕЦ,
	|	СУММА(0),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОстатокОтпусков
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОтпускАвансом
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зачислен, ЛОЖЬ)
	|ИЗ
	|	ВТ_ОстаткиОтпусков КАК ВТ_ОстаткиОтпусков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияСотрудников КАК ВТ_СостоянияСотрудников
	|		ПО ВТ_ОстаткиОтпусков.Сотрудник = ВТ_СостоянияСотрудников.Сотрудник
	|ГДЕ
	|	НЕ ВТ_ОстаткиОтпусков.Сотрудник В
	|				(ВЫБРАТЬ
	|					ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_ФондОплатыТрудаИСтраховыеВзносы КАК ВТ_ФондОплатыТрудаИСтраховыеВзносы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СтатьяФинансирования
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОблагаетсяЕНВД
	|	КОНЕЦ,
	|	ВТ_ОстаткиОтпусков.Сотрудник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.МестоВСтруктуреПредприятия
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СпособОтраженияЗарплатыВБухучете
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОстатокОтпусков
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОтпускАвансом
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зачислен, ЛОЖЬ)";
	
	ТаблицаРаспределения = Запрос.Выполнить().Выгрузить();
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерва",                      ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваНУ",                    ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваСтраховыхВзносов",      ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваСтраховыхВзносовНУ",    ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаи",   ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиНУ", ОписаниеТиповЧисло);
	
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваИсчислено",                      ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваИсчисленоНУ",                    ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваСтраховыхВзносовИсчислено",      ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваСтраховыхВзносовИсчисленоНУ",    ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиИсчислено",   ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ", ОписаниеТиповЧисло);
	
    // ЗУПК
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваСО",                    ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваСН",                    ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваОППВ",                  ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваОПВР",                  ОписаниеТиповЧисло);
	ТаблицаРаспределения.Колонки.Добавить("СуммаРезерваОтчисленияОСМС",        ОписаниеТиповЧисло);
    // ЗУПК
	
	Для Каждого СтрокаТаблицы Из РасчетРезерваОтпусков Цикл
		
		ПараметрыОтбора = Новый Структура("Сотрудник",СтрокаТаблицы.Сотрудник);
		МассивСтрок = ТаблицаРаспределения.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() <> 0 Тогда
			
			ИмяКолонкиРаспределения = "ФОТ";
			Если РезервыПоОплатеТруда.ИтогПоКолонкеМассиваСтрок(МассивСтрок, ИмяКолонкиРаспределения) = 0 Тогда
				ИмяКолонкиРаспределения = "ОстатокОтпуска";
			Иначе
				РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "ОстатокОтпуска", "ФОТ");
			КонецЕсли;
			
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерва",                      ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваСтраховыхВзносов",      ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаи",   ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваНУ",                    ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваСтраховыхВзносовНУ",    ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаиНУ", ИмяКолонкиРаспределения);
			
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваИсчислено",                      ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваСтраховыхВзносовИсчислено",      ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаиИсчислено",   ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваИсчисленоНУ",                    ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваСтраховыхВзносовИсчисленоНУ",    ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ", ИмяКолонкиРаспределения);
			
            // ЗУПК
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваСО",                             ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваСН",                             ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваОППВ",                           ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваОПВР",                           ИмяКолонкиРаспределения);
			РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, "СуммаРезерваОтчисленияОСМС",                 ИмяКолонкиРаспределения);
            // ЗУПК
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРаспределения.Свернуть("Сотрудник, МестоВСтруктуреПредприятия, Подразделение,СпособОтраженияЗарплатыВБухучете,СтатьяФинансирования,ОблагаетсяЕНВД, Уволен, Перемещен, Зачислен", 
		"СуммаРезерва,СуммаРезерваНУ,
		|СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовНУ,
		|СуммаРезерваФССНесчастныеСлучаи,СуммаРезерваФССНесчастныеСлучаиНУ,
		|СуммаРезерваИсчислено,СуммаРезерваИсчисленоНУ,
		|СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваСтраховыхВзносовИсчисленоНУ,
		// ЗУПК
		|СуммаРезерваСО,СуммаРезерваСН,СуммаРезерваОППВ,СуммаРезерваОПВР,СуммаРезерваОтчисленияОСМС,
		// ЗУПК
		|СуммаРезерваФССНесчастныеСлучаиИсчислено,СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ");
	
	НастройкиРезервовОтпусков = НастройкиРезервовОтпусков(Объект.Организация, НачалоМесяца(Объект.ПериодРегистрации));
	
	СтруктураПараметровРасчета = РезервыПоОплатеТруда.СтруктураПараметровРасчетаРезервов();
	СтруктураПараметровРасчета.Вставить("Организация",       Объект.Организация);
	СтруктураПараметровРасчета.Вставить("Резерв",            НастройкиРезервовОтпусков.Резерв);
	СтруктураПараметровРасчета.Вставить("Регистратор",       Объект.Ссылка);
	СтруктураПараметровРасчета.Вставить("ПериодРегистрации", Объект.ПериодРегистрации);
	
	
	Если Сотрудники = Неопределено
		ИЛИ ПересчитатьПолностьюПоСотрудникам Тогда
		РезервыПоОплатеТруда.ДополнитьПараметрыРасчетаНакопленнымиРезервами(СтруктураПараметровРасчета);
		РезервыПоОплатеТруда.НакопленныеРезервыПереведенныхСотрудников(ТаблицаРаспределения, СтруктураПараметровРасчета);
		ОпределитьСуммуКорректировкиОстатков(ТаблицаРаспределения, СтруктураПараметровРасчета);
		ОценочныеОбязательстваПоСотрудникам = ТаблицаРаспределения;
	Иначе
		ОценочныеОбязательстваПоСотрудникам = Объект.ОценочныеОбязательстваПоСотрудникам.Скопировать();
		Для Каждого Сотрудник Из Сотрудники Цикл
			МассивСтрокКУдалению = ОценочныеОбязательстваПоСотрудникам.НайтиСтроки(Новый Структура("Сотрудник, КорректировкаОбязательств", Сотрудник, Ложь));
			Для Каждого СтрокаМассива Из МассивСтрокКУдалению Цикл
				ОценочныеОбязательстваПоСотрудникам.Удалить(СтрокаМассива);
			КонецЦикла;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРаспределения, ОценочныеОбязательстваПоСотрудникам);
		РезервыПоОплатеТруда.НакопленныеРезервыПереведенныхСотрудников(ТаблицаРаспределения, СтруктураПараметровРасчета);
	КонецЕсли;
	
	ДобавитьКлючСортировкиТаблицыРезервовОтпусков(ОценочныеОбязательстваПоСотрудникам, Новый Структура("Период", Объект.ПериодРегистрации));
	
	ДополнитьПеренесеннымиОстатками(ОценочныеОбязательстваПоСотрудникам, СтруктураПараметровРасчета);
	
	Объект.ОценочныеОбязательстваПоСотрудникам.Очистить();
	СформироватьТаблицуОценочныеОбязательстваПоСотрудникам(ОценочныеОбязательстваПоСотрудникам, Объект.ОценочныеОбязательстваПоСотрудникам);
	
	Если ПересчитатьПолностью Тогда
		Объект.ОценочныеОбязательства.Очистить();
		СформироватьТаблицуОценочныеОбязательства(ОценочныеОбязательстваПоСотрудникам, Объект.ОценочныеОбязательства);
	КонецЕсли;
	
КонецПроцедуры

// Сворачивает суммы начисленных резервов по способам отражения в учете
// при ручном редактировании сумм резервов.
//
// Параметры:
//			Объект - Объект - Движения.
//
Процедура ОбновитьОтражениеВУчете(Объект) Экспорт
	
	ТаблицаРаспределения = Объект.ОценочныеОбязательстваПоСотрудникам.Скопировать();
	
	Объект.ОценочныеОбязательства.Очистить();
	СформироватьТаблицуОценочныеОбязательства(ТаблицаРаспределения, Объект.ОценочныеОбязательства);
	
КонецПроцедуры

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfbc-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.НачислениеОценочныхОбязательствПоОтпускам);
	
КонецПроцедуры

#КонецОбласти

Функция ПараметрыДляСписанияРасходовПоОплатеОтпуска() Экспорт
	
	ОписаниеПараметров = РезервыПоОплатеТруда.ПараметрыДляСписанияРасходов();
	ДополнениеСтруктуры = Новый Структура("НачисленныеОтпуска");
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОписаниеПараметров, ДополнениеСтруктуры);
	
	// Признак того, что накопленные оценочные обязательства должны включать
	// операции текущего месяца.
	ОписаниеПараметров.УчитыватьОперацииТекущегоМесяца = Истина;
	ОписаниеПараметров.Резерв = Справочники.Резервы.РезервЕжегодныхОтпусков();
	
	Возврат ОписаниеПараметров;

КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать СписатьРасходыПоОтпускамЗаСчетОценочныхОбязательств.
//
// Списывает расходы по оплате отпуска за счет оценочных обязательств
//
// Параметры:
//			Организация - СправочникСсылка.Организации - Организация.
//			ПериодРегистрации - Дата - ПериодРегистрации.
//			ДокументСсылка - ДокументСсылка - ДокументСсылка.
//			ТаблицаНачисленнаяЗарплатаИВзносы - ТаблицаЗначений - из ОтражениеЗарплатыВБухучете.ДанныеДляОтраженияЗарплатыВБухучете.
//			НачисленныеОтпуска - ТаблицаЗначений - из ОтражениеЗарплатыВБухучете.НоваяТаблицаНачисленоЗаСчетРезерва().
//			КолонкиСуммирования - Массив - Имена колонок для суммирования значений.
//
Процедура СписатьРасходыПоОплатеОтпускаЗаСчетОценочныхОбязательств(Организация, ПериодРегистрации, ДокументСсылка, НачисленнаяЗарплатаИВзносы, НачисленныеОтпуска, КолонкиСуммирования) Экспорт

	ПараметрыДляСписанияРасходов = РезервыПоОплатеТруда.ПараметрыДляСписанияРасходов();
	ПараметрыДляСписанияРасходов.Организация 					= Организация;
	ПараметрыДляСписанияРасходов.ПериодРегистрации 				= ПериодРегистрации;
	ПараметрыДляСписанияРасходов.НачисленнаяЗарплатаИВзносы 	= НачисленнаяЗарплатаИВзносы;
	ПараметрыДляСписанияРасходов.НачисленныеОтпуска 			= НачисленныеОтпуска;
	ПараметрыДляСписанияРасходов.ДокументСсылка 				= ДокументСсылка;
	ПараметрыДляСписанияРасходов.Резерв			 				= Справочники.Резервы.РезервЕжегодныхОтпусков();
	СписатьРасходыПоОтпускамЗаСчетОценочныхОбязательств(ПараметрыДляСписанияРасходов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.18.15";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РезервОтпусков.ЗаполнитьАналитикуРезервЕжегодныхОтпусков";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4ee24442-9c92-45ef-a1c2-d49d36ad0575");
	Обработчик.Комментарий = НСтр("ru = 'В регистрах учета резервов заполняется новая аналитика ""Резерв"" предопределенным значением ""Резерв ежегодных отпусков""'");
	
КонецПроцедуры

Процедура ЗаполнитьАналитикуРезервЕжегодныхОтпусков(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОценочныеОбязательства.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательства КАК ОценочныеОбязательства
	|ГДЕ
	|	ОценочныеОбязательства.Резерв = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОценочныеОбязательстваПоСотрудникам.Регистратор
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательстваПоСотрудникам КАК ОценочныеОбязательстваПоСотрудникам
	|ГДЕ
	|	ОценочныеОбязательстваПоСотрудникам.Резерв = ЗНАЧЕНИЕ(Справочник.Резервы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	ВТ_Регистраторы.Регистратор КАК Регистратор
	|ИЗ
	|	ВТ_Регистраторы КАК ВТ_Регистраторы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбработкаЗавершена = РезультатЗапроса.Пустой();
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбработкаЗавершена);
	Если ОбработкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	РезервЕжегодныхОтпусков = Справочники.Резервы.РезервЕжегодныхОтпусков();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрНакопления.ОценочныеОбязательства.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.ОценочныеОбязательства.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Резерв = РезервЕжегодныхОтпусков;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
		// ЗУПК
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		// ЗУПК
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыНакопления.ОценочныеОбязательстваПоСотрудникам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.Резерв = РезервЕжегодныхОтпусков;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
		// ЗУПК
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		// ЗУПК
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область НачислениеРезерваОтпусков

Функция МетодНачисленияРезерваОтпусков(Организация, Период) Экспорт
	
	Возврат УточнитьМетодНачисленияРезерваОтпусков(Организация, Период);

КонецФункции

Функция ПараметрыДляРасчетаОценочныхОбязательствОтпусков(Организация, ПериодРегистрации, Регистратор = Неопределено, Инвентаризация, ОпределятьИзлишкиЕжемесячно) Экспорт
	
	ТаблицыРасчетаОбязательств = ОтражениеЗарплатыВБухучете.ПараметрыДляРасчетаОценочныхОбязательствОтпусков(Организация, ПериодРегистрации);
	
	МассивСотрудников = Новый Массив;
	РезервыПоОплатеТруда.ПолучитьМассивСотрудников(МассивСотрудников, ТаблицыРасчетаОбязательств.ФондОплатыТрудаИСтраховыеВзносы);
	РезервыПоОплатеТруда.ПолучитьМассивСотрудников(МассивСотрудников, ТаблицыРасчетаОбязательств.ОстаткиОтпусков);
	
	ТаблицаСостоянияСотрудников = РезервыПоОплатеТруда.СостоянияСотрудниковДляРасчетаОценочныхОбязательств(Организация, МассивСотрудников, ПериодРегистрации);
	
	Если Инвентаризация Тогда
		РезервОтпусковПереопределяемый.ДополнитьТаблицуОстатковОтпусков(Организация, ПериодРегистрации, ТаблицыРасчетаОбязательств.ОстаткиОтпусков);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОстаткиОтпусков",                 ТаблицыРасчетаОбязательств.ОстаткиОтпусков);
	Запрос.УстановитьПараметр("ФондОплатыТрудаИСтраховыеВзносы", ТаблицыРасчетаОбязательств.ФондОплатыТрудаИСтраховыеВзносы);
	Запрос.УстановитьПараметр("ТаблицаСостоянияСотрудников",     ТаблицаСостоянияСотрудников);
	Запрос.УстановитьПараметр("Регистратор",                     Регистратор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиОтпусков.Организация КАК Организация,
	|	ОстаткиОтпусков.Сотрудник КАК Сотрудник,
	|	ОстаткиОтпусков.ОстатокОтпусков КАК ОстатокОтпусков,
	|	ОстаткиОтпусков.ОтпускАвансом КАК ОтпускАвансом,
	|	ОстаткиОтпусков.Подразделение КАК Подразделение,
	|	ОстаткиОтпусков.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ОстаткиОтпусков.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ОстаткиОтпусков.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ОстаткиОтпусков.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ОстаткиОтпусков.СреднийЗаработок КАК СреднийЗаработок,
	|	ОстаткиОтпусков.РасчетПоСохраняемомуЗаработку КАК РасчетПоСохраняемомуЗаработку
	|ПОМЕСТИТЬ ВТ_ОстаткиОтпусков
	|ИЗ
	|	&ОстаткиОтпусков КАК ОстаткиОтпусков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФондОплатыТрудаИСтраховыеВзносы.Организация КАК Организация,
	|	ФондОплатыТрудаИСтраховыеВзносы.Сотрудник КАК Сотрудник,
	|	ФондОплатыТрудаИСтраховыеВзносы.Подразделение КАК Подразделение,
	|	ФондОплатыТрудаИСтраховыеВзносы.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ФондОплатыТрудаИСтраховыеВзносы.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ФондОплатыТрудаИСтраховыеВзносы.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ФондОплатыТрудаИСтраховыеВзносы.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ФондОплатыТрудаИСтраховыеВзносы.ФондОплатыТруда КАК ФондОплатыТруда,
	|	ФондОплатыТрудаИСтраховыеВзносы.СтраховыеВзносы КАК СтраховыеВзносы,
	|	ФондОплатыТрудаИСтраховыеВзносы.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
    // ЗУПК
    |   ФондОплатыТрудаИСтраховыеВзносы.СО КАК СО,
    |   ФондОплатыТрудаИСтраховыеВзносы.СН КАК СН,
    |   ФондОплатыТрудаИСтраховыеВзносы.ОППВ КАК ОППВ,
    |   ФондОплатыТрудаИСтраховыеВзносы.ОПВР КАК ОПВР,
    |   ФондОплатыТрудаИСтраховыеВзносы.ООСМС КАК ООСМС,
    // ЗУПК
	|	ФондОплатыТрудаИСтраховыеВзносы.РасчетПоСохраняемомуЗаработку КАК РасчетПоСохраняемомуЗаработку
	|ПОМЕСТИТЬ ВТ_ФондОплатыТрудаИСтраховыеВзносы
	|ИЗ
	|	&ФондОплатыТрудаИСтраховыеВзносы КАК ФондОплатыТрудаИСтраховыеВзносы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСостоянияСотрудников.Сотрудник КАК Сотрудник,
	|	ТаблицаСостоянияСотрудников.Уволен КАК Уволен,
    //ЗУПК
    |   ТаблицаСостоянияСотрудников.ВОтпускеПоУходуЗаРебенком КАК ВОтпускеПоУходуЗаРебенком,
    //ЗУПК
	|	ТаблицаСостоянияСотрудников.Перемещен КАК Перемещен,
	|	ТаблицаСостоянияСотрудников.Зачислен КАК Зачислен,
	|	ТаблицаСостоянияСотрудников.Зарезервирован КАК Зарезервирован
	|ПОМЕСТИТЬ ВТ_СостоянияСотрудников
	|ИЗ
	|	&ТаблицаСостоянияСотрудников КАК ТаблицаСостоянияСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Регистратор КАК Регистратор,
	|	ВТ_ФондОплатыТрудаИСтраховыеВзносы.Организация КАК Организация,
	|	ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник КАК Сотрудник,
	|	ВТ_ФондОплатыТрудаИСтраховыеВзносы.РасчетПоСохраняемомуЗаработку КАК РасчетПоСохраняемомуЗаработку,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СпособОтраженияЗарплатыВБухучете
	|	КОНЕЦ КАК СпособОтраженияЗарплатыВБухучете,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СтатьяФинансирования
	|	КОНЕЦ КАК СтатьяФинансирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ФондОплатыТруда
	|	КОНЕЦ КАК ФОТ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СтраховыеВзносы
	|	КОНЕЦ КАК СтраховыеВзносы,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиОтпусков.ОстатокОтпусков, 0)
	|	КОНЕЦ КАК ОстатокОтпуска,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиОтпусков.ОтпускАвансом, 0)
	|	КОНЕЦ КАК ОтпускАвансом,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_ОстаткиОтпусков.СреднийЗаработок, 0)
	|	КОНЕЦ КАК СреднийЗаработок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ОблагаетсяЕНВД
	|	КОНЕЦ КАК ОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.МестоВСтруктуреПредприятия
	|	КОНЕЦ КАК МестоВСтруктуреПредприятия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ФССНесчастныеСлучаи
	|	КОНЕЦ КАК ФССНесчастныеСлучаи,
    // ЗУПК
	|   ВЫБОР
    |       КОГДА ВТ_СостоянияСотрудников.Уволен
    |           ТОГДА 0
    |       ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СО
    |   КОНЕЦ КАК СО,
    |   ВЫБОР
    |       КОГДА ВТ_СостоянияСотрудников.Уволен
    |           ТОГДА 0
    |       ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.СН
    |   КОНЕЦ КАК СН,
    |   ВЫБОР
    |       КОГДА ВТ_СостоянияСотрудников.Уволен
    |           ТОГДА 0
    |       ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ОППВ
    |   КОНЕЦ КАК ОППВ,
    |   ВЫБОР
    |       КОГДА ВТ_СостоянияСотрудников.Уволен
    |           ТОГДА 0
    |       ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ОПВР
    |   КОНЕЦ КАК ОПВР,
    |   ВЫБОР
    |       КОГДА ВТ_СостоянияСотрудников.Уволен
    |           ТОГДА 0
    |       ИНАЧЕ ВТ_ФондОплатыТрудаИСтраховыеВзносы.ООСМС
    |   КОНЕЦ КАК ООСМС,
    // ЗУПК
	|	0 КАК ТекущаяСтавкаСтраховыхВзносов,
	|	0 КАК ТекущаяСтавкаФССНесчастныеСлучаи,
    //ЗУПК
    |   ЕСТЬNULL(ВТ_СостоянияСотрудников.ВОтпускеПоУходуЗаРебенком, ЛОЖЬ) КАК ВОтпускеПоУходуЗаРебенком,
    //ЗУПК
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ) КАК Уволен,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ) КАК Перемещен,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зачислен, ЛОЖЬ) КАК Зачислен,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зарезервирован, ЛОЖЬ) КАК Зарезервирован
	|ПОМЕСТИТЬ ВТ_СводнаяТаблица
	|ИЗ
	|	ВТ_ФондОплатыТрудаИСтраховыеВзносы КАК ВТ_ФондОплатыТрудаИСтраховыеВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиОтпусков КАК ВТ_ОстаткиОтпусков
	|		ПО (ВТ_ОстаткиОтпусков.Организация = ВТ_ФондОплатыТрудаИСтраховыеВзносы.Организация)
	|			И (ВТ_ОстаткиОтпусков.Сотрудник = ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияСотрудников КАК ВТ_СостоянияСотрудников
	|		ПО ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник = ВТ_СостоянияСотрудников.Сотрудник
    |ГДЕ
    |   (ВТ_СостоянияСотрудников.ВОтпускеПоУходуЗаРебенком ЕСТЬ NULL ИЛИ НЕ ВТ_СостоянияСотрудников.ВОтпускеПоУходуЗаРебенком)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Регистратор,
	|	ВТ_ОстаткиОтпусков.Организация,
	|	ВТ_ОстаткиОтпусков.Сотрудник,
	|	ВТ_ОстаткиОтпусков.РасчетПоСохраняемомуЗаработку,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СпособОтраженияЗарплатыВБухучете
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СтатьяФинансирования
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОстатокОтпусков
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОтпускАвансом
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СреднийЗаработок
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОблагаетсяЕНВД
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.МестоВСтруктуреПредприятия
	|	КОНЕЦ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(0),
    |   СУММА(0),
    |   СУММА(0),
    |   СУММА(0),
    |   СУММА(0),
    |   СУММА(0),
    //ЗУПК
    |   ЕСТЬNULL(ВТ_СостоянияСотрудников.ВОтпускеПоУходуЗаРебенком, ЛОЖЬ) КАК ВОтпускеПоУходуЗаРебенком,
    //ЗУПК
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зачислен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зарезервирован, ЛОЖЬ)
	|ИЗ
	|	ВТ_ОстаткиОтпусков КАК ВТ_ОстаткиОтпусков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияСотрудников КАК ВТ_СостоянияСотрудников
	|		ПО ВТ_ОстаткиОтпусков.Сотрудник = ВТ_СостоянияСотрудников.Сотрудник
	|ГДЕ
	|	НЕ ВТ_ОстаткиОтпусков.Сотрудник В
	|				(ВЫБРАТЬ
	|					ВТ_ФондОплатыТрудаИСтраховыеВзносы.Сотрудник КАК Сотрудник
	|				ИЗ
	|					ВТ_ФондОплатыТрудаИСтраховыеВзносы КАК ВТ_ФондОплатыТрудаИСтраховыеВзносы)
    |   И (ВТ_СостоянияСотрудников.ВОтпускеПоУходуЗаРебенком ЕСТЬ NULL ИЛИ НЕ ВТ_СостоянияСотрудников.ВОтпускеПоУходуЗаРебенком)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиОтпусков.Сотрудник,
	|	ВТ_ОстаткиОтпусков.Организация,
	|	ВТ_ОстаткиОтпусков.РасчетПоСохраняемомуЗаработку,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОстатокОтпусков
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОтпускАвансом
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Уволен, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СреднийЗаработок
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СпособОтраженияЗарплатыВБухучете
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.СтатьяФинансирования
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.ОблагаетсяЕНВД
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СостоянияСотрудников.Перемещен, ЛОЖЬ)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВТ_ОстаткиОтпусков.МестоВСтруктуреПредприятия
	|	КОНЕЦ,
    |   ЕСТЬNULL(ВТ_СостоянияСотрудников.ВОтпускеПоУходуЗаРебенком, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зачислен, ЛОЖЬ),
	|	ЕСТЬNULL(ВТ_СостоянияСотрудников.Зарезервирован, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СводнаяТаблица.Регистратор КАК Регистратор,
	|	ВТ_СводнаяТаблица.Организация КАК Организация,
	|	ВТ_СводнаяТаблица.Сотрудник КАК Сотрудник,
	|	ВТ_СводнаяТаблица.РасчетПоСохраняемомуЗаработку КАК РасчетПоСохраняемомуЗаработку,
	|	ВТ_СводнаяТаблица.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ВТ_СводнаяТаблица.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВТ_СводнаяТаблица.ФОТ КАК ФОТ,
	|	ВТ_СводнаяТаблица.СтраховыеВзносы КАК СтраховыеВзносы,
	|	ВТ_СводнаяТаблица.ОстатокОтпуска КАК ОстатокОтпуска,
	|	ВТ_СводнаяТаблица.ОтпускАвансом КАК ОтпускАвансом,
	|	ВТ_СводнаяТаблица.СреднийЗаработок КАК СреднийЗаработок,
	|	ВТ_СводнаяТаблица.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	ВТ_СводнаяТаблица.Подразделение КАК Подразделение,
	|	ВТ_СводнаяТаблица.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ВТ_СводнаяТаблица.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	ВТ_СводнаяТаблица.ТекущаяСтавкаСтраховыхВзносов КАК ТекущаяСтавкаСтраховыхВзносов,
	|	ВТ_СводнаяТаблица.ТекущаяСтавкаФССНесчастныеСлучаи КАК ТекущаяСтавкаФССНесчастныеСлучаи,
	|	ВТ_СводнаяТаблица.Уволен КАК Уволен,
	|	ВТ_СводнаяТаблица.Перемещен КАК Перемещен,
	|	ВТ_СводнаяТаблица.Зачислен КАК Зачислен,
    // ЗУПК
	|   ВТ_СводнаяТаблица.СО КАК СО,
    |   ВТ_СводнаяТаблица.СН КАК СН,
    |   ВТ_СводнаяТаблица.ОППВ КАК ОППВ,
    |   ВТ_СводнаяТаблица.ОПВР КАК ОПВР,
    |   ВТ_СводнаяТаблица.ООСМС КАК ОтчисленияОСМС,
    |   ВТ_СводнаяТаблица.ВОтпускеПоУходуЗаРебенком КАК ВОтпускеПоУходуЗаРебенком,
    // ЗУПК
	|	ВТ_СводнаяТаблица.Зарезервирован КАК Зарезервирован
	|ИЗ
	|	ВТ_СводнаяТаблица КАК ВТ_СводнаяТаблица";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Инвентаризация Тогда
		ТаблицыСтавокСтраховыхВзносов = ОтражениеЗарплатыВБухучете.ПараметрыДляИнвентаризацииОценочныхОбязательствОтпусков(Организация, ПериодРегистрации);
		СтавкиВзносовФСС_НС    = ТаблицыСтавокСтраховыхВзносов.СтавкиВзносовФСС_НС;
		СтавкиСтраховыхВзносов = ТаблицыСтавокСтраховыхВзносов.СтавкиСтраховыхВзносов;
		Для Каждого СтрокаТаблицы Из Результат Цикл
			ПараметрыОтбора = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
			МассивСтрок = СтавкиВзносовФСС_НС.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				СтрокаТаблицы.ТекущаяСтавкаФССНесчастныеСлучаи = СтрокаМассива.Ставка;
			КонецЦикла;
			МассивСтрок = СтавкиСтраховыхВзносов.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				Для Каждого Колонка Из СтавкиСтраховыхВзносов.Колонки Цикл
					Если Колонка.Имя <> "Сотрудник" И Колонка.Имя <> "ФизическоеЛицо" Тогда
						СтрокаТаблицы.ТекущаяСтавкаСтраховыхВзносов = СтрокаТаблицы.ТекущаяСтавкаСтраховыхВзносов + СтрокаМассива[Колонка.Имя];
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СобратьДанныеДляНачислениеРезерваОтпусков(Регистратор, Организация, ПериодРегистрации, РасчетРезерваОтпусков, ОценочныеОбязательства, ОценочныеОбязательстваПоСотрудникам) Экспорт
	
	Реквизиты = Новый Структура("Организация, Период", Организация, ПериодРегистрации);
	
	НастройкиРезервовОтпусков   = НастройкиРезервовОтпусков(Организация, НачалоМесяца(ПериодРегистрации));
	ФормироватьРезервБУ         = НастройкиРезервовОтпусков.ФормироватьРезервБУ;
	ФормироватьРезервНУ         = НастройкиРезервовОтпусков.ФормироватьРезервНУ;
	ОпределятьИзлишкиЕжемесячно = НастройкиРезервовОтпусков.ОпределятьИзлишкиЕжемесячно;
	Резерв                      = НастройкиРезервовОтпусков.Резерв;
		
	Если НЕ ФормироватьРезервБУ И НЕ ФормироватьРезервНУ Тогда
		Возврат;
	КонецЕсли;
	
	МетодНачисленияРезерваОтпусков              = НастройкиРезервовОтпусков.МетодНачисленияРезерваОтпусков;
	НормативныйМетодБУ                          = МетодНачисленияРезерваОтпусков = Перечисления.МетодыНачисленияРезервовПоОплатеТруда.НормативныйМетод;
	НормативОтчисленийВРезервОтпусков           = НастройкиРезервовОтпусков.НормативОтчисленийВРезервОтпусков;
	ПредельнаяВеличинаОтчисленийВРезервОтпусков = НастройкиРезервовОтпусков.ПредельнаяВеличинаОтчисленийВРезервОтпусков;
	Инвентаризация                              = КонецМесяца(ПериодРегистрации) = КонецГода(ПериодРегистрации);
	
	ПараметрыРасчетаОбязательств = ПараметрыДляРасчетаОценочныхОбязательствОтпусков(Организация, ПериодРегистрации, Регистратор, Инвентаризация, ОпределятьИзлишкиЕжемесячно);
	
	УстановитьПривилегированныйРежим(Истина);
	Организации                  = РезервыПоОплатеТруда.ВсяОрганизация(Организация);
	ДолиРезервовОтпусков         = ДолиРезервовОтпусков(ПериодРегистрации, Организация, Резерв, Регистратор);
	ТаблицаНакопленныхРезервов   = РезервыПоОплатеТруда.НакопленоРезерваПоВсейОрганизации(ПериодРегистрации, Организации, Резерв, Регистратор, Истина);
	
	ВсегоНакопленоРезервов = ТаблицаНакопленныхРезервов.Итог("НакопленныйРезерв");
	Если ПредельнаяВеличинаОтчисленийВРезервОтпусков > ВсегоНакопленоРезервов Тогда
		ПредельнаяВеличинаОтчисленийТекущегоМесяца = ПредельнаяВеличинаОтчисленийВРезервОтпусков - ВсегоНакопленоРезервов;
	Иначе
		ПредельнаяВеличинаОтчисленийТекущегоМесяца = 0;
	КонецЕсли;
	ПредельнаяВеличинаОтчисленийОрганизации = Окр(ДолиРезервовОтпусков.ДоляРезервовОтпусков * ПредельнаяВеличинаОтчисленийТекущегоМесяца, 2);
	
	ВсегоНакопленоРезервовНУ = ТаблицаНакопленныхРезервов.Итог("НакопленныйРезервНУ");
	Если ПредельнаяВеличинаОтчисленийВРезервОтпусков > ВсегоНакопленоРезервовНУ Тогда
		ПредельнаяВеличинаОтчисленийТекущегоМесяцаНУ = ПредельнаяВеличинаОтчисленийВРезервОтпусков - ВсегоНакопленоРезервовНУ;
	Иначе
		ПредельнаяВеличинаОтчисленийТекущегоМесяцаНУ = 0;
	КонецЕсли;
	ПредельнаяВеличинаОтчисленийОрганизацииНУ = Окр(ДолиРезервовОтпусков.ДоляРезервовОтпусковНУ * ПредельнаяВеличинаОтчисленийТекущегоМесяцаНУ, 2);
	
	СтруктураПараметровРасчета = РезервыПоОплатеТруда.СтруктураПараметровРасчетаРезервов();
	СтруктураПараметровРасчета.Вставить("Организация",                                  Организация);
	СтруктураПараметровРасчета.Вставить("Регистратор",                                  Регистратор);
	СтруктураПараметровРасчета.Вставить("ПериодРегистрации",                            ПериодРегистрации);
	СтруктураПараметровРасчета.Вставить("Инвентаризация",                               Инвентаризация);
	СтруктураПараметровРасчета.Вставить("ОпределятьИзлишкиЕжемесячно",                  ОпределятьИзлишкиЕжемесячно);
	СтруктураПараметровРасчета.Вставить("Резерв",                                       Резерв);
	СтруктураПараметровРасчета.Вставить("ФормироватьРезервБУ",                          ФормироватьРезервБУ);
	СтруктураПараметровРасчета.Вставить("ФормироватьРезервНУ",                          ФормироватьРезервНУ);
	СтруктураПараметровРасчета.Вставить("МетодНачисленияРезерваОтпусков",               МетодНачисленияРезерваОтпусков);
	СтруктураПараметровРасчета.Вставить("ОграничиватьНачислениеПредельнойСуммойБУ",     НормативныйМетодБУ);
	СтруктураПараметровРасчета.Вставить("ОграничиватьНачислениеПредельнойСуммойНУ",     Истина);
	СтруктураПараметровРасчета.Вставить("НормативныйМетодБУ",                           НормативныйМетодБУ);
	СтруктураПараметровРасчета.Вставить("НормативныйМетодНУ",                           ФормироватьРезервНУ);
	СтруктураПараметровРасчета.Вставить("НормативОтчисленийВРезервОтпусков",            НормативОтчисленийВРезервОтпусков);
	СтруктураПараметровРасчета.Вставить("ПредельнаяВеличинаОтчисленийВРезерв",          ПредельнаяВеличинаОтчисленийВРезервОтпусков);
	СтруктураПараметровРасчета.Вставить("ПредельнаяВеличинаОтчисленийТекущегоМесяца",   ПредельнаяВеличинаОтчисленийТекущегоМесяца);
	СтруктураПараметровРасчета.Вставить("ПредельнаяВеличинаОтчисленийОрганизации",      ПредельнаяВеличинаОтчисленийОрганизации);
	СтруктураПараметровРасчета.Вставить("ПредельнаяВеличинаОтчисленийТекущегоМесяцаНУ", ПредельнаяВеличинаОтчисленийТекущегоМесяцаНУ);
	СтруктураПараметровРасчета.Вставить("ПредельнаяВеличинаОтчисленийОрганизацииНУ",    ПредельнаяВеличинаОтчисленийОрганизацииНУ);
	СтруктураПараметровРасчета.Вставить("АрхивныйРасчет",                               Истина);
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерва",                               ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСтраховыхВзносов",               ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаи",            ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваНУ",                             ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСтраховыхВзносовНУ",             ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиНУ",          ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваНакоплено",                      ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСтраховыхВзносовНакоплено",      ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиНакоплено",   ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваНакопленоНУ",                    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСтраховыхВзносовНакопленоНУ",    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиНакопленоНУ", ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваИсчислено",                      ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСтраховыхВзносовИсчислено",      ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиИсчислено",   ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваИсчисленоНУ",                    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСтраховыхВзносовИсчисленоНУ",    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ", ОписаниеТиповЧисло);
	
	ПараметрыРасчетаОбязательств.Колонки.Добавить("ФиксСтрока",     Новый ОписаниеТипов("Булево"));
	ПараметрыРасчетаОбязательств.Колонки.Добавить("ФиксРасчет",     Новый ОписаниеТипов("Булево"));
	ПараметрыРасчетаОбязательств.Колонки.Добавить("ФиксЗаполнение", Новый ОписаниеТипов("Булево"));
	
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСО",                             ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСОНакоплено",                    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСОИсчислено",                    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСН",                             ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСННакоплено",                    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваСНИсчислено",                    ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОППВ",                           ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОППВНакоплено",                  ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОППВИсчислено",                  ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОПВР",                           ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОПВРНакоплено",                  ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОПВРИсчислено",                  ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОтчисленияОСМС",                 ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОтчисленияОСМСНакоплено",        ОписаниеТиповЧисло);
	ПараметрыРасчетаОбязательств.Колонки.Добавить("СуммаРезерваОтчисленияОСМСИсчислено",        ОписаниеТиповЧисло);
	
	РассчитатьСуммыРезервовОтпусков(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета);
	РезервыПоОплатеТруда.ВычислитьСуммыРезервовТекущегоМесяца(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета, Реквизиты, Регистратор);
	
	ОпределитьСуммуКорректировкиОстатков(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета);
	
	ДобавитьКлючСортировкиТаблицыРезервовОтпусков(ПараметрыРасчетаОбязательств, Реквизиты);
	
	СформироватьТаблицуРасчетаРезерваОтпусков(ПараметрыРасчетаОбязательств, Реквизиты, РасчетРезерваОтпусков, СтруктураПараметровРасчета);
	
	ДополнитьПеренесеннымиОстатками(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета);
	
	СформироватьТаблицуОценочныеОбязательстваПоСотрудникам(ПараметрыРасчетаОбязательств, ОценочныеОбязательстваПоСотрудникам);
	СформироватьТаблицуОценочныеОбязательства(ПараметрыРасчетаОбязательств, ОценочныеОбязательства);
	
КонецПроцедуры

Процедура ДобавитьКлючСортировкиТаблицыРезервовОтпусков(ПараметрыРасчетаОбязательств, Реквизиты)
	
	СортируемыеКоллекции = Новый Массив;
	
	Коллекция = СотрудникиФормы.СортируемаяКоллекцияСотрудников(ПараметрыРасчетаОбязательств);
	Коллекция.ОписаниеКоллекции.Псевдоним                    = "Коллекция";
	Коллекция.ОписаниеКоллекции.ИмяПоляСотрудник             = "Сотрудник";
	Коллекция.ОписаниеКоллекции.ИмяПоляПодразделение         = "Подразделение";
	Коллекция.ОписаниеКоллекции.ЗначениеПоляПериод           = Реквизиты.Период;
	Коллекция.ОписаниеКоллекции.ДополнительныеПоляСортировки = Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда 
		СотрудникиФормы.ДобавитьДополнительноеПолеСортировки(Коллекция, "МестоВСтруктуреПредприятия",
			Метаданные.ОпределяемыеТипы.МестоВСтруктуреПредприятия.Тип);
	КонецЕсли;
		
	СотрудникиФормы.ДобавитьДополнительноеПолеСортировки(Коллекция, "СпособОтраженияЗарплатыВБухУчете",
		Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете"));
	
	СотрудникиФормы.ДобавитьДополнительноеПолеСортировки(Коллекция, "СтатьяФинансирования",
		Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	
	СотрудникиФормы.ДобавитьДополнительноеПолеСортировки(Коллекция, "ОблагаетсяЕНВД",
		Новый ОписаниеТипов("Булево"));
	
	СотрудникиФормы.ДобавитьДополнительноеПолеСортировки(Коллекция, "КорректировкаОбязательств",
			Новый ОписаниеТипов("Булево"));
	
	СортируемыеКоллекции.Добавить(Коллекция);
	
	НастройкиСортировки = СотрудникиФормы.НастройкиСортировкиПоУмолчанию();
	
	УстановитьПривилегированныйРежим(Истина);
	ПорядокСортировки = СотрудникиФормы.ПорядокСтрокКоллекцийСотрудников(СортируемыеКоллекции, НастройкиСортировки);
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыРасчетаОбязательств.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
		
	Для Каждого КлючЗначение Из ПорядокСортировки Цикл
		
		Для Каждого СтрокаПорядка Из КлючЗначение.Значение Цикл
			СтрокаТаблицы = ПараметрыРасчетаОбязательств[СтрокаПорядка.ИндексСтрокиИсходнойТаблицы];
			СтрокаТаблицы.Порядок = СтрокаПорядка.Порядок;	
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьТаблицуРасчетаРезерваОтпусков(ТаблицаОбязательств, Реквизиты, РасчетРезерваОтпусков, СтруктураПараметровРасчета)
	
	МассивСтрокРасчета = ТаблицаОбязательств.НайтиСтроки(Новый Структура("КорректировкаОбязательств", Ложь));
	ТаблицаРезервов    = ТаблицаОбязательств.Скопировать(МассивСтрокРасчета);
	
	МассивСтрокУволенных = ТаблицаРезервов.НайтиСтроки(Новый Структура("Уволен", Истина));
	Для Каждого СтрокаТаблицы Из МассивСтрокУволенных Цикл
		
		Если СтрокаТаблицы.СуммаРезерва = 0
			И СтрокаТаблицы.СуммаРезерваНУ = 0
			И (СтрокаТаблицы.СуммаРезерва - СтрокаТаблицы.СуммаРезерваНУ) = 0
			И СтрокаТаблицы.СуммаРезерваСтраховыхВзносов = 0
			И СтрокаТаблицы.СуммаРезерваСтраховыхВзносовНУ = 0
			И (СтрокаТаблицы.СуммаРезерваСтраховыхВзносов - СтрокаТаблицы.СуммаРезерваСтраховыхВзносовНУ) = 0
			И СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаи = 0
			И СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиНУ = 0
			И (СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаи - СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиНУ) = 0
			И СтрокаТаблицы.СуммаРезерваСО = 0
			И СтрокаТаблицы.СуммаРезерваСН = 0
			И СтрокаТаблицы.СуммаРезерваОППВ = 0
			И СтрокаТаблицы.СуммаРезерваОПВР = 0
			И СтрокаТаблицы.СуммаРезерваОтчисленияОСМС = 0
			Тогда
			
			ТаблицаРезервов.Удалить(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРезервов.Сортировать("Порядок");
	
	ПараметрыСвертки      = "Сотрудник,РасчетПоСохраняемомуЗаработку";
	ПараметрыСуммирования = "ФОТ,СтраховыеВзносы,ФССНесчастныеСлучаи,
        // ЗУПК
		|СО,СН,ОППВ,ОПВР,ОтчисленияОСМС,
        // ЗУПК
		|СуммаРезерваНакоплено,СуммаРезерваСтраховыхВзносовНакоплено,СуммаРезерваФССНесчастныеСлучаиНакоплено,
		|СуммаРезерваСОНакоплено,СуммаРезерваСННакоплено,СуммаРезерваОППВНакоплено,СуммаРезерваОПВРНакоплено,СуммаРезерваОтчисленияОСМСНакоплено,
		|СуммаРезерваНакопленоНУ,СуммаРезерваСтраховыхВзносовНакопленоНУ,СуммаРезерваФССНесчастныеСлучаиНакопленоНУ,
		|СуммаРезерваИсчислено,СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваФССНесчастныеСлучаиИсчислено,
        // ЗУПК
		|СуммаРезерваСОИсчислено,СуммаРезерваСНИсчислено,СуммаРезерваОППВИсчислено,СуммаРезерваОПВРИсчислено,СуммаРезерваОтчисленияОСМСИсчислено,
        // ЗУПК
		|СуммаРезерваИсчисленоНУ,СуммаРезерваСтраховыхВзносовИсчисленоНУ,СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ,
		|СуммаРезерва,СуммаРезерваСтраховыхВзносов,СуммаРезерваФССНесчастныеСлучаи,
        // ЗУПК
		|СуммаРезерваСО,СуммаРезерваСН,СуммаРезерваОППВ,СуммаРезерваОПВР,СуммаРезерваОтчисленияОСМС,
        // ЗУПК
		|СуммаРезерваНУ,СуммаРезерваСтраховыхВзносовНУ,СуммаРезерваФССНесчастныеСлучаиНУ";
	
	Если СтруктураПараметровРасчета.МетодНачисленияРезерваОтпусков = Перечисления.МетодыНачисленияРезервовПоОплатеТруда.МетодОбязательств
		ИЛИ СтруктураПараметровРасчета.Инвентаризация Тогда
		ПараметрыСвертки      = ПараметрыСвертки + ",СреднийЗаработок,ТекущаяСтавкаСтраховыхВзносов,ТекущаяСтавкаФССНесчастныеСлучаи";
		ПараметрыСуммирования = ПараметрыСуммирования + ",ОстатокОтпуска,ОтпускАвансом";
	КонецЕсли;
	
	ТаблицаРезервов.Свернуть(ПараметрыСвертки, ПараметрыСуммирования);
	
	ТаблицаРезервов.Колонки.Добавить("Организация");
	ТаблицаРезервов.Колонки.Добавить("ПериодРасчета");
	ТаблицаРезервов.ЗаполнитьЗначения(Реквизиты.Организация, "Организация");
	ТаблицаРезервов.ЗаполнитьЗначения(Реквизиты.Период, "ПериодРасчета");
	
	РасчетРезерваОтпусков = ТаблицаРезервов.Скопировать();
	
КонецПроцедуры

Процедура СформироватьТаблицуОценочныеОбязательства(ТаблицаОбязательств, ОценочныеОбязательства)
	
	ТаблицаРезервов = ТаблицаОбязательств.Скопировать(Новый Структура("КорректировкаОбязательств", Ложь));
	
	ТаблицаРезервов.Свернуть("МестоВСтруктуреПредприятия, Подразделение, СпособОтраженияЗарплатыВБухУчете, СтатьяФинансирования, ОблагаетсяЕНВД",	
    // ЗУПК
	"СуммаРезерва,СуммаРезерваНУ,СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовНУ,СуммаРезерваФССНесчастныеСлучаи,СуммаРезерваФССНесчастныеСлучаиНУ,
 	|СуммаРезерваСО,СуммаРезерваСН,СуммаРезерваОППВ,СуммаРезерваОПВР,СуммаРезерваОтчисленияОСМС");
    // ЗУПК

	ТаблицаРезервов.Сортировать("МестоВСтруктуреПредприятия, Подразделение, СпособОтраженияЗарплатыВБухУчете, СтатьяФинансирования, ОблагаетсяЕНВД, СуммаРезерва, СуммаРезерваСтраховыхВзносов, СуммаРезерваФССНесчастныеСлучаи");
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезервов Цикл
		
		Если СтрокаТаблицы.СуммаРезерва = 0
			И СтрокаТаблицы.СуммаРезерваНУ = 0
			И (СтрокаТаблицы.СуммаРезерва - СтрокаТаблицы.СуммаРезерваНУ) = 0
			И СтрокаТаблицы.СуммаРезерваСтраховыхВзносов = 0
			И СтрокаТаблицы.СуммаРезерваСтраховыхВзносовНУ = 0
			И (СтрокаТаблицы.СуммаРезерваСтраховыхВзносов - СтрокаТаблицы.СуммаРезерваСтраховыхВзносовНУ) = 0 
			И СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаи = 0
			И СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиНУ = 0
			И (СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаи - СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиНУ) = 0
			И СтрокаТаблицы.СуммаРезерваСО = 0
			И СтрокаТаблицы.СуммаРезерваСН = 0
			И СтрокаТаблицы.СуммаРезерваОППВ = 0
			И СтрокаТаблицы.СуммаРезерваОПВР = 0
			И СтрокаТаблицы.СуммаРезерваОтчисленияОСМС = 0
			Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ОценочныеОбязательства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;
	
	ОценочныеОбязательства.Сортировать("МестоВСтруктуреПредприятия, Подразделение, СпособОтраженияЗарплатыВБухучете, СтатьяФинансирования, ОблагаетсяЕНВД");
	
КонецПроцедуры

Процедура СформироватьТаблицуОценочныеОбязательстваПоСотрудникам(ТаблицаОбязательств, ОценочныеОбязательстваПоСотрудникам)
	
	ТаблицаРезервов =  ТаблицаОбязательств.Скопировать();
	
	ТаблицаРезервов.Сортировать("Порядок");
	
	ТаблицаРезервов.Свернуть("Сотрудник, МестоВСтруктуреПредприятия, Подразделение, СпособОтраженияЗарплатыВБухУчете, СтатьяФинансирования, ОблагаетсяЕНВД, КорректировкаОбязательств",
    // ЗУПК
	"СуммаРезерва,СуммаРезерваНУ,СуммаРезерваСтраховыхВзносов,СуммаРезерваСтраховыхВзносовНУ,СуммаРезерваФССНесчастныеСлучаи,СуммаРезерваФССНесчастныеСлучаиНУ,
	|СуммаРезерваСО,СуммаРезерваСН,СуммаРезерваОППВ,СуммаРезерваОПВР,СуммаРезерваОтчисленияОСМС");
    // ЗУПК
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезервов Цикл
		
		Если СтрокаТаблицы.СуммаРезерва = 0
			И СтрокаТаблицы.СуммаРезерваНУ = 0
			И (СтрокаТаблицы.СуммаРезерва - СтрокаТаблицы.СуммаРезерваНУ) = 0
			И СтрокаТаблицы.СуммаРезерваСтраховыхВзносов = 0
			И СтрокаТаблицы.СуммаРезерваСтраховыхВзносовНУ = 0
			И (СтрокаТаблицы.СуммаРезерваСтраховыхВзносов - СтрокаТаблицы.СуммаРезерваСтраховыхВзносовНУ) = 0
			И СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаи = 0
			И СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиНУ = 0
			И (СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаи - СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиНУ) = 0
			И СтрокаТаблицы.СуммаРезерваСО = 0
			И СтрокаТаблицы.СуммаРезерваСН = 0
			И СтрокаТаблицы.СуммаРезерваОППВ = 0
			И СтрокаТаблицы.СуммаРезерваОПВР = 0
			И СтрокаТаблицы.СуммаРезерваОтчисленияОСМС = 0
			Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ОценочныеОбязательстваПоСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНачислениеОценочныхОбязательствПоОтпускам(ДокументОбъект) Экспорт
	
	// Начисленная зарплата и взносы.
	ДокументОбъект.РасчетРезерваОтпусков.Очистить();
	ДокументОбъект.ОценочныеОбязательства.Очистить();
	ДокументОбъект.ОценочныеОбязательстваПоСотрудникам.Очистить();
	
	РасчетРезерваОтпусков  = ДокументОбъект.РасчетРезерваОтпусков.СкопироватьКолонки();
	ОценочныеОбязательства = ДокументОбъект.ОценочныеОбязательства.СкопироватьКолонки();
	ОценочныеОбязательстваПоСотрудникам = ДокументОбъект.ОценочныеОбязательстваПоСотрудникам.СкопироватьКолонки();

	СобратьДанныеДляНачислениеРезерваОтпусков(ДокументОбъект.Ссылка, ДокументОбъект.Организация, ДокументОбъект.ПериодРегистрации, 
		РасчетРезерваОтпусков, ОценочныеОбязательства, ОценочныеОбязательстваПоСотрудникам);
		
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РасчетРезерваОтпусков,
		ДокументОбъект.РасчетРезерваОтпусков);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ОценочныеОбязательстваПоСотрудникам,
		ДокументОбъект.ОценочныеОбязательстваПоСотрудникам);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ОценочныеОбязательства,
		ДокументОбъект.ОценочныеОбязательства);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетСуммыРезерва

Процедура РассчитатьСуммыРезервовОтпусков(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета)
	
	Если СтруктураПараметровРасчета.Инвентаризация Тогда
		СуммыРезервовОтпусковМетодОбязательств(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета);
		СинхронизацияСведенийОСуммеРезервовБУиНУ(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета);
	Иначе
		Если СтруктураПараметровРасчета.ФормироватьРезервБУ Тогда
			СуммыРезервовОтпусковМетодОбязательств(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета);
			СуммыРезервовОтпусковНормативныйМетод(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета)
		КонецЕсли;
		
		Если СтруктураПараметровРасчета.ФормироватьРезервНУ Тогда
			СуммыРезервовОтпусковНормативныйМетод(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета, "НУ")
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СинхронизацияСведенийОСуммеРезервовБУиНУ(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета)
	
	Для Каждого СтрокаТаблицы Из ПараметрыРасчетаОбязательств Цикл
		Если СтруктураПараметровРасчета.ФормироватьРезервНУ Тогда
			СтрокаТаблицы.СуммаРезерваИсчисленоНУ                    = СтрокаТаблицы.СуммаРезерваИсчислено;
			СтрокаТаблицы.СуммаРезерваСтраховыхВзносовИсчисленоНУ    = СтрокаТаблицы.СуммаРезерваСтраховыхВзносовИсчислено;
			СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ = СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиИсчислено;
		КонецЕсли;
		Если НЕ СтруктураПараметровРасчета.ФормироватьРезервБУ Тогда
			СтрокаТаблицы.СуммаРезерваИсчислено                    = 0;
			СтрокаТаблицы.СуммаРезерваСтраховыхВзносовИсчислено    = 0;
			СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиИсчислено = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НормативныйМетод

Процедура СуммыРезервовОтпусковНормативныйМетод(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета, ВидУчета = "")
	
	Если СтруктураПараметровРасчета.МетодНачисленияРезерваОтпусков =  Перечисления.МетодыНачисленияРезервовПоОплатеТруда.НормативныйМетод 
		ИЛИ ВидУчета = "НУ" Тогда
		
		Для Каждого СтрокаТаблицы Из ПараметрыРасчетаОбязательств Цикл
			
			СтрокаТаблицы["СуммаРезерваИсчислено" + ВидУчета]                    = Окр(СтрокаТаблицы.ФОТ*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
			СтрокаТаблицы["СуммаРезерваСтраховыхВзносовИсчислено" + ВидУчета]    = Окр(СтрокаТаблицы.СтраховыеВзносы*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
			СтрокаТаблицы["СуммаРезерваФССНесчастныеСлучаиИсчислено" + ВидУчета] = Окр(СтрокаТаблицы.ФССНесчастныеСлучаи*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
			
            // ЗУПК
			СтрокаТаблицы.СуммаРезерваСОИсчислено                                = Окр(СтрокаТаблицы.СО*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
			СтрокаТаблицы.СуммаРезерваСНИсчислено                                = Окр(СтрокаТаблицы.СН*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
			СтрокаТаблицы.СуммаРезерваОППВИсчислено                              = Окр(СтрокаТаблицы.ОППВ*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
			СтрокаТаблицы.СуммаРезерваОПВРИсчислено                    			 = Окр(СтрокаТаблицы.ОПВР*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
			СтрокаТаблицы.СуммаРезерваОтчисленияОСМСИсчислено                    = Окр(СтрокаТаблицы.ОтчисленияОСМС*СтруктураПараметровРасчета.НормативОтчисленийВРезервОтпусков/100,2);
            // ЗУПК
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РезервОтпусковМетодОбязательств

#Область Соглашения

Функция УточнитьМетодНачисленияРезерваОтпусков(Организация, Период) Экспорт
	
	Результат = Перечисления.МетодыНачисленияРезервовПоОплатеТруда.НормативныйМетод;
	
	НастройкиРезервовОтпусков = НастройкиРезервовОтпусков(Организация, НачалоМесяца(Период));
	Результат = НастройкиРезервовОтпусков.МетодНачисленияРезерваОтпусков;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область МетодОбязательств

Процедура СуммыРезервовОтпусковМетодОбязательств(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета) Экспорт
	
	Если СтруктураПараметровРасчета.МетодНачисленияРезерваОтпусков =  Перечисления.МетодыНачисленияРезервовПоОплатеТруда.МетодОбязательств 
		ИЛИ СтруктураПараметровРасчета.Инвентаризация Тогда
		
		ПредыдущийПериод = КонецМесяца(ДобавитьМесяц(СтруктураПараметровРасчета.ПериодРегистрации, -1));
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаОбязательств",    ПараметрыРасчетаОбязательств);
		Запрос.УстановитьПараметр("Организация",            СтруктураПараметровРасчета.Организация);
		Запрос.УстановитьПараметр("ПредыдущийПериодНачало", НачалоМесяца(ПредыдущийПериод));
		Запрос.УстановитьПараметр("ПредыдущийПериодКонец",  КонецМесяца(ПредыдущийПериод));
        // ЗУПК
		Запрос.УстановитьПараметр("ПериодРегистрацииКонец", КонецМесяца(СтруктураПараметровРасчета.ПериодРегистрации));
        // ЗУПК
        			
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаОбязательств.Сотрудник,
		|	ТаблицаОбязательств.ФОТ,
		|	ТаблицаОбязательств.СтраховыеВзносы,
		|	ТаблицаОбязательств.ФССНесчастныеСлучаи,
		|	ТаблицаОбязательств.ОстатокОтпуска,
		|	ТаблицаОбязательств.ОтпускАвансом,
		|	ТаблицаОбязательств.СреднийЗаработок
		|ПОМЕСТИТЬ ВТ_ТаблицаОбязательств
		|ИЗ
		|	&ТаблицаОбязательств КАК ТаблицаОбязательств
		|ГДЕ
		|	ТаблицаОбязательств.ФОТ = 0
		|	И ТаблицаОбязательств.СтраховыеВзносы = 0
		|	И ТаблицаОбязательств.ФССНесчастныеСлучаи = 0
		|	И ТаблицаОбязательств.СреднийЗаработок <> 0
		|	И ТаблицаОбязательств.ОстатокОтпуска <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(РасчетРезерваОтпусков.ТекущаяСтавкаСтраховыхВзносов) КАК ТекущаяСтавкаСтраховыхВзносов,
		|	МАКСИМУМ(РасчетРезерваОтпусков.ТекущаяСтавкаФССНесчастныеСлучаи) КАК ТекущаяСтавкаФССНесчастныеСлучаи,
		|	РасчетРезерваОтпусков.Сотрудник
		|ИЗ
		|	ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств,
		|	РегистрСведений.РасчетРезерваОтпусков КАК РасчетРезерваОтпусков
		|ГДЕ
		|	РасчетРезерваОтпусков.ПериодРасчета МЕЖДУ &ПредыдущийПериодНачало И &ПредыдущийПериодКонец
		|	И РасчетРезерваОтпусков.Организация = &Организация
		|	И РасчетРезерваОтпусков.Сотрудник В
		|			(ВЫБРАТЬ
		|				ВТ_ТаблицаОбязательств.Сотрудник КАК Сотрудник
		|			ИЗ
		|				ВТ_ТаблицаОбязательств КАК ВТ_ТаблицаОбязательств)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетРезерваОтпусков.Сотрудник";
		
		ТаблицаСтавокПредыдущегоПериода = Запрос.Выполнить().Выгрузить();
		
		СводнаяТаблица =  ПараметрыРасчетаОбязательств.Скопировать();
		
		// ЗУПК	
		СводнаяТаблица.Свернуть("Сотрудник", "СтраховыеВзносы, ФССНесчастныеСлучаи, СО, СН, ОППВ, ОПВР, ОтчисленияОСМС, ФОТ");
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   МАКСИМУМ(СведенияОСтавкахНалоговСборовОтчислений.Период) КАК Период,
        |   СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
        |ПОМЕСТИТЬ ВТМаксимальныйПериодСтавок
        |ИЗ
        |   РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений.СрезПоследних(
        |           &ПериодРегистрацииКонец,
        |           (Организация = &Организация
        |               ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
        |               И (ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)
        |                   ИЛИ ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ПустаяСсылка))) КАК СведенияОСтавкахНалоговСборовОтчислений
        |
        |СГРУППИРОВАТЬ ПО
        |   СведенияОСтавкахНалоговСборовОтчислений.ВидНалогаВзносаОтчисления
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   МАКСИМУМ(СведенияОСтавкахОСМС.Период) КАК Период
        |ПОМЕСТИТЬ ВТМаксимальныйПериодСтавокОСМС
        |ИЗ
        |   РегистрСведений.СведенияОСтавкахОСМС.СрезПоследних(
        |           &ПериодРегистрацииКонец,
        |           (Организация = &Организация
        |               ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
        |               И ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)) КАК СведенияОСтавкахОСМС
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   1 КАК Приоритет,
        |   СтавкиНалоговСборовОтчислений.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
        |   СтавкиНалоговСборовОтчислений.Ставка КАК Ставка
        |ПОМЕСТИТЬ ВТСтавкиПоПриоритетам
        |ИЗ
        |   ВТМаксимальныйПериодСтавок КАК Максимум
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СтавкиНалоговСборовОтчислений
        |       ПО Максимум.Период = СтавкиНалоговСборовОтчислений.Период
        |           И Максимум.ВидНалогаВзносаОтчисления = СтавкиНалоговСборовОтчислений.ВидНалогаВзносаОтчисления
        |           И (СтавкиНалоговСборовОтчислений.Организация = &Организация)
        |           И (СтавкиНалоговСборовОтчислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   2,
        |   СтавкиНалоговСборовОтчислений.ВидНалогаВзносаОтчисления,
        |   СтавкиНалоговСборовОтчислений.Ставка
        |ИЗ
        |   ВТМаксимальныйПериодСтавок КАК Максимум
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СтавкиНалоговСборовОтчислений
        |       ПО Максимум.Период = СтавкиНалоговСборовОтчислений.Период
        |           И Максимум.ВидНалогаВзносаОтчисления = СтавкиНалоговСборовОтчислений.ВидНалогаВзносаОтчисления
        |           И (СтавкиНалоговСборовОтчислений.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
        |           И (СтавкиНалоговСборовОтчислений.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   1,
        |   ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ООСМС),
        |   СведенияОСтавкахОСМС.СтавкаОтчисления
        |ИЗ
        |   ВТМаксимальныйПериодСтавокОСМС КАК Максимум
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахОСМС КАК СведенияОСтавкахОСМС
        |       ПО Максимум.Период = СведенияОСтавкахОСМС.Период
        |           И (СведенияОСтавкахОСМС.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
        |           И (СведенияОСтавкахОСМС.Организация = &Организация)
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   2,
        |   ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ООСМС),
        |   СведенияОСтавкахОСМС.СтавкаОтчисления
        |ИЗ
        |   ВТМаксимальныйПериодСтавокОСМС КАК Максимум
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахОСМС КАК СведенияОСтавкахОСМС
        |       ПО Максимум.Период = СведенияОСтавкахОСМС.Период
        |           И (СведенияОСтавкахОСМС.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
        |           И (СведенияОСтавкахОСМС.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   1,
        |   ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
        |   СведенияОСтавкахОСМС.СтавкаВзносы
        |ИЗ
        |   ВТМаксимальныйПериодСтавокОСМС КАК Максимум
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахОСМС КАК СведенияОСтавкахОСМС
        |       ПО Максимум.Период = СведенияОСтавкахОСМС.Период
        |           И (СведенияОСтавкахОСМС.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
        |           И (СведенияОСтавкахОСМС.Организация = &Организация)
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   2,
        |   ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ВОСМС),
        |   СведенияОСтавкахОСМС.СтавкаВзносы
        |ИЗ
        |   ВТМаксимальныйПериодСтавокОСМС КАК Максимум
        |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахОСМС КАК СведенияОСтавкахОСМС
        |       ПО Максимум.Период = СведенияОСтавкахОСМС.Период
        |           И (СведенияОСтавкахОСМС.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя))
        |           И (СведенияОСтавкахОСМС.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
        |
        |ИНДЕКСИРОВАТЬ ПО
        |   ВидНалогаВзносаОтчисления,
        |   Приоритет
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ВТСтавкиПоПриоритетам.Ставка КАК Ставка,
        |   ВТСтавкиПоПриоритетам.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
        |ИЗ
        |   (ВЫБРАТЬ
        |       МИНИМУМ(ПриоритетСтавок.Приоритет) КАК Приоритет,
        |       ПриоритетСтавок.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления
        |   ИЗ
        |       ВТСтавкиПоПриоритетам КАК ПриоритетСтавок
        |   
        |   СГРУППИРОВАТЬ ПО
        |       ПриоритетСтавок.ВидНалогаВзносаОтчисления) КАК ПриоритетСтавок
        |       ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкиПоПриоритетам КАК ВТСтавкиПоПриоритетам
        |       ПО ПриоритетСтавок.Приоритет = ВТСтавкиПоПриоритетам.Приоритет
        |           И ПриоритетСтавок.ВидНалогаВзносаОтчисления = ВТСтавкиПоПриоритетам.ВидНалогаВзносаОтчисления";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		СтавкаСО = 0;
		СтавкаСН = 0;
		СтавкаОПВ = 0;
		СтавкаОППВ = 0;
		СтавкаОПВР = 0;
		СтавкаООСМС = 0;
        СтавкаВОСМС = 0;
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СО Тогда
				СтавкаСО = Выборка.Ставка;
			ИначеЕсли Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СН Тогда
				СтавкаСН = Выборка.Ставка;
			ИначеЕсли Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ Тогда
				СтавкаОПВ = Выборка.Ставка;
			ИначеЕсли Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ
				И ПолучитьФункциональнуюОпцию("ИспользуетсяОППВ") Тогда
				СтавкаОППВ = Выборка.Ставка;
			ИначеЕсли Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВР
				И СтруктураПараметровРасчета.ПериодРегистрации >= Дата(2024, 1, 1) Тогда
				СтавкаОПВР = Выборка.Ставка;
			ИначеЕсли Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС Тогда
				СтавкаООСМС = Выборка.Ставка;
   			ИначеЕсли Выборка.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
				СтавкаВОСМС = Выборка.Ставка;
			КонецЕсли;
		КонецЦикла;
        
        // Получаем применение вычета в месяц отсутствия дохода
        УчетнаяПолитикаНУ = РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету.СрезПоследних(СтруктураПараметровРасчета.ПериодРегистрации, Новый Структура("Организация", СтруктураПараметровРасчета.Организация));
        ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураПараметровРасчета.Организация, "ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель");
        ОрганизацияЯвляетсяИП = (ДанныеОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
        ФизическоеЛицоИП = ДанныеОрганизации.ИндивидуальныйПредприниматель;
        
        РежимНалогообложения = Перечисления.СистемыНалогообложения.Общая;
        КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
        КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = 0;
        
        МесячныйРасчетныйПоказатель = РегистрыСведений.МесячныйРасчетныйПоказатель.СрезПоследних(СтруктураПараметровРасчета.ПериодРегистрации);
        РазмерМРП = 0;
        Если МесячныйРасчетныйПоказатель.Количество() > 0 Тогда
            РазмерМРП = МесячныйРасчетныйПоказатель[0].Размер;
        КонецЕсли;
        // в расчете учитываем все три возможные положения 
        // РежимНалогообложения = ПустаяСсылка
        // для ИП и юр лица считаем как раньше
        //
        // РежимНалогообложения = Общая
        // для ИП считаем СН с учетом Коэффициентов
        // для юр лица считаем как раньше
        //
        // РежимНалогообложения = Упрощенная
        // для ИП и юр лица не считаем СН
        Если УчетнаяПолитикаНУ.Количество() > 0 Тогда
            
            РежимНалогообложения = УчетнаяПолитикаНУ[0].СистемаНалогообложения;
            
            Если ОрганизацияЯвляетсяИП Тогда
                
                КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя;
                КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника = УчетнаяПолитикаНУ[0].КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника;
                
            КонецЕсли;
            
            // не плательщик СН, независимо что в регистре
            Если РежимНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
                КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя = 0;
                КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника 			   = 0;
            КонецЕсли;
            
        КонецЕсли;
		// ЗУПК	

		Для Каждого СтрокаТаблицы Из ПараметрыРасчетаОбязательств Цикл
			
			ОтборПоСотруднику = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
			
			МассивСтрок = СводнаяТаблица.НайтиСтроки(ОтборПоСотруднику);
			
			Если МассивСтрок.Количество() <> 0 Тогда
				
				// Проверка на случай нулевого ФОТа
				Если МассивСтрок[0].ФОТ = 0 Тогда
				
					НулевойЗнаменатель = Истина;
					
				Иначе 
					
					НулевойЗнаменатель = Ложь;
					
				КонецЕсли;
				
				// Проверка на случай отсутствия остатка отпусков или среднего заработка
				Если (СтрокаТаблицы.СреднийЗаработок = Null)
					ИЛИ (СтрокаТаблицы.ОстатокОтпуска = Null)
					ИЛИ (СтрокаТаблицы.ОтпускАвансом = Null)
					ИЛИ СтрокаТаблицы.ОстатокОтпуска <= 0 
					ИЛИ СтрокаТаблицы.ОстатокОтпуска <= СтрокаТаблицы.ОтпускАвансом
					Тогда
				
					СтрокаТаблицы.СуммаРезерваИсчислено = 0;
				
				Иначе
				
					СтрокаТаблицы.СуммаРезерваИсчислено = Окр(СтрокаТаблицы.СреднийЗаработок*(СтрокаТаблицы.ОстатокОтпуска - СтрокаТаблицы.ОтпускАвансом), 2);
				
				КонецЕсли;
				
				МассивСтавокПредыдущегоПериода = ТаблицаСтавокПредыдущегоПериода.НайтиСтроки(ОтборПоСотруднику);
				// Расчет на случай нулевого ФОТа
				Если НулевойЗнаменатель Тогда
					
					Если НЕ СтруктураПараметровРасчета.Инвентаризация
						ИЛИ СтрокаТаблицы.ТекущаяСтавкаСтраховыхВзносов = 0 Тогда
						
						СтрокаТаблицы.ТекущаяСтавкаСтраховыхВзносов = 0;
						
						Если МассивСтавокПредыдущегоПериода.Количество() <> 0 Тогда
							СтрокаТаблицы.ТекущаяСтавкаСтраховыхВзносов = МассивСтавокПредыдущегоПериода[0].ТекущаяСтавкаСтраховыхВзносов;
						КонецЕсли;
						
					КонецЕсли;
				
				Иначе
				
					Если НЕ СтруктураПараметровРасчета.Инвентаризация Тогда
						СтрокаТаблицы.ТекущаяСтавкаСтраховыхВзносов = Окр(МассивСтрок[0].СтраховыеВзносы/МассивСтрок[0].ФОТ*100, 4);
					КонецЕсли;
				
				КонецЕсли; 
				
				СтрокаТаблицы.СуммаРезерваСтраховыхВзносовИсчислено = Окр(СтрокаТаблицы.СуммаРезерваИсчислено*СтрокаТаблицы.ТекущаяСтавкаСтраховыхВзносов/100, 2);
				
				Если НулевойЗнаменатель Тогда
				
					Если НЕ СтруктураПараметровРасчета.Инвентаризация
						ИЛИ СтрокаТаблицы.ТекущаяСтавкаФССНесчастныеСлучаи = 0 Тогда
						
						СтрокаТаблицы.ТекущаяСтавкаФССНесчастныеСлучаи = 0;
						
						Если МассивСтавокПредыдущегоПериода.Количество() <> 0 Тогда
							СтрокаТаблицы.ТекущаяСтавкаФССНесчастныеСлучаи = МассивСтавокПредыдущегоПериода[0].ТекущаяСтавкаФССНесчастныеСлучаи;
						КонецЕсли;
						
					КонецЕсли;
				
				Иначе
					
					Если НЕ СтруктураПараметровРасчета.Инвентаризация Тогда
						СтрокаТаблицы.ТекущаяСтавкаФССНесчастныеСлучаи = Окр(МассивСтрок[0].ФССНесчастныеСлучаи/МассивСтрок[0].ФОТ*100, 4);
					КонецЕсли;
					
				КонецЕсли; 
				
				СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиИсчислено = Окр(СтрокаТаблицы.СуммаРезерваИсчислено*СтрокаТаблицы.ТекущаяСтавкаФССНесчастныеСлучаи/100, 2);
				
            	// ЗУПК
                Если СтрокаТаблицы.СО = 0 
                    И СтрокаТаблицы.СН = 0 
                    И СтрокаТаблицы.ОППВ = 0 
                    И СтрокаТаблицы.ОПВР = 0 
                    И СтрокаТаблицы.ОтчисленияОСМС = 0 Тогда
                    СтрокаТаблицы.СуммаРезерваСОИсчислено               = Окр(СтрокаТаблицы.СуммаРезерваИсчислено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2);
                    Если ОрганизацияЯвляетсяИП И СтрокаТаблицы.СуммаРезерваИсчислено <> 0 Тогда
                        ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Сотрудник, "ФизическоеЛицо");
                        Если ФизическоеЛицо = ФизическоеЛицоИП Тогда
                            СтрокаТаблицы.СуммаРезерваСНИсчислено       = Окр(?(РазмерМРП*КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя > СтрокаТаблицы.СуммаРезерваСОИсчислено, РазмерМРП*КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя - СтрокаТаблицы.СуммаРезерваСОИсчислено, 0), 2);                            
                        Иначе
                            СтрокаТаблицы.СуммаРезерваСНИсчислено       = Окр(?(РазмерМРП*КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника > СтрокаТаблицы.СуммаРезерваСОИсчислено, РазмерМРП*КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника - СтрокаТаблицы.СуммаРезерваСОИсчислено, 0), 2);
                        КонецЕсли;
                    Иначе
                        СтрокаТаблицы.СуммаРезерваСНИсчислено           = Окр(СтрокаТаблицы.СуммаРезерваИсчислено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2);
                    КонецЕсли; 
                    СтрокаТаблицы.СуммаРезерваОППВИсчислено             = 0;
                    СтрокаТаблицы.СуммаРезерваОПВРИсчислено             = Окр(СтрокаТаблицы.СуммаРезерваИсчислено*СтавкаОПВР/100, 2);
                    СтрокаТаблицы.СуммаРезерваОтчисленияОСМСИсчислено   = Окр(СтрокаТаблицы.СуммаРезерваИсчислено*СтавкаООСМС/100, 2);
                Иначе
                    СтрокаТаблицы.СуммаРезерваСОИсчислено               = ?(СтрокаТаблицы.СО = 0, 0, Окр(СтрокаТаблицы.СуммаРезерваИсчислено*(1-СтавкаОПВ/100)*СтавкаСО/100, 2));
                    Если ОрганизацияЯвляетсяИП И СтрокаТаблицы.СуммаРезерваИсчислено <> 0 Тогда
                        ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Сотрудник, "ФизическоеЛицо");
                        Если ФизическоеЛицо = ФизическоеЛицоИП Тогда
                            СтрокаТаблицы.СуммаРезерваСНИсчислено       = Окр(?(РазмерМРП*КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя > СтрокаТаблицы.СуммаРезерваСОИсчислено, РазмерМРП*КоэффициентМРПДляРасчетаСНЗаИндивидуальногоПредпринимателя - СтрокаТаблицы.СуммаРезерваСОИсчислено, 0), 2);                            
                        Иначе
                            СтрокаТаблицы.СуммаРезерваСНИсчислено       = Окр(?(РазмерМРП*КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника > СтрокаТаблицы.СуммаРезерваСОИсчислено, РазмерМРП*КоэффициентМРПДляРасчетаСНЗаНаемногоРаботника - СтрокаТаблицы.СуммаРезерваСОИсчислено, 0), 2);
                        КонецЕсли;
                    Иначе
                        СтрокаТаблицы.СуммаРезерваСНИсчислено           = ?(СтрокаТаблицы.СН = 0, 0, Окр(СтрокаТаблицы.СуммаРезерваИсчислено*(1-(СтавкаОПВ+СтавкаВОСМС)/100)*(СтавкаСН - СтавкаСО)/100, 2));
                    КонецЕсли; 
                    СтрокаТаблицы.СуммаРезерваОППВИсчислено             = ?(СтрокаТаблицы.ОППВ = 0, 0, Окр(СтрокаТаблицы.СуммаРезерваИсчислено*СтавкаОППВ/100, 2) * ?(СтрокаТаблицы.ОППВ = 0,0,1));
                    СтрокаТаблицы.СуммаРезерваОПВРИсчислено             = ?(СтрокаТаблицы.ОПВР = 0, 0, Окр(СтрокаТаблицы.СуммаРезерваИсчислено*СтавкаОПВР/100, 2));
                    СтрокаТаблицы.СуммаРезерваОтчисленияОСМСИсчислено   = ?(СтрокаТаблицы.ОтчисленияОСМС = 0, 0, Окр(СтрокаТаблицы.СуммаРезерваИсчислено*СтавкаООСМС/100, 2));
                КонецЕсли;
            	// ЗУПК
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из СводнаяТаблица Цикл
			
			МассивСтрок = ПараметрыРасчетаОбязательств.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник));
			
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваИсчислено,
				МассивСтрок,
				"СуммаРезерваИсчислено",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваСтраховыхВзносовИсчислено,
				МассивСтрок,
				"СуммаРезерваСтраховыхВзносовИсчислено",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваФССНесчастныеСлучаиИсчислено,
				МассивСтрок,
				"СуммаРезерваФССНесчастныеСлучаиИсчислено",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].ОстатокОтпуска,
				МассивСтрок,
				"ОстатокОтпуска",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].ОтпускАвансом,
				МассивСтрок,
				"ОтпускАвансом",
				"ФОТ");
            // ЗУПК
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваСОИсчислено,
				МассивСтрок,
				"СуммаРезерваСОИсчислено",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваСНИсчислено,
				МассивСтрок,
				"СуммаРезерваСНИсчислено",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваОППВИсчислено,
				МассивСтрок,
				"СуммаРезерваОППВИсчислено",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваОПВРИсчислено,
				МассивСтрок,
				"СуммаРезерваОПВРИсчислено",
				"ФОТ");
			РаспределитьСуммуПоКолонкеТаблицы(МассивСтрок[0].СуммаРезерваОтчисленияОСМСИсчислено,
				МассивСтрок,
				"СуммаРезерваОтчисленияОСМСИсчислено",
				"ФОТ");
            // ЗУПК
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьСуммуОстатка(МассивСтрок, СтрокаТаблицы, ИмяКолонкиСуммы, ИмяКолонкиБазы = "")
	
	РаспределяемаяСумма = СтрокаТаблицы[ИмяКолонкиСуммы];
	
	Если ПустаяСтрока(ИмяКолонкиБазы) Тогда
		ИмяКолонкиБазы = ИмяКолонкиСуммы;
	КонецЕсли;
	
	// Распределение по колонке таблицы резервов
	МассивСтарыхСумм = Новый Массив;
	Для Каждого ЗначениеМассива Из МассивСтрок Цикл
		МассивСтарыхСумм.Добавить(ЗначениеМассива[ИмяКолонкиБазы]);
	КонецЦикла;
	МассивНовыхСумм = РаспределитьПропорционально(РаспределяемаяСумма, МассивСтарыхСумм);
	Если МассивНовыхСумм <> Неопределено Тогда
		ИндексСтроки = 0;
		КоличествоСтрок = МассивСтрок.Количество();
		Пока ИндексСтроки < КоличествоСтрок Цикл
			МассивСтрок[ИндексСтроки][ИмяКолонкиСуммы] = МассивНовыхСумм[ИндексСтроки];
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	Иначе
		// Распределение по дням отпуска
		МассивСтарыхСумм = Новый Массив;
		Для Каждого ЗначениеМассива Из МассивСтрок Цикл
			МассивСтарыхСумм.Добавить(ЗначениеМассива.ОстатокОтпуска + ЗначениеМассива.ОтпускАвансом);
		КонецЦикла;
		МассивНовыхСумм = РаспределитьПропорционально(РаспределяемаяСумма, МассивСтарыхСумм);
		Если МассивНовыхСумм <> Неопределено Тогда
			ИндексСтроки = 0;
			КоличествоСтрок = МассивСтрок.Количество();
			Пока ИндексСтроки < КоличествоСтрок Цикл
				МассивСтрок[ИндексСтроки][ИмяКолонкиСуммы] = МассивНовыхСумм[ИндексСтроки];
				ИндексСтроки = ИндексСтроки + 1;
			КонецЦикла;
		Иначе
			// Нет базы распределения - весь остаток в одной строке
			МассивСтрок[0][ИмяКолонкиСуммы] = РаспределяемаяСумма;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РезервОтпусковПереопределяемый

#Область ОпределениеДолиРезерва

Функция РассчитыватьДолиРезерваПоБУ(Организация, Период)
	
	Возврат УточнитьМетодНачисленияРезерваОтпусков(Организация, Период) = Перечисления.МетодыНачисленияРезервовПоОплатеТруда.НормативныйМетод;
	
КонецФункции

Функция ДолиРезервовОтпусков(Период, Организация, Резерв, Регистратор = Неопределено)
	
	ДолиРезервовОтпусков = Новый Структура("ДоляРезервовОтпусков, ДоляРезервовОтпусковНУ", 0, 0);
	
	НастройкиРезервовОтпусков = НастройкиРезервовОтпусков(Организация, НачалоМесяца(Период));
	РассчитыватьДолиПоНУ = НастройкиРезервовОтпусков.ФормироватьРезервНУ;
	РассчитыватьДолиПоБУ = НастройкиРезервовОтпусков.ФормироватьРезервБУ
		И РассчитыватьДолиРезерваПоБУ(Организация, Период);
	
	Если НЕ РассчитыватьДолиПоБУ И НЕ РассчитыватьДолиПоНУ Тогда
		Возврат ДолиРезервовОтпусков;
	КонецЕсли;
	
	Организации = РезервыПоОплатеТруда.ВсяОрганизация(Организация.ГоловнаяОрганизация);
	
	ТаблицаНакопленныхРезервов = РезервыПоОплатеТруда.НакопленоРезерваПоВсейОрганизации(Период, Организации, Резерв, Регистратор);
	
	ТаблицаФондаОплатыТруда = ОтражениеЗарплатыВБухучете.ФондОплатыТрудаПоОрганизациямДляРасчетаОценочныхОбязательств(Организации, Период, Истина, Неопределено);
	
	ПредельнаяВеличинаОтчисленийВРезервОтпусков = НастройкиРезервовОтпусков.ПредельнаяВеличинаОтчисленийВРезервОтпусков;
	
	ФондОплатыТрудаИВзносы = ТаблицаФондаОплатыТруда.Итог("ФондОплатыТруда") + ТаблицаФондаОплатыТруда.Итог("СтраховыеВзносы");
	
	Если ФондОплатыТрудаИВзносы <> 0 Тогда
		
		// Вычислим долю ФОТ, приходящуюся на текущую организацию
		ТаблицаФондаОплатыТрудаОрганизации = ТаблицаФондаОплатыТруда.Скопировать(Новый Структура("Организация", Организация));
		ФондОплатыТрудаИВзносыОрганизации  = ТаблицаФондаОплатыТрудаОрганизации.Итог("ФондОплатыТруда") + ТаблицаФондаОплатыТрудаОрганизации.Итог("СтраховыеВзносы");
		ДоляРезервовОтпусковОрганизации    = ФондОплатыТрудаИВзносыОрганизации/ФондОплатыТрудаИВзносы;
		
		Если ТаблицаНакопленныхРезервов.Итог("НакопленныйРезерв") < ПредельнаяВеличинаОтчисленийВРезервОтпусков Тогда
			ДолиРезервовОтпусков.ДоляРезервовОтпусков = Окр(ДоляРезервовОтпусковОрганизации, 8);
		КонецЕсли;
		Если ТаблицаНакопленныхРезервов.Итог("НакопленныйРезервНУ") < ПредельнаяВеличинаОтчисленийВРезервОтпусков Тогда
			ДолиРезервовОтпусков.ДоляРезервовОтпусковНУ = Окр(ДоляРезервовОтпусковОрганизации, 8);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДолиРезервовОтпусков;
	
КонецФункции

#КонецОбласти

#Область ОпределениеРазмераРезерваТекущегоПериода

// Возможно ранее регистрировались документы сводной корректировки обязательств.
// Такими документами корректировалась сумма обязательств без разбиения по сотрудникам.
// Такая корректировка учитывается при расчете, однако ее необходимо отразить 
// в учете в разрезе сотрудников
//
Процедура ОпределитьСуммуКорректировкиОстатков(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета)
	
	Если ПараметрыРасчетаОбязательств.Колонки.Найти("КорректировкаОбязательств") = Неопределено Тогда
		ПараметрыРасчетаОбязательств.Колонки.Добавить("КорректировкаОбязательств", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	ТаблицаКорректировок = ТаблицаКорректировокТекущегоМесяца(СтруктураПараметровРасчета, СтруктураПараметровРасчета.Регистратор);
	Если ТаблицаКорректировок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОстатковИсточник = ПараметрыРасчетаОбязательств.Скопировать();
	ТаблицаОстатковИсточник.ЗаполнитьЗначения(0,"СуммаРезерва , СуммаРезерваСтраховыхВзносов, СуммаРезерваФССНесчастныеСлучаи,
                                        // ЗУПК
										|СуммаРезерваСО , СуммаРезерваСН, СуммаРезерваОППВ, СуммаРезерваОПВР, СуммаРезерваОтчисленияОСМС,
                                        // ЗУПК
										|СуммаРезерваНУ , СуммаРезерваСтраховыхВзносовНУ, СуммаРезерваФССНесчастныеСлучаиНУ");
	
	ТаблицаОстатков = ТаблицаОстатковИсточник.Скопировать();
	
	ТаблицаОстатков.Свернуть("Сотрудник, СтатьяФинансирования, КорректировкаОбязательств",
		"СуммаРезерваИсчислено, СуммаРезерваСтраховыхВзносовИсчислено, СуммаРезерваФССНесчастныеСлучаиИсчислено,
		|СуммаРезерваИсчисленоНУ, СуммаРезерваСтраховыхВзносовИсчисленоНУ, СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ,
		|СуммаРезерва , СуммаРезерваСтраховыхВзносов, СуммаРезерваФССНесчастныеСлучаи,
        // ЗУПК
		|СуммаРезерваСО , СуммаРезерваСН, СуммаРезерваОППВ, СуммаРезерваОПВР, СуммаРезерваОтчисленияОСМС,
		|СуммаРезерваСОИсчислено, СуммаРезерваСНИсчислено, СуммаРезерваОППВИсчислено, СуммаРезерваОПВРИсчислено, СуммаРезерваОтчисленияОСМСИсчислено,
        // ЗУПК
		|СуммаРезерваНУ , СуммаРезерваСтраховыхВзносовНУ, СуммаРезерваФССНесчастныеСлучаиНУ");
	
	ТаблицаНераспределенныхОстатков = ТаблицаОстатков.Скопировать();
	
	МассивОбщихОстатков = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаКорректировок Цикл
		
		МассивСтрок = ТаблицаОстатковИсточник.НайтиСтроки(Новый Структура("СтатьяФинансирования", СтрокаТаблицы.СтатьяФинансирования));
		Если МассивСтрок.Количество() = 0 Тогда
			МассивОбщихОстатков.Добавить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерва",                      "СуммаРезерваИсчислено");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваСтраховыхВзносов",      "СуммаРезерваСтраховыхВзносовИсчислено");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваФССНесчастныеСлучаи",   "СуммаРезерваФССНесчастныеСлучаиИсчислено");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваНУ",                    "СуммаРезерваИсчисленоНУ");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваСтраховыхВзносовНУ",    "СуммаРезерваСтраховыхВзносовИсчисленоНУ");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваФССНесчастныеСлучаиНУ", "СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ");

		// ЗУПК
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваСО",                    "СуммаРезерваСОИсчислено");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваСН",                    "СуммаРезерваСНИсчислено");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваОППВ",                  "СуммаРезерваОППВИсчислено");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваОПВР",                  "СуммаРезерваОПВРИсчислено");
		РаспределитьПоМассиву(СтрокаТаблицы, МассивСтрок, "СуммаРезерваОтчисленияОСМС",        "СуммаРезерваОтчисленияОСМСИсчислено");
		// ЗУПК
		
		Для Каждого ЗначениеМассива Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаОстатков.Добавить(), ЗначениеМассива);
		КонецЦикла;
		
	КонецЦикла;
	
	Если МассивОбщихОстатков.Количество() <> 0 Тогда
		
		Для Каждого СтрокаМассива Из МассивОбщихОстатков Цикл
			
			ТаблицаНераспределенныхОстатков.ЗаполнитьЗначения(0,"СуммаРезерва , СуммаРезерваСтраховыхВзносов, СуммаРезерваФССНесчастныеСлучаи,
                                        		// ЗУПК
												|СуммаРезерваСО , СуммаРезерваСН, СуммаРезерваОППВ, СуммаРезерваОПВР, СуммаРезерваОтчисленияОСМС,
                                        		// ЗУПК
												|СуммаРезерваНУ , СуммаРезерваСтраховыхВзносовНУ, СуммаРезерваФССНесчастныеСлучаиНУ");
			
			ТаблицаНераспределенныхОстатков.ЗаполнитьЗначения(СтрокаМассива.СтатьяФинансирования, "СтатьяФинансирования");
			МассивСтрок = ТаблицаНераспределенныхОстатков.НайтиСтроки(Новый Структура("КорректировкаОбязательств", Ложь));
			
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерва",                      "СуммаРезерваИсчислено");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваСтраховыхВзносов",      "СуммаРезерваСтраховыхВзносовИсчислено");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваФССНесчастныеСлучаи",   "СуммаРезерваФССНесчастныеСлучаиИсчислено");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваНУ",                    "СуммаРезерваИсчисленоНУ");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваСтраховыхВзносовНУ",    "СуммаРезерваСтраховыхВзносовИсчисленоНУ");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваФССНесчастныеСлучаиНУ", "СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ");
			// ЗУПК
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваСО",                    "СуммаРезерваСОИсчислено");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваСН",                    "СуммаРезерваСНИсчислено");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваОППВ",                  "СуммаРезерваОППВИсчислено");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваОПВР",                  "СуммаРезерваОПВРИсчислено");
			РаспределитьПоМассиву(СтрокаМассива, МассивСтрок, "СуммаРезерваОтчисленияОСМС",        "СуммаРезерваОтчисленияОСМСИсчислено");
			// ЗУПК
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаНераспределенныхОстатков, ТаблицаОстатков);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаОстатков", ТаблицаОстатков);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатков.Сотрудник КАК Сотрудник,
	|	ТаблицаОстатков.СуммаРезерва КАК СуммаРезерваОстаток,
	|	ТаблицаОстатков.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносовОстаток,
	|	ТаблицаОстатков.СуммаРезерваФССНесчастныеСлучаи КАК СуммаРезерваФССНесчастныеСлучаиОстаток,
	|	ТаблицаОстатков.СуммаРезерваНУ КАК СуммаРезерваОстатокНУ,
	|	ТаблицаОстатков.СуммаРезерваСтраховыхВзносовНУ КАК СуммаРезерваСтраховыхВзносовОстатокНУ,
	|	ТаблицаОстатков.СуммаРезерваФССНесчастныеСлучаиНУ КАК СуммаРезерваФССНесчастныеСлучаиОстатокНУ,
    // ЗУПК
	|	ТаблицаОстатков.СуммаРезерваСО КАК СуммаРезерваСООстаток,
	|	ТаблицаОстатков.СуммаРезерваСН КАК СуммаРезерваСНОстаток,
	|	ТаблицаОстатков.СуммаРезерваОППВ КАК СуммаРезерваОППВОстаток,
	|	ТаблицаОстатков.СуммаРезерваОПВР КАК СуммаРезерваОПВРОстаток,
	|	ТаблицаОстатков.СуммаРезерваОтчисленияОСМС КАК СуммаРезерваОтчисленияОСМСОстаток,
    // ЗУПК
	|	ТаблицаОстатков.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ОстаткиРезервов
	|ИЗ
	|	&ТаблицаОстатков КАК ТаблицаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиРезервов.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваОстаток) КАК СуммаРезерва,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваСтраховыхВзносовОстаток) КАК СуммаРезерваСтраховыхВзносов,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваФССНесчастныеСлучаиОстаток) КАК СуммаРезерваФССНесчастныеСлучаи,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваОстатокНУ) КАК СуммаРезерваНУ,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваСтраховыхВзносовОстатокНУ) КАК СуммаРезерваСтраховыхВзносовНУ,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваФССНесчастныеСлучаиОстатокНУ) КАК СуммаРезерваФССНесчастныеСлучаиНУ,
    // ЗУПК
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваСООстаток) КАК СуммаРезерваСО,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваСНОстаток) КАК СуммаРезерваСН,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваОППВОстаток) КАК СуммаРезерваОППВ,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваОПВРОстаток) КАК СуммаРезерваОПВР,
	|	СУММА(ВТ_ОстаткиРезервов.СуммаРезерваОтчисленияОСМСОстаток) КАК СуммаРезерваОтчисленияОСМС,
    // ЗУПК
	|	ВТ_ОстаткиРезервов.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ИСТИНА КАК КорректировкаОбязательств
	|ИЗ
	|	ВТ_ОстаткиРезервов КАК ВТ_ОстаткиРезервов
	|ГДЕ
	|	(ВТ_ОстаткиРезервов.СуммаРезерваОстаток <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваСтраховыхВзносовОстаток <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваФССНесчастныеСлучаиОстаток <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваОстатокНУ <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваСтраховыхВзносовОстатокНУ <> 0
    // ЗУПК
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваСООстаток <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваСНОстаток <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваОППВОстаток <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваОПВРОстаток <> 0
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваОтчисленияОСМСОстаток <> 0
    // ЗУПК
	|			ИЛИ ВТ_ОстаткиРезервов.СуммаРезерваФССНесчастныеСлучаиОстатокНУ <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиРезервов.Сотрудник,
	|	ВТ_ОстаткиРезервов.СтатьяФинансирования";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат.Выгрузить(), ПараметрыРасчетаОбязательств);
	КонецЕсли;
	
КонецПроцедуры

Процедура РаспределитьПоМассиву(СтрокаТаблицы, МассивИсточник, ИмяКолонки, ИмяКолонкиБазы)
	
	РаспределяемаяСумма = СтрокаТаблицы[ИмяКолонки];
	
	Если РаспределяемаяСумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивИсточник.Количество() <> 0 Тогда
		МассивСтарыхСумм = Новый Массив;
		Для Каждого Строка Из МассивИсточник Цикл
			МассивСтарыхСумм.Добавить(Строка[ИмяКолонкиБазы]);
		КонецЦикла;
		МассивНовыхСумм = РаспределитьПропорционально(РаспределяемаяСумма, МассивСтарыхСумм);
		Если МассивНовыхСумм <> Неопределено Тогда
			Для НомерЗаписи = 1 По МассивНовыхСумм.Количество() Цикл
				МассивИсточник[НомерЗаписи-1][ИмяКолонки] = МассивНовыхСумм[НомерЗаписи-1];
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаКорректировокТекущегоМесяца(СтруктураПараметровРасчета, Регистратор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   СтруктураПараметровРасчета.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(СтруктураПараметровРасчета.ПериодРегистрации));
	Запрос.УстановитьПараметр("КонецПериода",  КонецМесяца(СтруктураПараметровРасчета.ПериодРегистрации));
	Запрос.УстановитьПараметр("Регистратор",   Регистратор);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваПриход) КАК СуммаРезерва,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваНУПриход) КАК СуммаРезерваНУ,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовПриход) КАК СуммаРезерваСтраховыхВзносов,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСтраховыхВзносовНУПриход) КАК СуммаРезерваСтраховыхВзносовНУ,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиПриход) КАК СуммаРезерваФССНесчастныеСлучаи,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваФССНесчастныеСлучаиНУПриход) КАК СуммаРезерваФССНесчастныеСлучаиНУ,
    // ЗУПК
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСОНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСОПриход) КАК СуммаРезерваСО,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСННачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваСНПриход) КАК СуммаРезерваСН,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваОППВНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваОППВПриход) КАК СуммаРезерваОППВ,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваОПВРНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваОПВРПриход) КАК СуммаРезерваОПВР,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваОтчисленияОСМСНачальныйОстаток + ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СуммаРезерваОтчисленияОСМСПриход) КАК СуммаРезерваОтчисленияОСМС,
    // ЗУПК
	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ОстаткиИОборотыСотрудников
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Период, , Организация = &Организация) КАК ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ОценочныеОбязательстваПоСотрудникамОстаткиИОбороты.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваПриход) КАК СуммаРезерваПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваНУПриход) КАК СуммаРезерваНУПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваСтраховыхВзносовПриход) КАК СуммаРезерваСтраховыхВзносовПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваСтраховыхВзносовНУПриход) КАК СуммаРезерваСтраховыхВзносовНУПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваФССНесчастныеСлучаиПриход) КАК СуммаРезерваФССНесчастныеСлучаиПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваФССНесчастныеСлучаиНУПриход) КАК СуммаРезерваФССНесчастныеСлучаиНУПриход,
    // ЗУПК
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваСОПриход) КАК СуммаРезерваСОПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваСНПриход) КАК СуммаРезерваСНПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваОППВПриход) КАК СуммаРезерваОППВПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваОПВРПриход) КАК СуммаРезерваОПВРПриход,
	|	СУММА(ОценочныеОбязательстваПоСотрудникамОбороты.СуммаРезерваОтчисленияОСМСПриход) КАК СуммаРезерваОтчисленияОСМСПриход,
    // ЗУПК
	|	ОценочныеОбязательстваПоСотрудникамОбороты.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ТекущиеОборотыСотрудников
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Организация = &Организация) КАК ОценочныеОбязательстваПоСотрудникамОбороты
	|ГДЕ
	|	ОценочныеОбязательстваПоСотрудникамОбороты.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ОценочныеОбязательстваПоСотрудникамОбороты.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерва - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваПриход, 0)) КАК СуммаРезерва,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваНУ - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваНУПриход, 0)) КАК СуммаРезерваНУ,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваСтраховыхВзносов - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваСтраховыхВзносовПриход, 0)) КАК СуммаРезерваСтраховыхВзносов,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваСтраховыхВзносовНУ - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваСтраховыхВзносовНУПриход, 0)) КАК СуммаРезерваСтраховыхВзносовНУ,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваФССНесчастныеСлучаи - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваФССНесчастныеСлучаиПриход, 0)) КАК СуммаРезерваФССНесчастныеСлучаи,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваФССНесчастныеСлучаиНУ - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваФССНесчастныеСлучаиНУПриход, 0)) КАК СуммаРезерваФССНесчастныеСлучаиНУ,
    // ЗУПК
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваСО - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваСОПриход, 0)) КАК СуммаРезерваСО,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваСН - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваСНПриход, 0)) КАК СуммаРезерваСН,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваОППВ - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваОППВПриход, 0)) КАК СуммаРезерваОППВ,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваОПВР - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваОПВРПриход, 0)) КАК СуммаРезерваОПВР,
	|	СУММА(ВТ_ОстаткиИОборотыСотрудников.СуммаРезерваОтчисленияОСМС - ЕСТЬNULL(ВТ_ТекущиеОборотыСотрудников.СуммаРезерваОтчисленияОСМСПриход, 0)) КАК СуммаРезерваОтчисленияОСМС,
    // ЗУПК
	|	ВТ_ОстаткиИОборотыСотрудников.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ОстаткиСотрудников
	|ИЗ
	|	ВТ_ОстаткиИОборотыСотрудников КАК ВТ_ОстаткиИОборотыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеОборотыСотрудников КАК ВТ_ТекущиеОборотыСотрудников
	|		ПО ВТ_ОстаткиИОборотыСотрудников.СтатьяФинансирования = ВТ_ТекущиеОборотыСотрудников.СтатьяФинансирования
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиИОборотыСотрудников.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВознаграждениям)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерва,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВознаграждениям)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНУНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаНУПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваНУ,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСтраховымВзносам)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСтраховымВзносам)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНУНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаНУПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСтраховыхВзносовНУ,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВзносамФССНСиПЗ)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваФССНесчастныеСлучаи,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВзносамФССНСиПЗ)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНУНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаНУПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваФССНесчастныеСлучаиНУ,
    // ЗУПК
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСО)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСО,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСН)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСН,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоООСМС)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваОтчисленияОСМС,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоОППВ)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваОППВ,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОстаткиИОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоОПВР)
	|				ТОГДА ОценочныеОбязательстваОстаткиИОбороты.СуммаНачальныйОстаток + ОценочныеОбязательстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваОПВР,
    // ЗУПК
	|	ОценочныеОбязательстваОстаткиИОбороты.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ОстаткиИОборотыСводные
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательства.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Период, , Организация = &Организация) КАК ОценочныеОбязательстваОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ОценочныеОбязательстваОстаткиИОбороты.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВознаграждениям)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВознаграждениям)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаНУПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваНУПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСтраховымВзносам)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСтраховыхВзносовПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСтраховымВзносам)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаНУПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСтраховыхВзносовНУПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВзносамФССНСиПЗ)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваФССНесчастныеСлучаиПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоВзносамФССНСиПЗ)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаНУПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваФССНесчастныеСлучаиНУПриход,
    // ЗУПК
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСО)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСОПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоСН)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваСНПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоОППВ)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваОППВПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоОПВР)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваОПВРПриход,
	|	СУММА(ВЫБОР
	|			КОГДА ОценочныеОбязательстваОбороты.ТипОценочногоОбязательства = ЗНАЧЕНИЕ(Перечисление.ТипыОценочныхОбязательств.ОценочныеОбязательстваПоООСМС)
	|				ТОГДА ОценочныеОбязательстваОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаРезерваОтчисленияОСМСПриход,
    // ЗУПК
	|	ОценочныеОбязательстваОбороты.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ТекущиеОборотыСводные
	|ИЗ
	|	РегистрНакопления.ОценочныеОбязательства.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Организация = &Организация) КАК ОценочныеОбязательстваОбороты
	|ГДЕ
	|	ОценочныеОбязательстваОбороты.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ОценочныеОбязательстваОбороты.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерва - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваПриход, 0)) КАК СуммаРезерва,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваНУ - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваНУПриход, 0)) КАК СуммаРезерваНУ,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваСтраховыхВзносов - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваСтраховыхВзносовПриход, 0)) КАК СуммаРезерваСтраховыхВзносов,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваСтраховыхВзносовНУ - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваСтраховыхВзносовНУПриход, 0)) КАК СуммаРезерваСтраховыхВзносовНУ,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваФССНесчастныеСлучаи - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваФССНесчастныеСлучаиПриход, 0)) КАК СуммаРезерваФССНесчастныеСлучаи,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваФССНесчастныеСлучаиНУ - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваФССНесчастныеСлучаиНУПриход, 0)) КАК СуммаРезерваФССНесчастныеСлучаиНУ,
    // ЗУПК
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваСО - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваСОПриход, 0)) КАК СуммаРезерваСО,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваСН - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваСНПриход, 0)) КАК СуммаРезерваСН,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваОППВ - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваОППВПриход, 0)) КАК СуммаРезерваОППВ,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваОПВР - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваОПВРПриход, 0)) КАК СуммаРезерваОПВР,
	|	СУММА(ВТ_ОстаткиИОборотыСводные.СуммаРезерваОтчисленияОСМС - ЕСТЬNULL(ВТ_ТекущиеОборотыСводные.СуммаРезерваОтчисленияОСМСПриход, 0)) КАК СуммаРезерваОтчисленияОСМС,
    // ЗУПК
	|	ВТ_ОстаткиИОборотыСводные.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_ОстаткиСводные
	|ИЗ
	|	ВТ_ОстаткиИОборотыСводные КАК ВТ_ОстаткиИОборотыСводные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеОборотыСводные КАК ВТ_ТекущиеОборотыСводные
	|		ПО ВТ_ОстаткиИОборотыСводные.СтатьяФинансирования = ВТ_ТекущиеОборотыСводные.СтатьяФинансирования
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиИОборотыСводные.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерва, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерва, 0)) КАК СуммаРезерва,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваНУ, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваНУ, 0)) КАК СуммаРезерваНУ,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваСтраховыхВзносов, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваСтраховыхВзносов, 0)) КАК СуммаРезерваСтраховыхВзносов,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваСтраховыхВзносовНУ, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваСтраховыхВзносовНУ, 0)) КАК СуммаРезерваСтраховыхВзносовНУ,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваФССНесчастныеСлучаи, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваФССНесчастныеСлучаи, 0)) КАК СуммаРезерваФССНесчастныеСлучаи,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваФССНесчастныеСлучаиНУ, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваФССНесчастныеСлучаиНУ, 0)) КАК СуммаРезерваФССНесчастныеСлучаиНУ,
    // ЗУПК
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваСО, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваСО, 0)) КАК СуммаРезерваСО,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваСН, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваСН, 0)) КАК СуммаРезерваСН,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваОППВ, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваОППВ, 0)) КАК СуммаРезерваОППВ,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваОПВР, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваОПВР, 0)) КАК СуммаРезерваОПВР,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиСводные.СуммаРезерваОтчисленияОСМС, 0) - ЕСТЬNULL(ВТ_ОстаткиСотрудников.СуммаРезерваОтчисленияОСМС, 0)) КАК СуммаРезерваОтчисленияОСМС,
    // ЗУПК
	|	ЕСТЬNULL(ВТ_ОстаткиСводные.СтатьяФинансирования, ВТ_ОстаткиСотрудников.СтатьяФинансирования) КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТ_Итоги
	|ИЗ
	|	ВТ_ОстаткиСводные КАК ВТ_ОстаткиСводные
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОстаткиСотрудников КАК ВТ_ОстаткиСотрудников
	|		ПО ВТ_ОстаткиСводные.СтатьяФинансирования = ВТ_ОстаткиСотрудников.СтатьяФинансирования
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_ОстаткиСводные.СтатьяФинансирования, ВТ_ОстаткиСотрудников.СтатьяФинансирования)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итоги.СуммаРезерва КАК СуммаРезерва,
	|	ВТ_Итоги.СуммаРезерваНУ КАК СуммаРезерваНУ,
	|	ВТ_Итоги.СуммаРезерваСтраховыхВзносов КАК СуммаРезерваСтраховыхВзносов,
	|	ВТ_Итоги.СуммаРезерваСтраховыхВзносовНУ КАК СуммаРезерваСтраховыхВзносовНУ,
	|	ВТ_Итоги.СуммаРезерваФССНесчастныеСлучаи КАК СуммаРезерваФССНесчастныеСлучаи,
	|	ВТ_Итоги.СуммаРезерваФССНесчастныеСлучаиНУ КАК СуммаРезерваФССНесчастныеСлучаиНУ,
    // ЗУПК
	|	ВТ_Итоги.СуммаРезерваСО КАК СуммаРезерваСО,
	|	ВТ_Итоги.СуммаРезерваСН КАК СуммаРезерваСН,
	|	ВТ_Итоги.СуммаРезерваОППВ КАК СуммаРезерваОППВ,
	|	ВТ_Итоги.СуммаРезерваОПВР КАК СуммаРезерваОПВР,
	|	ВТ_Итоги.СуммаРезерваОтчисленияОСМС КАК СуммаРезерваОтчисленияОСМС,
    // ЗУПК
	|	ВТ_Итоги.СтатьяФинансирования КАК СтатьяФинансирования
	|ИЗ
	|	ВТ_Итоги КАК ВТ_Итоги
	|ГДЕ
	|	(ВТ_Итоги.СуммаРезерва <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваНУ <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваСтраховыхВзносов <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваСтраховыхВзносовНУ <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваФССНесчастныеСлучаи <> 0
    // ЗУПК
	|			ИЛИ ВТ_Итоги.СуммаРезерваСО <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваСН <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваОтчисленияОСМС <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваОППВ <> 0
	|			ИЛИ ВТ_Итоги.СуммаРезерваОПВР <> 0
    // ЗУПК
	|			ИЛИ ВТ_Итоги.СуммаРезерваФССНесчастныеСлучаиНУ <> 0)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДополнитьПеренесеннымиОстатками(ПараметрыРасчетаОбязательств, СтруктураПараметровРасчета)
	
	Если НЕ СтруктураПараметровРасчета.Свойство("ТаблицаОстатковЗачисленных") Тогда
		Возврат;
	Иначе
		ТаблицаОстатковЗачисленных = СтруктураПараметровРасчета.ТаблицаОстатковЗачисленных;
	КонецЕсли;
	
	Если ТаблицаОстатковЗачисленных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОстатковЗачисленных Цикл
		
		НоваяСтрока   = ПараметрыРасчетаОбязательств.Добавить();
		НоваяСтрока.Сотрудник                         = СтрокаТаблицы.Сотрудник;
		НоваяСтрока.СтатьяФинансирования              = СтрокаТаблицы.СтатьяФинансирования;
		НоваяСтрока.СуммаРезерва                      = СтрокаТаблицы.СуммаРезерваОстаток;
		НоваяСтрока.СуммаРезерваНУ                    = СтрокаТаблицы.СуммаРезерваНУОстаток;
		НоваяСтрока.СуммаРезерваСтраховыхВзносов      = СтрокаТаблицы.СуммаРезерваСтраховыхВзносовОстаток;
		НоваяСтрока.СуммаРезерваСтраховыхВзносовНУ    = СтрокаТаблицы.СуммаРезерваСтраховыхВзносовНУОстаток;
		НоваяСтрока.СуммаРезерваФССНесчастныеСлучаи   = СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиОстаток;
		НоваяСтрока.СуммаРезерваФССНесчастныеСлучаиНУ = СтрокаТаблицы.СуммаРезерваФССНесчастныеСлучаиНУОстаток;
		
		// ЗУПК
		НоваяСтрока.СуммаРезерваСН 			  		  = СтрокаТаблицы.СуммаРезерваСНОстаток;
		НоваяСтрока.СуммаРезерваСО 					  = СтрокаТаблицы.СуммаРезерваСООстаток;
		НоваяСтрока.СуммаРезерваОтчисленияОСМС		  = СтрокаТаблицы.СуммаРезерваОтчисленияОСМСОстаток;
		НоваяСтрока.СуммаРезерваОППВ 				  = СтрокаТаблицы.СуммаРезерваОППВОстаток;
		НоваяСтрока.СуммаРезерваОПВР 				  = СтрокаТаблицы.СуммаРезерваОПВРОстаток;
        // ЗУПК

		СтрокаПорядка = ПараметрыРасчетаОбязательств.Найти(СтрокаТаблицы.Сотрудник, "Сотрудник");
		Если СтрокаПорядка <> Неопределено Тогда
			НоваяСтрока.Порядок = СтрокаПорядка.Порядок;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

// Функция выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
//
// Параметры:
//		ИсхСумма - распределяемая сумма.
//		МассивКоэф - массив коэффициентов распределения.
//		Точность - точность округления при распределении. Необязателен.
//
//	Возврат:
//		МассивСумм - массив размерностью равный массиву коэффициентов, содержит
//			суммы в соответствии с весом коэффициента (из массива коэффициентов)
//          В случае если распределить не удалось (сумма = 0, кол-во коэф. = 0
//          или суммарный вес коэф. = 0), тогда возвращается значение Неопределено
//
Функция РаспределитьПропорционально(Знач ИсхСумма, МассивКоэф, Знач Точность = 2) Экспорт
 
	Возврат ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(
		ИсхСумма, МассивКоэф, Точность);
 
КонецФункции

Процедура РаспределитьСуммуПоКолонкеТаблицы(РаспределяемаяСумма, НаборСтрок, ИмяКолонки, ИмяКолонкиБазы = "") Экспорт

	Если РаспределяемаяСумма <> 0 Тогда
		МассивСтарыхСумм = Новый Массив;
		Если ПустаяСтрока(ИмяКолонкиБазы) Тогда
			ИмяКолонкиБазы = ИмяКолонки;
		КонецЕсли;
		Для Каждого СтрокаМассива Из НаборСтрок Цикл
			МассивСтарыхСумм.Добавить(СтрокаМассива[ИмяКолонкиБазы]);
		КонецЦикла;
		МассивНовыхСумм = РаспределитьПропорционально(РаспределяемаяСумма, МассивСтарыхСумм);
		Если МассивНовыхСумм <> Неопределено Тогда
			Для ИндексЗначения = 0 По МассивНовыхСумм.Количество()-1 Цикл
				НаборСтрок[ИндексЗначения][ИмяКолонки] = МассивНовыхСумм[ИндексЗначения];
			КонецЦикла;
		КонецЕсли; 
	Иначе
		Для Каждого СтрокаМассива Из НаборСтрок Цикл
			СтрокаМассива[ИмяКолонки] = 0;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РегистрацияДвиженийДокумента

Процедура СформироватьДвиженияПоНачислениюОбязательств(Движения, Отказ, Организация, Период, ПериодРегистрации, ДанныеДляОтражения) Экспорт
	
	Если ДанныеДляОтражения.Свойство("ОценочныеОбязательства")
		Или ДанныеДляОтражения.Свойство("ОценочныеОбязательстваПоСотрудникам") Тогда
		РезервыПоОплатеТруда.СформироватьДвиженияПоНачислениюОбязательств(Движения, Отказ, Организация, Период, ПериодРегистрации, ДанныеДляОтражения);
	КонецЕсли;
	
	Если ДанныеДляОтражения.Свойство("РасчетРезерваОтпусков") Тогда
		СформироватьДвиженияРегистраРасчетРезерваОтпусков(ДанныеДляОтражения.РасчетРезерваОтпусков, Организация, Период, ПериодРегистрации, Движения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияРегистраРасчетРезерваОтпусков(ТаблицаОбязательств, Организация, Период, ПериодРегистрации, Движения, Отказ)
	
	ТаблицаОбязательств.Свернуть("Сотрудник,
	|СреднийЗаработок,ТекущаяСтавкаСтраховыхВзносов, ТекущаяСтавкаФССНесчастныеСлучаи" ,
	"ОстатокОтпуска,ОтпускАвансом,ФОТ,СтраховыеВзносы,ФССНесчастныеСлучаи,
	|СуммаРезерваНакоплено,СуммаРезерваСтраховыхВзносовНакоплено,СуммаРезерваФССНесчастныеСлучаиНакоплено,
	// ЗУПК
	|СуммаРезерваСОНакоплено,СуммаРезерваСННакоплено,СуммаРезерваОППВНакоплено,СуммаРезерваОПВРНакоплено,СуммаРезерваОтчисленияОСМСНакоплено,
	// ЗУПК
	|СуммаРезерваНакопленоНУ,СуммаРезерваСтраховыхВзносовНакопленоНУ,СуммаРезерваФССНесчастныеСлучаиНакопленоНУ,
	|СуммаРезерваИсчислено,СуммаРезерваСтраховыхВзносовИсчислено,СуммаРезерваФССНесчастныеСлучаиИсчислено,
	// ЗУПК
	|СуммаРезерваСОИсчислено,СуммаРезерваСНИсчислено,СуммаРезерваОППВИсчислено,СуммаРезерваОПВРИсчислено,СуммаРезерваОтчисленияОСМСИсчислено,
	// ЗУПК
	|СуммаРезерваИсчисленоНУ,СуммаРезерваСтраховыхВзносовИсчисленоНУ,СуммаРезерваФССНесчастныеСлучаиИсчисленоНУ,
	|СуммаРезерва,СуммаРезерваСтраховыхВзносов,СуммаРезерваФССНесчастныеСлучаи,
	// ЗУПК
	|СуммаРезерваСО,СуммаРезерваСН,СуммаРезерваОППВ,СуммаРезерваОПВР,СуммаРезерваОтчисленияОСМС,
	// ЗУПК
	|СуммаРезерваНУ,СуммаРезерваСтраховыхВзносовНУ,СуммаРезерваФССНесчастныеСлучаиНУ");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", ТаблицаОбязательств.ВыгрузитьКолонку("Сотрудник"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Сотрудники)";
	Выборка = Запрос.Выполнить().Выбрать();
	СотрудникиФизическиеЛица = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СотрудникиФизическиеЛица.Вставить(Выборка.Сотрудник, Выборка.ФизическоеЛицо);
	КонецЦикла;	
	
	Для каждого СтрокаТЗ Из ТаблицаОбязательств Цикл
	
		НоваяСтрока = Движения.РасчетРезерваОтпусков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЗ);
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.ПериодРасчета = ПериодРегистрации;
		НоваяСтрока.Период = КонецМесяца(ПериодРегистрации);
		НоваяСтрока.ФизическоеЛицо = СотрудникиФизическиеЛица[НоваяСтрока.Сотрудник];
	
	КонецЦикла;
	
	Движения.РасчетРезерваОтпусков.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.НачислениеОценочныхОбязательствПоОтпускам);
	
КонецПроцедуры

#КонецОбласти
