
#Область ПрограммныйИнтерфейс

Процедура УстановитьВидимостьКомандыСоздатьВедомостиПрочихДоходов(Форма) Экспорт
	
	ВидимостьКомандыСоздатьВедомостиПрочихДоходов = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВидимостьКомандыСоздатьВедомостиПрочихДоходов") Тогда
		ВидимостьКомандыСоздатьВедомостиПрочихДоходов = Форма.ВидимостьКомандыСоздатьВедомостиПрочихДоходов;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Форма.Элементы.ГруппаКнопкиКоманднойПанели.ПодчиненныеЭлементы,
					"ФормаОбработкаСозданиеВедомостейПрочихДоходовСоздатьВедомостиПрочихДоходовПоДокументу",
					"Видимость",
					ВидимостьКомандыСоздатьВедомостиПрочихДоходов);
	
КонецПроцедуры

Процедура УстановитьВидимостьКомандыСоздатьВедомостиНаВыплатуЗарплаты(Форма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Форма.Элементы,
					"ФормаОбработкаСозданиеВедомостейНаВыплатуЗарплатыСоздатьВедомостиПоРасчетномуДокументу",
					"Видимость",
					Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти