
#Область ПрограммныйИнтерфейс

Процедура ВвестиДокументПрекращениеПредоставленияЛьготИВычетовИПН(ФизическоеЛицо, Организация) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Сотрудник", ФизическоеЛицо);
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("Месяц", НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса()));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ИзФормыСотрудника", Истина);
	
	ОткрытьФорму("Документ.ПрекращениеПредоставленияВычетовИПН.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

Процедура ВвестиНовоеЗаявлениеНаПредоставлениеЛьготИВычетовИПН(ФизическоеЛицо, Организация) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Сотрудник", ФизическоеЛицо);
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ЗначенияЗаполнения.Вставить("Месяц", НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса()));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ИзФормыСотрудника", Истина);
	
	ОткрытьФорму("Документ.ЗаявлениеНаПредоставлениеВычетовИПН.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
