#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// ЗУП РК индексация в рамках дня
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборДанных", ЭтотОбъект.Выгрузить(,"Период, Сотрудник, ДатаИндексации"));
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НаборДанных.Период КАК Период,
	               |	НаборДанных.Сотрудник КАК Сотрудник,
	               |	НаборДанных.ДатаИндексации КАК ДатаИндексации
	               |ПОМЕСТИТЬ ВТДанныеНабора
	               |ИЗ
	               |	&НаборДанных КАК НаборДанных
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеНабора.Период КАК Период,
	               |	ДанныеНабора.Сотрудник КАК Сотрудник,
	               |	ДанныеНабора.ДатаИндексации КАК ДатаИндексации
	               |ИЗ
	               |	РегистрСведений.КоэффициентИндексацииЗаработка КАК КоэффициентИндексацииЗаработка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеНабора КАК ДанныеНабора
	               |		ПО НЕ КоэффициентИндексацииЗаработка.Регистратор = &Регистратор 
	               |			И КоэффициентИндексацииЗаработка.Сотрудник = ДанныеНабора.Сотрудник
	               |			И КоэффициентИндексацииЗаработка.ДатаИндексации = ДанныеНабора.ДатаИндексации
	               |			И НАЧАЛОПЕРИОДА(КоэффициентИндексацииЗаработка.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДанныеНабора.Период, ДЕНЬ)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПроверки = РезультатЗапроса.Выбрать();
	
	Если ВыборкаПроверки.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'В рамках одного дня возможно произвести индексацию только одним документом кадрового учета'");	
	КонецЕсли;

КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
