#Область ПрограммныйИнтерфейс

// Дополняет параметры открытия формы с похожими данными физического лица.
// 
// Параметры:
//  ПараметрыОткрытия - Структура -
Процедура ДополнитьПараметрыОткрытияФормыФизическиеЛицаСПохожимиДанными(ПараметрыОткрытия) Экспорт
	
	ПараметрыОткрытия.Вставить("КандидатУникален", Истина);
	ПараметрыОткрытия.Вставить("ДанныеКандидатов", Новый Массив);
	ПараметрыОткрытия.Вставить("ДанныеКандидатовДоступны", Истина);
	
КонецПроцедуры

// Выполняет в форме сотрудника поиск однофамильцев среди кандидатов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма элемента справочника Сотрудники или ФизическиеЛица
//  ПараметрыОткрытия - см. СотрудникиКлиент.ПараметрыОткрытияФормыФизическиеЛицаСПохожимиДанными
//  ДополнительныеПараметры - Структура
Процедура ПроверитьОднофамильцевСотрудникаСредиКандидатов(Форма, ПараметрыОткрытия, ДополнительныеПараметры) Экспорт
	
	ПараметрыПоиска = ПодборПерсоналаВызовСервера.ПараметрыПоискаПохожихКандидатов();
	ПараметрыПоиска.Ссылка = Форма.ЛичныеДанныеКандидатаСсылка;
	ПараметрыПоиска.Фамилия = Форма.ФИОФизическихЛиц.Фамилия;
	ПараметрыПоиска.Имя = Форма.ФИОФизическихЛиц.Имя;
	ПараметрыПоиска.Отчество = Форма.ФИОФизическихЛиц.Отчество;
	
	РезультатПоиска = ПодборПерсоналаВызовСервера.ПодобратьПохожихКандидатов(ПараметрыПоиска, Истина);
	
	ПараметрыОткрытия.КандидатУникален = РезультатПоиска.КандидатУникален;
	ПараметрыОткрытия.ДанныеКандидатов = РезультатПоиска.ДанныеКандидатов;
	ПараметрыОткрытия.ДанныеКандидатовДоступны = РезультатПоиска.ДанныеКандидатовДоступны;
	
	ДополнительныеПараметры.ФизическоеЛицоУникально =
		ДополнительныеПараметры.ФизическоеЛицоУникально И РезультатПоиска.КандидатУникален;
	ДополнительныеПараметры.КоличествоНайденных =
		ДополнительныеПараметры.КоличествоНайденных + РезультатПоиска.ДанныеКандидатов.Количество();
	
	Если ЗначениеЗаполнено(Форма.ФизическоеЛицо.ГруппаДоступа) Тогда
		ДополнительныеПараметры.Вставить("ГруппаДоступа", Форма.ФизическоеЛицо.ГруппаДоступа);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет действия при завершении поиска однофамильцев среди кандидатов в форме сотрудника.
// 
// Параметры:
//  РезультатВыбора  - СправочникСсылка.ФизическиеЛица,СправочникСсылка.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//   * Форма - ФормаКлиентскогоПриложения
//   * ОповещениеЗавершения - ОписаниеОповещения
Процедура ПроверитьОднофамильцевСотрудникаСредиКандидатовЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
		
	Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = ПредопределенноеЗначение("Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка");
		СотрудникиКлиент.УстановитьФизическоеЛицоВФормеСотрудника(Форма, РезультатВыбора);
	ИначеЕсли ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = РезультатВыбора;
		Форма.ОбновитьДанныеФизическогоЛицаНаСервере();
		Форма.ФИОФизическихЛиц.Фамилия = Форма.ФизическоеЛицо.Фамилия;
		Форма.ФИОФизическихЛиц.Имя = Форма.ФизическоеЛицо.Имя;
		Форма.ФИОФизическихЛиц.Отчество = Форма.ФизическоеЛицо.Отчество;
		СотрудникиКлиент.СформироватьНаименованиеСотрудника(Форма);
		Оповестить("ИзмененЗаголовокФормыСотрудника", Форма.Сотрудник.Наименование, Форма);
		СотрудникиКлиентСервер.УстановитьВидЗанятостиНовогоСотрудника(Форма);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			СтрШаблон(НСтр("ru = 'Неизвестный тип результата выбора - %1'"), ТипЗнч(РезультатВыбора)),
			"ПодборПерсоналаКлиент.ПроверитьОднофамильцевСотрудникаСредиКандидатовЗавершение");
	КонецЕсли;
		
КонецПроцедуры

// Выполняет действия при завершении поиска однофамильцев среди кандидатов в форме физического лица.
// 
// Параметры:
//  РезультатВыбора  - СправочникСсылка.ФизическиеЛица,СправочникСсылка.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//   * Форма - ФормаКлиентскогоПриложения
//   * ОповещениеЗавершения - ОписаниеОповещения
Процедура ПроверитьОднофамильцевФизическогоЛицаСредиКандидатовЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
		
	Если ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = ПредопределенноеЗначение("Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка");
		СотрудникиКлиент.ОбработатьВыборФизическогоЛицаОднофамильца(Форма, РезультатВыбора);
	ИначеЕсли ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		Форма.ЛичныеДанныеКандидатаСсылка = РезультатВыбора;
		Форма.ЗаполнитьФизическоеЛицоПоКандидату();
		Форма.ФИОФизическихЛиц.Фамилия = Форма.ФизическоеЛицо.Фамилия;
		Форма.ФИОФизическихЛиц.Имя = Форма.ФизическоеЛицо.Имя;
		Форма.ФИОФизическихЛиц.Отчество = Форма.ФизическоеЛицо.Отчество;
		Оповестить("ИзмененЗаголовокФормыСотрудника", Форма.ФизическоеЛицо.Наименование, Форма);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			СтрШаблон(НСтр("ru = 'Неизвестный тип результата выбора - %1'"), ТипЗнч(РезультатВыбора)),
			"ПодборПерсоналаКлиент.ПроверитьОднофамильцевФизическогоЛицаСредиКандидатовЗавершение");
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает видимость команды открытия списка групп доступа кандидатов в панеле администрирования пользователей
// и прав при изменении использования вида доступа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатовПриИзменении(Форма) Экспорт
	
	ИмяКонстанты = "ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов";
	ПодборПерсоналаВызовСервера.УстановитьЗначениеКонстанты(ИмяКонстанты, Форма[ИмяКонстанты]);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппыДоступаКандидатовОткрытьСписок",
		"Видимость", ПодборПерсоналаВызовСервера.ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Предназначена для обработки команды перехода из формы сотрудника к форме кандидата.
//
Процедура ОткрытьФормуКандидатаИзФормыСотрудника(Форма) Экспорт
	
	КандидатСсылка = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "КандидатСсылка");
	Если Не ЗначениеЗаполнено(КандидатСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Кандидаты.ФормаОбъекта", Новый Структура("Ключ", КандидатСсылка));
	
КонецПроцедуры

Процедура ОткрытьФормуНовогоКандидата(Знач ЗначенияЗаполнения = Неопределено, Знач ПараметрыФормы = Неопределено,
	Уникальность = Неопределено) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
	КонецЕсли;
	
	Если ЗначенияЗаполнения <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Кандидаты.Форма.ФормаЭлемента", ПараметрыФормы, , Уникальность);
	
КонецПроцедуры

Процедура ФизическиеЛицаФормаЭлементаПриВыполненииКоманды(Команда, Форма) Экспорт
	Если Команда.Имя = ПодборПерсоналаКлиентСервер.ИмяКомандыНовыйКандидатВФормеФизическиеЛица() Тогда
		НачатьОткрытиеФормыНовогоКандидата(Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытииФормыЭлементаИсторииВзаимоотношений(Ссылка, ФормаВладелец, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Ссылка) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	
	ОткрытьФорму(
		"Справочник.Кандидаты.ФормаОбъекта", 
		ПараметрыФормы, 
		ФормаВладелец, , , , , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ФизическиеЛицаФормаЭлементаОбработкаОповещения(Форма, ИмяСобытия, Параметр) Экспорт
	
	Если ИмяСобытия <> "Запись_Кандидаты" Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметр) = Тип("Структура") 
		И Параметр.Свойство("ФизическоеЛицо") 
		И Параметр.ФизическоеЛицо = Форма.ФизическоеЛицоСсылка Тогда
		СотрудникиКлиент.НачатьЗаполнениеИсторииВзаимоотношений(
			Форма, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Форма.ФизическоеЛицоСсылка));
	КонецЕсли;
	
КонецПроцедуры

// Инициирует открытие формы для редактирования места рождения физического лица.
//
// Параметры:
//  Форма - Форма - форма, в которой редактируются данные кандидата.
//  Элемент - ПолеФормы - поле ввода, в котором размещается представление места рождения.
//  СтандартнаяОбработка - Булево - признак стандартной обработки, который будет установлен в Ложь.
//  МестоРождения - Строка - данные места рождения, которые будет отредактированы.
//  ОповещениеЗавершения - ОписаниеОповещения, Неопределено	 - необязательный, если указано,
//  	будет выполнен после завершения редактирования, в качестве параметра передается признак Булево:
//  	Истина, если место рождения изменено, Ложь - в противном случае.
//
Процедура НачатьРедактированиеМестаРожденияКандидата(Форма, Элемент, СтандартнаяОбработка, МестоРождения,
	ОповещениеЗавершения = Неопределено) Экспорт
	
	МестоРожденияКандидатаНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, МестоРождения, ОповещениеЗавершения);
	
КонецПроцедуры

#Область ФормаФизическиеЛицаСПохожимиДанными

// Выделяет цветом совпадающие данные на форме ФизическиеЛицаСПохожимиДанными.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  НомерСтроки - Число
Процедура ВыделитьСовпадающиеДанные(Форма, НомерСтроки) Экспорт
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанных = Форма.Однофамильцы.НайтиПоИдентификатору(НомерСтроки);
	СовпадающиеДанные = СтрРазделить(СтрокаДанных.СовпадающиеДанные, ",");
	
	ИмяПоляТелефон = "МобильныйТелефон";
	ИмяПоляАдресЭлектроннойПочты = "АдресЭлектроннойПочты";
	ИмяГруппыТелефон = "МобильныйТелефонГруппа";
	ИмяГруппыАдресЭлектроннойПочты = "АдресЭлектроннойПочтыГруппа";
	ИмяГруппыФИО = "ЗаголовокОднофамильцаГруппа";
	
	ШрифтыЦвета = ПодборПерсоналаВызовСервера.ШрифтыЦветаСовпадающихДанных();
	
	Если СовпадающиеДанные.Найти("Телефон") = Неопределено Тогда
		Форма.Элементы[ИмяПоляТелефон].Шрифт = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИмяПоляТелефон].ШрифтЗаголовка = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИмяГруппыТелефон].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	Иначе
		Форма.Элементы[ИмяПоляТелефон].Шрифт = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИмяПоляТелефон].ШрифтЗаголовка = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИмяГруппыТелефон].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти("E-mail") = Неопределено Тогда
		Форма.Элементы[ИмяПоляАдресЭлектроннойПочты].Шрифт = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИмяПоляАдресЭлектроннойПочты].ШрифтЗаголовка = ШрифтыЦвета.ОбычныйШрифтТекста;
		Форма.Элементы[ИмяГруппыАдресЭлектроннойПочты].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	Иначе
		Форма.Элементы[ИмяПоляАдресЭлектроннойПочты].Шрифт = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИмяПоляАдресЭлектроннойПочты].ШрифтЗаголовка = ШрифтыЦвета.СовпадающиеДанныеШрифт;
		Форма.Элементы[ИмяГруппыАдресЭлектроннойПочты].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	КонецЕсли;
	
	Если СовпадающиеДанные.Найти("ФИО") = Неопределено Тогда
		Форма.Элементы[ИмяГруппыФИО].ЦветФона = ШрифтыЦвета.ОбычныйЦветФона;
	Иначе
		Форма.Элементы[ИмяГруппыФИО].ЦветФона = ШрифтыЦвета.СовпадающиеДанныеЦветФонаГруппы;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриВыбореФизическогоЛица(Форма, РезультатВыбора) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВыбора) И ЗначениеЗаполнено(Форма.ЛичныеДанныеКандидата) Тогда
		РезультатВыбора = Форма.ЛичныеДанныеКандидата;
	КонецЕсли;

КонецПроцедуры

Процедура ПриОткрытииЛичныхДанных(Форма, КлючФормы, ИмяОткрываемойФормы) Экспорт
	
	Если Не ЗначениеЗаполнено(КлючФормы) И ЗначениеЗаполнено(Форма.ЛичныеДанныеКандидата) Тогда
		КлючФормы = Форма.ЛичныеДанныеКандидата;
	КонецЕсли;
	
	Если ТипЗнч(КлючФормы) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		ИмяОткрываемойФормы = "Справочник.ЛичныеДанныеКандидатов.ФормаОбъекта";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеОтбораВИстории(Форма) Экспорт
	
	Если ЗначениеЗаполнено(Форма.ЛичныеДанныеКандидата) Тогда
		Форма.Элементы.История.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ЛичныеДанныеКандидата",
			Форма.ЛичныеДанныеКандидата));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область НачальнаяНастройкаПрограммы

Процедура ОткрытьФормуЗагрузкиДанныхИзEStaff(Форма) Экспорт
	
	ОткрытьФорму("Обработка.ПереносДанныхEStaff.Форма.ПереносДанныхEStaff", , Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельНастроекУправлениеПерсоналом

Процедура ИспользоватьСкрытиеПерсональныхДанныхКандидатовПриИзменении(Форма, НастройкиПодбораПерсонала) Экспорт
	
	Элементы = Форма.Элементы;
	ИспользоватьСкрытиеПерсональныхДанных = НастройкиПодбораПерсонала.ИспользоватьСкрытиеПерсональныхДанныхКандидатов;
	
	ФоновоеЗадание = ПодборПерсоналаВызовСервера.ЗапуститьИзменениеНастроекКонтроляПДнВФоновомЗадании(Форма.УникальныйИдентификатор, ИспользоватьСкрытиеПерсональныхДанных);
	
	ДоступностьЭлементов = Новый Соответствие;
	ДоступностьЭлементов.Вставить(Элементы.ИспользоватьСкрытиеПерсональныхДанныхКандидатов.Имя, Элементы.ИспользоватьСкрытиеПерсональныхДанныхКандидатов.Доступность);
	
	Если ФоновоеЗадание <> Неопределено
		И ФоновоеЗадание.Статус = "Выполняется" Тогда
		
		Элементы.ИспользоватьСкрытиеПерсональныхДанныхКандидатов.Доступность = Ложь;
		Элементы.ДекорацияОжиданиеИзмененияИспользоватьСкрытиеПДн.Видимость = Истина;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ДоступностьЭлементов", ДоступностьЭлементов);
	ДополнительныеПараметры.Вставить("НастройкиПодбораПерсонала", НастройкиПодбораПерсонала);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("ПослеИзмененияНастроекКонтроляПДн", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область КадровыеДокументы

Процедура ДополнитьПараметрыОтбораСпискаРешений(ИмяДокумента, ПараметрыОтбора, Объект) Экспорт 
	
	Если ИмяДокумента = "РешениеОПриемеНаРаботу" Тогда
		ЛичныеДанныеКандидата = ПодборПерсоналаВызовСервера.ЛичныеДанныеКандидатаФизическогоЛица(
			Объект.ФизическоеЛицо);
		Если ЗначениеЗаполнено(ЛичныеДанныеКандидата) Тогда
			ПараметрыОтбора.Вставить("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПанельНастроекУправлениеПерсоналом

Процедура ПослеИзмененияНастроекКонтроляПДн(ФоновоеЗадание, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Элементы = Форма.Элементы;
	ДоступностьЭлементов = ДополнительныеПараметры.ДоступностьЭлементов;
	
	Для Каждого КлючИЗначение Из ДоступностьЭлементов Цикл
		
		ИмяЭлемента = КлючИЗначение.Ключ;
		ДоступностьДо = КлючИЗначение.Значение;
		ТекущийЭлемент = Элементы.Найти(ИмяЭлемента);
		
		Если ТекущийЭлемент.Доступность <> ДоступностьДо Тогда
			ТекущийЭлемент.Доступность = ДоступностьДо;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Элементы.ДекорацияОжиданиеИзмененияИспользоватьСкрытиеПДн.Видимость Тогда
		Элементы.ДекорацияОжиданиеИзмененияИспользоватьСкрытиеПДн.Видимость = Ложь;
	КонецЕсли;
	
	Если ФоновоеЗадание <> Неопределено
		И ФоновоеЗадание.Статус = "Выполнено" Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Настройки контроля персональных данных изменены.'"));
		
	Иначе
		
		НастройкиПодбораПерсонала = ДополнительныеПараметры.НастройкиПодбораПерсонала;
		ИспользоватьСкрытиеПерсональныхДанных = Не НастройкиПодбораПерсонала.ИспользоватьСкрытиеПерсональныхДанныхКандидатов;
		
		НастройкиПодбораПерсонала.ИспользоватьСкрытиеПерсональныхДанныхКандидатов = ИспользоватьСкрытиеПерсональныхДанных;
		ПодборПерсоналаВызовСервера.ЗаписатьНастройкиПодбораПерсонала(Форма.УникальныйИдентификатор, НастройкиПодбораПерсонала);
		
		Форма.НастройкиПодбораПерсонала.ИспользоватьСкрытиеПерсональныхДанныхКандидатов = ИспользоватьСкрытиеПерсональныхДанных;
		
		Если ФоновоеЗадание <> Неопределено Тогда
			ТекстОшибки = НСтр("ru='Не удалось изменить настройки контроля персональных данных кандидатов.
				|См. подробности в журнале регистрации.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Оповестить("Запись_НастройкиПодбораПерсонала", Новый Структура, "ИспользоватьСкрытиеПерсональныхДанныхКандидатов");
	
КонецПроцедуры

#КонецОбласти

Процедура НачатьПринятиеРешенияПоКандидату(Кандидаты, Решение, ОписаниеОповещения, Владелец) Экспорт
	
	ПараметрыФормы = Новый Структура("Кандидаты, Решение, Источник");
	ПараметрыФормы.Кандидаты = Кандидаты;
	ПараметрыФормы.Решение = Решение;
	
	ОткрытьФорму(
		"Справочник.Кандидаты.Форма.ФормаРешенияПоКандидату", 
		ПараметрыФормы, 
		Владелец, 
		Владелец, , , 
		ОписаниеОповещения);

КонецПроцедуры

Процедура НачатьЗаполнениеСчетчиковКандидатовПоВакансии(Вакансия, ТолькоКандидатыВРаботе, Форма, ОписаниеОповещения) Экспорт

	ДлительнаяОперация = ПодборПерсоналаВызовСервера.ДлительнаяОперацияЗаполненияСчетчиковКандидатовПоВакансии(
		Вакансия, ТолькоКандидатыВРаботе, Форма.УникальныйИдентификатор); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение информационной строки кандидатов'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("Вакансия, ОписаниеОповещения");
	ДополнительныеПараметры.Вакансия = Вакансия;
	ДополнительныеПараметры.ОписаниеОповещения = ОписаниеОповещения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеСчетчиковКандидатовПоВакансии", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

Процедура ЗавершитьЗаполнениеСчетчиковКандидатовПоВакансии(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Результат);
	
КонецПроцедуры

Процедура НачатьЗаполнениеИнформацииЗанятостиПоВакансии(Вакансия, Форма, ОписаниеОповещения) Экспорт
	
	ДлительнаяОперация = ПодборПерсоналаВызовСервера.ДлительнаяОперацияЗаполненияЗанятостиПоВакансии(
		Вакансия, Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение информационной строки занятости позиций'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("Вакансия, ОписаниеОповещения");
	ДополнительныеПараметры.Вакансия = Вакансия;
	ДополнительныеПараметры.ОписаниеОповещения = ОписаниеОповещения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеИнформацииЗанятости", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

Процедура НачатьЗаполнениеИнформацииЗанятостиПоДаннымВакансии(ДанныеВакансии, Форма, ОписаниеОповещения) Экспорт
	
	ДлительнаяОперация = ПодборПерсоналаВызовСервера.ДлительнаяОперацияЗаполненияЗанятостиПоДаннымВакансии(
		ДанныеВакансии, Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение информационной строки занятости позиций'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("Вакансия, ОписаниеОповещения");
	ДополнительныеПараметры.Вакансия = ДанныеВакансии.Вакансия;
	ДополнительныеПараметры.ОписаниеОповещения = ОписаниеОповещения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеИнформацииЗанятости", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

Процедура ЗавершитьЗаполнениеИнформацииЗанятости(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Результат);
	
КонецПроцедуры

Процедура ОткрытьФормуНовогоКандидатаФизическогоЛица(Форма)
	
	ЗначенияЗаполнения = Новый Структура("ФизическоеЛицо");
	ЗначенияЗаполнения.ФизическоеЛицо = Форма.ФизическоеЛицо.Ссылка;
	
	ОткрытьФормуНовогоКандидата(ЗначенияЗаполнения, , Форма.ФизическоеЛицо.Ссылка);
	
КонецПроцедуры

Процедура НачатьОткрытиеФормыНовогоКандидата(Форма)

	Если Не Форма.Параметры.Ключ.Пустая() Тогда
		ОткрытьФормуНовогоКандидатаФизическогоЛица(Форма);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("Форма", Форма);
	Форма.НачатьЗапись(, Новый ОписаниеОповещения("ЗавершитьОткрытиеФормыНовогоКандидата", ЭтотОбъект, ПараметрыОповещения));
	
КонецПроцедуры

Процедура ЗавершитьОткрытиеФормыНовогоКандидата(ПараметрыЗаписи, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Не Форма.Записать(ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;

	Форма.Модифицированность = Ложь;
	
	ОткрытьФормуНовогоКандидатаФизическогоЛица(ДополнительныеПараметры.Форма);
	
КонецПроцедуры

Процедура МестоРожденияКандидатаНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, МестоРождения,
	ОповещениеЗавершения = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Представление", МестоРождения);
	
	Оповещение = Новый ОписаниеОповещения("МестоРожденияКандидатаНачалоВыбораЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ВводМестаРождения", ПараметрыФормы, , , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

Процедура МестоРожденияКандидатаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Форма = ДополнительныеПараметры.Форма;
	Элемент = ДополнительныеПараметры.Элемент;
	ОповещениеЗавершения = ДополнительныеПараметры.ОповещениеЗавершения;
	
	Форма.ЛичныеДанныеКандидата.МестоРождения = Результат;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, Элемент.Имя) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, Элемент.Имя,
			ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(Результат));
	КонецЕсли;
	Форма.Модифицированность = Истина;

	Если ОповещениеЗавершения <> Неопределено Тогда
		МестоРожденияИзменено = Результат <> Неопределено;
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, МестоРожденияИзменено);
	Иначе
		Форма.ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьКомментарийПередУдалением(ДанныеКомментария) Экспорт

	Если ДанныеКомментария.Пользователь <> ПользователиКлиент.АвторизованныйПользователь() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Вы не можете удалить комментарий другого пользователя.'"), , 
			НСтр("ru = 'Удаление комментария'"));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти