
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ОрганизацияСсылка") Тогда
		ВызватьИсключение НСтр("ru='Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
	
	Объект.Организация = Параметры.ОрганизацияСсылка;
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	СвойстваДоступны = УправлениеСвойствами.СвойстваДоступны();
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УсловияМедицинскогоСтрахования) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ПриПолученииДанныхНаСервере();
	
	Если Параметры.Свойство("СтраховаяКомпания") Тогда
		УстановитьЗначенияПоУмолчанию(Параметры.СтраховаяКомпания);
	КонецЕсли;
	
	ЗаголовокСтраховаяКомпания = "";
	
	Если Параметры.Свойство("СтраховаяКомпания") И ЗначениеЗаполнено(Параметры.СтраховаяКомпания)
		И СтраховыеКомпании.НайтиПоЗначению(Параметры.СтраховаяКомпания) <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраховыеКомпании", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОтступ", "Видимость", Ложь);
		Объект.СтраховаяКомпания = Параметры.СтраховаяКомпания;
		ЗаголовокСтраховаяКомпания = СтрШаблон(НСтр("ru = '(страховая компания: %1)'"),
			Строка(Параметры.СтраховаяКомпания));
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru = '%1: %2 %3'"),
		Строка(Параметры.ОрганизацияСсылка),
		НСтр("ru='Настройки медицинского страхования'"),
		ЗаголовокСтраховаяКомпания);
	
	ИспользуютсяУдержания = ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиУдержания", "Видимость", ИспользуютсяУдержания);
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Или Не СвойстваДоступны Тогда
		Элементы.ОтправляемыеДополнительныеРеквизитыИСведения.Видимость = Ложь;
	КонецЕсли;
	
	Если ИспользоватьДополнительныеРеквизитыИСведения И СвойстваДоступны Тогда
		Элементы.ПояснениеДополнительныеРеквизитыИСведения.Видимость = ?(СвойстваФизическихЛиц.Количество() > 0, Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.СтраховаяКомпания) Тогда
		Элементы.СтраховыеКомпании.ТекущаяСтрока = Объект.СтраховаяКомпания;
		
		ПодготовитьШкалуВозраста(ПредыдущаяСтраховаяКомпания, Объект.СтраховаяКомпания);
		ПодготовитьШкалуВозрастаДляРодственников(ПредыдущаяСтраховаяКомпания, Объект.СтраховаяКомпания);
		ПредыдущаяСтраховаяКомпания = Объект.СтраховаяКомпания;
		
		УстановитьОтборТаблиц(Объект.СтраховаяКомпания);
		
		ДобавитьСтрокиШкалыВозраста(ШкалаВозраста);
		ДобавитьСтрокиШкалыВозраста(ШкалаВозрастаДляРодственников);
		СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозраста);
		СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозрастаДляРодственников);
		
		УстановитьВидимостьНастроекУдержания();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьНаКлиенте", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаСтрахованияПриИзменении(Элемент)
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	НайденныеСтроки = ПериодыСтрахования.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаПериода = ПериодыСтрахования.Добавить();
		СтрокаПериода.СтраховаяКомпания = СтраховаяКомпания;
	Иначе
		СтрокаПериода = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаПериода.НачалоПериодаСтрахования = Объект.ДатаНачалаСтрахования;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаСтрахованияПриИзменении(Элемент)
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	НайденныеСтроки = ПериодыСтрахования.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаПериода = ПериодыСтрахования.Добавить();
		СтрокаПериода.СтраховаяКомпания = СтраховаяКомпания;
	Иначе
		СтрокаПериода = НайденныеСтроки[0];
	КонецЕсли;
	
	СтрокаПериода.ОкончаниеПериодаСтрахования = Объект.ДатаОкончанияСтрахования;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенкомПриИзменении(Элемент)
	
	СтрокаНастройки = СтрокаНастройкиСтраховойКомпании();
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуютсяРасширенияПрограммПриИзменении(Элемент)
	
	СтрокаНастройки = СтрокаНастройкиСтраховойКомпании();
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.ИспользуютсяРасширенияПрограмм = ИспользуютсяРасширенияПрограмм;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СдвигДатыПрикрепленияПриИзменении(Элемент)
	
	СтрокаНастройки = СтрокаНастройкиСтраховойКомпании();
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.СдвигДатыПрикрепления = СдвигДатыПрикрепления;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяУдержаниеПриИзменении(Элемент)
	
	УстановитьВидимостьНастроекУдержания();
	
	СтрокаНастройки = СтрокаНастройкиУдержанийСтраховойКомпании();
	
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.ТребуетсяУдержание = Объект.ТребуетсяУдержание;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СпособУдержания) Тогда
		Объект.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно");
		Если СтрокаНастройки <> Неопределено Тогда
			СтрокаНастройки.СпособУдержания = Объект.СпособУдержания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяетсяЧастичноеУдержаниеПриИзменении(Элемент)
	
	УстановитьВидимостьНастроекЧастичногоУдержания();
	
	СтрокаНастройки = СтрокаНастройкиУдержанийСтраховойКомпании();
	
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.ПрименяетсяЧастичноеУдержание = Объект.ПрименяетсяЧастичноеУдержание;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентЧастичногоУдержанияПриИзменении(Элемент)
	
	СтрокаНастройки = СтрокаНастройкиУдержанийСтраховойКомпании();
	
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.ПроцентЧастичногоУдержания = Объект.ПроцентЧастичногоУдержания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдержаниеПриИзменении(Элемент)
	
	СтрокаНастройки = СтрокаНастройкиУдержанийСтраховойКомпании();
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.Удержание = Объект.Удержание;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУдержанияМедицинскогоСтрахованияПриИзменении(Элемент)
	
	УстановитьВидимостьНастроекУдержания();
	
	СтрокаНастройки = СтрокаНастройкиУдержанийСтраховойКомпании();
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.СпособУдержания = Объект.СпособУдержания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдержаниеЗаСотрудникаПриИзменении(Элемент)
	
	СтрокаНастройки = СтрокаНастройкиУдержанийСтраховойКомпании();
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.УдержаниеЗаСотрудника = Объект.УдерживатьЗаСотрудника;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдержаниеЗаРодственниковПриИзменении(Элемент)
	
	СтрокаНастройки = СтрокаНастройкиУдержанийСтраховойКомпании();
	Если СтрокаНастройки <> Неопределено Тогда
		СтрокаНастройки.УдержаниеЗаРодственников = Объект.УдерживатьЗаРодственников;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВводМесяцаУдержанияНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
		Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Неопределено, "Месяц", Ложь),
		ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержания", "Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержанияСтрокой");
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ГрафикУдержаний.ТекущаяСтрока;
	СтрокаГрафика = ГрафикУдержаний.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаГрафика.СтраховаяКомпания = СтраховаяКомпания;
	
	ГрафикУдержаний.Сортировать("МесяцУдержания");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийМесяцУдержанияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержания", "Элементы.ГрафикУдержаний.ТекущиеДанные.МесяцУдержанияСтрокой", Направление);
	ГрафикУдержаний.Сортировать("МесяцУдержания");
	
КонецПроцедуры

&НаКлиенте
Процедура ВводМесяцаУдержанияНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.ГрафикУдержаний.ТекущаяСтрока;
	СтрокаГрафика = ГрафикУдержаний.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаГрафика.СтраховаяКомпания = СтраховаяКомпания;
	СтрокаГрафика.МесяцУдержания = ВыбранноеЗначение;
	СтрокаГрафика.МесяцУдержанияСтрокой = Формат(ВыбранноеЗначение, "ДФ='ММММ гггг'");
	
	ГрафикУдержаний.Сортировать("МесяцУдержания");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтраховыеКомпании

&НаКлиенте
Процедура СтраховыеКомпанииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанныеСК.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", ТекущиеДанныеСК.Значение);
	НайденныеСтроки = ПериодыСтрахования.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрокаПериода = ПериодыСтрахования.Добавить();
		НоваяСтрокаПериода.СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	
	НайденныеНастройкиУдержаний = НастройкиУдержаний.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеНастройкиУдержаний.Количество() = 0 Тогда
		НоваяНастройкаУдержания = НастройкиУдержаний.Добавить();
		НоваяНастройкаУдержания.СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	
	УстановитьОтборТаблиц(ТекущиеДанныеСК.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховыеКомпанииПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		Объект.СтраховаяКомпания = Неопределено;
	Иначе
		Объект.СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	
	ПодготовитьШкалуВозраста(ПредыдущаяСтраховаяКомпания, Объект.СтраховаяКомпания);
	ПодготовитьШкалуВозрастаДляРодственников(ПредыдущаяСтраховаяКомпания, Объект.СтраховаяКомпания);
	ПредыдущаяСтраховаяКомпания = Объект.СтраховаяКомпания;
	
	УстановитьОтборТаблиц(Объект.СтраховаяКомпания);
	
	ДобавитьСтрокиШкалыВозраста(ШкалаВозраста);
	ДобавитьСтрокиШкалыВозраста(ШкалаВозрастаДляРодственников);
	СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозраста);
	СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозрастаДляРодственников);
	
	УстановитьВидимостьНастроекУдержания();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммыМедицинскогоСтрахования

&НаКлиенте
Процедура ПрограммыМедицинскогоСтрахованияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеПрограмм = Элемент.ТекущиеДанные;
	Если ТекущиеДанныеПрограмм = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанныеПрограмм.СтраховаяКомпания = СтраховаяКомпания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАдресаРассылки

&НаКлиенте
Процедура АдресаРассылкиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеАдресов = Элемент.ТекущиеДанные;
	Если ТекущиеДанныеАдресов = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанныеАдресов.СтраховаяКомпания = СтраховаяКомпания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалаВозраста

&НаКлиенте
Процедура ШкалаВозрастаЗначениеОтПриИзменении(Элемент)
	
	СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозраста);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаЗначениеДоПриИзменении(Элемент)
	
	СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозраста);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковЗначениеОтПриИзменении(Элемент)
	
	СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозрастаДляРодственников);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковЗначениеДоПриИзменении(Элемент)
	
	СформироватьПредставлениеИнтервалаШкалыВозраста(ШкалаВозрастаДляРодственников);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	УпорядочитьСтрокиШкалыВозраста(Элемент.ТекущиеДанные, ШкалаВозраста);
	СкорректироватьСоседниеСтрокиШкалыВозраста(Элемент.ТекущиеДанные, ШкалаВозраста);
	ДобавитьСтрокиШкалыВозраста(ШкалаВозраста);
	СкорректироватьИнтервалыШкалыВозраста(ШкалаВозраста);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаПослеУдаления(Элемент)
	
	ДобавитьСтрокиШкалыВозраста(ШкалаВозраста);
	СкорректироватьИнтервалыШкалыВозраста(ШкалаВозраста);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	УпорядочитьСтрокиШкалыВозраста(Элемент.ТекущиеДанные, ШкалаВозрастаДляРодственников);
	СкорректироватьСоседниеСтрокиШкалыВозраста(Элемент.ТекущиеДанные, ШкалаВозрастаДляРодственников);
	ДобавитьСтрокиШкалыВозраста(ШкалаВозрастаДляРодственников);
	СкорректироватьИнтервалыШкалыВозраста(ШкалаВозрастаДляРодственников);
	
КонецПроцедуры

&НаКлиенте
Процедура ШкалаВозрастаДляРодственниковПослеУдаления(Элемент)
	
	ДобавитьСтрокиШкалыВозраста(ШкалаВозрастаДляРодственников);
	СкорректироватьИнтервалыШкалыВозраста(ШкалаВозрастаДляРодственников);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если ПроверитьЗаполнениеНаКлиенте() Тогда
		ЗаписатьНаКлиенте();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	СтраховыеКомпании.Очистить();
	
	// Настройки страховой компании
	ПериодыСтрахования.Очистить();
	НастройкиСтраховыхКомпаний.Очистить();
	Объект.ДатаНачалаСтрахования = Неопределено;
	Объект.ДатаОкончанияСтрахования = Неопределено;
	
	НаборЗаписей = РегистрыСведений.УсловияМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ЗаписьНабора.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ЗаписьНабора.СтраховаяКомпания);
		КонецЕсли;
		НоваяСтрока = ПериодыСтрахования.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.НачалоПериодаСтрахования = ЗаписьНабора.НачалоПериодаСтрахования;
		НоваяСтрока.ОкончаниеПериодаСтрахования = ЗаписьНабора.ОкончаниеПериодаСтрахования;
		
		НоваяСтрока = НастройкиСтраховыхКомпаний.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = ЗаписьНабора.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком;
		НоваяСтрока.ИспользуютсяРасширенияПрограмм = ЗаписьНабора.ИспользуютсяРасширенияПрограмм;
		НоваяСтрока.СдвигДатыПрикрепления = ЗаписьНабора.СдвигДатыПрикрепления;
	КонецЦикла;
	
	// Программы страхования
	ПрограммыМедицинскогоСтрахования.Очистить();
	
	НаборЗаписей = РегистрыСведений.ПрограммыМедицинскогоСтрахованияПоУмолчанию.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		СтраховаяКомпанияЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьНабора.ПрограммаСтрахования, "СтраховаяКомпания");
		Если СтраховыеКомпании.НайтиПоЗначению(СтраховаяКомпанияЗаписи) = Неопределено Тогда
			СтраховыеКомпании.Добавить(СтраховаяКомпанияЗаписи);
		КонецЕсли;
		НоваяСтрока = ПрограммыМедицинскогоСтрахования.Добавить();
		НоваяСтрока.СтраховаяКомпания = СтраховаяКомпанияЗаписи;
		НоваяСтрока.ПрограммаСтрахования = ЗаписьНабора.ПрограммаСтрахования;
	КонецЦикла;
	
	// Адреса рассылки
	АдресаРассылки.Очистить();
	
	НаборЗаписей = РегистрыСведений.АдресаОтправкиУведомленийСтраховыхКомпаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ЗаписьНабора.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ЗаписьНабора.СтраховаяКомпания);
		КонецЕсли;
		НоваяСтрока = АдресаРассылки.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.Email = ЗаписьНабора.Email;
	КонецЦикла;
	
	// Шкала возраста
	ШкалыВозрастов.Очистить();
	
	НаборЗаписей = РегистрыСведений.ВозрастныеКоэффициентыСтраховыхКомпаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	ТаблицаШкалы = НаборЗаписей.Выгрузить();
	ТаблицаШкалы.Сортировать("ИндексСтроки");
	
	ТекСтраховаяКомпания = Неопределено;
	Для Каждого ТекСтрока Из ТаблицаШкалы Цикл 
		
		Если ТекСтраховаяКомпания <> ТекСтрока.СтраховаяКомпания Тогда
			ТекСтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
			ЗначениеДоПредыдущее = 0;
		КонецЕсли;
		
		Если СтраховыеКомпании.НайтиПоЗначению(ТекСтрока.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ТекСтрока.СтраховаяКомпания);
		КонецЕсли;
		
		НоваяСтрока = ШкалыВозрастов.Добавить();
		НоваяСтрока.СтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
		НоваяСтрока.ЗначениеОт = ЗначениеДоПредыдущее;
		НоваяСтрока.ЗначениеДо = ТекСтрока.ВерхняяГраницаИнтервалаВозраста;
		НоваяСтрока.ЗначениеПоказателя = ТекСтрока.ЗначениеПоказателя;
		
		ЗначениеДоПредыдущее = НоваяСтрока.ЗначениеДо + 1;
		
	КонецЦикла;
	
	// Шкала возраста для родственников
	ШкалыВозрастовДляРодственников.Очистить();
	
	НаборЗаписей = РегистрыСведений.ВозрастныеКоэффициентыСтраховыхКомпанийДляРодственников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	ТаблицаШкалы = НаборЗаписей.Выгрузить();
	ТаблицаШкалы.Сортировать("ИндексСтроки");
	
	ТекСтраховаяКомпания = Неопределено;
	Для Каждого ТекСтрока Из ТаблицаШкалы Цикл 
		
		Если ТекСтраховаяКомпания <> ТекСтрока.СтраховаяКомпания Тогда
			ТекСтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
			ЗначениеДоПредыдущее = 0;
		КонецЕсли;
		
		Если СтраховыеКомпании.НайтиПоЗначению(ТекСтрока.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ТекСтрока.СтраховаяКомпания);
		КонецЕсли;
		
		НоваяСтрока = ШкалыВозрастовДляРодственников.Добавить();
		НоваяСтрока.СтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
		НоваяСтрока.ЗначениеОт = ЗначениеДоПредыдущее;
		НоваяСтрока.ЗначениеДо = ТекСтрока.ВерхняяГраницаИнтервалаВозраста;
		НоваяСтрока.ЗначениеПоказателя = ТекСтрока.ЗначениеПоказателя;
		
		ЗначениеДоПредыдущее = НоваяСтрока.ЗначениеДо + 1;
		
	КонецЦикла;
	
	// Настройки удержаний
	Объект.Удержание = Неопределено;
	Объект.СпособУдержания = Неопределено;
	Объект.ТребуетсяУдержание = Ложь;
	НастройкиУдержаний.Очистить();
	
	НаборЗаписей = РегистрыСведений.НастройкиУдержанийМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ЗаписьНабора.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ЗаписьНабора.СтраховаяКомпания);
		КонецЕсли;
		НоваяСтрока = НастройкиУдержаний.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.Удержание = ЗаписьНабора.Удержание;
		НоваяСтрока.СпособУдержания = ЗаписьНабора.СпособУдержания;
		НоваяСтрока.ТребуетсяУдержание = Истина;
		НоваяСтрока.УдержаниеЗаСотрудника = ЗаписьНабора.УдержаниеЗаСотрудника;
		НоваяСтрока.УдержаниеЗаРодственников = ЗаписьНабора.УдержаниеЗаРодственников;
		НоваяСтрока.ПрименяетсяЧастичноеУдержание = ЗаписьНабора.ПрименяетсяЧастичноеУдержание;
		НоваяСтрока.ПроцентЧастичногоУдержания = ЗаписьНабора.ПроцентЧастичногоУдержания;
	КонецЦикла;
	
	ГрафикУдержаний.Очистить();
	
	НаборЗаписей = РегистрыСведений.НастройкиГрафиковУдержанийМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ЗаписьНабора.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ЗаписьНабора.СтраховаяКомпания);
		КонецЕсли;
		НоваяСтрока = ГрафикУдержаний.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.МесяцУдержания = ЗаписьНабора.Дата;
		НоваяСтрока.МесяцУдержанияСтрокой = Формат(ЗаписьНабора.Дата, "ДФ='ММММ гггг'");
	КонецЦикла;
	
	ЗаполнитьОтправляемыеДанные();
	ЗаполнитьОтправляемуюКонтактнуюИнформацию();
	ЗаполнитьОтправляемыеДополнительныеРеквизитыИСведения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию(СтраховаяКомпания)

	Если Не ЗначениеЗаполнено(СтраховаяКомпания) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтраховыеКомпании.НайтиПоЗначению(СтраховаяКомпания) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтраховыеКомпании.Добавить(СтраховаяКомпания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте()
	
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	
	ПредыдущаяСтраховая = ПредыдущаяСтраховаяКомпания;
	ПодготовитьШкалуВозраста(ПредыдущаяСтраховая, СтраховаяКомпания);
	ПодготовитьШкалуВозрастаДляРодственников(ПредыдущаяСтраховая, СтраховаяКомпания);
	
	// Проверка заполнения шкалы оценки.
	Если Не ШкалаВозрастаЗаполненаПравильно() Тогда 
		Оповещение = Новый ОписаниеОповещения("ОбработатьОтветОКорректировкеШкалыВозраста", ЭтаФорма);
		ТекстВопроса = НСтр("ru = 'Обнаружены неверно заполненные интервалы шкалы. Скорректировать значения интервалов автоматически?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Возврат;
	КонецЕсли;
	
	ЗаписатьНаСервере();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	// Настройки страховой компании
	НаборЗаписей = РегистрыСведений.УсловияМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	Для Каждого СтрокаТаблицы Из ПериодыСтрахования Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНайдена = Ложь;
		Для каждого НайденнаяЗаписьНабора Из НаборЗаписей Цикл
			Если НайденнаяЗаписьНабора.Организация = Объект.Организация И НайденнаяЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания Тогда
				ЗаписьНайдена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗаписьНайдена Тогда
			ЗаписьНабора = НайденнаяЗаписьНабора;
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
		КонецЕсли;
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
		ЗаписьНабора.НачалоПериодаСтрахования = СтрокаТаблицы.НачалоПериодаСтрахования;
		ЗаписьНабора.ОкончаниеПериодаСтрахования = СтрокаТаблицы.ОкончаниеПериодаСтрахования;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из НастройкиСтраховыхКомпаний Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНайдена = Ложь;
		Для каждого НайденнаяЗаписьНабора Из НаборЗаписей Цикл
			Если НайденнаяЗаписьНабора.Организация = Объект.Организация И НайденнаяЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания Тогда
				ЗаписьНайдена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗаписьНайдена Тогда
			ЗаписьНабора = НайденнаяЗаписьНабора;
		Иначе
			ЗаписьНабора = НаборЗаписей.Добавить();
		КонецЕсли;
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
		ЗаписьНабора.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = СтрокаТаблицы.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком;
		ЗаписьНабора.ИспользуютсяРасширенияПрограмм = СтрокаТаблицы.ИспользуютсяРасширенияПрограмм;
		ЗаписьНабора.СдвигДатыПрикрепления = СтрокаТаблицы.СдвигДатыПрикрепления;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	// Программы страхования
	НаборЗаписей = РегистрыСведений.ПрограммыМедицинскогоСтрахованияПоУмолчанию.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	Для каждого СтрокаТаблицы Из ПрограммыМедицинскогоСтрахования Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.ПрограммаСтрахования = СтрокаТаблицы.ПрограммаСтрахования;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	// Адреса рассылки
	НаборЗаписей = РегистрыСведений.АдресаОтправкиУведомленийСтраховыхКомпаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	Для каждого СтрокаТаблицы Из АдресаРассылки Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
		ЗаписьНабора.Email = СтрокаТаблицы.Email;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	// Шкала возраста
	НаборЗаписей = РегистрыСведений.ВозрастныеКоэффициентыСтраховыхКомпаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	ПерваяСтрока = Истина;
	НомерСтроки = 0;
	Для Каждого ТекСтрока Из ШкалыВозрастов Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ТекСтрока.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
		Если ПерваяСтрока Тогда 
			ПерваяСтрока = Ложь;
			Если ТекСтрока.ЗначениеОт <> 0 Тогда 
				ЗаписьНабора = НаборЗаписей.Добавить();
				ЗаписьНабора.Организация = Объект.Организация;
				ЗаписьНабора.СтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
				ЗаписьНабора.ВерхняяГраницаИнтервалаВозраста = ТекСтрока.ЗначениеОт;
				ЗаписьНабора.ЗначениеПоказателя = 0;
				ЗаписьНабора.ИндексСтроки = НомерСтроки;
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
		ЗаписьНабора.ВерхняяГраницаИнтервалаВозраста = ТекСтрока.ЗначениеДо;
		ЗаписьНабора.ЗначениеПоказателя = ТекСтрока.ЗначениеПоказателя;
		ЗаписьНабора.ИндексСтроки = НомерСтроки;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	// Шкала возраста для родственников
	НаборЗаписей = РегистрыСведений.ВозрастныеКоэффициентыСтраховыхКомпанийДляРодственников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	ПерваяСтрока = Истина;
	НомерСтроки = 0;
	Для Каждого ТекСтрока Из ШкалыВозрастовДляРодственников Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ТекСтрока.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
		Если ПерваяСтрока Тогда 
			ПерваяСтрока = Ложь;
			Если ТекСтрока.ЗначениеОт <> 0 Тогда 
				ЗаписьНабора = НаборЗаписей.Добавить();
				ЗаписьНабора.Организация = Объект.Организация;
				ЗаписьНабора.СтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
				ЗаписьНабора.ВерхняяГраницаИнтервалаВозраста = ТекСтрока.ЗначениеОт;
				ЗаписьНабора.ЗначениеПоказателя = 0;
				ЗаписьНабора.ИндексСтроки = НомерСтроки;
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = ТекСтрока.СтраховаяКомпания;
		ЗаписьНабора.ВерхняяГраницаИнтервалаВозраста = ТекСтрока.ЗначениеДо;
		ЗаписьНабора.ЗначениеПоказателя = ТекСтрока.ЗначениеПоказателя;
		ЗаписьНабора.ИндексСтроки = НомерСтроки;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	// Настройки удержаний
	НаборЗаписей = РегистрыСведений.НастройкиУдержанийМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	Для каждого СтрокаТаблицы Из НастройкиУдержаний Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТаблицы.ТребуетсяУдержание Тогда
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Организация = Объект.Организация;
			ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
			ЗаписьНабора.Удержание = СтрокаТаблицы.Удержание;
			ЗаписьНабора.СпособУдержания = СтрокаТаблицы.СпособУдержания;
			ЗаписьНабора.УдержаниеЗаСотрудника = СтрокаТаблицы.УдержаниеЗаСотрудника;
			ЗаписьНабора.УдержаниеЗаРодственников = СтрокаТаблицы.УдержаниеЗаРодственников;
			ЗаписьНабора.ПрименяетсяЧастичноеУдержание = СтрокаТаблицы.ПрименяетсяЧастичноеУдержание;
			Если СтрокаТаблицы.ПрименяетсяЧастичноеУдержание Тогда
				ЗаписьНабора.ПроцентЧастичногоУдержания = СтрокаТаблицы.ПроцентЧастичногоУдержания;
			Иначе
				ЗаписьНабора.ПроцентЧастичногоУдержания = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.НастройкиГрафиковУдержанийМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НомерПоПорядку = 1;
	Для каждого СтрокаТаблицы Из ГрафикУдержаний Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
		ЗаписьНабора.НомерПоПорядку = НомерПоПорядку;
		ЗаписьНабора.Дата = СтрокаТаблицы.МесяцУдержания;
		НомерПоПорядку = НомерПоПорядку + 1;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	ЗаписатьОтправляемыеДанные();
	ЗаписатьОтправляемуюКонтактнуюИнформацию();
	ЗаписатьОтправляемыеДополнительныеРеквизитыИСведения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПроверитьЗаполнениеНаКлиенте() Тогда
		ЗаписатьНаКлиенте();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборТаблиц(СтраховаяКомпания)
	
	ТолькоПросмотрЭлементов = Не ЗначениеЗаполнено(СтраховаяКомпания);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачалоПериодаСтрахования", "ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОкончаниеПериодаСтрахования", "ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрограммыМедицинскогоСтрахования", "ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "АдресаРассылки", "ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиУдержания", "ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтправляемыеСведения", "ТолькоПросмотр", ТолькоПросмотрЭлементов);
	
	ПараметрыОтбора = Новый ФиксированнаяСтруктура("СтраховаяКомпания", СтраховаяКомпания);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрограммыМедицинскогоСтрахования", "ОтборСтрок", ПараметрыОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "АдресаРассылки", "ОтборСтрок", ПараметрыОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикУдержаний", "ОтборСтрок", ПараметрыОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтправляемыеДанные", "ОтборСтрок", ПараметрыОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтправляемаяКонтактнаяИнформация", "ОтборСтрок", ПараметрыОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтправляемыеДополнительныеРеквизитыИСведения", "ОтборСтрок", ПараметрыОтбора);

	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	НайденныеСтроки = ПериодыСтрахования.НайтиСтроки(ПараметрыОтбора);
	Для Каждого НайденныйПериод Из НайденныеСтроки Цикл
		Объект.ДатаНачалаСтрахования = НайденныйПериод.НачалоПериодаСтрахования;
		Объект.ДатаОкончанияСтрахования = НайденныйПериод.ОкончаниеПериодаСтрахования;
	КонецЦикла;
	
	Объект.ТребуетсяУдержание = Ложь;
	Объект.Удержание = Неопределено;
	Объект.СпособУдержания = Неопределено;
	Объект.УдерживатьЗаСотрудника = Ложь;
	Объект.УдерживатьЗаРодственников = Ложь;
	Объект.ПрименяетсяЧастичноеУдержание = Ложь;
	Объект.ПроцентЧастичногоУдержания = 0;
	НайденныеНастройкиУдержаний = НастройкиУдержаний.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Строка Из НайденныеНастройкиУдержаний Цикл
		Объект.ТребуетсяУдержание = Строка.ТребуетсяУдержание;
		Объект.Удержание = Строка.Удержание;
		Объект.СпособУдержания = Строка.СпособУдержания;
		Объект.УдерживатьЗаСотрудника = Строка.УдержаниеЗаСотрудника;
		Объект.УдерживатьЗаРодственников = Строка.УдержаниеЗаРодственников;
		Объект.ПрименяетсяЧастичноеУдержание = Строка.ПрименяетсяЧастичноеУдержание;;
		Объект.ПроцентЧастичногоУдержания = Строка.ПроцентЧастичногоУдержания;;
	КонецЦикла;
	
	ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = Ложь;
	ИспользуютсяРасширенияПрограмм = Ложь;
	СдвигДатыПрикрепления = 0;
	НайденныеСтроки = НастройкиСтраховыхКомпаний.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаНастройки Из НайденныеСтроки Цикл
		ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = СтрокаНастройки.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком;
		ИспользуютсяРасширенияПрограмм = СтрокаНастройки.ИспользуютсяРасширенияПрограмм;;
		СдвигДатыПрикрепления = СтрокаНастройки.СдвигДатыПрикрепления;
	КонецЦикла;
	
	ДополнитьОтправляемыеДанные(СтраховаяКомпания);
	ДополнитьОтправляемуюКонтактнуюИнформацию(СтраховаяКомпания);
	ДополнитьОтправляемыеДополнительныеРеквизитыИСведения(СтраховаяКомпания);
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаНастройкиСтраховойКомпании()
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	НайденныеСтроки = НастройкиСтраховыхКомпаний.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаНастройки = НастройкиСтраховыхКомпаний.Добавить();
		СтрокаНастройки.СтраховаяКомпания = СтраховаяКомпания;
	Иначе
		СтрокаНастройки = НайденныеСтроки[0];
	КонецЕсли;
	
	Возврат СтрокаНастройки;
	
КонецФункции

&НаКлиенте
Функция СтрокаНастройкиУдержанийСтраховойКомпании()
	
	СтраховаяКомпания = Неопределено;
	ТекущиеДанныеСК = Элементы.СтраховыеКомпании.ТекущиеДанные;
	Если ТекущиеДанныеСК = Неопределено Тогда
		СтраховаяКомпания = Элементы.СтраховыеКомпании.ТекущаяСтрока;
	Иначе
		СтраховаяКомпания = ТекущиеДанныеСК.Значение;
	КонецЕсли;
	Если СтраховаяКомпания = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	НайденныеСтроки = НастройкиУдержаний.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаНастройки = НастройкиУдержаний.Добавить();
		СтрокаНастройки.СтраховаяКомпания = СтраховаяКомпания;
	Иначе
		СтрокаНастройки = НайденныеСтроки[0];
	КонецЕсли;
	
	Возврат СтрокаНастройки;
	
КонецФункции

#Область ШкалаВозраста

&НаКлиенте
Процедура СформироватьПредставлениеИнтервалаШкалыВозраста(ТаблицаИнтервалов)
	
	Для Каждого ТекСтрока Из ТаблицаИнтервалов Цикл 
		
		Если ТекСтрока.ЗначениеОт = 0 И ТекСтрока.ЗначениеДо = 0 Тогда 
			ПредставлениеОт = НСтр("ru = 'от'");
			ПредставлениеДо = НСтр("ru = 'до'");
		ИначеЕсли ТекСтрока.ЗначениеОт = 0 И ТекСтрока.ЗначениеДо <> 0 Тогда
			ПредставлениеОт = "";
			ПредставлениеДо = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'до %1'"), ТекСтрока.ЗначениеДо);
		ИначеЕсли ТекСтрока.ЗначениеОт <> 0 И ТекСтрока.ЗначениеДо = 0 Тогда
			ПредставлениеОт = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'свыше %1'"), ТекСтрока.ЗначениеОт);
			ПредставлениеДо = "";
		Иначе
			ПредставлениеОт = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'от %1'"), ТекСтрока.ЗначениеОт);
			ПредставлениеДо = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'до %1'"), ТекСтрока.ЗначениеДо);
		КонецЕсли;
		
		ТекСтрока.ПредставлениеОт = ПредставлениеОт;
		ТекСтрока.ПредставлениеДо = ПредставлениеДо;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьСтрокиШкалыВозраста(ТекущиеДанные, Шкала)
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяПозиция = Шкала.Индекс(ТекущиеДанные);
	НоваяПозиция = 0;
	
	Для Каждого ТекСтрока Из Шкала Цикл 
		Если НоваяПозиция <> ТекущаяПозиция И ТекСтрока.ЗначениеОт >= ТекущиеДанные.ЗначениеОт Тогда 
			Прервать;
		КонецЕсли;
		НоваяПозиция = НоваяПозиция + 1;
	КонецЦикла;
	
	Сдвиг = ?(НоваяПозиция < ТекущаяПозиция, НоваяПозиция - ТекущаяПозиция, НоваяПозиция - ТекущаяПозиция - 1);
	Шкала.Сдвинуть(ТекущаяПозиция, Сдвиг);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокиШкалыВозраста(Шкала)
	
	КоличествоСтрок = Шкала.Количество();
	Если КоличествоСтрок = 0 Тогда 
		НоваяСтрока = Шкала.Добавить();
		НоваяСтрока.ЗначениеПоказателя = 1;
	ИначеЕсли Шкала[КоличествоСтрок-1].ЗначениеДо <> 0 
		И Шкала[КоличествоСтрок-1].ЗначениеДо > Шкала[КоличествоСтрок-1].ЗначениеОт Тогда
		НоваяСтрока = Шкала.Добавить();
		НоваяСтрока.ЗначениеОт = Шкала[КоличествоСтрок-1].ЗначениеДо + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьСоседниеСтрокиШкалыВозраста(ТекущиеДанные, Шкала);
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЗначениеДо <= ТекущиеДанные.ЗначениеОт Тогда
		ТекущиеДанные.ЗначениеДо = 0;
		Возврат;
	КонецЕсли;
	
	КоличествоСтрок = Шкала.Количество();
	ИндексСтроки = Шкала.Индекс(ТекущиеДанные);
	
	Если ИндексСтроки = (КоличествоСтрок - 1) Тогда 
		Возврат;
	КонецЕсли;
	
	СледующаяСтрока = Шкала[ИндексСтроки+1];
	СледующаяСтрока.ЗначениеОт = ТекущиеДанные.ЗначениеДо + 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьИнтервалыШкалыВозраста(Шкала)
	
	НижняяГраница = Неопределено;
	КоличествоСтрок = Шкала.Количество();
	
	Для Сч = 1 По КоличествоСтрок Цикл 
		
		ИндексСтроки = КоличествоСтрок - Сч;
		ТекСтрока = Шкала[ИндексСтроки];
		
		Если НижняяГраница <> Неопределено И НижняяГраница <> ТекСтрока.ЗначениеДо + 1 Тогда 
			ТекСтрока.ЗначениеДо = НижняяГраница - 1;
		КонецЕсли;
		
		Если НижняяГраница = Неопределено И ТекСтрока.ЗначениеОт = ТекСтрока.ЗначениеДо Тогда 
			ТекСтрока.ЗначениеДо = 0;
		КонецЕсли;
		
		Если (ТекСтрока.ЗначениеОт > ТекСтрока.ЗначениеДо И ТекСтрока.ЗначениеДо <> 0) 
			Или (ТекСтрока.ЗначениеОт = ТекСтрока.ЗначениеДо И ТекСтрока.ЗначениеОт <> 0) Тогда
			Шкала.Удалить(ТекСтрока);
			Продолжить;
		КонецЕсли;
		
		НижняяГраница = ТекСтрока.ЗначениеОт;
		
	КонецЦикла;
	
	// В первой строке может быть нулевое значение До, только если это единственная строка.
	Пока Шкала.Количество() > 1 Цикл 
		Если Шкала[0].ЗначениеДо <> 0 Тогда 
			Прервать;
		КонецЕсли;
		Шкала.Удалить(0);
	КонецЦикла;
	
	СформироватьПредставлениеИнтервалаШкалыВозраста(Шкала);
	
КонецПроцедуры

&НаКлиенте
Функция ШкалаВозрастаЗаполненаПравильно()
	
	Отказ = Ложь;
	
	НижняяГраница = Неопределено;
	КоличествоСтрок = ШкалаВозраста.Количество();
	
	Если КоличествоСтрок > 1 И ШкалаВозраста[0].ЗначениеДо = 0 Тогда 
		ТекстСообщения = НСтр("ru = 'Значение ""До"" в строке 1 равно 0'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ШкалаВозраста[0].ЗначениеДо", , Отказ);
	КонецЕсли;
	
	Для Сч = 1 По КоличествоСтрок Цикл 
		
		ИндексСтроки = КоличествоСтрок - Сч;
		ТекСтрока = ШкалаВозраста[ИндексСтроки];
		
		Если ТекСтрока.ЗначениеДо <= ТекСтрока.ЗначениеОт И ТекСтрока.ЗначениеДо <> 0 Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 значение ""До"" меньше или равно значению ""От""'"), ИндексСтроки + 1);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ШкалаВозраста[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ЗначениеДо", , Отказ);
		КонецЕсли;
		
		Если НижняяГраница <> Неопределено И НижняяГраница <> ТекСтрока.ЗначениеДо + 1 Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Значение ""До"" строки %1 не равно значению ""От"" строки %2'"), ИндексСтроки + 1, ИндексСтроки + 2);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ШкалаВозраста[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ЗначениеДо", , Отказ);
		КонецЕсли;
		
		НижняяГраница = ТекСтрока.ЗначениеОт;
		
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьОтветОКорректировкеШкалыВозраста(Результат, Параметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьШкалуВозраста(ПредыдущаяСтраховаяКомпания, СтраховаяКомпания)
	
	// Перенесем данные шкалы по предыдущей страховой компании
	ОтборСтрок = Новый Структура("СтраховаяКомпания", ПредыдущаяСтраховаяКомпания);
	СтрокиДляУдаления = ШкалыВозрастов.НайтиСтроки(ОтборСтрок);
	Для Каждого УдаляемаяСтрока Из СтрокиДляУдаления Цикл
		ШкалыВозрастов.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Для Каждого СтрокаШкалы Из ШкалаВозраста Цикл
		НоваяСтрока = ШкалыВозрастов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШкалы);
		НоваяСтрока.СтраховаяКомпания = ПредыдущаяСтраховаяКомпания;
	КонецЦикла;
	
	// Заполним данные шкалы по выбранной страховой компании
	ШкалаВозраста.Очистить();
	ОтборСтрок = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	СтрокиШкалы = ШкалыВозрастов.НайтиСтроки(ОтборСтрок);
	Для Каждого СтрокаШкалы Из СтрокиШкалы Цикл
		НоваяСтрока = ШкалаВозраста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШкалы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьШкалуВозрастаДляРодственников(ПредыдущаяСтраховаяКомпания, СтраховаяКомпания)
	
	// Перенесем данные шкалы по предыдущей страховой компании
	ОтборСтрок = Новый Структура("СтраховаяКомпания", ПредыдущаяСтраховаяКомпания);
	СтрокиДляУдаления = ШкалыВозрастовДляРодственников.НайтиСтроки(ОтборСтрок);
	Для Каждого УдаляемаяСтрока Из СтрокиДляУдаления Цикл
		ШкалыВозрастовДляРодственников.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Для Каждого СтрокаШкалы Из ШкалаВозрастаДляРодственников Цикл
		НоваяСтрока = ШкалыВозрастовДляРодственников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШкалы);
		НоваяСтрока.СтраховаяКомпания = ПредыдущаяСтраховаяКомпания;
	КонецЦикла;
	
	// Заполним данные шкалы по выбранной страховой компании
	ШкалаВозрастаДляРодственников.Очистить();
	ОтборСтрок = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	СтрокиШкалы = ШкалыВозрастовДляРодственников.НайтиСтроки(ОтборСтрок);
	Для Каждого СтрокаШкалы Из СтрокиШкалы Цикл
		НоваяСтрока = ШкалаВозрастаДляРодственников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШкалы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастроекУдержания()
	
	Если ИспользуютсяУдержания Тогда
		Элементы.СпособУдержанияМедицинскогоСтрахования.Видимость = Объект.ТребуетсяУдержание;
		Элементы.Удержание.Видимость = Объект.ТребуетсяУдержание;
		Элементы.ГруппаУдерживатьПоУмолчанию.Видимость = Объект.ТребуетсяУдержание;
		Элементы.ГруппаГрафикУдержаний.Видимость = Объект.ТребуетсяУдержание
			И Объект.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику");
		Элементы.ПрименяетсяЧастичноеУдержание.Видимость = Объект.ТребуетсяУдержание;
		Элементы.ПроцентЧастичногоУдержания.Видимость = Объект.ТребуетсяУдержание;
		УстановитьВидимостьНастроекЧастичногоУдержания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьНастроекЧастичногоУдержания()
	
	Элементы.ПроцентЧастичногоУдержания.Доступность = Объект.ПрименяетсяЧастичноеУдержание И Объект.ТребуетсяУдержание;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеНаКлиенте()
	
	Отказ = Ложь;
	
	Для Каждого Элемент Из СтраховыеКомпании Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Страховая компания'"));
			Поле = "СтраховыеКомпании["+ Формат(СтраховыеКомпании.Индекс(Элемент), "ЧДЦ=; ЧГ=0") +"].Значение";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Процедура ОтправляемыеДанныеСпособПроверкиЗаполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтправляемыеДанные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособПроверкиЗаполнения) Тогда
		ТекущиеДанные.СпособПроверкиЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправляемыеДополнительныеРеквизитыИСведенияСпособПроверкиЗаполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтправляемыеДополнительныеРеквизитыИСведения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособПроверкиЗаполнения) Тогда
		ТекущиеДанные.СпособПроверкиЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправляемаяКонтактнаяИнформацияСпособПроверкиЗаполненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтправляемаяКонтактнаяИнформация.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособПроверкиЗаполнения) Тогда
		ТекущиеДанные.СпособПроверкиЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьОтправляемыеДанные(СтраховаяКомпания)
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	Для Каждого Сведение Из КадровыеДанныеФизическихЛиц Цикл
		ПараметрыОтбора.Вставить("Сведение", Сведение.Значение);
		НайденноеСведение= ОтправляемыеДанные.НайтиСтроки(ПараметрыОтбора);
		Если НайденноеСведение.Количество() = 0 Тогда
			НоваяСтрока = ОтправляемыеДанные.Добавить();
			НоваяСтрока.СтраховаяКомпания = СтраховаяКомпания;
			НоваяСтрока.Сведение = Сведение.Значение;
			НоваяСтрока.Отправлять = Истина;
			НоваяСтрока.СпособПроверкиЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьОтправляемуюКонтактнуюИнформацию(СтраховаяКомпания)
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	Для Каждого ВидКИ Из ВидыКонтактнойИнформацииФизическихЛиц Цикл
		ПараметрыОтбора.Вставить("ВидКонтактнойИнформации", ВидКИ.Значение);
		НайденныйВидКИ = ОтправляемаяКонтактнаяИнформация.НайтиСтроки(ПараметрыОтбора);
		Если НайденныйВидКИ.Количество() = 0 Тогда
			НоваяСтрока = ОтправляемаяКонтактнаяИнформация.Добавить();
			НоваяСтрока.СтраховаяКомпания = СтраховаяКомпания;
			НоваяСтрока.ВидКонтактнойИнформации = ВидКИ.Значение;
			НоваяСтрока.Отправлять = Ложь;
			НоваяСтрока.СпособПроверкиЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьОтправляемыеДополнительныеРеквизитыИСведения(СтраховаяКомпания)
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СвойстваДоступны Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("СтраховаяКомпания", СтраховаяКомпания);
	
	Для Каждого Свойство Из СвойстваФизическихЛиц Цикл
		ПараметрыОтбора.Вставить("Свойство", Свойство.Значение);
		НайденноеСвойство = ОтправляемыеДополнительныеРеквизитыИСведения.НайтиСтроки(ПараметрыОтбора);
		Если НайденноеСвойство.Количество() = 0 Тогда
			НоваяСтрока = ОтправляемыеДополнительныеРеквизитыИСведения.Добавить();
			НоваяСтрока.СтраховаяКомпания = СтраховаяКомпания;
			НоваяСтрока.Свойство = Свойство.Значение;
			НоваяСтрока.Отправлять = Ложь;
			НоваяСтрока.СпособПроверкиЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтправляемыеДанные()
	
	ДанныеЗастрахованных = Перечисления.ДанныеЗастрахованных;
	Для Каждого Сведение Из ДанныеЗастрахованных Цикл
		КадровыеДанныеФизическихЛиц.Добавить(Сведение);
	КонецЦикла;
	
	ОтправляемыеДанные.Очистить();
	НаборЗаписей = РегистрыСведений.ОтправляемыеДанныеЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ЗаписьНабора.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ЗаписьНабора.СтраховаяКомпания);
		КонецЕсли;
		НоваяСтрока = ОтправляемыеДанные.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.Сведение = ЗаписьНабора.Сведение;
		НоваяСтрока.Отправлять = ЗаписьНабора.Отправлять;
		НоваяСтрока.СпособПроверкиЗаполнения = ЗаписьНабора.СпособПроверкиЗаполнения;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтправляемуюКонтактнуюИнформацию()
	
	ТаблицаВидовКИ = УправлениеКонтактнойИнформацией.ВидыКонтактнойИнформацииОбъекта(
		Справочники.ФизическиеЛица.ПустаяСсылка());
	ВидыКонтактнойИнформацииФизическихЛиц.ЗагрузитьЗначения(ТаблицаВидовКИ.ВыгрузитьКолонку("Ссылка"));
	
	ОтправляемаяКонтактнаяИнформация.Очистить();
	НаборЗаписей = РегистрыСведений.ОтправляемаяКонтактнаяИнформацияЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ЗаписьНабора.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ЗаписьНабора.СтраховаяКомпания);
		КонецЕсли;
		НоваяСтрока = ОтправляемаяКонтактнаяИнформация.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.ВидКонтактнойИнформации = ЗаписьНабора.Вид;
		НоваяСтрока.Отправлять = ЗаписьНабора.Отправлять;
		НоваяСтрока.СпособПроверкиЗаполнения = ЗаписьНабора.СпособПроверкиЗаполнения;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтправляемыеДополнительныеРеквизитыИСведения()
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СвойстваДоступны Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваФизическихЛиц.ЗагрузитьЗначения(
		УправлениеСвойствами.СвойстваОбъекта(Справочники.ФизическиеЛица.ПустаяСсылка()));
		
	ОтправляемыеДополнительныеРеквизитыИСведения.Очистить();
	НаборЗаписей = РегистрыСведений.ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Прочитать();
	Для каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(ЗаписьНабора.СтраховаяКомпания) = Неопределено Тогда
			СтраховыеКомпании.Добавить(ЗаписьНабора.СтраховаяКомпания);
		КонецЕсли;
		НоваяСтрока = ОтправляемыеДополнительныеРеквизитыИСведения.Добавить();
		НоваяСтрока.СтраховаяКомпания = ЗаписьНабора.СтраховаяКомпания;
		НоваяСтрока.Свойство = ЗаписьНабора.Свойство;
		НоваяСтрока.Отправлять = ЗаписьНабора.Отправлять;
		НоваяСтрока.СпособПроверкиЗаполнения = ЗаписьНабора.СпособПроверкиЗаполнения;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтправляемыеДанные()
	
	НаборЗаписей = РегистрыСведений.ОтправляемыеДанныеЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	Для каждого СтрокаТаблицы Из ОтправляемыеДанные Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
		ЗаписьНабора.Сведение = СтрокаТаблицы.Сведение;
		ЗаписьНабора.Отправлять = СтрокаТаблицы.Отправлять;
		ЗаписьНабора.СпособПроверкиЗаполнения = СтрокаТаблицы.СпособПроверкиЗаполнения;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтправляемуюКонтактнуюИнформацию()
	
	НаборЗаписей = РегистрыСведений.ОтправляемаяКонтактнаяИнформацияЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	Для каждого СтрокаТаблицы Из ОтправляемаяКонтактнаяИнформация Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
		ЗаписьНабора.Вид = СтрокаТаблицы.ВидКонтактнойИнформации;
		ЗаписьНабора.Отправлять = СтрокаТаблицы.Отправлять;
		ЗаписьНабора.СпособПроверкиЗаполнения = СтрокаТаблицы.СпособПроверкиЗаполнения;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтправляемыеДополнительныеРеквизитыИСведения()
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СвойстваДоступны Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	Для каждого СтрокаТаблицы Из ОтправляемыеДополнительныеРеквизитыИСведения Цикл
		Если СтраховыеКомпании.НайтиПоЗначению(СтрокаТаблицы.СтраховаяКомпания) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация = Объект.Организация;
		ЗаписьНабора.СтраховаяКомпания = СтрокаТаблицы.СтраховаяКомпания;
		ЗаписьНабора.Свойство = СтрокаТаблицы.Свойство;
		ЗаписьНабора.Отправлять = СтрокаТаблицы.Отправлять;
		ЗаписьНабора.СпособПроверкиЗаполнения = СтрокаТаблицы.СпособПроверкиЗаполнения;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти