#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(ПрочиеВыплаты.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти   
 
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти   

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ВедомостьНаВозвратПрочихВыплат;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Процедура ПодготовитьДанныеДляЗаполнения(Параметры, АдресХранилища) Экспорт
	
	ДанныеРеглУчетаТекст = "";

	УсловиеСтруктурноеПодразделение = " И СтруктурнаяЕдиница = &СтруктурнаяЕдиница ";
	
	ДанныеРеглУчетаТекст = ДанныеРеглУчетаТекст + 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыПоПрочимВыплатамОстатки.Физлицо КАК ФизЛицо,
	|   НАЧАЛОПЕРИОДА(ВзаиморасчетыПоПрочимВыплатамОстатки.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
	|	СУММА(ВзаиморасчетыПоПрочимВыплатамОстатки.СуммаВзаиморасчетовОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыПоПрочимВыплатам.Остатки(
	|				&парамГраницаОстатков,
	|				Организация = &парамОрганизация" + УсловиеСтруктурноеПодразделение + "
	|				И ВидПрочихВыплат = &парамВидПрочихВыплат
	|				И " + ?(Параметры.ПоОстаткам, "
	|					ПериодВзаиморасчетов <= КОНЕЦПЕРИОДА(&парамМесяц, МЕСЯЦ)", "
	|					ПериодВзаиморасчетов МЕЖДУ НАЧАЛОПЕРИОДА(&парамМесяц, МЕСЯЦ) И КОНЕЦПЕРИОДА(&парамМесяц, МЕСЯЦ)") + ") КАК ВзаиморасчетыПоПрочимВыплатамОстатки
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыПоПрочимВыплатамОстатки.Физлицо,
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыПоПрочимВыплатамОстатки.ПериодВзаиморасчетов, МЕСЯЦ)
	|УПОРЯДОЧИТЬ ПО
	|	ВзаиморасчетыПоПрочимВыплатамОстатки.Физлицо.Наименование,
	|	НАЧАЛОПЕРИОДА(ВзаиморасчетыПоПрочимВыплатамОстатки.ПериодВзаиморасчетов, МЕСЯЦ)
	|";
	
	Запрос = Новый Запрос(ДанныеРеглУчетаТекст);
	
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.парамСтруктурноеПодразделение) Тогда
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.парамСтруктурноеПодразделение);
	Иначе
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.парамОрганизация);
	КонецЕсли;
			
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Сумма) И Выборка.Сумма > 0 Тогда
			НоваяСтрока = Параметры.ТаблицаПрочиеВыплаты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("ТаблицаПрочиеВыплаты", Параметры.ТаблицаПрочиеВыплаты); 
	 
	ПоместитьВоВременноеХранилище(СтруктураДанных, АдресХранилища); 
	
КонецПроцедуры 

Процедура ЗаполнитьПоВедомостьНаПеречислениеПрочихВыплат(Объект, Основание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаПеречислениеПрочихВыплат.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВедомостьНаПеречислениеПрочихВыплат.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВедомостьНаПеречислениеПрочихВыплат.Сумма КАК Сумма
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаПеречислениеПрочихВыплат
	|
	|ГДЕ
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВедомостьНаПеречислениеПрочихВыплат.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ПрочиеВыплаты.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

Функция ПодготовитьПараметрыПроведения(Объект, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;

	ДанныеПрочихВыплат = ДанныеПрочихВыплат(Объект);
	
	ПараметрыПроведения.Вставить("ДанныеПрочихВыплат", ДанныеПрочихВыплат);
	
	Возврат ПараметрыПроведения;

КонецФункции

#КонецОбласти   

#Область ОбработчикиСобытий

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПрочихВыплат(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеДокумента.Организация КАК Организация,
			|	ДанныеДокумента.Подразделение КАК Подразделение,
			|	ДанныеДокумента.ВидПрочихВыплат КАК ВидПрочихВыплат,
			|	НАЧАЛОПЕРИОДА(ДанныеДокумента.ДатаВозврата, ДЕНЬ) КАК Период
			|ПОМЕСТИТЬ ВТ_ДанныеДокумента
			|ИЗ
			|	Документ.ВедомостьНаВозвратПрочихВыплат КАК ДанныеДокумента
			|ГДЕ
			|	ДанныеДокумента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	СУММА(ДанныеПрочиеВыплаты.Сумма) КАК СуммаВзаиморасчетов,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено) КАК ВидСтроки
			|ПОМЕСТИТЬ ВТ_ДанныеПрочиеВыплаты
			|ИЗ
			|	Документ.ВедомостьНаВозвратПрочихВыплат.ПрочиеВыплаты КАК ДанныеПрочиеВыплаты
			|ГДЕ
			|	ДанныеПрочиеВыплаты.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеДокумента.Организация КАК Организация,
			|	ДанныеДокумента.Подразделение КАК Подразделение,
			|	ДанныеПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеДокумента.Период КАК Период,
			|	ДанныеДокумента.ВидПрочихВыплат КАК ВидПрочихВыплат,
			|	ДанныеПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	-ДанныеПрочиеВыплаты.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
			|	ЕСТЬNULL(ИсторияРегистрацийВНалоговомОрганеПодразделения.РегистрацияВНалоговомОргане, ИсторияРегистрацийВНалоговомОрганеОрганизация.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Выплачено) КАК ГруппаНачисленияУдержанияВыплаты,
			|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
			|ИЗ
			|	ВТ_ДанныеПрочиеВыплаты КАК ДанныеПрочиеВыплаты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ДанныеДокумента
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный КАК ИсторияРегистрацийВНалоговомОрганеОрганизация
			|		ПО (ДанныеДокумента.Организация = ИсторияРегистрацийВНалоговомОрганеОрганизация.СтруктурнаяЕдиница)
			|			И (ДанныеПрочиеВыплаты.ПериодВзаиморасчетов МЕЖДУ ИсторияРегистрацийВНалоговомОрганеОрганизация.ДатаНачала И ИсторияРегистрацийВНалоговомОрганеОрганизация.ДатаОкончания)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный КАК ИсторияРегистрацийВНалоговомОрганеПодразделения
			|		ПО (ДанныеДокумента.Подразделение = ИсторияРегистрацийВНалоговомОрганеПодразделения.СтруктурнаяЕдиница)
			|			И (ДанныеПрочиеВыплаты.ПериодВзаиморасчетов МЕЖДУ ИсторияРегистрацийВНалоговомОрганеПодразделения.ДатаНачала И ИсторияРегистрацийВНалоговомОрганеПодразделения.ДатаОкончания)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти   

#КонецЕсли