#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Номер");
		ЗаполнитьПоДокументуОснования(ДанныеЗаполнения);
		ДокументОснование = ДанныеЗаполнения;
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = ПрочиеВыплаты.Итог("Сумма");

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДатаВозврата");	
	
	КонецЕсли;
	
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация, Подразделение, ВидПрочихВыплат");
	
	ШаблонТекстОшибки = НСтр("ru = 'В документе перечисления выплаты %1 отличается значение поля %2'");
	
	Если НЕ ДанныеДокументаОснования.Организация = Организация Тогда 
        ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстОшибки, ДокументОснование, НСтр("ru = 'Организация'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, , , Отказ);
	КонецЕсли;
	
	Если НЕ ДанныеДокументаОснования.Подразделение = Подразделение Тогда 
        ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстОшибки, ДокументОснование, НСтр("ru = 'Подразделение'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, , , Отказ);
	КонецЕсли;
	
	Если НЕ ДанныеДокументаОснования.ВидПрочихВыплат = ВидПрочихВыплат Тогда 
        ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстОшибки, ДокументОснование, НСтр("ru = 'Вид прочей выплаты'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОснование, , , Отказ);
	КонецЕсли;
	
	ПроверитьПересечениеФизическихЛиц(Отказ);
	ПроверитьФизическихЛицДокументаОснования(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// движение в документах поступления ДС
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнешниеХозяйственныеОперацииЗарплатаКадры") Тогда
		Возврат;	
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.ВедомостьНаВозвратПрочихВыплат.ПодготовитьПараметрыПроведения(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВзаиморасчетыПоПрочимВыплатам.Записывать = Истина;
	Движения.ВзаиморасчетыПоПрочимВыплатам.Загрузить(ПараметрыПроведения.ДанныеПрочихВыплат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет заполнение документа по документу-основанию
//
Процедура ЗаполнитьПоДокументуОснования(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда

		Документы.ВедомостьНаВозвратПрочихВыплат.ЗаполнитьПоВедомостьНаПеречислениеПрочихВыплат(ЭтотОбъект, Основание);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПересечениеФизическихЛиц(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка",  			Ссылка);
	Запрос.УстановитьПараметр("ПрочиеВыплаты", 		ПрочиеВыплаты);
	Запрос.УстановитьПараметр("ДокументОснование",  ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_ПрочиеВыплаты
	|ИЗ
	|	&ПрочиеВыплаты КАК ПрочиеВыплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВедомостьНаВозвратПрочихВыплат.Ссылка КАК Ссылка,
	|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_СведенияОНезачисленныхПрочихВыплатах
	|ИЗ
	|	Документ.ВедомостьНаВозвратПрочихВыплат КАК ВедомостьНаВозвратПрочихВыплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВозвратПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты
	|		ПО ВедомостьНаВозвратПрочихВыплат.Ссылка = ВедомостьНаВозвратПрочихВыплатПрочиеВыплаты.Ссылка
	|ГДЕ
	|	НЕ ВедомостьНаВозвратПрочихВыплат.Ссылка = &Ссылка
	|	И ВедомостьНаВозвратПрочихВыплат.ДокументОснование = &ДокументОснование
	|	И ВедомостьНаВозвратПрочихВыплат.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	СведенияОНезачисленныхПрочихВыплатах.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ПрочиеВыплаты КАК ПрочиеВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОНезачисленныхПрочихВыплатах КАК СведенияОНезачисленныхПрочихВыплатах
	|		ПО (СведенияОНезачисленныхПрочихВыплатах.ФизическоеЛицо = ПрочиеВыплаты.ФизическоеЛицо)
	|			И (СведенияОНезачисленныхПрочихВыплатах.ПериодВзаиморасчетов = ПрочиеВыплаты.ПериодВзаиморасчетов)
	|ГДЕ
	|	НЕ СведенияОНезачисленныхПрочихВыплатах.Ссылка ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Физическое лицо %1 в строке %2 уже включен в ведомость на возврат %3 за период %4'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.ФизическоеЛицо, Выборка.НомерСтроки, Выборка.Ссылка, Выборка.ПериодВзаиморасчетов);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка);
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьФизическихЛицДокументаОснования(Отказ) Экспорт
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ПрочиеВыплаты", 		ПрочиеВыплаты);
	Запрос.УстановитьПараметр("ДокументОснование",  ДокументОснование);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_ПрочиеВыплаты
	|ИЗ
	|	&ПрочиеВыплаты КАК ПрочиеВыплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка КАК Ссылка,
	|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_ВедомостьНаПеречислениеПрочихВыплат
	|ИЗ
	|	Документ.ВедомостьНаПеречислениеПрочихВыплат КАК ВедомостьНаПеречислениеПрочихВыплат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты КАК ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты
	|		ПО ВедомостьНаПеречислениеПрочихВыплат.Ссылка = ВедомостьНаПеречислениеПрочихВыплатПрочиеВыплаты.Ссылка
	|ГДЕ
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка = &ДокументОснование
	|	И ВедомостьНаПеречислениеПрочихВыплат.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПрочиеВыплаты.НомерСтроки КАК НомерСтроки,
	|	ПрочиеВыплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрочиеВыплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ПрочиеВыплаты КАК ПрочиеВыплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВедомостьНаПеречислениеПрочихВыплат КАК ВедомостьНаПеречислениеПрочихВыплат
	|		ПО (ВедомостьНаПеречислениеПрочихВыплат.ФизическоеЛицо = ПрочиеВыплаты.ФизическоеЛицо)
	|			И (ВедомостьНаПеречислениеПрочихВыплат.ПериодВзаиморасчетов = ПрочиеВыплаты.ПериодВзаиморасчетов)
	|ГДЕ
	|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Физическое лицо %1 в строке %2 не включено в ведомость на перечисление %3 за период %4'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.ФизическоеЛицо, Выборка.НомерСтроки, ДокументОснование, Выборка.ПериодВзаиморасчетов);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОснование);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли