
#Область СлужебныйПрограммныйИнтерфейс

Функция ДатаИзмененияПорядкаПеречисленияОСМС2024() Экспорт
	
	Возврат НачалоМесяца('20240421');
	
КонецФункции

Процедура ИзменитьПериодыОплатыДляМедицинскогоСтрахованияПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
		
	ДокументОснование = Источник.Отбор.Регистратор.Значение;

    // регистрируем данные только для документов регистрации события отпуска
	Если НЕ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Отпуск") Тогда
		
		Возврат;
		
	КонецЕсли;	

	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "ПериодРегистрации, Организация, Сотрудник, ФизическоеЛицо, ИсправленныйДокумент");

	Если ЗначениеЗаполнено(ДанныеДокумента.ИсправленныйДокумент) Тогда
		
		ПериодРегистрацииИсправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.ИсправленныйДокумент, "ПериодРегистрации");
		
		Если ЗначениеЗаполнено(ПериодРегистрацииИсправления) Тогда
			ПериодРегистрации = ПериодРегистрацииИсправления;
		Иначе
			ПериодРегистрации = ПериодРегистрацииИсправления;
		КонецЕсли;
		
	Иначе
		
		ПериодРегистрации = ДанныеДокумента.ПериодРегистрации;
		
	КонецЕсли;
	
	Организация = ДанныеДокумента.Организация;
	ФизическоеЛицо = ДанныеДокумента.ФизическоеЛицо;

	// настройки периода действия получаем на период регистрации документа
	// при расчете по периоду действия расчет ОСМС будет разноситься по месяцу действия события,
	// делить сумму ОСМС по периодам необходимости нет
	ИспользуетсяПериодДействия = Ложь;
	
	Если ИспользуетсяПериодДействия
		ИЛИ ПериодРегистрации < ДатаИзмененияПорядкаПеречисленияОСМС2024() Тогда
		Возврат;
	КонецЕсли;
	
	ПериодыОплатыДляМедицинскогоСтрахования = РегистрыСведений.ПериодыОплатыДляМедицинскогоСтрахования.СоздатьНаборЗаписей();
	ПериодыОплатыДляМедицинскогоСтрахования.Отбор.Регистратор.Установить(ДокументОснование);
	
	Если Источник.Количество() = 0 Тогда
		
		ПериодыОплатыДляМедицинскогоСтрахования.Записать();
		Возврат;	
		
	КонецЕсли;
	
    // в рамках документа регистрации события по сотруднику может быть несколько событий, 
	// переходящий период необходимо контролировать по всем видам событий
	// например, отпуск основной + отпуск экологический
	ДатаНачалаПоДокументу	 = Дата(3999, 12, 31, 23, 59, 59);
	ДатаОкончанияПоДокументу = Дата(1, 1, 1);
    ОбщиеКалендарныеДниРегистратора = 0;
	
	ЕстьСобытиеБудущегоПериода = Ложь;
	МесяцПослеПериодаРегистрации = НачалоМесяца(ДобавитьМесяц(ПериодРегистрации, 1));
	
    // Добавляем в регистр записи при переходящем отпуске или отпуске будущего периода
	Для Каждого СтрокаОтпуска Из Источник Цикл
		
		Если НЕ СтрокаОтпуска.Компенсация
				И (СтрокаОтпуска.Состояние = Перечисления.СостоянияСотрудника.ОтпускОсновной
					ИЛИ СтрокаОтпуска.Состояние = Перечисления.СостоянияСотрудника.ДополнительныйОтпуск) Тогда
			
			Если ДатаНачалаПоДокументу > СтрокаОтпуска.ДатаНачала Тогда
				ДатаНачалаПоДокументу = СтрокаОтпуска.ДатаНачала;	
			КонецЕсли;
			
			Если ДатаОкончанияПоДокументу < СтрокаОтпуска.ДатаОкончания Тогда
				ДатаОкончанияПоДокументу = СтрокаОтпуска.ДатаОкончания;	
			КонецЕсли;
			
			Если СтрокаОтпуска.ДатаНачала >= МесяцПослеПериодаРегистрации
				ИЛИ СтрокаОтпуска.ДатаОкончания >= МесяцПослеПериодаРегистрации Тогда
				
				ЕстьСобытиеБудущегоПериода = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
    // документ отпуска может регистрировать только отпуск без оплаты или только компенсацию
	Если ДатаНачалаПоДокументу = ДатаОкончанияПоДокументу = Дата(1, 1, 1)
		ИЛИ ДатаНачалаПоДокументу = Дата(3999, 12, 31, 23, 59, 59) Тогда
		
		Возврат;
				
	КонецЕсли;
	
	ОбщиеКалендарныеДниРегистратора = ОбщегоНазначенияБЗККлиентСервер.КоличествоДнейВПериоде(ДатаНачалаПоДокументу, ДатаОкончанияПоДокументу);
	
	// календарный месяц более 28 дней (28-31, в высокосном 29-31)
	МинимальноеКоличествоКалендарныхДнейВГоду = ?(Цел(Год(ПериодРегистрации)/4 = Год(ПериодРегистрации)/4), 29, 28); 
	
    // в регистре формируем записи, только если отпуск удовлетворяет условию
	// начислении (исчислении) дохода, включающего период оплачиваемого трудового отпуска длительностью один или более одного календарного месяца
	Если ОбщиеКалендарныеДниРегистратора >= МинимальноеКоличествоКалендарныхДнейВГоду И (ЕстьСобытиеБудущегоПериода
		ИЛИ (НЕ ДатаНачалаПоДокументу = ДатаОкончанияПоДокументу И ЗначениеЗаполнено(ДатаНачалаПоДокументу)))  Тогда

		// Сформируем суммы отпуска по месяцам
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СУММА(ВЫБОР
		               |			КОГДА НалогообложениеНачислений.СпособОбложенияВОСМС В (ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом), ЗНАЧЕНИЕ(Перечисление.СпособыНалогообложенияДоходов.НеОблагаетсяЧастично))
		               |				ТОГДА ОтпускНачисления.Результат
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК СуммаПоДокументу
		               |ИЗ
		               |	Документ.Отпуск.Начисления КАК ОтпускНачисления
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		               |		ПО ОтпускНачисления.Начисление = Начисления.Ссылка
		               |			И (Начисления.КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска))
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НалогообложениеНачислений.СрезПоследних(&ПериодРегистрации, ) КАК НалогообложениеНачислений
		               |		ПО ОтпускНачисления.Начисление = НалогообложениеНачислений.Начисление
		               |ГДЕ
		               |	ОтпускНачисления.Ссылка = &Регистратор";
		
		Запрос.УстановитьПараметр("Регистратор", ДокументОснование);
		Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
		
		ДанныеОблагаемойСуммыДокумента = Запрос.Выполнить().Выбрать();
		
		Если ДанныеОблагаемойСуммыДокумента.Следующий() Тогда
			
			ОблагаемаяСуммаДокумента = ДанныеОблагаемойСуммыДокумента.СуммаПоДокументу;
			
		Иначе
			
			ОблагаемаяСуммаДокумента = 0;
			
		КонецЕсли;

		Если ОблагаемаяСуммаДокумента = 0 Тогда
			
			ПериодыОплатыДляМедицинскогоСтрахования.Записать();
			Возврат;	
			
		КонецЕсли;

		ТаблицаПериодовОплаты = ПериодыОплатыДляМедицинскогоСтрахования.ВыгрузитьКолонки();
		
		Для Каждого СтрокаОтпуска Из Источник Цикл
			
			Если НЕ СтрокаОтпуска.Компенсация
					И (СтрокаОтпуска.Состояние = Перечисления.СостоянияСотрудника.ОтпускОсновной
						ИЛИ СтрокаОтпуска.Состояние = Перечисления.СостоянияСотрудника.ДополнительныйОтпуск) Тогда
				
				ДатаНачала    = СтрокаОтпуска.ДатаНачала;
				ДатаОкончания = КонецМесяца(СтрокаОтпуска.ДатаНачала);
				
				Пока КонецМесяца(СтрокаОтпуска.ДатаОкончания) > КонецМесяца(ДатаОкончания) Цикл
					
					ЗаписьПериода = ТаблицаПериодовОплаты.Добавить();
					ЗаполнитьЗначенияСвойств(ЗаписьПериода, СтрокаОтпуска);
					ЗаписьПериода.МесяцСобытия = НачалоМесяца(ДатаНачала);
					ЗаписьПериода.Организация = Организация;
					ЗаписьПериода.ФизическоеЛицо = ФизическоеЛицо;
					ЗаписьПериода.ПериодРегистрации = ПериодРегистрации;
	                ЗаписьПериода.УчитываемыеДниПериода = ОбщегоНазначенияБЗККлиентСервер.КоличествоДнейВПериоде(ДатаНачала, ДатаОкончания);
	                ЗаписьПериода.УчитываемыеДниСобытия = ОбщиеКалендарныеДниРегистратора;
					ЗаписьПериода.СуммаСобытия = ОблагаемаяСуммаДокумента;	
					
					ДатаНачала = КонецМесяца(ДатаОкончания) + 1;
					ДатаОкончания = Мин(КонецМесяца(ДатаНачала), СтрокаОтпуска.ДатаОкончания);
					
				КонецЦикла;
				
				// закрывающая запись
				ЗаписьПериода = ТаблицаПериодовОплаты.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьПериода, СтрокаОтпуска);
				ЗаписьПериода.МесяцСобытия = НачалоМесяца(ДатаНачала);
				ЗаписьПериода.Организация = Организация;
				ЗаписьПериода.ФизическоеЛицо = ФизическоеЛицо;
				ЗаписьПериода.ПериодРегистрации = ПериодРегистрации;
                ЗаписьПериода.УчитываемыеДниПериода = ОбщегоНазначенияБЗККлиентСервер.КоличествоДнейВПериоде(ДатаНачала, СтрокаОтпуска.ДатаОкончания);
                ЗаписьПериода.УчитываемыеДниСобытия = ОбщиеКалендарныеДниРегистратора;
				ЗаписьПериода.СуммаСобытия = ОблагаемаяСуммаДокумента;	

			КонецЕсли;
			
		КонецЦикла;
		
		// если в рамках месяца были разные виды отпусков, то свернем их, получим итогы количества дней события и общую сумму
		ТаблицаПериодовОплаты.Свернуть("ПериодРегистрации, Сотрудник, ФизическоеЛицо, Организация, МесяцСобытия, Подразделение, УчитываемыеДниСобытия, СуммаСобытия", "УчитываемыеДниПериода");
		
		ПериодыОплатыДляМедицинскогоСтрахования.Загрузить(ТаблицаПериодовОплаты);

	КонецЕсли;
	
	// набор записываем в любом случае (отмена проведения, срабатывания механизмов сторнирования и исправления)
	ПериодыОплатыДляМедицинскогоСтрахования.Записать(Истина);

КонецПроцедуры

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Раздел Зарплата
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МесячныйРасчетныйПоказатель",							"Период",				"Зарплата", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РасчетСреднегоЗаработкаОрганизаций", 					"Период", 				"Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РасчетСреднегоЗаработкаПодразделений", 				"Период", 				"Зарплата", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РасчетСреднегоЗаработкаСотрудников", 					"Период", 				"Зарплата", "");
	
	// Раздел НалогиВзносыОтчисления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявлениеНаПредоставлениеВычетовИПН", 						"Месяц", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрекращениеПредоставленияВычетовИПН", 						"Месяц", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВедомостьНаПеречислениеВзносовОтчислений", 					"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияОНезачисленныхВзносахОтчислениях", 					"Дата", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеняПоВзносамИОтчислениям", 									"ПериодРегистрации",	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УдержаниеНалоговВзносовПоНУ", 								"ПериодРегистрации",	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияПрочихВыплат",									"Дата",					"Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВедомостьНаПеречислениеПрочихВыплат",						"ПериодВзаиморасчетов",	"Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВедомостьНаВозвратПрочихВыплат",								"Дата",					"Зарплата", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков",			"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ВычетыФизическихЛицИПН", 								"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПрименениеВычетовИПН",			 					"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ЛьготыФизическихЛицИПН",			 					"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПрочиеВычетыФизическихЛицИПН", 						"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НалогообложениеНачислений", 							"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты", 		"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц", 		"ДатаРегистрацииИзменений", "НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОСтавкахИПН", 								"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений", 			"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОСтавкахОСМС", 								"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОДоляхЕП", 									"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОФизическихЛицахУчастникахВОВ", 				"ДатаРегистрацииИзменений", "НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СрокиПеречисленияВзносовИОтчислений", 				"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КоэффициентыСтавкиРефинансированияНБ", 				"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РазмерыВычетовИПН", 									"Период", 				"НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично", 	"Период", 				"НДФЛ", "");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам",			 	"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами", 	"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков",				"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений",		"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОДоходахФизическихЛиц",			 			"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОбИсчисленииВычетовИПН",			 		"ПериодРегистрации", 	"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПениПоВзносамИОтчислениям",			 				"Период", 				"НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЕПКомпоненты",			 							"Период", 				"НДФЛ", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках","Период", 				"КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету",					"Период", 				"Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДополнениеРасчетнойБазыУдержаний",					"Период", 				"Зарплата", "Организация");
   	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.УчетнаяПолитикаЗарплатаКадры",					    "Период", 				"Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПрименениеВычетовПоВидамДохода", 						"Период", 				"Зарплата", "");

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПериодыОплатыДляМедицинскогоСтрахования", 			"Период", 				"СтраховыеВзносы", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ВзаиморасчетыПоПрочимВыплатам", 					"Период", 				"Зарплата", "Организация");

	// + УчетНалоговВзносовОтчисленийВХО.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения
	
КонецПроцедуры

#КонецОбласти

Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Чтение.Организации
	|РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Изменение.Организации
	|РегистрСведений.ДанныеДляПодбораСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеДляПодбораСотрудников.Чтение.Организации";

 	Описание = Описание + "
	|Справочник.БанковскиеСчетаОрганизаций.Чтение.Организации
	|Справочник.БанковскиеСчетаОрганизаций.Изменение.Организации
	|Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Чтение.Организации
	|Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеВычетовИПН.Изменение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеВычетовИПНПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеВычетовИПНПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеВычетовИПНПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеВычетовИПНПрисоединенныеФайлы.Изменение.Организации
	|Документ.ПрекращениеПредоставленияВычетовИПН.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПредоставленияВычетовИПН.Чтение.Организации
	|Документ.ПрекращениеПредоставленияВычетовИПН.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПредоставленияВычетовИПН.Изменение.Организации
	|Документ.ВедомостьНаПеречислениеВзносовОтчислений.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаПеречислениеВзносовОтчислений.Чтение.Организации
	|Документ.ВедомостьНаПеречислениеВзносовОтчислений.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаПеречислениеВзносовОтчислений.Изменение.Организации
	|Справочник.ВедомостьНаПеречислениеВзносовОтчисленийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаПеречислениеВзносовОтчисленийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаПеречислениеВзносовОтчисленийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаПеречислениеВзносовОтчисленийПрисоединенныеФайлы.Изменение.Организации
	|Документ.ПеняПоВзносамИОтчислениям.Чтение.ГруппыФизическихЛиц
	|Документ.ПеняПоВзносамИОтчислениям.Чтение.Организации
	|Документ.ПеняПоВзносамИОтчислениям.Изменение.ГруппыФизическихЛиц
	|Документ.ПеняПоВзносамИОтчислениям.Изменение.Организации
	|Справочник.ПеняПоВзносамИОтчислениямПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПеняПоВзносамИОтчислениямПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеняПоВзносамИОтчислениямПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПеняПоВзносамИОтчислениямПрисоединенныеФайлы.Изменение.Организации
	|Документ.СведенияОНезачисленныхВзносахОтчислениях.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОНезачисленныхВзносахОтчислениях.Чтение.Организации
	|Документ.СведенияОНезачисленныхВзносахОтчислениях.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОНезачисленныхВзносахОтчислениях.Изменение.Организации
	|Справочник.СведенияОНезачисленныхВзносахОтчисленияхПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СведенияОНезачисленныхВзносахОтчисленияхПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СведенияОНезачисленныхВзносахОтчисленияхПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СведенияОНезачисленныхВзносахОтчисленияхПрисоединенныеФайлы.Изменение.Организации
 	|Документ.УдержаниеНалоговВзносовПоНУ.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеНалоговВзносовПоНУ.Чтение.Организации
	|Документ.УдержаниеНалоговВзносовПоНУ.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеНалоговВзносовПоНУ.Изменение.Организации
 	|Документ.РегистрацияПрочихВыплат.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихВыплат.Чтение.Организации
	|Документ.РегистрацияПрочихВыплат.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихВыплат.Изменение.Организации
 	|Документ.ВедомостьНаПеречислениеПрочихВыплат.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаПеречислениеПрочихВыплат.Чтение.Организации
	|Документ.ВедомостьНаПеречислениеПрочихВыплат.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаПеречислениеПрочихВыплат.Изменение.Организации
 	|Документ.ВедомостьНаВозвратПрочихВыплат.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВозвратПрочихВыплат.Чтение.Организации
	|Документ.ВедомостьНаВозвратПрочихВыплат.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВозвратПрочихВыплат.Изменение.Организации";

 	Описание = Описание + "
	|РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НалогиВзносыОтчисленияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Чтение.Организации
	|РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков.Чтение.Организации
	|РегистрНакопления.ПениПоВзносамИОтчислениям.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПениПоВзносамИОтчислениям.Чтение.Организации
	|РегистрНакопления.СведенияОбИсчисленииВычетовИПН.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОбИсчисленииВычетовИПН.Чтение.Организации
	|РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахФизическихЛиц.Чтение.Организации
	|РегистрНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыПоПрочимВыплатам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыПоПрочимВыплатам.Чтение.Организации
	|РегистрНакопления.ЕПКомпоненты.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЕПКомпоненты.Чтение.Организации";
	
	Описание = Описание + "
	|РегистрСведений.ВычетыФизическихЛицИПН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВычетыФизическихЛицИПН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДистанционнаяРаботаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДистанционнаяРаботаСотрудников.Чтение.Организации
	|РегистрСведений.ДистанционнаяРаботаСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДистанционнаяРаботаСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ДоходыПредыдущегоМестаРаботы.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДоходыПредыдущегоМестаРаботы.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДоходыПредыдущегоМестаРаботы.Чтение.Организации
	|РегистрСведений.ПериодыОплатыДляМедицинскогоСтрахования.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПериодыОплатыДляМедицинскогоСтрахования.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПериодыОплатыДляМедицинскогоСтрахования.Чтение.Организации
	|РегистрСведений.ПериодыОплатыДляМедицинскогоСтрахования.Изменение.Организации
	|РегистрСведений.КоэффициентыСтавкиРефинансированияНБ.Чтение.Организации
	|РегистрСведений.КоэффициентыСтавкиРефинансированияНБ.Изменение.Организации
	|РегистрСведений.ЛьготыФизическихЛицИПН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛьготыФизическихЛицИПН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.Чтение.Организации
	|РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.Изменение.Организации
	|РегистрСведений.ПрименениеВычетовИПН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеВычетовИПН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПрочиеВычетыФизическихЛицИПН.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрочиеВычетыФизическихЛицИПН.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.Чтение.Организации
	|РегистрСведений.РасчетСреднегоЗаработкаОрганизаций.Изменение.Организации
    |РегистрСведений.РасчетСреднегоЗаработкаСотрудников.Чтение.Организации
	|РегистрСведений.РасчетСреднегоЗаработкаСотрудников.Изменение.Организации
	|РегистрСведений.РасчетСреднегоЗаработкаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетСреднегоЗаработкаСотрудников.Изменение.ГруппыФизическихЛиц
 	|РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОПенсионномОбеспеченииФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОСтавкахИПН.Чтение.Организации
	|РегистрСведений.СведенияОСтавкахИПН.Изменение.Организации
	|РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений.Чтение.Организации
	|РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений.Изменение.Организации
	|РегистрСведений.СведенияОСтавкахОСМС.Чтение.Организации
	|РегистрСведений.СведенияОСтавкахОСМС.Изменение.Организации
	|РегистрСведений.СведенияОФизическихЛицахУчастникахВОВ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОФизическихЛицахУчастникахВОВ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Чтение.Организации
	|РегистрСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках.Изменение.Организации
	|РегистрСведений.СрокиПеречисленияВзносовИОтчислений.Чтение.Организации
	|РегистрСведений.СрокиПеречисленияВзносовИОтчислений.Изменение.Организации
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиков.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УчетнаяПолитикаЗарплатаКадры.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаЗарплатаКадры.Изменение.Организации
	|РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаПоНалоговомуУчету.Изменение.Организации";

	// + УчетНалоговВзносовОтчисленийВХО.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных

КонецПроцедуры

Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт

	Списки.Вставить(Метаданные.Справочники.ВедомостьНаПеречислениеВзносовОтчисленийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПеняПоВзносамИОтчислениямПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СведенияОНезачисленныхВзносахОтчисленияхПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаявлениеНаПредоставлениеВычетовИПНПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаОрганизаций, Истина);

	Списки.Вставить(Метаданные.Документы.ВедомостьНаПеречислениеВзносовОтчислений, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявлениеНаПредоставлениеВычетовИПН, Истина);
	Списки.Вставить(Метаданные.Документы.ПеняПоВзносамИОтчислениям, Истина);
	Списки.Вставить(Метаданные.Документы.ПрекращениеПредоставленияВычетовИПН, Истина);
	Списки.Вставить(Метаданные.Документы.СведенияОНезачисленныхВзносахОтчислениях, Истина);
	Списки.Вставить(Метаданные.Документы.УдержаниеНалоговВзносовПоНУ, Истина);
	Списки.Вставить(Метаданные.Документы.РегистрацияПрочихВыплат, Истина);
	Списки.Вставить(Метаданные.Документы.ВедомостьНаПеречислениеПрочихВыплат, Истина);
	Списки.Вставить(Метаданные.Документы.ВедомостьНаВозвратПрочихВыплат, Истина);

	Списки.Вставить(Метаданные.РегистрыСведений.ВычетыФизическихЛицИПН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДистанционнаяРаботаСотрудниковИнтервальный, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДоходыПредыдущегоМестаРаботы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПериодыОплатыДляМедицинскогоСтрахования, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КоэффициентыСтавкиРефинансированияНБ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЛьготыФизическихЛицИПН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрименениеВычетовИПН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрочиеВычетыФизическихЛицИПН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетСреднегоЗаработкаОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасчетСреднегоЗаработкаСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОПенсионномОбеспеченииФизическихЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОСтавкахИПН, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОСтавкахНалоговСборовОтчислений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОСтавкахОСМС, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОФизическихЛицахУчастникахВОВ, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СоответствиеРеквизитовНаРусскомИГосударственномЯзыках, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СрокиПеречисленияВзносовИОтчислений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатусФизическихЛицКакНалогоплательщиков, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УчетнаяПолитикаЗарплатаКадры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УчетнаяПолитикаПоНалоговомуУчету, Истина);
	
	Списки.Вставить(Метаданные.РегистрыНакопления.НалогиВзносыОтчисленияПоСотрудникам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.НалогиВзносыРасчетыНалогоплательщиков, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПениПоВзносамИОтчислениям, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииВычетовИПН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СведенияОДоходахФизическихЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СведенияОНеоблагаемыхДоходахФизическихЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЕПКомпоненты, Истина);

	Списки.Вставить(Метаданные.РегистрыНакопления.ВзаиморасчетыПоПрочимВыплатам, Истина);
	// + УчетНалоговВзносовОтчисленийВХО.ПриЗаполненииСписковСОграничениемДоступа

КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
	// + УчетНалоговВзносовОтчисленийВХО.ПриЗаполненииОграниченияДоступа 
	
КонецПроцедуры

#Область Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ВедомостьНаПеречислениеВзносовОтчислений);
	СписокОбъектов.Добавить(Документы.ЗаявлениеНаПредоставлениеВычетовИПН);
	СписокОбъектов.Добавить(Документы.ПрекращениеПредоставленияВычетовИПН);
	СписокОбъектов.Добавить(Документы.ПеняПоВзносамИОтчислениям);
	СписокОбъектов.Добавить(Документы.СведенияОНезачисленныхВзносахОтчислениях);
	СписокОбъектов.Добавить(Документы.РегистрацияПрочихВыплат);
	СписокОбъектов.Добавить(Документы.ВедомостьНаПеречислениеПрочихВыплат);
	СписокОбъектов.Добавить(Документы.ВедомостьНаВозвратПрочихВыплат);

	// + УчетНалоговВзносовОтчисленийВХО.ПриОпределенииОбъектовСКомандамиПечати
	
КонецПроцедуры

#КонецОбласти

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт

	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "79516d34-82d3-4035-9e2a-bb4fbb64feee", Метаданные.Документы.ЗаявлениеНаПредоставлениеВычетовИПН);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "cba9495c-5b66-4265-b16d-7ab7df6cca5b", Метаданные.Документы.ВедомостьНаПеречислениеВзносовОтчислений);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c48f24fc-309b-4910-a0b3-19dc54251373", Метаданные.Документы.ПеняПоВзносамИОтчислениям);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c7d94436-bbd0-4bb8-b0cd-19fe2c2b67a4", Метаданные.Документы.ПрекращениеПредоставленияВычетовИПН);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "64c0940b-241b-4954-b743-df7b3e02acc3", Метаданные.Документы.СведенияОНезачисленныхВзносахОтчислениях);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "666d7b5a-d294-4a96-8035-b96c1e05710d", Метаданные.Документы.УдержаниеНалоговВзносовПоНУ);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "cfa85289-8de7-41f8-bc67-1e0e536ea421", Метаданные.Документы.РегистрацияПрочихВыплат);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "0c9185be-7cb3-43a5-ae9d-2ceaa3fb746d", Метаданные.Документы.ВедомостьНаПеречислениеПрочихВыплат);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "a5b9b31f-03d4-4fee-88d1-c0c0903c1555", Метаданные.Документы.ВедомостьНаВозвратПрочихВыплат);
	
	// + УчетНалоговВзносовОтчисленийВХО.ПриПолученииПредопределенныхНаборовСвойств
	
КонецПроцедуры

Функция ВидыСплошнойРегистрацииПоНормеВремени() Экспорт 
	
	ВидыВремени = Новый Массив;
	
	Болезнь = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.Болезнь");
	Если ЗначениеЗаполнено(Болезнь) Тогда
		ВидыВремени.Добавить(Болезнь);
	КонецЕсли;	
	
	ОсновнойОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОсновнойОтпуск");
	Если ЗначениеЗаполнено(ОсновнойОтпуск) Тогда
		ВидыВремени.Добавить(ОсновнойОтпуск);
	КонецЕсли;	

	ДополнительныйОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ДополнительныйОтпуск");
	Если ЗначениеЗаполнено(ДополнительныйОтпуск) Тогда
		ВидыВремени.Добавить(ДополнительныйОтпуск);
	КонецЕсли;	
	
	ОтпускНаОбучение = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОтпускНаОбучение");
	Если ЗначениеЗаполнено(ОтпускНаОбучение) Тогда
		ВидыВремени.Добавить(ОтпускНаОбучение);
	КонецЕсли;	
	
	Возврат ВидыВремени;
	
КонецФункции

Функция ВидыСплошнойРегистрацииПоНормеВремениТолькоОтпуска() Экспорт 
	
	ВидыВремени = Новый Массив;
	
	ОсновнойОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОсновнойОтпуск");
	Если ЗначениеЗаполнено(ОсновнойОтпуск) Тогда
		ВидыВремени.Добавить(ОсновнойОтпуск);
	КонецЕсли;	

	ДополнительныйОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ДополнительныйОтпуск");
	Если ЗначениеЗаполнено(ДополнительныйОтпуск) Тогда
		ВидыВремени.Добавить(ДополнительныйОтпуск);
	КонецЕсли;	
	
	ОтпускНаОбучение = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыИспользованияРабочегоВремени.ОтпускНаОбучение");
	Если ЗначениеЗаполнено(ОтпускНаОбучение) Тогда
		ВидыВремени.Добавить(ОтпускНаОбучение);
	КонецЕсли;	
	
	Возврат ВидыВремени;
	
КонецФункции

Процедура УстановитьУсловноеОформлениеДокументРегистрацияПрочихДоходов(Форма) Экспорт
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ВидДохода");
	ЭлементОтбора.ПравоеЗначение = Справочники.ВидыДоходов.ДоходСубъектаПредпринимательства;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияКВыплате");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияУдержанияВзносыУдержано");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьОПВ");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияОПВ");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьВОСМС");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияВОСМС");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьИПН");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияИПН");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьСН");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияСН");
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	// Вид оформления
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	// Условие для оформления
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("УчитыватьСО");
	ЭлементОтбора.ПравоеЗначение = Ложь;
	// Оформляемое поле
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НачисленияСО");
		
КонецПроцедуры

Функция РеквизитВходитВСписокНеиспользуемых(Реквизит) Экспорт
	
	ПодстрокиНеиспользуемыхРеквизитов = Новый Массив;
	ПодстрокиНеиспользуемыхРеквизитов.Добавить("НДФЛ");
	ПодстрокиНеиспользуемыхРеквизитов.Добавить("ЕНВД");
	ПодстрокиНеиспользуемыхРеквизитов.Добавить("ОГРН");
	ПодстрокиНеиспользуемыхРеквизитов.Добавить("ДНР, ЛНР");
	ПодстрокиНеиспользуемыхРеквизитов.Добавить("БИК РКЦ");
	ПодстрокиНеиспользуемыхРеквизитов.Добавить(ВРег("(не используется)"));
	ПодстрокиНеиспользуемыхРеквизитов.Добавить(ВРег("районный коэффициент"));
	ПодстрокиНеиспользуемыхРеквизитов.Добавить(ВРег("районному коэффициенту"));
	ПодстрокиНеиспользуемыхРеквизитов.Добавить(ВРег("северная надбавка"));
	ПодстрокиНеиспользуемыхРеквизитов.Добавить(ВРег("северной надбавки"));
	
	НаименованиеРеквизита = ВРег(Реквизит);
	Для Каждого Подстрока Из ПодстрокиНеиспользуемыхРеквизитов Цикл
		Если СтрНайти(НаименованиеРеквизита, Подстрока) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Заполнение сведений о показателях, используемых при расчете результата предопределенным способом.
//
// Параметры:
//	- ТаблицаПоказателей - таблица значений с колонками
//		СпособРасчета.
//		Показатель
//
Процедура ОбработатьПоказателиПредопределенногоСпособа(СпособРасчета, ВидОперацииПоЗарплате, ТаблицаПоказателей) Экспорт
	
	// Исполнительные листы
	Если СпособРасчета = Перечисления.СпособыРасчетаУдержаний.ИсполнительныйЛист
		И ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛистыКонтрагенты Тогда
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		НоваяСтрока.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоИсполнительномуЛистуСО");
		НоваяСтрока.ИспользоватьПриРасчете = Истина;
		
	ИначеЕсли СпособРасчета = Перечисления.СпособыРасчетаУдержаний.ИсполнительныйЛист
		И ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.АлиментыПрочиеИсполнительныеЛисты Тогда
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		НоваяСтрока.Показатель = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.ИсчисленныйПоИсполнительномуЛистуЕП");
		НоваяСтрока.ИспользоватьПриРасчете = Истина;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти