
////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиПереопределяемый: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет массив актуальными видами электронных документов для прикладного решения.
//
// Параметры:
//  Массив - Массив из ПеречислениеСсылка.ВидыЭДОбменСБанками  - виды актуальных ЭД
//   Добавлять можно только следующие значения:
//    - Перечисления.ВидыЭДОбменСБанками.ЗапросВыписки
//    - Перечисления.ВидыЭДОбменСБанками.ПлатежноеПоручение
//    - Перечисления.ВидыЭДОбменСБанками.ПлатежноеТребование
//    - Перечисления.ВидыЭДОбменСБанками.ПоручениеНаПереводВалюты
//    - Перечисления.ВидыЭДОбменСБанками.ПоручениеНаПокупкуВалюты
//    - Перечисления.ВидыЭДОбменСБанками.ПоручениеНаПродажуВалюты
//    - Перечисления.ВидыЭДОбменСБанками.РаспоряжениеНаОбязательнуюПродажуВалюты
//    - Перечисления.ВидыЭДОбменСБанками.СписокНаЗачислениеДенежныхСредствНаСчетаСотрудников
//    - Перечисления.ВидыЭДОбменСБанками.СписокНаОткрытиеСчетовПоЗарплатномуПроекту
//    - Перечисления.ВидыЭДОбменСБанками.СписокУволенныхСотрудников
//    - Перечисления.ВидыЭДОбменСБанками.Письмо
//    - Перечисления.ВидыЭДОбменСБанками.РеестрВыплатСамозанятым
//
Процедура ПолучитьАктуальныеВидыЭД(Массив) Экспорт
	ОбменСБанкамиБЗК.ПолучитьАктуальныеВидыЭД(Массив);
КонецПроцедуры

// Используется для получения номеров счетов в виде массив строк
//
// Параметры:
//  Организация - СправочникСсылка.Организации - отбор по организации.
//  Банк - СправочникСсылка.КлассификаторБанков - отбор по банку.
//  МассивНомеровБанковскихСчетов - Массив - Массив возврата, в элементах строки с номерами счетов.
//
Процедура ПолучитьНомераБанковскихСчетов(Организация, Банк, МассивНомеровБанковскихСчетов) Экспорт
	
КонецПроцедуры

// Определяет параметры электронного документа по типу владельца.
//
// Параметры:
//  Источник - ДокументСсылка, ДокументОбъект - Источник объекта, либо ссылка документа/справочника-источника.
//  ПараметрыЭД - Структура - структура параметров источника, необходимых для определения
//                настроек обмена ЭД. Обязательные параметры: ВидЭД, Банк, Организация.
//
Процедура ЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭД) Экспорт
	// ЗУПК
	ТипИсточника = ТипЗнч(Источник);	
	Если ТипИсточника = Тип("ДокументСсылка.ПлатежноеПоручение")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПлатежноеПоручение") 
		ИЛИ ТипИсточника = Тип("ДокументСсылка.ПеречислениеВзносовИОтчислений")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПеречислениеВзносовИОтчислений") Тогда	
		ПараметрыЭД.ВидЭД = Перечисления.ВидыЭДОбменСБанками.ПлатежноеПоручение;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Банк = Источник.БанковскийСчет.Банк; 	
	КонецЕсли;
	// ЗУПК
КонецПроцедуры

// Подготавливает данные для электронного документа типа Платежное поручение.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПлатежноеПоручение из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо дерева значений.
//           ВНИМАНИЕ! Порядок элементов массива ДанныеДляЗаполнения соответствует порядку элементов массива МассивСсылок.
//
Процедура ЗаполнитьДанныеПлатежныхПоручений(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
	// ЗУПК
	
	ТекДокумент = МассивСсылок[0];
	
	ДанныеДокументаСтруктура = Новый Структура("Организация, БанковскийСчет, Получатель, БанковскийСчетПолучателя, 
											|Дата, Номер, КодНазначенияПлатежа, НазначениеПлатежа, СтруктурноеПодразделение, ФактическийПлательщик", 
											ТекДокумент.Организация, ТекДокумент.БанковскийСчет, ТекДокумент.Контрагент, ТекДокумент.БанковскийСчетКонтрагента,
											ТекДокумент.Дата, ТекДокумент.Номер, ТекДокумент.КодНазначенияПлатежа, ТекДокумент.НазначениеПлатежа, ТекДокумент.Подразделение, ТекДокумент.ФактическийПлательщик); 

	
	ДанныеДокумента = Новый Структура("ВидОперации, ВидНалогаВзносаОтчисления, Дата, Номер, КодНазначенияПлатежа, НазначениеПлатежа, Ведомости, БуквенныйКодВалюты,
									|Организация, БанковскийСчет, ОрганизацияНаименованиеСокращенное, ОрганизацияИдентификационныйНомер, ОрганизацияКодСтраныРегистрации,
									|ОрганизацияНомерСчета, ОрганизацияБИК, ОрганизацияПризнакРезидентства, ОрганизацияСекторЭкономики,
									|Получатель, БанковскийСчетПолучателя, ПолучательНаименованиеПолное, ПолучательИдентификационныйНомер, ПолучательКодСтраныРегистрации,
									|ПолучательПризнакРезидентства, ПолучательСекторЭкономики, ПолучательНомерСчета, ПолучательБИК,
									|ФИОРуководителя, ДолжностьРуководителя, ФИОГлавногоБухгалтера, 
									|СтруктурноеПодразделение, СтруктурноеПодразделениеИдентификационныйНомер, СтруктурноеПодразделениеНаименование, 
									|ФактическийПлательщик, ФактическийПлательщикНаименованиеСокращенное, ФактическийПлательщикИдентификационныйНомер");
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, ДанныеДокументаСтруктура);
	
	СтруктураРеквизитовОрганизации                     = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.Организация, "ИНН, НаименованиеСокращенное, КБЕ, СтранаРегистрации, ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель");
	ДанныеДокумента.ОрганизацияИдентификационныйНомер  = СтруктураРеквизитовОрганизации.ИНН;
	ДанныеДокумента.ОрганизацияНаименованиеСокращенное = СтруктураРеквизитовОрганизации.НаименованиеСокращенное;
	ДанныеДокумента.ОрганизацияПризнакРезидентства     = Лев(СтруктураРеквизитовОрганизации.КБЕ, 1);
	ДанныеДокумента.ОрганизацияСекторЭкономики         = Прав(СтруктураРеквизитовОрганизации.КБЕ, 1);
	
	Если СтруктураРеквизитовОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		ГражданствоФизическихЛиц = РегистрыСведений.ГражданствоФизическихЛиц.СрезПоследних(ДанныеДокумента.Дата, Новый Структура("ФизическоеЛицо", СтруктураРеквизитовОрганизации.ИндивидуальныйПредприниматель));
		
		Если ГражданствоФизическихЛиц.Количество() > 0 Тогда
			
			СтранаРегистрации = ГражданствоФизическихЛиц[0].Страна;
			ДанныеДокумента.ОрганизацияКодСтраныРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтранаРегистрации, "КодАльфа2");
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.СтранаРегистрации) Тогда
		
		ДанныеДокумента.ОрганизацияКодСтраныРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовОрганизации.СтранаРегистрации, "КодАльфа2");
		
	Иначе
		
		ДанныеДокумента.ОрганизацияКодСтраныРегистрации = "KZ";
		
	КонецЕсли;
	
	СтруктураРеквизитовПолучателя                      = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.Получатель, "ИНН, НаименованиеПолное, КБЕ, СтранаРегистрации");
	ДанныеДокумента.ПолучательНаименованиеПолное       = СтруктураРеквизитовПолучателя.НаименованиеПолное;
	ДанныеДокумента.ПолучательИдентификационныйНомер   = СтруктураРеквизитовПолучателя.ИНН;
	ДанныеДокумента.ПолучательПризнакРезидентства      = Лев(СтруктураРеквизитовПолучателя.КБЕ, 1);
	ДанныеДокумента.ПолучательСекторЭкономики          = Прав(СтруктураРеквизитовПолучателя.КБЕ, 1);
	Если ЗначениеЗаполнено(СтруктураРеквизитовПолучателя.СтранаРегистрации) Тогда
		
		ДанныеДокумента.ПолучательКодСтраныРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовПолучателя.СтранаРегистрации, "КодАльфа2");
		
	Иначе
		
		ДанныеДокумента.ПолучательКодСтраныРегистрации = "KZ";

	КонецЕсли;
	
    Если ЗначениеЗаполнено(ДанныеДокумента.СтруктурноеПодразделение) Тогда
		
		Регистрация = ЗарплатаКадры.РегистрацияВНалоговомОргане(ДанныеДокумента.СтруктурноеПодразделение, ДанныеДокумента.Дата);
		ДанныеДокумента.СтруктурноеПодразделениеИдентификационныйНомер  = Регистрация.ИНН;
		ДанныеДокумента.СтруктурноеПодразделениеНаименование = Регистрация.НаименованиеОбособленногоПодразделения;
		
	КонецЕсли;
	
    Если ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
		
		Если ТипЗнч(ДанныеДокумента.ФактическийПлательщик) = Тип("СправочникСсылка.ПодразделенияОрганизаций") 
			И ЗначениеЗаполнено(ДанныеДокумента.ФактическийПлательщик) Тогда
			
			Регистрация = ЗарплатаКадры.РегистрацияВНалоговомОргане(ДанныеДокумента.ФактическийПлательщик, ДанныеДокумента.Дата);
			ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер  = Регистрация.ИНН;
			ДанныеДокумента.ФактическийПлательщикНаименованиеСокращенное = Регистрация.НаименованиеОбособленногоПодразделения;
			
		Иначе
			
			СтруктураРеквизитовОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.ФактическийПлательщик, "ИНН, НаименованиеСокращенное");
			ДанныеДокумента.ФактическийПлательщикИдентификационныйНомер  = СтруктураРеквизитовОрганизации.ИНН;
			ДанныеДокумента.ФактическийПлательщикНаименованиеСокращенное = СтруктураРеквизитовОрганизации.НаименованиеСокращенное;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы") Тогда
		МодульЗарплатаКадры                            = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадры");
		ДанныеДокумента.БуквенныйКодВалюты             = МодульЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
		МодульЗарплатаКадрыПереопределяемый            = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыПереопределяемый");
		СтруктураОтветственных                         = МодульЗарплатаКадрыПереопределяемый.СведенияОбОтветственныхЛицах(
			ДанныеДокумента.Организация,"Руководитель, ДолжностьРуководителя, ГлавныйБухгалтер", ДанныеДокумента.Дата);
		ДанныеДокумента.ФИОРуководителя                = СтруктураОтветственных.Руководитель;
		ДанныеДокумента.ДолжностьРуководителя          = СтруктураОтветственных.ДолжностьРуководителя;
		ДанныеДокумента.ФИОГлавногоБухгалтера          = СтруктураОтветственных.ГлавныйБухгалтер;
	Иначе
		МодульЗначениеНастроекПовтИсп = ОбщегоНазначения.ОбщийМодуль("ЗначениеНастроекПовтИсп");
		ДанныеДокумента.БуквенныйКодВалюты             = МодульЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
		МодульОтветственныеЛицаСервер = ОбщегоНазначения.ОбщийМодуль("ОтветственныеЛицаСервер");
		СтруктураОтветственных                         = МодульОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(ДанныеДокумента.Организация, ДанныеДокумента.Дата);
		ДанныеДокумента.ФИОРуководителя                = СтруктураОтветственных.РуководительНаименование;
		ДанныеДокумента.ДолжностьРуководителя          = СтруктураОтветственных.РуководительДолжность;
		ДанныеДокумента.ФИОГлавногоБухгалтера          = СтруктураОтветственных.ГлавныйБухгалтерНаименование;
	КонецЕсли;
	
	СтруктураРеквизитовБанкаОрганизации                = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(ДанныеДокумента.БанковскийСчет);
	ДанныеДокумента.ОрганизацияНомерСчета              = СтруктураРеквизитовБанкаОрганизации.НомерСчета;
	ДанныеДокумента.ОрганизацияБИК                     = СтруктураРеквизитовБанкаОрганизации.БИК;
	
	СтруктураРеквизитовБанкаКонтрагента                = Справочники.БанковскиеСчетаКонтрагентов.ПолучитьРеквизитыБанковскогоСчета(ДанныеДокумента.БанковскийСчетПолучателя);
	ДанныеДокумента.ПолучательНомерСчета               = СтруктураРеквизитовБанкаКонтрагента.НомерСчета;
	ДанныеДокумента.ПолучательБИК                      = СтруктураРеквизитовБанкаКонтрагента.БИК;

	Если ТипЗнч(ТекДокумент) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		Если ТекДокумент.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты
			ИЛИ ТекДокумент.ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов Тогда
			Ведомости = ТекДокумент.Ведомости.Выгрузить(,"Ведомость").ВыгрузитьКолонку("Ведомость");
		Иначе
			Ведомости = ТекДокумент.ВедомостиПрочие.Выгрузить(,"Ведомость").ВыгрузитьКолонку("Ведомость");
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекДокумент) = Тип("ДокументСсылка.ПеречислениеВзносовИОтчислений") Тогда
		Ведомости = ТекДокумент.ВедомостиНаПеречислениеВзносовИОтчислений.Выгрузить(,"Ведомость").ВыгрузитьКолонку("Ведомость");	
	КонецЕсли;
	
	Если Ведомости.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В табличной части платежного поручения должна быть выбрана как минимум одна ведомость'"));
		Возврат;
	КонецЕсли;
	
	СуммаКПеречислению = 0;
	
	Для каждого ТекВедомость из Ведомости Цикл
		
		Если ТипЗнч(ТекВедомость)= Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
			ВидОперации = "ВыплатаЗарплатыПеречислением";  
		ИначеЕсли ТипЗнч(ТекВедомость)= Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда
			ВидОперации = "ПеречислениеПрочихВыплат";
		ИначеЕсли ТипЗнч(ТекВедомость)= Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк") Тогда
			ВидОперации = "ВедомостьПрочихДоходовВБанк";
		ИначеЕсли ТипЗнч(ТекВедомость)= Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
			ВидОперации = "ВедомостьПрочихДоходовПеречислением";
		Иначе
			ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту";
		КонецЕсли; 
		
		Если ТипЗнч(ТекДокумент) = Тип("ДокументСсылка.ПеречислениеВзносовИОтчислений") Тогда
			ВидОперации = "ПеречислениеВзносов";
		КонецЕсли;
		
		Если ВидОперации = "ПеречислениеВзносов" И Ведомости.Количество() > 0 Тогда
			ВидНалогаВзносаОтчисления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекВедомость, "ВидНалогаВзносаОтчисления");
		Иначе
			ВидНалогаВзносаОтчисления = Неопределено;
		КонецЕсли;
		
		РазделятьСуммыПоПериодуЗадолженности  = Ложь;
		
		Если НЕ ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
			РазделятьСуммыПоПериодуЗадолженности = Истина;
		КонецЕсли;
		
		Если ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
			ИЛИ ВидОперации = "ВыплатаЗарплатыПеречислением" Тогда			
			ВидОплаты = "41";
		ИначеЕсли ВидОперации = "ПеречислениеВзносов" Тогда
			ВидОплаты = "42";   
		Иначе
			ВидОплаты = "10";
		КонецЕсли;		
		
		Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.СО") Тогда
			ВидОплаты = "43";
		КонецЕсли;	
		
		ДатаДокумента = ТекДокумент.Дата;  
		
		СуммаКПеречислению = СуммаКПеречислению + ТекВедомость.СуммаПоДокументу;
		
		Запрос = Новый Запрос(); 
		Запрос.УстановитьПараметр("Ведомости", Ведомости);
		Запрос.УстановитьПараметр("Организация", ТекДокумент.Организация);
		Запрос.УстановитьПараметр("ВидыПлатежейПени", Перечисления.ВидыПлатежейВГосБюджет.ВидыПениПлатежей());
		Запрос.УстановитьПараметр("ВключатьПоляФорматаMX", ложь);		
		
		Если ВидНалогаВзносаОтчисления = "ЕП" Тогда
			
			ТекстЗапроса = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МИНИМУМ(СписокКПеречислению.МесяцНалоговогоПериода) КАК НачалоПериода,
			|	МАКСИМУМ(СписокКПеречислению.МесяцНалоговогоПериода) КАК КонецПериода
			|ИЗ
			|	Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления КАК СписокКПеречислению
			|ГДЕ
			|	СписокКПеречислению.Ссылка В(&Ведомости)
			|";
			
			Если НЕ РазделятьСуммыПоПериодуЗадолженности Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "МАКСИМУМ", "МИНИМУМ");
			КонецЕсли;
			
			Запрос.Текст = ТекстЗапроса;
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда			
				
				Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Выборка.НачалоПериода));
				Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Выборка.КонецПериода));
				
			Иначе
				
				Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекДокумент.Дата));
				Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекДокумент.Дата));
				
			КонецЕсли; 		
			
		КонецЕсли;
			
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ПолеФизическоеЛицо,
		|	&ПолеФизическоеЛицоНаименование,
		|	""9"" КАК ФизЛицоСекторЭкономики,
		|	&ПолеИИН,
		|	СУММА(ВЫБОР
		|			КОГДА СписокКПеречислению.КВыплате ЕСТЬ NULL 
		|				ТОГДА 0
		|			ИНАЧЕ СписокКПеречислению.КВыплате
		|		КОНЕЦ) КАК Сумма,
		|	&ПоляВыборки,
		|	&ПоляФИО,
		|	&ПоляДанныеФИО
		|
		|ИЗ
		|	&Источник КАК СписокКПеречислению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОФизЛиц
		|		ПО ФИОФизЛиц.ФизическоеЛицо = СписокКПеречислению.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ГражданствоФизическихЛиц
		|		ПО ГражданствоФизическихЛиц.ФизическоеЛицо = СписокКПеречислению.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаФизическогоЛица
		|		ПО ГражданствоФизическихЛиц.Страна = СтранаФизическогоЛица.Ссылка
		|		&ПрисоединяемыеТаблицы
		|ГДЕ
		|	СписокКПеречислению.Ссылка В(&Ведомости)
		|
		|СГРУППИРОВАТЬ ПО
		|	&ГруппировкаФизическоеЛицо,
		|	&ГруппировкаФизическоеЛицоНаименование,
		|	&ГруппировкаИИН,
		|	&ГруппировкиФИО,
		|	&ГруппировкиДанныеФИО,
		|	&ПоляГруппировки
		|";
		
		ПолеФизическоеЛицо = "СписокКПеречислению.ФизическоеЛицо";
		ПолеФизическоеЛицоНаименование = "СписокКПеречислению.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование";
		ПолеИИН = "СписокКПеречислению.ФизическоеЛицо.ИНН КАК ИНН";
		ПоляФИО = 
		"ФИОФизЛиц.Фамилия КАК Фамилия,
		|	ФИОФизЛиц.Имя КАК Имя,
		|	ФИОФизЛиц.Отчество КАК Отчество";
		ПоляДанныеФИО = 
		"ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """") КАК ФизЛицоКодСтраны,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, """") = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
		|			ТОГДА ""1""
		|		ИНАЧЕ ""2""
		|	КОНЕЦ КАК ФизЛицоПризнакРезидентства";
		ПрисоединяемыеТаблицы = "";
		ГруппировкаФизическоеЛицо = "СписокКПеречислению.ФизическоеЛицо";
		ГруппировкаФизическоеЛицоНаименование = "СписокКПеречислению.ФизическоеЛицо.Наименование";
		ГруппировкаИИН = "СписокКПеречислению.ФизическоеЛицо.ИНН";
		ГруппировкиФИО = 
		"ФИОФизЛиц.Фамилия,
		|	ФИОФизЛиц.Имя,
		|	ФИОФизЛиц.Отчество";
		ГруппировкиДанныеФИО = 
		"ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, """")= ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
		|			ТОГДА ""1""
		|		ИНАЧЕ ""2""
		|	КОНЕЦ";
		ПоляУпорядочивания = ГруппировкиФИО;
		
		Если ВидОперации = "ВыплатаЗарплатыПоЗарплатномуПроекту"
			ИЛИ ВидОперации = "ВедомостьПрочихДоходовВБанк" Тогда
			Источник1 = "Документ.ВедомостьНаВыплатуЗарплатыВБанк.Зарплата";
			Если ПолучитьФункциональнуюОпцию("ИспользоватьВзаиморасчетыПоПрочимДоходам") Тогда
				Источник2 = "Документ.ВедомостьПрочихДоходовВБанк.Выплаты";
			КонецЕсли;
			ПоляВыборки = "СписокКПеречислению.НомерЛицевогоСчета КАК РасчСчет, СписокКПеречислению.ФизическоеЛицо.ДатаРождения КАК ДатаРождения";
			ПоляГруппировки = "СписокКПеречислению.НомерЛицевогоСчета, СписокКПеречислению.ФизическоеЛицо.ДатаРождения";
			
		ИначеЕсли ВидОперации = "ВыплатаЗарплатыПеречислением"
			ИЛИ ВидОперации = "ВедомостьПрочихДоходовПеречислением" Тогда
			Источник1 = "Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Зарплата";
			Если ПолучитьФункциональнуюОпцию("ИспользоватьВзаиморасчетыПоПрочимДоходам") Тогда
				Источник2 = "Документ.ВедомостьПрочихДоходовПеречислением.Выплаты";
			КонецЕсли;
			ПоляВыборки = "СписокКПеречислению.БанковскийСчет.НомерСчета КАК РасчСчет";
			ПоляГруппировки = "СписокКПеречислению.БанковскийСчет.НомерСчета";
			ПолеФизическоеЛицо = 
			"ВЫБОР
			|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо
			|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо
			|	КОНЕЦ КАК ФизическоеЛицо";
			ПолеФизическоеЛицоНаименование = 
			"ВЫБОР
			|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.Наименование
			|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.Наименование
			|	КОНЕЦ КАК ФизическоеЛицоНаименование";
			ПолеИИН = 
			"ВЫБОР
			|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.ИНН
			|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.ИНН
			|	КОНЕЦ КАК ИИН";
			ПоляФИО = 
			"ВЫБОР
			|		КОГДА НЕ ФИОТретьегоЛица.Фамилия ЕСТЬ NULL
			|			ТОГДА ФИОТретьегоЛица.Фамилия
			|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Фамилия, """")
			|	КОНЕЦ КАК Фамилия,
			|	ВЫБОР
			|		КОГДА НЕ ФИОТретьегоЛица.Имя ЕСТЬ NULL
			|			ТОГДА ФИОТретьегоЛица.Имя
			|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Имя, """")
			|	КОНЕЦ КАК Имя,
			|	ВЫБОР
			|		КОГДА НЕ ФИОТретьегоЛица.Отчество ЕСТЬ NULL
			|			ТОГДА ФИОТретьегоЛица.Отчество
			|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Отчество, """")
			|	КОНЕЦ КАК Отчество";
			ПоляДанныеФИО = 
			"ЕСТЬNULL(СтранаТретьегоЛица.КодАльфа2, ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """")) КАК ФизЛицоКодСтраны,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ГражданствоТретьегоЛица.Страна, ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, """")) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
			|			ТОГДА ""1""
			|		ИНАЧЕ ""2""
			|	КОНЕЦ КАК ФизЛицоПризнакРезидентства";
			ПрисоединяемыеТаблицы = 
			"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестаВыплатыЗарплатыСотрудников КАК МестаВыплатыЗарплатыСотрудников
			|		ПО (МестаВыплатыЗарплатыСотрудников.Сотрудник = СписокКПеречислению.Сотрудник)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОТретьегоЛица
			|		ПО (ФИОТретьегоЛица.ФизическоеЛицо = МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ГражданствоТретьегоЛица
			|		ПО (ФИОТретьегоЛица.ФизическоеЛицо = ГражданствоТретьегоЛица.ФизическоеЛицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаТретьегоЛица
			|		ПО ГражданствоТретьегоЛица.Страна = СтранаТретьегоЛица.Ссылка";
			ГруппировкаФизическоеЛицо = 
			"ВЫБОР
			|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо
			|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо
			|	КОНЕЦ";
			ГруппировкаФизическоеЛицоНаименование = 
			"ВЫБОР
			|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.Наименование
			|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.Наименование
			|	КОНЕЦ";
			ГруппировкаИИН = 
			"ВЫБОР
			|		КОГДА НЕ МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо ЕСТЬ NULL
			|			ТОГДА МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо.ИНН
			|		ИНАЧЕ СписокКПеречислению.ФизическоеЛицо.ИНН
			|	КОНЕЦ";
			ГруппировкиФИО = 
			"ВЫБОР
			|		КОГДА НЕ ФИОТретьегоЛица.Фамилия ЕСТЬ NULL
			|			ТОГДА ФИОТретьегоЛица.Фамилия
			|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Фамилия, """")
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ ФИОТретьегоЛица.Имя ЕСТЬ NULL
			|			ТОГДА ФИОТретьегоЛица.Имя
			|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Имя, """")
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НЕ ФИОТретьегоЛица.Отчество ЕСТЬ NULL
			|			ТОГДА ФИОТретьегоЛица.Отчество
			|		ИНАЧЕ ЕСТЬNULL(ФИОФизЛиц.Отчество, """")
			|	КОНЕЦ";
			ГруппировкиДанныеФИО = 
			"ЕСТЬNULL(СтранаТретьегоЛица.КодАльфа2, ЕСТЬNULL(СтранаФизическогоЛица.КодАльфа2, """")),
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ГражданствоТретьегоЛица.Страна, ЕСТЬNULL(ГражданствоФизическихЛиц.Страна, """")) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Казахстан)
			|			ТОГДА ""1""
			|		ИНАЧЕ ""2""
			|	КОНЕЦ";
			ПоляУпорядочивания = ГруппировкиФИО;
			
		ИначеЕсли ВидОперации = "ПеречислениеВзносов" Тогда
			Источник1 = "Документ.ВедомостьНаПеречислениеВзносовОтчислений.НалогиВзносыОтчисления";
			ПоляВыборки = "
			|	СписокКПеречислению.Ссылка.ВидНалогаВзносаОтчисления КАК ВидОперации,
			|	СписокКПеречислению.Ссылка.ВидПлатежа КАК ВидПлатежа,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,";
			
			Если РазделятьСуммыПоПериодуЗадолженности ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ЕП"
				ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
				
				
				Если ТекДокумент.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
					
					ПоляВыборки = ПоляВыборки + "
					|	ВЫБОР КОГДА СписокКПеречислению.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА СписокКПеречислению.МесяцНалоговогоПериода ИНАЧЕ СписокКПеречислению.МесяцПериода КОНЕЦ КАК ПериодПлатежа";
					
				Иначе
					
					ПоляВыборки = ПоляВыборки + "
					|	СписокКПеречислению.МесяцНалоговогоПериода КАК ПериодПлатежа";
					
				КонецЕсли;	
				
			Иначе
				ПоляВыборки = ПоляВыборки + "
				|	МИНИМУМ(СписокКПеречислению.МесяцНалоговогоПериода) КАК ПериодПлатежа";
			КонецЕсли;
			
			Если ТекДокумент.ВидНалогаВзносаОтчисления = "ЕП" Тогда
				
				ПоляВыборки = ПоляВыборки + ",
				|	МАКСИМУМ(СписокКПеречислению.ВключаетОПВ) КАК ОПВ,
				|	МАКСИМУМ(СписокКПеречислению.ВключаетВОСМС) КАК ВОСМС,
				|	МАКСИМУМ(СписокКПеречислению.ВключаетИПН) КАК ИПН,
				|	МАКСИМУМ(СписокКПеречислению.ВключаетСО) КАК СО,
				|	МАКСИМУМ(СписокКПеречислению.ВключаетООСМС) КАК ООСМС,
				|	МАКСИМУМ(СписокКПеречислению.ВключаетОПВР) КАК ОПВР,
				|	СУММА(ВЫБОР КОГДА СписокКПеречислению.Ссылка.ВидПлатежа В (&ВидыПлатежейПени) ТОГДА СписокКПеречислению.НалогВзнос ИНАЧЕ СписокКПеречислению.СуммаПлатежа КОНЕЦ) КАК СуммаПлатежа";
				
			КонецЕсли;
			
			ПоляГруппировки = "
			|	СписокКПеречислению.Ссылка.ВидНалогаВзносаОтчисления,
			|	СписокКПеречислению.Ссылка.ВидПлатежа,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения";
			
			Если РазделятьСуммыПоПериодуЗадолженности ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ЕП"
				ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
				
				Если ТекДокумент.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
					
					ПоляГруппировки = ПоляГруппировки + ",
					|	ВЫБОР КОГДА СписокКПеречислению.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА СписокКПеречислению.МесяцНалоговогоПериода ИНАЧЕ СписокКПеречислению.МесяцПериода КОНЕЦ";
					
				Иначе
					
					ПоляГруппировки = ПоляГруппировки + ",
					|	СписокКПеречислению.МесяцНалоговогоПериода";
					
				КонецЕсли;	
				
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КВыплате", "НалогВзнос");
			
			Если ТекДокумент.ВидНалогаВзносаОтчисления = "ВОСМС" ИЛИ ТекДокумент.ВидНалогаВзносаОтчисления = "ООСМС" Тогда
				
				ПоляУпорядочивания = ПоляУпорядочивания + ", ВЫБОР КОГДА СписокКПеречислению.МесяцПериода = ДАТАВРЕМЯ(1, 1, 1) ТОГДА СписокКПеречислению.МесяцНалоговогоПериода ИНАЧЕ СписокКПеречислению.МесяцПериода КОНЕЦ";
				
			КонецЕсли;
			
		ИначеЕсли ВидОперации = "ПеречислениеДенежныхСредствПодотчетникам" Тогда
			Источник1 = "Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа";
			ПоляВыборки = "
			|	СписокКПеречислению.БанковскийСчетПодотчетногоЛица.НомерСчета КАК РасчСчет";
			
			ПоляГруппировки = "
			|	СписокКПеречислению.БанковскийСчетПодотчетногоЛица.НомерСчета";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СписокКПеречислению.ФизическоеЛицо", "СписокКПеречислению.ПодотчетноеЛицо");
			
		ИначеЕсли ВидОперации = "ПеречислениеПрочихВыплат" Тогда
			Источник1 = "Документ.ВедомостьНаПеречислениеПрочихВыплат.ПрочиеВыплаты";
			ПоляВыборки = "
			|	СписокКПеречислению.Ссылка.ВидПрочихВыплат КАК ВидОперации,
			|	""ПеречислениеПрочихВыплат"" КАК ВидПлатежа,
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,";
			
			Если РазделятьСуммыПоПериодуЗадолженности Тогда
				ПоляВыборки = ПоляВыборки + "
				|	СписокКПеречислению.ПериодВзаиморасчетов КАК ПериодПлатежа";
				
			Иначе
				ПоляВыборки = ПоляВыборки + "
				|	МИНИМУМ(СписокКПеречислению.ПериодВзаиморасчетов) КАК ПериодПлатежа";
			КонецЕсли;
			
			ПоляГруппировки = "
			|	СписокКПеречислению.Ссылка.ВидПрочихВыплат,
			|	""ПеречислениеПрочихВыплат"",
			|	СписокКПеречислению.ФизическоеЛицо.ДатаРождения";
			
			Если РазделятьСуммыПоПериодуЗадолженности Тогда
				ПоляГруппировки = ПоляГруппировки + ",
				|	СписокКПеречислению.ПериодВзаиморасчетов";
			КонецЕсли;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КВыплате", "Сумма");
		КонецЕсли;
		
		ТекстЗапросаДопДанные = ТекстЗапроса;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Источник", Источник1);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки", ПоляВыборки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляГруппировки", ПоляГруппировки);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеФизическоеЛицоНаименование", ПолеФизическоеЛицоНаименование);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеФизическоеЛицо", ПолеФизическоеЛицо);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеИИН", ПолеИИН);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляФИО", ПоляФИО);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДанныеФИО", ПоляДанныеФИО);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПрисоединяемыеТаблицы", ПрисоединяемыеТаблицы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаФизическоеЛицоНаименование", ГруппировкаФизическоеЛицоНаименование);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаФизическоеЛицо", ГруппировкаФизическоеЛицо);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкаИИН", ГруппировкаИИН);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкиФИО", ГруппировкиФИО);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГруппировкиДанныеФИО", ГруппировкиДанныеФИО);
		
		// дополним ВедомостьПрочихДоходовВБанк
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВзаиморасчетыПоПрочимДоходам") 
			И (ВидОперации = "ВедомостьПрочихДоходовВБанк"
			ИЛИ ВидОперации = "ВедомостьПрочихДоходовПеречислением") Тогда
			
			Если ВидОперации = "ВедомостьПрочихДоходовПеречислением" Тогда
				ПрисоединяемыеТаблицы = 
				"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестаВыплатыЗарплатыСотрудников КАК МестаВыплатыЗарплатыСотрудников
				|		ПО ЛОЖЬ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ФИОТретьегоЛица
				|		ПО ЛОЖЬ
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&ДатаДокумента, ) КАК ГражданствоТретьегоЛица
				|		ПО ЛОЖЬ
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтранаТретьегоЛица
				|		ПО ЛОЖЬ"; // перечисление третьему лицу для доходов ГПХ не поддерживается
			КонецЕсли;
			
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&Источник", Источник2);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "РАЗРЕШЕННЫЕ", "");
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляВыборки", ПоляВыборки);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляГруппировки", ПоляГруппировки);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПолеФизическоеЛицоНаименование", ПолеФизическоеЛицоНаименование);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПолеФизическоеЛицо", ПолеФизическоеЛицо);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПолеИИН", ПолеИИН);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляФИО", ПоляФИО);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПоляДанныеФИО", ПоляДанныеФИО);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ПрисоединяемыеТаблицы", ПрисоединяемыеТаблицы);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкаФизическоеЛицоНаименование", ГруппировкаФизическоеЛицоНаименование);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкаФизическоеЛицо", ГруппировкаФизическоеЛицо);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкаИИН", ГруппировкаИИН);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкиФИО", ГруппировкиФИО);
			ТекстЗапросаДопДанные = СтрЗаменить(ТекстЗапросаДопДанные, "&ГруппировкиДанныеФИО", ГруппировкиДанныеФИО);
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|"
			+ ТекстЗапросаДопДанные + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	&ПоляУпорядочивания";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	&ПоляУпорядочивания";
			
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляУпорядочивания", ПоляУпорядочивания);
		
		Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить();
		
		ТаблицаСписокСотрудников = Результат.Выгрузить();
				
	КонецЦикла;

	ДеревоДокумента = ДанныеДляЗаполнения[МассивСсылок.Найти(ТекДокумент)];  
		
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "Дата", ДанныеДокумента.Дата);  
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "Сумма", СуммаКПеречислению); 
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "Организация", ДанныеДокумента.Организация);  
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "СтруктурноеПодразделениеОтправитель", ДанныеДокумента.СтруктурноеПодразделениеНаименование); 
	ПечатныйНомерДокумента = "";
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьПечатныйНомерДокумента(ТекДокумент, ПечатныйНомерДокумента); 
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "Номер", ПечатныйНомерДокумента); 
		
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.ВидОплаты", ВидОплаты); 
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.НазначениеПлатежа", ДанныеДокумента.НазначениеПлатежа); 
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.ВалютаДокумента", ДанныеДокумента.БуквенныйКодВалюты);
		
	// Плательщик.
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Наименование", ДанныеДокумента.Организация.НаименованиеПолное); 
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.ИНН", ДанныеДокумента.ОрганизацияИдентификационныйНомер);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.КБЕ", ДанныеДокумента.Организация.КБЕ);  
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.РасчСчет", ДанныеДокумента.БанковскийСчет.НомерСчета);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.ФактическийПлательщик", ДанныеДокумента.ФактическийПлательщик); 
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.ПлательщикКодСтраныРегистрации", ДанныеДокумента.ОрганизацияКодСтраныРегистрации);
		
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.БИК", СокрЛП(ДанныеДокумента.ОрганизацияБИК));
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.Наименование", ДанныеДокумента.БанковскийСчет.Банк.Наименование);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.Город", ДанныеДокумента.БанковскийСчет.Банк.Город);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлательщика.Банк.КоррСчет", ДанныеДокумента.БанковскийСчет.Банк.КоррСчет);
		
	// Получатель.
	Контрагент = ДанныеДокумента.Получатель;
		
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "Получатель", Контрагент); 
	
	Если Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда 
		ТипКонтрагента = "ЮрЛицо";	
	Иначе 
		ТипКонтрагента = "ФизЛицо";
	КонецЕсли;	
	
	Если ТипКонтрагента = "ФизЛицо" И Контрагент.КБЕ = "" Тогда 
		Если Контрагент.СтранаРегистрации.КодАльфа2 <> "KZ" Тогда
			ПолучательКБЕ = "29";
		Иначе
			ПолучательКБЕ = "19";
		КонецЕсли;
	Иначе
		ПолучательКБЕ = Контрагент.КБЕ;
	КонецЕсли;	
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.ТипКонтрагента", ТипКонтрагента);

	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Наименование", ДанныеДокумента.ПолучательНаименованиеПолное); 
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ПолучательИдентификационныйНомер) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.ИНН", СокрЛП(Контрагент.ИНН));
	Иначе
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.ИНН", СокрЛП(ДанныеДокумента.ПолучательИдентификационныйНомер));
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПолучательКБЕ) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.КБЕ", СокрЛП(Контрагент.КБЕ)); 
	Иначе
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.КБЕ", СокрЛП(ПолучательКБЕ));
	КонецЕсли;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.РасчСчет", ДанныеДокумента.ПолучательНомерСчета);
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.БИК", СокрЛП(ДанныеДокумента.ПолучательБИК)); 
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.Наименование", ДанныеДокумента.БанковскийСчетПолучателя.Банк.Наименование);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.Город", ДанныеДокумента.БанковскийСчетПолучателя.Банк.Город);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.Банк.КоррСчет", ДанныеДокумента.БанковскийСчетПолучателя.Банк.КоррСчет);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПолучателя.ПолучательКодСтраныРегистрации", ДанныеДокумента.ПолучательКодСтраныРегистрации);
		
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.ПеречислениеНалога", Ложь);
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.КодНазначенияПлатежа", ДанныеДокумента.КодНазначенияПлатежа);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.ДатаВалютирования", ДанныеДокумента.Дата);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "РеквизитыПлатежа.ДатаПолученияТовара", Дата(1,1,1));
	
	// Списочные платежи.
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПлатежныйДокумент", ТекДокумент);
	
	Если ТаблицаСписокСотрудников.Количество() <> 0 Тогда
		СписокСотрудников = ТаблицаСписокСотрудников.Скопировать();
	Иначе
		СписокСотрудников = Новый ТаблицаЗначений;
	КонецЕсли;
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДокумента, "ПереданСписокСотрудников", СписокСотрудников.Количество() <> 0);
	Если СписокСотрудников.Количество() <> 0 Тогда
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, СписокСотрудников, "СписокСотрудников");
	КонецЕсли; 
	
	// ЗУПК
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Платежное требование.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПлатежноеТребование из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо дерева значений.
//           ВНИМАНИЕ! Порядок элементов массива ДанныеДляЗаполнения соответствует порядку элементов массива МассивСсылок.
//
Процедура ЗаполнитьДанныеПлатежныхТребований(МассивСсылок, ДанныеДляЗаполнения) Экспорт
		
КонецПроцедуры

// Подготавливает данные для электронного документа типа Поручение на перевод валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПоручениеНаПереводВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо дерева значений.
//           ВНИМАНИЕ! Порядок элементов массива ДанныеДляЗаполнения соответствует порядку элементов массива МассивСсылок.
//
//@skip-warning
Процедура ЗаполнитьДанныеПорученийНаПереводВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Поручение на покупку валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПоручениеНаПокупкуВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо дерева значений.
//           ВНИМАНИЕ! Порядок элементов массива ДанныеДляЗаполнения соответствует порядку элементов массива МассивСсылок.
//
//@skip-warning
Процедура ЗаполнитьДанныеПорученийНаПокупкуВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Поручение на продажу валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета ПоручениеНаПродажуВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо дерева значений.
//           ВНИМАНИЕ! Порядок элементов массива ДанныеДляЗаполнения соответствует порядку элементов массива МассивСсылок.
//
//@skip-warning
Процедура ЗаполнитьДанныеПорученийНаПродажуВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Распоряжение на обязательную продажу валюты.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета РаспоряжениеНаОбязательнуюПродажуВалюты из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо дерева значений.
//           ВНИМАНИЕ! Порядок элементов массива ДанныеДляЗаполнения соответствует порядку элементов массива МассивСсылок.
//
//@skip-warning
Процедура ЗаполнитьДанныеРаспоряженийНаОбязательнуюПродажуВалюты(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Подготавливает данные для электронного документа типа Справка о подтверждающих документах.
//
// Параметры:
//  МассивСсылок - Массив - содержит ссылки на документы информационной базы, на основании которых будут созданы электронные документы.
//  ДанныеДляЗаполнения - Массив - содержит пустые деревья значений, которые необходимо заполнить данными.
//           Дерево значений повторяет структуру макета СправкаОПодтверждающихДокументах из обработки ОбменСБанками.
//           Если по какому-либо документу не удалось получить данные, то текст ошибки необходимо поместить вместо дерева значений.
//           ВНИМАНИЕ! Порядок элементов массива ДанныеДляЗаполнения соответствует порядку элементов массива МассивСсылок.
//
//@skip-warning
Процедура ЗаполнитьДанныеСправокОПодтверждающихДокументах(МассивСсылок, ДанныеДляЗаполнения) Экспорт
	
КонецПроцедуры

// Вызывается при получении уведомления о зачислении валюты
//
// Параметры:
//  ДеревоРазбора - ДеревоЗначений - дерево данных, соответствующее макету Обработки.ОбменСБанками.УведомлениеОЗачислении
//  НовыйДокументСсылка - ДокументСсылка - ссылка на созданный документ на основании данных электронного документа.
//
//@skip-warning
Процедура ПриПолученииУведомленияОЗачислении(ДеревоРазбора, НовыйДокументСсылка) Экспорт
	
КонецПроцедуры

// Включает тестовый режим обмена в банком.
// При включении тестового режима возможно ручное указание URL сервера для получения настроек обмена.
//
// Параметры:
//    ИспользуетсяТестовыйРежим - Булево - признак использования тестового режима.
//
Процедура ПроверитьИспользованиеТестовогоРежима(ИспользуетсяТестовыйРежим) Экспорт
	ОбменСБанкамиБЗК.ПроверитьИспользованиеТестовогоРежима(ИспользуетсяТестовыйРежим);
КонецПроцедуры

// Событие возникает при получении выписки из регламентного задания или при синхронизации.
// Необходимо создать документы в информационной базе для отражения произведенных по счету операций.
// Для получения данных выписки в удобном формате можно использовать следующие процедуры:
//  - ОбменСБанками.ПолучитьДанныеВыпискиБанкаДеревоЗначений()
//  - ОбменСБанками.ПолучитьДанныеВыпискиБанкаТекстовыйФормат() - только для рублевых выписок.
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками - ссылка на сообщение обмена, содержащий выписку банка.
//
Процедура ПриПолученииВыписки(СообщениеОбмена) Экспорт
	
КонецПроцедуры

// Вызывается однократно при первом формировании списка команд, выводимых в форме конкретного объекта конфигурации.
// Возможно изменение значений структуры в параметре Команды. Например, можно добавить условие видимости команды.
//
// Параметры:
//   НастройкиФормы - Структура - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//   Источники - ДеревоЗначений - см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//   ПодключенныеОтчетыИОбработки - см.ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//   Команды - ФиксированнаяСтруктура - команды, добавленные подсистемой ОбменСБанками.
//   	* Ключ - Строка - Идентификатор добавленной команды. Может содержать следующие значения:
//   		"ДиректБанкОтправка", "ДиректБанкПросмотр", "ДиректБанкСоздать", "ДиректБанкСписок", "ДиректБанкВыписки",
//   		"ДиректБанкПисьма"
//   	* Значение - СтрокаТаблицыЗначений - структура таблицы описана
//          в ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//@skip-warning пустая процедура в БЭД
Процедура ПриОпределенииКомандДиректБанк(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	ОбменСБанкамиБЗК.ПриОпределенииКомандДиректБанк(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
КонецПроцедуры

#Область ПроцедурыИФункцииСтатусовДокумента

// Для выполнения действий после отправки электронных документов в прикладной конфигурации
//
// Параметры:
//   РезультатОтправки - Структура - результат выполнения предыдущей процедуры СформироватьИОтправитьПакетыВБанк
//     * КоличествоПодготовленных - Число - количество подготовленных документов
//     * ОтправленныеДокументы - Массив - содержит ссылки на документы, которые были отправлены
//     * ОтправленныеСообщенияОбмена - Массив - содержит ссылки на ДокументСсылка.СообщениеОбменСБанками, которые были отправлены
//
Процедура ПослеОтправкиЭД(РезультатОтправки) Экспорт
			
КонецПроцедуры

#КонецОбласти

#Область ЗарплатныйПроект

// Вызывается для формирования XML файла в прикладном решении.
//
// Параметры:
//    ОбъектДляВыгрузки - ДокументСсылка - ссылка на документ, на основании которого будет сформирован ЭД.
//    ИмяФайла - Строка - имя сформированного файла.
//    АдресФайла - Строка - АдресВременногоХранилища, содержит двоичные данные файла.
//
//@skip-warning
Процедура ПриФормированииXMLФайла(ОбъектДляВыгрузки, ИмяФайла, АдресФайла) Экспорт
	ОбменСБанкамиБЗК.ПриФормированииXMLФайла(ОбъектДляВыгрузки, ИмяФайла, АдресФайла);
КонецПроцедуры

// Формирует табличный документ на основании файла XML для визуального отображения электронного документа.
//
// Параметры:
//  ИмяФайла - Строка - полный путь к файлу XML
//  ТабличныйДокумент - ТабличныйДокумент - возвращаемое значение, визуальное отображение данных файла.
//
//@skip-warning
Процедура ЗаполнитьТабличныйДокумент(Знач ИмяФайла, ТабличныйДокумент) Экспорт
	ОбменСБанкамиБЗК.ЗаполнитьТабличныйДокумент(ИмяФайла, ТабличныйДокумент);
КонецПроцедуры

// Вызывается при получении файла из банка.
//
// Параметры:
//  АдресДанныхФайла - Строка - адрес временного хранилища с двоичными данными файла.
//  ИмяФайла - Строка - формализованное имя файла данных.
//  ОбъектВладелец - ДокументСсылка - (возвращаемый параметр) ссылка на документ, который был создан на основании ЭД.
//  ДанныеОповещения - Структура - (возвращаемый параметр) данные для вызова метода Оповестить на клиенте.
//                 * Ключ - Строка - имя события.
//                 * Значение - Произвольный - параметр сообщения.
//@skip-warning
Процедура ПриПолученииXMLФайла(АдресДанныхФайла, ИмяФайла, ОбъектВладелец, ДанныеОповещения) Экспорт
	ОбменСБанкамиБЗК.ПриПолученииXMLФайла(АдресДанныхФайла, ИмяФайла, ОбъектВладелец, ДанныеОповещения);
КонецПроцедуры

// Вызывается при изменении состояния электронного документооборота.
//
// Параметры:
//  СсылкаНаОбъект - ДокументСсылка - владелец электронного документооборота;
//  СостояниеЭД - ПеречислениеСсылка.СостоянияОбменСБанками - новое состояние электронного документооборота.
//
//@skip-warning
Процедура ПриИзмененииСостоянияЭД(СсылкаНаОбъект, СостояниеЭД) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Позволяет скорректировать входящие параметры перед обработкой электронных документов.
//
// Параметры:
//  Параметры - Структура - параметры обработки электронных документов, содержит поля:
//   * МассивСсылокНаОбъект - Массив - содержит ссылки на документы, которые необходимо обработать;
//   * МассивОтпечатковСертификатов - Массив - отпечатки доступных сертификатов на клиенте;
//   * Действия - Строка - последовательность необходимых действий с электронным документом;
//   * СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками - ссылка сообщение обмена, который нужно обработать;
//   * СессииОбменСБанками - Соответствие - существующие сессии обмена со Сбербанком
//                         - Неопределено - нет установленных сессий.
//   * Фрод - Структура - содержит адреса сетевого оборудования клиента: 
//   	** MAC - Массив из Строка - MAC адреса сетевого оборудования клиента.
//   	** IP - Массив из Строка - IP адреса сетевого оборудования клиента.
//   	** IPАдресКлиента - Строка - IP адрес клиента с точки зрения сервера.
//
Процедура ПередОбработкойЭлектронныхДокументов(Параметры) Экспорт

КонецПроцедуры 

// Процедура добавляет связанные документы для прикладной конфигурации
//
// Параметры:
//    ТекущийДокумент - ДокументСсылка - ссылка на документ, для которого нужно добавить связанный документ.
//    МассивДокументов - Массив из ДокументСсылка - массив документов, в который необходимо добавить 
//      связанные документы для прикладной конфигурации.
//
Процедура ДобавитьСвязанныеДокументы(ТекущийДокумент, МассивДокументов) Экспорт
		
КонецПроцедуры

#КонецОбласти
