&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обход ошибки платформы "Параметр сеанса отсутствует или удален".
	ТабличныйДокумент.Очистить();
	
	СформироватьСтруктуруРеквизитовФормы();
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	СтруктураРеквизитовФормы.мИдГруппы21  = "П0000010040";
	
	КолИсхСтрокИдГруппы21  = 1;
	
	КолКолонокИдГруппы21 = 11;
		
	СтруктураДанныхФорма1ТСтраница1        = Новый Структура;
	СтруктураДанныхФорма1ТСтраница2        = Новый Структура;
	СтруктураДанныхФорма1ТСтраница3        = Новый Структура;
	СтруктураДанныхФорма1ТСтраница4        = Новый Структура;
	СтруктураДанныхФорма1ТСтраница5        = Новый Структура;
	СтруктураДанныхФорма1ТСтраница6		   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница7		   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница8		   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница9		   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница10	   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница11	   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница12	   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница13	   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница14	   = Новый Структура;
	СтруктураДанныхФорма1ТСтраница15	   = Новый Структура;
	
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатныеформы = Новый СписокЗначений;
	// структура многострочных разделов формы
	мСтруктураМногострочныхРазделов = Новый Структура;

	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21,  СтруктураРеквизитовФормы.мИдГруппы21);
	
	// Структура содержит данные дополнительных страниц
	мСтруктураМногостраничныхРазделов = Новый Структура;
	
	// структура исходных строк (минимального кол-ва) многострочных разделов формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолИсхСтрокИдГруппы21);
	
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппы21, КолКолонокИдГруппы21);
	
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = Параметры.Организация;
	СтруктураРеквизитовФормы.ВидДокумента             = 0;
	мСписокСтруктурныхЕдиниц                          = Параметры.СписокСтруктурныхЕдиниц;
	
	ИмяРаздела = "Форма1ТСтраница1";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
		ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	СформироватьОтчетныйПериод();
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мКвартал");
	СтруктураРеквизитовФормы.Вставить("мГод");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");                   
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мМетодРасчета");
	СтруктураРеквизитовФормы.Вставить("мИдГруппы21");
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница1";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница2";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница3";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
		
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница4";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница5";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 5";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница6";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 6";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница7";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 7";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница8";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 8";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница9";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 9";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница10";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 10";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница11";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 11";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница12";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 12";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;
    
    СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
    СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница13";
    СтрокаУровня1.Представление            = "Форма № 1-Т Страница 13";
    СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
    СтрокаУровня1.ВыводНаПечать            = 1;
    СтрокаУровня1.ПоказатьСтраницу         = 1;
    СтрокаУровня1.ВыгрузитьСтраницу        = 1;
    
    СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
    СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница14";
    СтрокаУровня1.Представление            = "Форма № 1-Т Страница 14";
    СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
    СтрокаУровня1.ВыводНаПечать            = 1;
    СтрокаУровня1.ПоказатьСтраницу         = 1;
    СтрокаУровня1.ВыгрузитьСтраницу        = 1;
    
    СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
    СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница15";
	СтрокаУровня1.Представление            = "Форма № 1-Т Страница 15";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 1;

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетныйПериод()
	
	СтрПериодОтчета = ПредставлениеПериода(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета,СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, "ФП = истина");
	
	СтруктураРеквизитовФормы.мКвартал = Лев(СтрПериодОтчета,1);
	СтруктураРеквизитовФормы.мГод = Лев(Прав(СтрПериодОтчета,7),4);
	
КонецПроцедуры

&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
		
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппы21;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 1;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница5";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница6";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница7";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница8";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница9";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница10";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница11";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница12";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница13";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
    
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница14";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
    
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Форма1ТСтраница15";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз                         = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
    
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			Если ЭтоРазделРодитель(ЭлементДереваСтраницОтчета.ИмяСтраницы) Тогда
				
				ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
				ЭлементРазделовОтчета.КолонкаРазделыОтчета = Лев(ЭлементДереваСтраницОтчета.Представление,12);
				ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
				ЭлементРазделовОтчета.РазделМногострочный = Ложь;
				
				Для НомерПодраздела = 1 По ПолучитьКоличествоПодразделовПоРодителю(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим) Цикл
					
					СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
					
					СтраницаРазделаОтчета.КолонкаРазделыОтчета              = Лев(ЭлементДереваСтраницОтчета.Представление,СтрДлина(ЭлементДереваСтраницОтчета.Представление)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = Лев(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, СтрДлина(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим)-1) + НомерПодраздела;
					СтраницаРазделаОтчета.РазделМногострочный             = ЭлементРазделовОтчета.РазделМногострочный;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПодразделовПоРодителю(Родитель)
	
	Если Родитель = "Форма1ТСтраница1" Тогда
		Возврат 15;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	ФормироватьСтруктуруСтраницОтчета();
	ФормироватьСтруктуруСвойствСтраниц();
	СформироватьДеревоРазделовОтчетаНаСервере();
	ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета();
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		ЗаполнитьПустыеСтруктурыДанных();
		НачальныеОперацииСМногострочнымиБлоками();
		
		ЗаполнитьСведенияОбОрганизацииНаСервере();
		СтруктураРеквизитовФормы.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		РасчетНаСервере("Форма1ТСтраница1");
	Иначе
		ВосстановитьСохраненныеДанные();
		ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма1ТСтраница1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизацииНаСервере()
	
	ЗаполнитьСведенияОбОрганизации(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	СтрокаСведений = "ИННЮЛ, НаимЮЛПол, ФИОРук, ФИОБух, АдрФактСтат, ОснВидДеят, ПолныйАдрЮР, ТелОрганизации, АдресЭлектроннойПочтыОрганизации, ОКВЭД, ОКАТО";
	СведенияОбОрганизации = РегламентированнаяОтчетностьРК.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация,,СтрокаСведений);
	
	Если ТабличныйДокумент.Области.Найти("Год1") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Год1"].Значение) Тогда
		Год = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=гггг");
		ТабличныйДокумент.Области["Год1"].Значение = Сред(Год, 1, 1);
		ТабличныйДокумент.Области["Год2"].Значение = Сред(Год, 2, 1);
		ТабличныйДокумент.Области["Год3"].Значение = Сред(Год, 3, 1);
		ТабличныйДокумент.Области["Год4"].Значение = Сред(Год, 4, 1);
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("Квартал1") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Квартал1"].Значение) Тогда
		Квартал = Формат(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, "ДФ=к");
		ТабличныйДокумент.Области["Квартал1"].Значение = "0";
		ТабличныйДокумент.Области["Квартал2"].Значение = Квартал;
	КонецЕсли;
	
    Если СведенияОбОрганизации.Свойство("ИННЮЛ")
        И ТабличныйДокумент.Области.Найти("БИН1") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["БИН1"].Значение) Тогда
		ДлинаИИН = СтрДлина(СведенияОбОрганизации.ИННЮЛ);
		Если ДлинаИИН <= 12 Тогда
			Для Шаг = 1 По ДлинаИИН Цикл
				ТабличныйДокумент.Области["БИН" + Шаг].Значение = СРЕД(СведенияОбОрганизации.ИННЮЛ, Шаг, 1);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
    Если СведенияОбОрганизации.Свойство("ОКАТО")
        И ТабличныйДокумент.Области.Найти("КодКАТО1") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодКАТО1"].Значение) Тогда
		КодКАТО = Лев(СведенияОбОрганизации.ОКАТО,10); // длина кода всего 9 символов, добавим 10-й
		ДлинаКАТО = СтрДлина(КодКАТО); 
		Если ДлинаКАТО <= 10 Тогда
			Для Шаг = 1 По ДлинаКАТО Цикл
				ТабличныйДокумент.Области["КодКАТО" + Шаг].Значение = СРЕД(КодКАТО, Шаг, 1);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
    Если СведенияОбОрганизации.Свойство("ОКВЭД")
        И ТабличныйДокумент.Области.Найти("КодПоОКЭД1") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["КодПоОКЭД1"].Значение) Тогда
		ДлинаКодПоОКЭД = СтрДлина(СведенияОбОрганизации.ОКВЭД);
		Если ДлинаКодПоОКЭД <= 5 Тогда
			Для Шаг = 1 По ДлинаКодПоОКЭД Цикл
				ТабличныйДокумент.Области["КодПоОКЭД" + Шаг].Значение = СРЕД(СведенияОбОрганизации.ОКВЭД, Шаг, 1);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
    Если СведенияОбОрганизации.Свойство("НаимЮЛПол")
        И ТабличныйДокумент.Области.Найти("НаимЮЛПол") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["НаимЮЛПол"].Значение) Тогда
		ТабличныйДокумент.Области["НаимЮЛПол"].Значение =  СведенияОбОрганизации.НаимЮЛПол;
	КонецЕсли;
	
    Если СведенияОбОрганизации.Свойство("ФИОРук")
        И ТабличныйДокумент.Области.Найти("ФИОРук") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ФИОРук"].Значение) Тогда
		ТабличныйДокумент.Области["ФИОРук"].Значение =  СведенияОбОрганизации.ФИОРук;
	КонецЕсли;

    Если СведенияОбОрганизации.Свойство("ФИОБух")
        И ТабличныйДокумент.Области.Найти("ФИОБух") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ФИОБух"].Значение) Тогда
		ТабличныйДокумент.Области["ФИОБух"].Значение =  СведенияОбОрганизации.ФИОБух;
	КонецЕсли;
	
    Если ТабличныйДокумент.Области.Найти("Исполнитель") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["Исполнитель"].Значение) Тогда
		ТабличныйДокумент.Области["Исполнитель"].Значение = ?(Пользователи.ТекущийПользователь().ФизическоеЛицо <> Справочники.ФизическиеЛица.ПустаяСсылка(), Пользователи.ТекущийПользователь().ФизическоеЛицо, Пользователи.ТекущийПользователь());
	КонецЕсли;
	
	Если ТабличныйДокумент.Области.Найти("АдрФакт") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["АдрФакт"].Значение) Тогда
		ТабличныйДокумент.Области["АдрФакт"].Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтруктураРеквизитовФормы.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	КонецЕсли;
	
    Если СведенияОбОрганизации.Свойство("ОснВидДеят")
        И ТабличныйДокумент.Области.Найти("НаимОКЭД") <> Неопределено
		И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["НаимОКЭД"].Значение) Тогда
		ТабличныйДокумент.Области["НаимОКЭД"].Значение = СведенияОбОрганизации.ОснВидДеят;
	КонецЕсли;
	
	ЮридическоеФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитовФормы.Организация,"ЮридическоеФизическоеЛицо");
	Если НЕ ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
        Если СведенияОбОрганизации.Свойство("ПолныйАдрЮР")
            И ТабличныйДокумент.Области.Найти("АдрЮР") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["АдрЮР"].Значение) Тогда
			ТабличныйДокумент.Области["АдрЮР"].Значение = СведенияОбОрганизации.ПолныйАдрЮР;
		КонецЕсли;
		
        Если СведенияОбОрганизации.Свойство("ТелОрганизации")
            И ТабличныйДокумент.Области.Найти("ТелОрганизации") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ТелОрганизации"].Значение) Тогда
			ТабличныйДокумент.Области["ТелОрганизации"].Значение = СведенияОбОрганизации.ТелОрганизации;
		КонецЕсли;
		
        Если СведенияОбОрганизации.Свойство("АдресЭлектроннойПочтыОрганизации")
            И ТабличныйДокумент.Области.Найти("ЭлПочта") <> Неопределено
			И Не ЗначениеЗаполнено(ТабличныйДокумент.Области["ЭлПочта"].Значение) Тогда
			ТабличныйДокумент.Области["ЭлПочта"].Значение = СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	Перем ИсходноеКоличествоСтрокГруппы;

	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

		Если ИсходноеКоличествоСтрокГруппы > СтруктураГруппы.Количество() Тогда 
			Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
				СтруктураГруппы.Добавить();
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета = 1)
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета) ;
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела,НомерСтраницыРазделаОтчета)
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(
	ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела));

	//многострочные разделы
	Если ИмяТекРаздела = "Форма1ТСтраница3" Тогда
			
		СтруктураДанныхРаздела = ЭтаФорма["СтруктураДанных" + ИмяТекРаздела];
		
		Для Каждого ЭлСтруктуры Из СтруктураДанныхРаздела Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ТекТабличноеПоле = ЭтаФорма.ТабличныйДокумент;
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
		
		СтруктураГруппы = Неопределено;
		
		мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
		
		СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
		
		ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
		
		ЕстьДопСтроки = Ложь;
		
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				ЕстьДопСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьДопСтроки Тогда
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Истина;
					ОбластьТД.Текст = "х";
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
				Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
					ОбластьТД.Гиперссылка = Ложь;
					ОбластьТД.Текст = "";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
	ИначеЕсли ЭтаФорма["СтруктураДанных" + ИмяТекРаздела]<> Неопределено Тогда
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Попытка
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
		
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОчиститьТекущуюСтраницу.Видимость = НЕ Элемент.ТекущиеДанные.РазделМногострочный;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ИзменятьАктивнуюСтраницу = Истина)
	// Многострочные разделы.
	Если НаимРаздела = "Форма1ТСтраница3" Тогда
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
		ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(НаимРаздела);
		
		ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы);
		
	Иначе	
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");	
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ИмяТабличногоПоля)

	ТабличноеПоле = Форма[ИмяТабличногоПоля];
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Инд = 0 По ТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ТабличноеПоле.Области[Инд];

		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;

		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;

		ИмяПоказателя      = ТекущаяОбласть.Имя;
		ЗначениеПоказателя = ТекущаяОбласть.Значение;

		СтруктураДанныхПоля.Вставить(ИмяПоказателя, ЗначениеПоказателя);

	КонецЦикла;

	Возврат СтруктураДанныхПоля;

КонецФункции

&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиОтчета;
	Перем СписокСтруктурныхЕдиниц;
	Перем СписокРегистраций;
		
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// восстановим сохраненные данные редактируемых ячеек
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Свойство("СписокСтруктурныхЕдиниц", СписокСтруктурныхЕдиниц);
	СписокСохранения.Свойство("СписокРегистраций", СписокРегистраций);
	
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	

	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
	КонецЦикла;
	
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения;
	
	мСписокСтруктурныхЕдиниц = СписокСтруктурныхЕдиниц;
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоРазделРодитель(ИмяРаздела)
	
	Результат = (ИмяРаздела = "Форма1ТСтраница1");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруЗависимыхЯчеекДляАвторасчета()
	
	СтруктураЗависимыхЯчеекДляАвторасчета = Новый Структура;
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001001001", "П000001002001;П000001003001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001001003", "П000001002003;П000001003002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001001007", "П000001001003;П000001001005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001001008", "П000001001004;П000001001006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001002007", "П000001002003;П000001002005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001002008", "П000001002004;П000001002006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001003001", "П000001004003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000001003002", "П000001004004");

	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001001", "П000002002001;П000002003001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001002", "П000002002002;П000002003002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001003", "П000002002003;П000002003003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001004", "П000002002004;П000002003004");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001005", "П000002002005;П000002003005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001006", "П000002002006;П000002003006");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001007", "П000002002003;П000002002005;П000002003003;П000002003005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002001008", "П000002002004;П000002002006;П000002003004;П000002003006");	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002002007", "П000002002003;П000002002005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002002008", "П000002002004;П000002002006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002003007", "П000002003003;П000002003005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000002003008", "П000002003004;П000002003006");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001001", "П000003002001;П000003003001;П000003004001;П000003005001;П000003006001;П000003007001;П000003008001;П000003009001;П000003010001;П000003011001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001002", "П000003002002;П000003003002;П000003004002;П000003005002;П000003006002;П000003007002;П000003008002;П000003009002;П000003010002;П000003011002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001003", "П000003002003;П000003003003;П000003004003;П000003005003;П000003006003;П000003007003;П000003008003;П000003009003;П000003010003;П000003011003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001004", "П000003002004;П000003003004;П000003004004;П000003005004;П000003006004;П000003007004;П000003008004;П000003009004;П000003010004;П000003011004");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001005", "П000003002005;П000003003005;П000003004005;П000003005005;П000003006005;П000003007005;П000003008005;П000003009005;П000003010005;П000003011005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001006", "П000003002006;П000003003006;П000003004006;П000003005006;П000003006006;П000003007006;П000003008006;П000003009006;П000003010006;П000003011006");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001007", "П000003002003;П000003002005;П000003003003;П000003003005;П000003004003;П000003004005;П000003005003;П000003005005;П000003006003;П000003006005;П000003007003;П000003007005;П000003008003;П000003008005;П000003009003;П000003009005;П000003010003;П000003010005;П000003011003;П000003011005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003002007", "П000003002003;П000003002005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003003007", "П000003003003;П000003003005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003004007", "П000003004003;П000003004005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003005007", "П000003005003;П000003005005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003006007", "П000003006003;П000003006005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003007007", "П000003007003;П000003007005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003008007", "П000003008004;П000003008005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003009007", "П000003009003;П000003009005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003010007", "П000003010003;П000003010005");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003011007", "П000003011004;П000003011005");

	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003001008", "П000003001004;П000003001006;П000003003004;П000003003006;П000003004004;П000003004006;П000003005004;П000003005006;П000003006004;П000003006006;П000003007004;П000003007006;П000003008004;П000003008006;П000003009004;П000003009006;П000003010004;П000003010006;П000003011004;П000003011006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003002008", "П000003002004;П000003002006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003003008", "П000003003004;П000003003006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003004008", "П000003004004;П000003004006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003005008", "П000003005004;П000003005006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003006008", "П000003006004;П000003006006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003007008", "П000003007004;П000003007006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003008008", "П000003008004;П000003008006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003009008", "П000003009004;П000003009006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003010008", "П000003010004;П000003010006");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000003011008", "П000003008004;П000003011006");

	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000005003001", "П000005004001;П000005005001;П000005006001;П000005007001;П000005008001;П000005009001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000005003002", "П000005004002;П000005005002;П000005006002;П000005007002;П000005008002;П000005009002");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000005010001", "П000001002001;П000001003001;П000005001001;П000005004001;П000005005001;П000005006001;П000005007001;П000005008001;П000005009001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000005010002", "П000001001002;П000005001002;П000005004002;П000005005002;П000005006002;П000005007002;П000005008002;П000005009002");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000006001001", "П000006002001;П000006003001;П000006004001"); 
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000006001002", "П000006002002;П000006003002;П000006004002"); 
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000006001003", "П000006002003;П000006003003;П000006004003"); 
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000006001004", "П000006002004;П000006003004;П000006004004"); 
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007002001", "П000007003001;П000007005001;П000007006001"); 
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007002005", "П000007003002;П000007005002;П000007006002");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007007001", "П000007008001;П000007009001;П000007010001;П000007011001;П000007012001;П000007013001;П000007014001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007007002", "П000007008002;П000007009002;П000007010002;П000007011002;П000007012002;П000007013002;П000007014002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007007003", "П000007008003;П000007009003;П000007010003;П000007011003;П000007012003;П000007013003;П000007014003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007007004", "П000007008004;П000007009004;П000007010004;П000007011004;П000007012004;П000007013004;П000007014004");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007007005", "П000007008005;П000007009005;П000007010005;П000007011005;П000007012005;П000007013005;П000007014005");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007015001", "П000007001001;П000007003001;П000007005001;П000007006001;П000007008001;П000007009001;П000007010001;П000007011001;П000007012001;П000007013001;П000007014001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007015002", "П000007001002;П000007002002;П000007008002;П000007009002;П000007010002;П000007011002;П000007012002;П000007013002;П000007014002");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007015003", "П000007001003;П000007002003;П000007008003;П000007009003;П000007010003;П000007011003;П000007012003;П000007013003;П000007014003");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007015004", "П000007001004;П000007002004;П000007008004;П000007009004;П000007010004;П000007011004;П000007012004;П000007013004;П000007014004");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000007015005", "П000007001005;П000007003002;П000007005002;П000007006002;П000007008005;П000007009005;П000007010005;П000007011005;П000007012005;П000007013005;П000007014005");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000008001001", "П000008002001;П000008003001;П000008004001;П000008005001");
	
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000009001001", "П000009003001;П000009004001;П000009005001;П000009006001;П000009011001;П000009012001;П000009013001;П000009015001;П000009016001;П000009017001;П000009018001;П000009019001;П000009021001;П000009017001;П000009022001;П000009023001;П000009024001;П000009026001;П000009027001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000009002001", "П000009003001;П000009004001;П000009005001;П000009006001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000009009001",	"П000009010001;П000009011001;П000009012001;П000009013001;П000009014001;П000009015001;П000009016001;П000009017001;П000009018001;П000009019001;П000009021001;П000009022001;П000009023001;П000009024001;П000009026001;П000009027001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000009010001",	"П000009011001;П000009012001;П000009013001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000009014001",	"П000009015001;П000009016001;П000009017001;П000009018001;П000009019001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000009020001", "П000009021001;П000009022001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000009025001", "П000009026001;П000009027001"); 
    
   	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010101001", "П000010102001;П000010103001;П000010104001;П000010105001;П000010106001;П000010107001;П000010108001;П000010109001;П000010110001;П000010111001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010201001", "П000010202001;П000010203001;П000010204001;П000010205001;П000010206001;П000010207001;П000010208001;П000010209001;П000010210001;П000010211001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010301001", "П000010302001;П000010303001;П000010304001;П000010305001;П000010306001;П000010307001;П000010308001;П000010309001;П000010310001;П000010311001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010401001", "П000010402001;П000010403001;П000010404001;П000010405001;П000010406001;П000010407001;П000010408001;П000010409001;П000010410001;П000010411001");
	СтруктураЗависимыхЯчеекДляАвторасчета.Вставить("П000010201002", "П000010202002;П000010203002;П000010204002;П000010205002;П000010206002;П000010207002;П000010208002;П000010209002;П000010210002;П000010211002");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	П0000010040.Очистить();
	П0000010040.Добавить();
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(Отчеты[ИмяОтчета(ЭтаФорма.ИмяФормы)].ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
		
		СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяСтраницыПанели = "", ОбластьИмя = "")
	
	Перем ТаблицаСтраницРаздела;
	
	Если Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////
	Если ИмяСтраницыПанели = "Форма1ТСтраница2" Тогда
		
		Если "П000001001002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница6", ОбластьИмя);
		КонецЕсли;
		
		//Раздел 1 строка 1 графа 1 
		Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001001001, ОбластьИмя) > 0 Тогда
			
			ОкрП000001002001 = 0;
			ОкрП000001003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П000001002001") Тогда
				ОкрП000001002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П000001003001") Тогда
				ОкрП000001003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001003001);
			КонецЕсли;
			
			П000001001001 = ОкрП000001002001 + ОкрП000001003001;
			
			Форма.СтруктураДанныхФорма1ТСтраница2.Вставить("П000001001001", П000001001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Форма.ТабличныйДокумент.Области.П000001001001.Значение = П000001001001;
			КонецЕсли;
			
		КонецЕсли;
		
		//Раздел 1 строка 1 графа 3 
		Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001001003, ОбластьИмя) > 0 Тогда
			
			ОкрП000001002003 = 0;
			ОкрП000001003002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002003.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001002003") Тогда
				ОкрП000001002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001002003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001003002") Тогда
				ОкрП000001003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001003002);
			КонецЕсли;
			
			П000001001003 = ОкрП000001002003 + ОкрП000001003002;
			
			Форма.СтруктураДанныхФорма1ТСтраница2.Вставить("П000001001003", П000001001003);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Форма.ТабличныйДокумент.Области.П000001001003.Значение = П000001001003;
			КонецЕсли;
			
		КонецЕсли;
			
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001001007, ОбластьИмя) > 0 Тогда
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001001003.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001001003") Тогда
				Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001001003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001001005.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001001005") Тогда
				Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001001005);
			КонецЕсли;
			
			Графа7 = ?(Графа3 <> 0, (Графа5*1000)/Графа3/12, 0);
			ОкрГрафа7 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа7);
			
			Форма.СтруктураДанныхФорма1ТСтраница2.Вставить("П000001001007", ОкрГрафа7);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Форма.ТабличныйДокумент.Области.П000001001007.Значение = ОкрГрафа7;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001001008, ОбластьИмя) > 0 Тогда
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001001004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001001004") Тогда
				Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001001004);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001001006.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001001006") Тогда
				Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001001006);
			КонецЕсли;
			
			Графа8 = ?(Графа4 <> 0, (Графа6*1000)/Графа4/12, 0);
			ОкрГрафа8 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа8);
			
			Форма.СтруктураДанныхФорма1ТСтраница2.Вставить("П000001001008", ОкрГрафа8);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Форма.ТабличныйДокумент.Области.П000001001008.Значение = ОкрГрафа8;
			КонецЕсли;	
		КонецЕсли;	
		
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница3" Тогда
		
		Если "П000001002001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница2", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница6", ОбластьИмя);
		ИначеЕсли "П000001003001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница2", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница6", ОбластьИмя);
		ИначеЕсли "П000001002003" = ОбластьИмя Тогда		
			Расчет(Форма, "Форма1ТСтраница2", ОбластьИмя);
		ИначеЕсли "П000001003002" = ОбластьИмя Тогда	
			Расчет(Форма, "Форма1ТСтраница2", ОбластьИмя);	
		КонецЕсли;
		
		//Раздел 1		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001002007, ОбластьИмя) > 0 Тогда
			
			Графа3 = 0;
			Графа5 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002003.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001002003") Тогда
				Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4.П000001002003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002005.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001002005") Тогда
				Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001002005);
			КонецЕсли;
			
			Графа7 = ?(Графа3 <> 0, (Графа5*1000)/Графа3/12, 0);
			ОкрГрафа7 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа7);
			
			Форма.СтруктураДанныхФорма1ТСтраница3.Вставить("П000001002007", ОкрГрафа7);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Форма.ТабличныйДокумент.Области.П000001002007.Значение = ОкрГрафа7;
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001002008, ОбластьИмя) > 0 Тогда
			
			Графа4 = 0;
			Графа6 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002004.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001002004") Тогда
				Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4.П000001002004);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002006.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001002006") Тогда
				Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001002006);
			КонецЕсли;
			
			Графа8 = ?(Графа4 <> 0, (Графа6*1000)/Графа4/12, 0);
			ОкрГрафа8 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа8);
			
			Форма.СтруктураДанныхФорма1ТСтраница3.Вставить("П000001002008", ОкрГрафа8);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Форма.ТабличныйДокумент.Области.П000001002008.Значение = ОкрГрафа8;
			КонецЕсли;	
		КонецЕсли;
		
		//графа 1 строка 1.2
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001003001, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000001003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]].Количество() Цикл
					СуммаП000001003001 = СуммаП000001003001 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000001004003_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000001003001.Значение = СуммаП000001003001;
			Иначе
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]].Количество() Цикл
					СуммаП000001003001 = СуммаП000001003001 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]][Ном - 1].П000001004003);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000001003001.Значение = СуммаП000001003001;
			КонецЕсли;
			
			//Раздел 1 строка 1 графа 1 
			
			ОкрП000001002001 = 0;
			ОкрП000001003001 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П000001002001") Тогда
				ОкрП000001002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001003001") Тогда
				ОкрП000001003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001003001);
			КонецЕсли;
			
			П000001001001 = ОкрП000001002001 + ОкрП000001003001;
			
			Форма.СтруктураДанныхФорма1ТСтраница2.Вставить("П000001001001", П000001001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Форма.ТабличныйДокумент.Области.П000001001001.Значение = П000001001001;
			КонецЕсли;
			
		КонецЕсли;
		
		//графа 3 строка 1.2
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000001003002, Лев(ОбластьИмя,13)) > 0 Тогда
			
			СуммаП000001003002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]].Количество() Цикл
					СуммаП000001003002 = СуммаП000001003002 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000001004004_" + Ном].Значение);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000001003002.Значение = СуммаП000001003002;
			Иначе
				Для Ном = 1 По Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]].Количество() Цикл
					СуммаП000001003002 = СуммаП000001003002 + РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма[Форма.мСтруктураМногострочныхРазделов[Форма.СтруктураРеквизитовФормы.мИдГруппы21]][Ном - 1].П000001004004);
				КонецЦикла;
				
				Форма.ТабличныйДокумент.Области.П000001003002.Значение = СуммаП000001003002;
			КонецЕсли;
			
			//Раздел 1 строка 1 графа 3 
			
			ОкрП000001002003 = 0;
			ОкрП000001003002 = 0;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001002003.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001002003") Тогда
				ОкрП000001002003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001002003);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
				ОкрП000001003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001003002") Тогда
				ОкрП000001003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001003002);
			КонецЕсли;
			
			П000001001003 = ОкрП000001002003 + ОкрП000001003002;
			
			Форма.СтруктураДанныхФорма1ТСтраница2.Вставить("П000001001003", П000001001003);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				Форма.ТабличныйДокумент.Области.П000001001003.Значение = П000001001003;
			КонецЕсли;
			
		КонецЕсли;
		
		//Раздел 2.1
		Для Графа = 1 по 6 Цикл 
			Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00000200100" + Графа], ОбластьИмя) > 0 Тогда
				
				ОкрП000002002 = 0;
				ОкрП000002003 = 0;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					ОкрП000002002 = Форма.ТабличныйДокумент.Области["П00000200200" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П00000200200" + Графа) Тогда
					ОкрП000002002 = Форма.СтруктураДанныхФорма1ТСтраница2["П00000200200" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					ОкрП000002003 = Форма.ТабличныйДокумент.Области["П00000200300" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П00000200300" + Графа) Тогда
					ОкрП000002003 = Форма.СтруктураДанныхФорма1ТСтраница2["П00000200300" + Графа];
				КонецЕсли;
				
				СуммаПоГрафе = ОкрП000002002 + ОкрП000002003;
				
				Форма.СтруктураДанныхФорма1ТСтраница3.Вставить("П00000200100" + Графа, СуммаПоГрафе);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					Форма.ТабличныйДокумент.Области["П00000200100" + Графа].Значение = СуммаПоГрафе;
				КонецЕсли;	
				
			КонецЕсли;
		КонецЦикла; 
		
		Для НомерСтроки = 1 По 3 Цикл	
			Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007"], ОбластьИмя) > 0 Тогда
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003") Тогда
					Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница3["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003"]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005") Тогда
					Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница3["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005"]);
				КонецЕсли;
				
				Графа7 = ?(Графа3 <> 0, (Графа5*1000)/Графа3/12, 0);
				ОкрГрафа7 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа7);
				
				Форма.СтруктураДанныхФорма1ТСтраница3.Вставить("П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007", ОкрГрафа7);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					Форма.ТабличныйДокумент.Области["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007"].Значение = ОкрГрафа7;
				КонецЕсли;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008"], ОбластьИмя) > 0 Тогда
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004") Тогда
					Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница3["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004"]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница3.Свойство("П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006") Тогда
					Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница3["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006"]);
				КонецЕсли;
				
				Графа8 = ?(Графа4 <> 0, (Графа6*1000)/Графа4/12, 0);
				ОкрГрафа8 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа8);
				
				Форма.СтруктураДанныхФорма1ТСтраница3.Вставить("П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008", ОкрГрафа8);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница3" Тогда
					Форма.ТабличныйДокумент.Области["П000002" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008"].Значение = ОкрГрафа8;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница4" Тогда
		
		//Раздел 3 
		ОкрП000003002 = 0;
		ОкрП000003003 = 0;
		ОкрП000003004 = 0;
		ОкрП000003005 = 0;
		ОкрП000003006 = 0;
		ОкрП000003007 = 0;
		ОкрП000003008 = 0;
		ОкрП000003009 = 0;
		ОкрП000003010 = 0;
		ОкрП000003011 = 0;
		
		Для Графа = 1 по 4 Цикл 		
			Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00000300100" + Графа], ОбластьИмя) > 0 Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300200" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300200" + Графа) Тогда
					ОкрП000003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П00000300200" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300300" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300300" + Графа) Тогда
					ОкрП000003003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П00000300300" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300400" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300400" + Графа) Тогда
					ОкрП000003004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П00000300400" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300500" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300500" + Графа) Тогда
					ОкрП000003005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П00000300500" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003006 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300600" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300600" + Графа) Тогда
					ОкрП000003006 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П00000300600" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003007 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300700" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300700" + Графа) Тогда
					ОкрП000003007 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П00000300700" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003008 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300800" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000300800" + Графа) Тогда
					ОкрП000003008 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П00000300800" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003009 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000300900" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000300900" + Графа) Тогда
					ОкрП000003009 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П00000300900" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003010 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000301000" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000301000" + Графа) Тогда
					ОкрП000003010 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П00000301000" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003011 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000301100" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000301100" + Графа) Тогда
					ОкрП000003011 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П00000301100" + Графа]);
				КонецЕсли;
				
				СуммаПоГрафе = ОкрП000003002 + ОкрП000003003 + ОкрП000003004 + ОкрП000003005 + ОкрП000003006 + ОкрП000003007 + ОкрП000003008 + ОкрП000003009 + ОкрП000003010 + ОкрП000003011;
				
				Форма.СтруктураДанныхФорма1ТСтраница4.Вставить("П00000300100" + Графа, СуммаПоГрафе);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Форма.ТабличныйДокумент.Области["П00000300100" + Графа].Значение = СуммаПоГрафе;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		Для Графа = 5 по 6 Цикл 		
			Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00000300100" + Графа], ОбластьИмя) > 0 Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003002 = Форма.ТабличныйДокумент.Области["П00000300200" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300200" + Графа) Тогда
					ОкрП000003002 = Форма.СтруктураДанныхФорма1ТСтраница4["П00000300200" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003003 = Форма.ТабличныйДокумент.Области["П00000300300" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300300" + Графа) Тогда
					ОкрП000003003 = Форма.СтруктураДанныхФорма1ТСтраница4["П00000300300" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003004 = Форма.ТабличныйДокумент.Области["П00000300400" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300400" + Графа) Тогда
					ОкрП000003004 = Форма.СтруктураДанныхФорма1ТСтраница4["П00000300400" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003005 = Форма.ТабличныйДокумент.Области["П00000300500" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300500" + Графа) Тогда
					ОкрП000003005 = Форма.СтруктураДанныхФорма1ТСтраница4["П00000300500" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					ОкрП000003006 = Форма.ТабличныйДокумент.Области["П00000300600" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300600" + Графа) Тогда
					ОкрП000003006 = Форма.СтруктураДанныхФорма1ТСтраница4["П00000300600" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003007 = Форма.ТабличныйДокумент.Области["П00000300700" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П00000300700" + Графа) Тогда
					ОкрП000003007 = Форма.СтруктураДанныхФорма1ТСтраница4["П00000300700" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003008 = Форма.ТабличныйДокумент.Области["П00000300800" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000300800" + Графа) Тогда
					ОкрП000003008 = Форма.СтруктураДанныхФорма1ТСтраница5["П00000300800" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003009 = Форма.ТабличныйДокумент.Области["П00000300900" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000300900" + Графа) Тогда
					ОкрП000003009 = Форма.СтруктураДанныхФорма1ТСтраница5["П00000300900" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003010 = Форма.ТабличныйДокумент.Области["П00000301000" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000301000" + Графа) Тогда
					ОкрП000003010 = Форма.СтруктураДанныхФорма1ТСтраница5["П00000301000" + Графа];
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					ОкрП000003011 = Форма.ТабличныйДокумент.Области["П00000301100" + Графа].Значение;
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П00000301100" + Графа) Тогда
					ОкрП000003011 = Форма.СтруктураДанныхФорма1ТСтраница5["П00000301100" + Графа];
				КонецЕсли;
				
				СуммаПоГрафе = ОкрП000003002 + ОкрП000003003 + ОкрП000003004 + ОкрП000003005 + ОкрП000003006 + ОкрП000003007 + ОкрП000003008 + ОкрП000003009 + ОкрП000003010 + ОкрП000003011;
				
				Форма.СтруктураДанныхФорма1ТСтраница4.Вставить("П00000300100" + Графа, СуммаПоГрафе);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Форма.ТабличныйДокумент.Области["П00000300100" + Графа].Значение = СуммаПоГрафе;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
	
		Для НомерСтроки = 1 По 7 Цикл	
			Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007"], ОбластьИмя) > 0 Тогда
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003") Тогда
					Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003"]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005") Тогда
					Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005"]);
				КонецЕсли;
				
				Графа7 = ?(Графа3 <> 0, (Графа5*1000)/Графа3/12, 0);
				ОкрГрафа7 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа7);
				
				Форма.СтруктураДанныхФорма1ТСтраница4.Вставить("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007", ОкрГрафа7);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007"].Значение = ОкрГрафа7;
				КонецЕсли;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008"], ОбластьИмя) > 0 Тогда
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004") Тогда
					Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004"]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница4.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006") Тогда
					Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница4["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006"]);
				КонецЕсли;
				
				Графа8 = ?(Графа4 <> 0, (Графа6*1000)/Графа4/12, 0);
				ОкрГрафа8 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа8);
				
				Форма.СтруктураДанныхФорма1ТСтраница4.Вставить("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008", ОкрГрафа8);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница4" Тогда
					Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008"].Значение = ОкрГрафа8;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница5" Тогда
		Для Графа = 1 По 6 Цикл
			Если "П00000300700" + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница4", ОбластьИмя);
			ИначеЕсли "П00000300800" + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница4", ОбластьИмя);
			ИначеЕсли "П00000300900" + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница4", ОбластьИмя);
			ИначеЕсли "П00000301000" + Графа = ОбластьИмя Тогда		
				Расчет(Форма, "Форма1ТСтраница4", ОбластьИмя);
			ИначеЕсли "П00000301100" + Графа = ОбластьИмя Тогда		
				Расчет(Форма, "Форма1ТСтраница4", ОбластьИмя);
			КонецЕсли;
		КонецЦикла;  
		
		Для НомерСтроки = 7 По 11 Цикл	
			Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007"], ОбластьИмя) > 0 Тогда
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003") Тогда
					Графа3 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "003"]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005") Тогда
					Графа5 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "005"]);
				КонецЕсли;
				
				Графа7 = ?(Графа3 <> 0, (Графа5*1000)/Графа3/12, 0);
				ОкрГрафа7 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа7);
				
				Форма.СтруктураДанныхФорма1ТСтраница5.Вставить("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007", ОкрГрафа7);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "007"].Значение = ОкрГрафа7;
				КонецЕсли;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008"], ОбластьИмя) > 0 Тогда
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004") Тогда
					Графа4 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "004"]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006"].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница5.Свойство("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006") Тогда
					Графа6 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница5["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "006"]);
				КонецЕсли;
				
				Графа8 = ?(Графа4 <> 0, (Графа6*1000)/Графа4/12, 0);
				ОкрГрафа8 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Графа8);
				
				Форма.СтруктураДанныхФорма1ТСтраница4.Вставить("П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008", ОкрГрафа8);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница5" Тогда
					Форма.ТабличныйДокумент.Области["П000003" + Формат(НомерСтроки,"ЧЦ=3; ЧВН=") + "008"].Значение = ОкрГрафа8;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница6" Тогда
		//Раздел 5 
		ОкрП000005004 = 0;
		ОкрП000005005 = 0;
		ОкрП000005006 = 0;
		ОкрП000005007 = 0;
		ОкрП000005008 = 0;
		ОкрП000005009 = 0;
		
		Для Графа = 1 по 2 Цикл 
			
			Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00000500300" + Графа], ОбластьИмя) > 0 Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
					ОкрП000005004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000500400" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П00000500400" + Графа) Тогда
					ОкрП000005004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6["П00000500400" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
					ОкрП000005005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000500500" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П00000500500" + Графа) Тогда
					ОкрП000005005 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6["П00000500500" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
					ОкрП000005006 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000500600" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П00000500600" + Графа) Тогда
					ОкрП000005006 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6["П00000500600" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
					ОкрП000005007 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000500700" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П00000500700" + Графа) Тогда
					ОкрП000005007 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6["П00000500700" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
					ОкрП000005008 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000500800" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П00000500800" + Графа) Тогда
					ОкрП000005008 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6["П00000500800" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
					ОкрП000005009 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000500900" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П00000500900" + Графа) Тогда
					ОкрП000005009 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6["П00000500900" + Графа]);
				КонецЕсли;
				
				СуммаПоГрафе = ОкрП000005004 + ОкрП000005005 + ОкрП000005006 + ОкрП000005007 + ОкрП000005008 + ОкрП000005009;
				
				Форма.СтруктураДанныхФорма1ТСтраница6.Вставить("П00000500300" + Графа, СуммаПоГрафе);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
					Форма.ТабличныйДокумент.Области["П00000500300" + Графа].Значение = СуммаПоГрафе;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		//число праздничных и выходных человеко-дней 															 	
		ОкрП000001001001 = 0;
		ОкрП000005001001 = 0;
		ОкрП000005003001 = 0;
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000005010001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				ОкрП000001001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001001001") Тогда
				ОкрП000001001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
				ОкрП000005001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000005001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П000005001001") Тогда
				ОкрП000005001001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6.П000005001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
				ОкрП000005003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000005003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П000005003001") Тогда
				ОкрП000005003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6.П000005003001);
			КонецЕсли;
					
			П000005010001 = ОкрП000001001001 * ДеньГода(КонецГода(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета)) - ОкрП000005001001 - ОкрП000005003001;
			
			Форма.СтруктураДанныхФорма1ТСтраница6.Вставить("П000005010001", П000005010001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
				Форма.ТабличныйДокумент.Области.П000005010001.Значение = П000005010001;
			КонецЕсли;
		КонецЕсли;
		
		ОкрП000001001002 = 0;
		ОкрП000005001002 = 0;
		ОкрП000005003002 = 0;
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000005010002, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница2" Тогда
				ОкрП000001001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000001001001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница2.Свойство("П000001001002") Тогда
				ОкрП000001001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница2.П000001001001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
				ОкрП000005001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000005001002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П000005001002") Тогда
				ОкрП000005001002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6.П000005001002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
				ОкрП000005003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000005003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница6.Свойство("П000005003002") Тогда
				ОкрП000005003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница6.П000005003002);
			КонецЕсли;
			
			П000005010002 = ОкрП000001001002 * ДеньГода(КонецГода(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета)) - ОкрП000005001002 - ОкрП000005003002;
			
			Форма.СтруктураДанныхФорма1ТСтраница6.Вставить("П000005010002", П000005010002);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница6" Тогда
				Форма.ТабличныйДокумент.Области.П000005010002.Значение = П000005010002;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница7" Тогда
		
		Если "П000007001001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007001002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007001003" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007001004" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007001005" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007002002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007002003" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		КонецЕсли;
		
		//Раздел 6	
		ОкрП000006002 = 0;
		ОкрП000006003 = 0;
		ОкрП000006004 = 0;
		
		Для Графа = 1 по 4 Цикл 
			
			Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00000600100" + Графа], ОбластьИмя) > 0 Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
					ОкрП000006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000600200" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница7.Свойство("П00000600200" + Графа) Тогда
					ОкрП000006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница7["П00000600200" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
					ОкрП000006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000600300" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница7.Свойство("П00000600300" + Графа) Тогда
					ОкрП000006003 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница7["П00000600300" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
					ОкрП000006004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000600400" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница7.Свойство("П00000600400" + Графа) Тогда
					ОкрП000006004 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница7["П00000600400" + Графа]);
				КонецЕсли;
				
				СуммаПоГрафе = ОкрП000006002 + ОкрП000006003 + ОкрП000006004;
				
				Форма.СтруктураДанныхФорма1ТСтраница7.Вставить("П00000600100" + Графа, СуммаПоГрафе);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
					Форма.ТабличныйДокумент.Области["П00000600100" + Графа].Значение = СуммаПоГрафе;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница8" Тогда		
			
		//Раздел 7  строка 3
		ОкрП000007008 = 0;
		ОкрП000007009 = 0;
		ОкрП000007010 = 0;
		ОкрП000007011 = 0;
		ОкрП000007012 = 0;
		ОкрП000007013 = 0;
		ОкрП000007014 = 0;
		
		Для Графа = 1 по 5 Цикл 
			
			Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00000700700" + Графа], ОбластьИмя) > 0 Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
					ОкрП000007008 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000700800" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П00000700800" + Графа) Тогда
					ОкрП000007008 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8["П00000700800" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
					ОкрП000007009 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000700900" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П00000700900" + Графа) Тогда
					ОкрП000007009 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8["П00000700900" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
					ОкрП000007010 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000701000" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П00000701000" + Графа) Тогда
					ОкрП000007010 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8["П00000701000" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
					ОкрП000007011 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000701100" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П00000701100" + Графа) Тогда
					ОкрП000007011 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8["П00000701100" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
					ОкрП000007012 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000701200" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П00000701200" + Графа) Тогда
					ОкрП000007012 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8["П00000701200" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
					ОкрП000007013 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000701300" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница9.Свойство("П00000701300" + Графа) Тогда
					ОкрП000007013 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница9["П00000701300" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
					ОкрП000007014 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000701400" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница9.Свойство("П00000701400" + Графа) Тогда
					ОкрП000007014 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница9["П00000701400" + Графа]);
				КонецЕсли;
				
				СуммаПоГрафе = ОкрП000007008 + ОкрП000007009 + ОкрП000007010 + ОкрП000007011 + ОкрП000007012 + ОкрП000007013 + ОкрП000007014;
			
				Форма.СтруктураДанныхФорма1ТСтраница8.Вставить("П00000700700" + Графа, СуммаПоГрафе);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
					Форма.ТабличныйДокумент.Области["П00000700700" + Графа].Значение = СуммаПоГрафе;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		//Раздел 7 
		ОкрП000007003001 = 0;
		ОкрП000007005001 = 0;
		ОкрП000007006001 = 0;
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000007002001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
				ОкрП000007003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000007003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П000007003001") Тогда
				ОкрП000007003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8.П000007003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
				ОкрП000007005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000007005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П000007005001") Тогда
				ОкрП000007005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8.П000007005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
				ОкрП000007006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000007006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П000007006001") Тогда
				ОкрП000007006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8.П000007006001);
			КонецЕсли;
			
			П000007002001 = ОкрП000007003001 + ОкрП000007005001 + ОкрП000007006001;
			
			Форма.СтруктураДанныхФорма1ТСтраница7.Вставить("П000007002001", П000007002001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
				Форма.ТабличныйДокумент.Области.П000007002001.Значение = П000007002001;
			КонецЕсли;
		КонецЕсли;
		
		ОкрП000007003002 = 0;
		ОкрП000007005002 = 0;
		ОкрП000007006002 = 0;
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000007002005, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
				ОкрП000007003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000007003002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П000007003002") Тогда
				ОкрП000007003002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8.П000007003002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
				ОкрП000007005002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000007005002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П000007005002") Тогда
				ОкрП000007005002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8.П000007005002);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
				ОкрП000007006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000007006002.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П000007006002") Тогда
				ОкрП000007006002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8.П000007006002);
			КонецЕсли;
			
			П000007002005= ОкрП000007003002 + ОкрП000007005002 + ОкрП000007006002;
			
			Форма.СтруктураДанныхФорма1ТСтраница7.Вставить("П000007002005", П000007002005);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
				Форма.ТабличныйДокумент.Области.П000007002005.Значение = П000007002005;
			КонецЕсли;
		КонецЕсли;

		Если "П000007003001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница7", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007005001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница7", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007006001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница7", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007003002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница7", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007005002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница7", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		ИначеЕсли "П000007006002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница7", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);	
		ИначеЕсли "П000007002004" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
		КонецЕсли;
		
		Для Графа = 1 По 5 Цикл	
			Если "П00000700800" + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
			ИначеЕсли "П00000700900"  + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
			ИначеЕсли "П00000701000"  + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
			ИначеЕсли "П00000701100"  + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
			ИначеЕсли "П00000701200"  + Графа = ОбластьИмя Тогда
				Расчет(Форма, "Форма1ТСтраница9", ОбластьИмя);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница9" Тогда
		
		Если "П000007013001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007013002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007013003" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007013004" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007013005" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007014001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007014002" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007014003" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007014004" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);
		ИначеЕсли "П000007014005" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница8", ОбластьИмя);	
		КонецЕсли;

		//Раздел 7  строка 4
		ОкрП000007001 = 0;
		ОкрП000007002 = 0;
		ОкрП000007007 = 0;
		
		Для Графа = 1 по 5 Цикл 
			
			Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00000701500" + Графа], ОбластьИмя) > 0 Тогда
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
					ОкрП000007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000700100" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница7.Свойство("П00000700100" + Графа) Тогда
					ОкрП000007001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница7["П00000700100" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница7" Тогда
					ОкрП000007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000700200" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П00000700200" + Графа) Тогда
					ОкрП000007002 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница7["П00000700200" + Графа]);
				КонецЕсли;
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница8" Тогда
					ОкрП000007007 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00000700700" + Графа].Значение);
				ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница8.Свойство("П00000700700" + Графа) Тогда
					ОкрП000007007 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница8["П00000700700" + Графа]);
				КонецЕсли;
				
				СуммаПоГрафе = ОкрП000007001 + ОкрП000007002 - ОкрП000007007;
				
				Форма.СтруктураДанныхФорма1ТСтраница9.Вставить("П00000701500" + Графа, СуммаПоГрафе);
				
				Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
					Форма.ТабличныйДокумент.Области["П00000701500" + Графа].Значение = СуммаПоГрафе;
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		ОкрП000008002001 = 0;
		ОкрП000008003001 = 0;
		ОкрП000008004001 = 0;
		ОкрП000008005001 = 0;
		

		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000008001001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
				ОкрП000008002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000008002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница9.Свойство("П000008002001") Тогда
				ОкрП000008002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница9.П000008002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
				ОкрП000008003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000008003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница9.Свойство("П000008003001") Тогда
				ОкрП000008003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница9.П000008003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
				ОкрП000008004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000008004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница9.Свойство("П000008004001") Тогда
				ОкрП000008004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница9.П000008004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
				ОкрП000008005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000008005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница9.Свойство("П000008005001") Тогда
				ОкрП000008005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница9.П000008005001);
			КонецЕсли;

			П000008001001 = ОкрП000008002001 + ОкрП000008003001 + ОкрП000008004001 + ОкрП000008005001;
			
			Форма.СтруктураДанныхФорма1ТСтраница9.Вставить("П000008001001", П000008001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница9" Тогда
				Форма.ТабличныйДокумент.Области.П000008001001.Значение = П000008001001;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница10" Тогда
		//Раздел 9  строка 1.1
		ОкрП000009003001 = 0;
		ОкрП000009004001 = 0;	
		ОкрП000009005001 = 0;		
		ОкрП000009006001 = 0;	
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009002001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009003001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009003001") Тогда
				ОкрП000009003001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009003001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009004001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009004001") Тогда
				ОкрП000009004001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009004001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009005001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009005001") Тогда
				ОкрП000009005001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009005001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009006001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009006001") Тогда
				ОкрП000009006001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009006001);
			КонецЕсли;

			П000009002001 = ОкрП000009003001 + ОкрП000009004001 + ОкрП000009005001 + ОкрП000009006001;
			
			Форма.СтруктураДанныхФорма1ТСтраница10.Вставить("П000009002001", П000009002001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				Форма.ТабличныйДокумент.Области.П000009002001.Значение = П000009002001;
			КонецЕсли;
		КонецЕсли;
		
		//Раздел 9  строка 1.2.1 
		ОкрП000009011001 = 0;
		ОкрП000009012001 = 0;	
		ОкрП000009013001 = 0;		
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009010001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009010001") Тогда
				ОкрП000009011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009011001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009012001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009012001") Тогда
				ОкрП000009012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009012001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009013001") Тогда
				ОкрП000009013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009013001);
			КонецЕсли;
			
			П000009010001 = ОкрП000009011001 + ОкрП000009012001 + ОкрП000009013001;
			
			Форма.СтруктураДанныхФорма1ТСтраница10.Вставить("П000009010001", П000009010001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				Форма.ТабличныйДокумент.Области.П000009010001.Значение = П000009010001;
			КонецЕсли;
		КонецЕсли;
		
		//Раздел 9  строка 1.2 
		ОкрП000009010001 = 0;
		ОкрП000009014001 = 0;	
		ОкрП000009020001 = 0;
		ОкрП000009023001 = 0;
		ОкрП000009024001 = 0;
		ОкрП000009025001 = 0;		
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009009001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009010001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009010001") Тогда
				ОкрП000009010001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009010001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009014001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009014001") Тогда
				ОкрП000009014001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009014001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009020001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009020001") Тогда
				ОкрП000009020001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009020001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009023001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009023001") Тогда
				ОкрП000009023001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009023001);
			КонецЕсли;

			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009024001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009024001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009024001") Тогда
				ОкрП000009024001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009024001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009025001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009025001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009025001") Тогда
				ОкрП000009025001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009025001);
			КонецЕсли;
			
			
			П000009009001 = ОкрП000009010001 + ОкрП000009014001 + ОкрП000009020001 + ОкрП000009023001 + ОкрП000009024001 + ОкрП000009025001;
			
			Форма.СтруктураДанныхФорма1ТСтраница10.Вставить("П000009009001", П000009009001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				Форма.ТабличныйДокумент.Области.П000009009001.Значение = П000009009001;
			КонецЕсли;
		КонецЕсли;
		
		//Раздел 9  строка 1
		ОкрП000009002001 = 0;
		ОкрП000009009001 = 0;		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009001001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009002001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009002001") Тогда
				ОкрП000009002001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009002001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009009001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009009001") Тогда
				ОкрП000009009001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009009001);
			КонецЕсли;

			П000009001001 = ОкрП000009002001 + ОкрП000009009001;
			
			Форма.СтруктураДанныхФорма1ТСтраница10.Вставить("П000009001001", П000009001001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				Форма.ТабличныйДокумент.Области.П000009001001.Значение = П000009001001;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница11" Тогда
		
		//Раздел 9  строка 1.2.1 
		ОкрП000009011001 = 0;
		ОкрП000009012001 = 0;	
		ОкрП000009013001 = 0;		
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009010001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				ОкрП000009011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009011001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница10.Свойство("П000009010001") Тогда
				ОкрП000009011001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница10.П000009011001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009012001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009012001") Тогда
				ОкрП000009012001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009012001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009013001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009013001") Тогда
				ОкрП000009013001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009013001);
			КонецЕсли;
			
			П000009010001 = ОкрП000009011001 + ОкрП000009012001 + ОкрП000009013001;
			
			Форма.СтруктураДанныхФорма1ТСтраница10.Вставить("П000009010001", П000009010001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница10" Тогда
				Форма.ТабличныйДокумент.Области.П000009010001.Значение = П000009010001;
			КонецЕсли;
		КонецЕсли;

		//Раздел 9  строка 1.2.2 
		ОкрП000009015001 = 0;
		ОкрП000009016001 = 0;	
		ОкрП000009017001 = 0;
		ОкрП000009018001 = 0;	
		ОкрП000009019001 = 0;		
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009014001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009015001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009015001") Тогда
				ОкрП000009015001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009015001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009016001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009016001") Тогда
				ОкрП000009016001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009016001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009017001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009017001") Тогда
				ОкрП000009017001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009017001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009018001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009018001") Тогда
				ОкрП000009018001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009018001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009019001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009019001") Тогда
				ОкрП000009019001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009019001);
			КонецЕсли;
			
			
			П000009014001 = ОкрП000009015001 + ОкрП000009016001 + ОкрП000009017001 + ОкрП000009018001 + ОкрП000009019001;
			
			Форма.СтруктураДанныхФорма1ТСтраница11.Вставить("П000009014001", П000009014001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				Форма.ТабличныйДокумент.Области.П000009014001.Значение = П000009014001;
			КонецЕсли;
		КонецЕсли;

		//Раздел 9 строка 1.2.3
		ОкрП000009021001 = 0;
		ОкрП000009017001 = 0;		
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009020001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009021001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009021001") Тогда
				ОкрП000009021001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009021001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				ОкрП000009022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009022001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница11.Свойство("П000009022001") Тогда
				ОкрП000009022001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница11.П000009022001);
			КонецЕсли;
						
			П000009020001 = ОкрП000009021001 + ОкрП000009022001;
			
			Форма.СтруктураДанныхФорма1ТСтраница10.Вставить("П000009020001", П000009020001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				Форма.ТабличныйДокумент.Области.П000009020001.Значение = П000009020001;
			КонецЕсли;
		КонецЕсли;
		
		//Раздел 9 строка 1.2.6 = сумме строк 1.2.6.1 – 1.2.6.2 по графе 1;
		ОкрП000009026001 = 0;
		ОкрП000009027001 = 0;		
		
		Если ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета.П000009025001, ОбластьИмя) > 0 Тогда
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
				ОкрП000009026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009026001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П000009026001") Тогда
				ОкрП000009026001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12.П000009026001);
			КонецЕсли;
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
				ОкрП000009027001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области.П000009027001.Значение);
			ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П000009027001") Тогда
				ОкрП000009027001 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12.П000009027001);
			КонецЕсли;
						
			П000009025001 = ОкрП000009026001 + ОкрП000009027001;
			
			Форма.СтруктураДанныхФорма1ТСтраница11.Вставить("П000009025001", П000009025001);
			
			Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница11" Тогда
				Форма.ТабличныйДокумент.Области.П000009025001.Значение = П000009025001;
			КонецЕсли;
		КонецЕсли;
		
		Если "П000009011001" = ОбластьИмя
			ИЛИ "П000009012001" = ОбластьИмя 
			ИЛИ "П000009013001" = ОбластьИмя 
			ИЛИ "П000009014001" = ОбластьИмя
			ИЛИ "П000009015001" = ОбластьИмя
			ИЛИ "П000009016001" = ОбластьИмя
			ИЛИ "П000009017001" = ОбластьИмя
			ИЛИ "П000009018001" = ОбластьИмя
			ИЛИ "П000009019001" = ОбластьИмя
			ИЛИ "П000009021001" = ОбластьИмя 
			ИЛИ "П000009022001" = ОбластьИмя 
			ИЛИ "П000009023001" = ОбластьИмя 
			ИЛИ "П000009024001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница10", ОбластьИмя);
		КонецЕсли;
		
	ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница12" Тогда
		
		Если "П000009026001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница11", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница10", ОбластьИмя);
		ИначеЕсли "П000009027001" = ОбластьИмя Тогда
			Расчет(Форма, "Форма1ТСтраница11", ОбластьИмя);
			Расчет(Форма, "Форма1ТСтраница10", ОбластьИмя);
        КонецЕсли;
        
        //Раздел 10 
		ОкрП000010102 = 0;
		ОкрП000010103 = 0;
		ОкрП000010104 = 0;
		ОкрП000010105 = 0;
		ОкрП000010106 = 0;
		ОкрП000010107 = 0;
		ОкрП000010108 = 0;
		ОкрП000010109 = 0;
		ОкрП000010110 = 0;
		ОкрП000010111 = 0;
		
        Графа = 1; 		
        Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00001010100" + Графа], ОбластьИмя) > 0 Тогда
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010200" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010200" + Графа) Тогда
                ОкрП000010102 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010200" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010300" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010300" + Графа) Тогда
                ОкрП000010103 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010300" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010400" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010400" + Графа) Тогда
                ОкрП000010104 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010400" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010500" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010500" + Графа) Тогда
                ОкрП000010105 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010500" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010106 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010600" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010600" + Графа) Тогда
                ОкрП000010106 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010600" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010107 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010700" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010700" + Графа) Тогда
                ОкрП000010107 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010700" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010108 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010800" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010800" + Графа) Тогда
                ОкрП000010108 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010800" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010109 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001010900" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001010900" + Графа) Тогда
                ОкрП000010109 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001010900" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                ОкрП000010110 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001011000" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница12.Свойство("П00001011000" + Графа) Тогда
                ОкрП000010110 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница12["П00001011000" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                ОкрП000010111 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001011100" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001011100" + Графа) Тогда
                ОкрП000010111 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001011100" + Графа]);
            КонецЕсли;
            
            СуммаПоГрафе = ОкрП000010102 + ОкрП000010103 + ОкрП000010104 + ОкрП000010105 + ОкрП000010106 + ОкрП000010107 + ОкрП000010108 + ОкрП000010109 + ОкрП000010110 + ОкрП000010111;
            
            Форма.СтруктураДанныхФорма1ТСтраница12.Вставить("П00001010100" + Графа, СуммаПоГрафе);
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница12" Тогда
                Форма.ТабличныйДокумент.Области["П00001010100" + Графа].Значение = СуммаПоГрафе;
            КонецЕсли;
        КонецЕсли;	
        
    ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница13" Тогда
        Если "П000010111001" = ОбластьИмя Тогда
            Расчет(Форма, "Форма1ТСтраница12", ОбластьИмя);
        КонецЕсли;
        
        ОкрП000010202 = 0;
		ОкрП000010203 = 0;
		ОкрП000010204 = 0;
		ОкрП000010205 = 0;
		ОкрП000010206 = 0;
		ОкрП000010207 = 0;
		ОкрП000010208 = 0;
		ОкрП000010209 = 0;
		ОкрП000010210 = 0;
		ОкрП000010211 = 0;
		
        Для Графа = 1 По 2 Цикл 		
            Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00001020100" + Графа], ОбластьИмя) > 0 Тогда
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020200" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020200" + Графа) Тогда
                    ОкрП000010202 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020200" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020300" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020300" + Графа) Тогда
                    ОкрП000010203 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020300" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020400" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020400" + Графа) Тогда
                    ОкрП000010204 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020400" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020500" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020500" + Графа) Тогда
                    ОкрП000010205 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020500" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010206 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020600" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020600" + Графа) Тогда
                    ОкрП000010206 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020600" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010207 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020700" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020700" + Графа) Тогда
                    ОкрП000010207 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020700" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010208 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020800" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020800" + Графа) Тогда
                    ОкрП000010208 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020800" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010209 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001020900" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001020900" + Графа) Тогда
                    ОкрП000010209 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001020900" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010210 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001021000" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001021000" + Графа) Тогда
                    ОкрП000010210 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001021000" + Графа]);
                КонецЕсли;
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    ОкрП000010211 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001021100" + Графа].Значение);
                ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001021100" + Графа) Тогда
                    ОкрП000010211 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001021100" + Графа]);
                КонецЕсли;
                
                СуммаПоГрафе = ОкрП000010202 + ОкрП000010203 + ОкрП000010204 + ОкрП000010205 + ОкрП000010206 + ОкрП000010207 + ОкрП000010208 + ОкрП000010209 + ОкрП000010210 + ОкрП000010211;
                
                Форма.СтруктураДанныхФорма1ТСтраница13.Вставить("П00001020100" + Графа, СуммаПоГрафе);
                
                Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                    Форма.ТабличныйДокумент.Области["П00001020100" + Графа].Значение = СуммаПоГрафе;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
            
        ОкрП000010302 = 0;
		ОкрП000010303 = 0;
		ОкрП000010304 = 0;
		ОкрП000010305 = 0;
		ОкрП000010306 = 0;
		ОкрП000010307 = 0;
		ОкрП000010308 = 0;
		ОкрП000010309 = 0;
		ОкрП000010310 = 0;
		ОкрП000010311 = 0;
		
        Графа = 1; 		
        Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00001030100" + Графа], ОбластьИмя) > 0 Тогда
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                ОкрП000010302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030200" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001030200" + Графа) Тогда
                ОкрП000010302 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001030200" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                ОкрП000010303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030300" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001030300" + Графа) Тогда
                ОкрП000010303 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001030300" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                ОкрП000010304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030400" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001030400" + Графа) Тогда
                ОкрП000010304 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001030400" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                ОкрП000010305 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030500" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001030500" + Графа) Тогда
                ОкрП000010305 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001030500" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                ОкрП000010306 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030600" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница13.Свойство("П00001030600" + Графа) Тогда
                ОкрП000010306 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница13["П00001030600" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010307 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030700" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001030700" + Графа) Тогда
                ОкрП000010307 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001030700" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010308 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030800" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001030800" + Графа) Тогда
                ОкрП000010308 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001030800" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010309 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001030900" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001030900" + Графа) Тогда
                ОкрП000010309 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001030900" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010310 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001031000" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001031000" + Графа) Тогда
                ОкрП000010310 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001031000" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010311 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001031100" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001031100" + Графа) Тогда
                ОкрП000010311 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001031100" + Графа]);
            КонецЕсли;
            
            СуммаПоГрафе = ОкрП000010302 + ОкрП000010303 + ОкрП000010304 + ОкрП000010305 + ОкрП000010306 + ОкрП000010307 + ОкрП000010308 + ОкрП000010309 + ОкрП000010310 + ОкрП000010311;
            
            Форма.СтруктураДанныхФорма1ТСтраница13.Вставить("П00001030100" + Графа, СуммаПоГрафе);
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница13" Тогда
                Форма.ТабличныйДокумент.Области["П00001030100" + Графа].Значение = СуммаПоГрафе;
            КонецЕсли;
        КонецЕсли;
    ИначеЕсли ИмяСтраницыПанели = "Форма1ТСтраница14" Тогда
        
        Если "П000010307001" = ОбластьИмя Тогда
            Расчет(Форма, "Форма1ТСтраница13", ОбластьИмя);
        ИначеЕсли "П000010308001" = ОбластьИмя Тогда
            Расчет(Форма, "Форма1ТСтраница13", ОбластьИмя);
        ИначеЕсли "П000010309001" = ОбластьИмя Тогда
            Расчет(Форма, "Форма1ТСтраница13", ОбластьИмя);
        ИначеЕсли "П000010310001" = ОбластьИмя Тогда
            Расчет(Форма, "Форма1ТСтраница13", ОбластьИмя);
        ИначеЕсли "П000010311001" = ОбластьИмя Тогда
            Расчет(Форма, "Форма1ТСтраница13", ОбластьИмя);
        КонецЕсли;

        ОкрП000010402 = 0;
		ОкрП000010403 = 0;
		ОкрП000010404 = 0;
		ОкрП000010405 = 0;
		ОкрП000010406 = 0;
		ОкрП000010407 = 0;
		ОкрП000010408 = 0;
		ОкрП000010409 = 0;
		ОкрП000010410 = 0;
		ОкрП000010411 = 0;
		
        Графа = 1; 		
        Если  ЗначениеЗаполнено(ОбластьИмя) И СтрЧислоВхождений(Форма.СтруктураЗависимыхЯчеекДляАвторасчета["П00001040100" + Графа], ОбластьИмя) > 0 Тогда
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040200" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040200" + Графа) Тогда
                ОкрП000010402 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040200" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010403 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040300" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040300" + Графа) Тогда
                ОкрП000010403 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040300" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010404 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040400" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040400" + Графа) Тогда
                ОкрП000010404 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040400" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010405 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040500" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040500" + Графа) Тогда
                ОкрП000010405 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040500" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010406 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040600" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040600" + Графа) Тогда
                ОкрП000010406 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040600" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010407 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040700" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040700" + Графа) Тогда
                ОкрП000010407 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040700" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010408 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040800" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040800" + Графа) Тогда
                ОкрП000010408 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040800" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010409 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001040900" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001040900" + Графа) Тогда
                ОкрП000010409 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001040900" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010410 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001041000" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001041000" + Графа) Тогда
                ОкрП000010410 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001041000" + Графа]);
            КонецЕсли;
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                ОкрП000010411 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.ТабличныйДокумент.Области["П00001041100" + Графа].Значение);
            ИначеЕсли Форма.СтруктураДанныхФорма1ТСтраница14.Свойство("П00001041100" + Графа) Тогда
                ОкрП000010411 = РегламентированнаяОтчетностьКлиентСервер.ОкруглитьЧислоПоФормату(Форма, Форма.СтруктураДанныхФорма1ТСтраница14["П00001041100" + Графа]);
            КонецЕсли;
            
            СуммаПоГрафе = ОкрП000010402 + ОкрП000010403 + ОкрП000010404 + ОкрП000010405 + ОкрП000010406 + ОкрП000010407 + ОкрП000010408 + ОкрП000010409 + ОкрП000010410 + ОкрП000010411;
            
            Форма.СтруктураДанныхФорма1ТСтраница14.Вставить("П00001040100" + Графа, СуммаПоГрафе);
            
            Если Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Форма1ТСтраница14" Тогда
                Форма.ТабличныйДокумент.Области["П00001040100" + Графа].Значение = СуммаПоГрафе;
            КонецЕсли;
        КонецЕсли;

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда) Экспорт
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоПредупредитьОСохранении", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
		
	ОбщиеРеквизитыРазделов = Новый Структура;
		
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	Раздел = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	Для Каждого ЭлеменетДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Если ЭлеменетДерева.ВыводНаПечать = 1 Тогда
			
				ВывестиМакетСтраницыВТабличныйДокументНаСервере(ЭлеменетДерева.ИмяСтраницы);
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("НаименованиеЛиста",  ЭлеменетДерева.Представление);
				СтруктураПараметров.Вставить("ОриентацияЛиста",    ЭлеменетДерева.ОриентацияСтраницы);
				СтруктураПараметров.Вставить("ИмяСтраницы",        ЭлеменетДерева.ИмяСтраницы);
				Структурапараметров.Вставить("ИмяОбластиТаблПоля", "ТабличныйДокумент");
				СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, СтруктураПараметров, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
		КонецЕсли;
		
	КонецЦикла;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел);
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение (Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	ДополнительныеПараметрыПечати = Новый Структура;
	ДополнительныеПараметрыПечати.Вставить("ВидПечати", Команда.Имя);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект, ДополнительныеПараметрыПечати);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
	Иначе
		
		СохранитьНаКлиенте(, ОписаниеОповещения);
		
	КонецЕсли;
	//
	//Если Команда <> Неопределено Тогда
	//	Печать(Команда.Имя);
	//КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);

КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт	
	
	Вариант = СтруктураРеквизитовФормы.ВидДокумента;
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, , Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением();
	
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением()
	
	Возврат Сохранить();
	
КонецФункции

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтаФорма[ИмяСтруктурыДанных][Ном].Данные[0].Значение;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
				   И ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтаФорма[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаСервере
Функция Сохранить()
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
			
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, , ,СтруктураРеквизитовФормы.ВидДокумента, , СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = Метаданные.Отчеты[Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7)].ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ТекущаяДата(); 
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = ?(СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане = Неопределено,"",СтруктураРеквизитовФормы.Организация.РегистрацияВНалоговомОргане.Код);
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = "";
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = СтруктураРеквизитовФормы.ВидДокумента;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = СтруктураРеквизитовФормы.ВидДокумента;
		
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	//сохранение данных текущего раздела
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	// формируем список сохранения
	СписокСохранения = Новый Структура();

	// вставляем данные редактируемых ячеек таблицы
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	СписокСохранения.Вставить("СписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	
	МассивТиповНеопределено = Новый Массив;
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		ИмяРаздела = ЭлементСтруктуры.Ключ;
		ИмяСтруктурыДанных = ЭлементСтруктуры.Значение;
		ДанныеВТаблицеЗначений = СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных);
		Если ДанныеВТаблицеЗначений <> Неопределено Тогда
			ДанныеМногостраничныхРазделов.Вставить(ИмяРаздела, ДанныеВТаблицеЗначений);
		КонецЕсли;
	КонецЦикла;

	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
	Исключение
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	Модифицированность = Ложь;
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
	
	Если Команда <> Неопределено Тогда
		Печать(Команда.Имя);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПредупредитьОСохранении(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоСохранениеОтчета", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = НСтр("ru = 'Автоматическое заполнение приведет к сохранению отчета с новыми данными. Заполнить отчет?'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Заполнить", "Заполнить и сохранить");
	Кнопки.Добавить("НеЗаполнять", "Не заполнять");
	
	КнопкаПоУмолчанию = "НеЗаполнять";
	
	ЗаголовокВопроса = НСтр("ru = 'Автоматическое заполнение отчета'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , КнопкаПоУмолчанию, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоСохранениеОтчета(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя <> "Заполнить" Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ЗаполнитьАвтоПослеСохранениеОтчета", 
		ЭтотОбъект, 
		ДополнительныеПараметры); 
	
	СохранитьНаКлиенте(,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоПослеСохранениеОтчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;
	
	ЭтаФорма.Доступность = Ложь;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "ФормированиеОтчета");
	РезультатВыполнения = ЗаполнитьАвтоНаСервере();
	Если НЕ РезультатВыполнения.ЗаданиеВыполнено Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);

	ЗаполнитьПустыеСтруктурыДанных();
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",              СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",  СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц",  мСписокСтруктурныхЕдиниц);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Форма1ТСтраница1", СтруктураДанныхФорма1ТСтраница1);
	Контейнер.Вставить("Форма1ТСтраница2", СтруктураДанныхФорма1ТСтраница2);
	Контейнер.Вставить("Форма1ТСтраница3", СтруктураДанныхФорма1ТСтраница3);
	Контейнер.Вставить("Форма1ТСтраница3_ДанныеДопСтрок", ДанныеФормыВЗначение(П0000010040, Тип("ТаблицаЗначений")));
	Контейнер.Вставить("Форма1ТСтраница4", СтруктураДанныхФорма1ТСтраница4);
	Контейнер.Вставить("Форма1ТСтраница5", СтруктураДанныхФорма1ТСтраница5);
	Контейнер.Вставить("Форма1ТСтраница6", СтруктураДанныхФорма1ТСтраница6);
	Контейнер.Вставить("Форма1ТСтраница7", СтруктураДанныхФорма1ТСтраница7);
	Контейнер.Вставить("Форма1ТСтраница8", СтруктураДанныхФорма1ТСтраница8);
	Контейнер.Вставить("Форма1ТСтраница9", СтруктураДанныхФорма1ТСтраница9);
	Контейнер.Вставить("Форма1ТСтраница10", СтруктураДанныхФорма1ТСтраница10);
	Контейнер.Вставить("Форма1ТСтраница11", СтруктураДанныхФорма1ТСтраница11);
	Контейнер.Вставить("Форма1ТСтраница12", СтруктураДанныхФорма1ТСтраница12);
	Контейнер.Вставить("Форма1ТСтраница13", СтруктураДанныхФорма1ТСтраница13);
	Контейнер.Вставить("Форма1ТСтраница14", СтруктураДанныхФорма1ТСтраница14);
	Контейнер.Вставить("Форма1ТСтраница15", СтруктураДанныхФорма1ТСтраница15);
    
    РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор, 
		"РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчетВФоне",
		Новый Структура("ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер", ИмяОтчета(ЭтаФорма.ИмяФормы), ИмяФормыОтчета(ЭтаФорма.ИмяФормы), ПараметрыОтчета, Контейнер),
		НСтр("ru = 'Выполняется автоматическое заполнение отчета. Пожалуйста, подождите...'"));
		
		АдресХранилища       = РезультатВыполнения.АдресХранилища;
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьНаКлиенте(, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("мАвтоВыборКодов", Ложь);
	мПараметры.Вставить("ЗначенияИзСписка", Ложь);
	мПараметры.Вставить("ОтключитьАвтоРасчет", Ложь);
	мПараметры.Вставить("СчетчикСтраниц", Ложь);
	мПараметры.Вставить("ПараметрыОтображенияСумм", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("Выгрузка", Истина);
	мПараметры.Вставить("ИмяОтчета", ИмяОтчета(ЭтаФорма.ИмяФормы));
	мПараметры.Вставить("СписокСтруктурныхЕдиниц", Истина);
	мПараметры.Вставить("РежимВыбораСтруктурныхЕдиниц", "ПоГоловнымОрганизациям");
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("СтруктурныеЕдиницы",        мСписокСтруктурныхЕдиниц);
	ПараметрыФормы.Вставить("мПараметры",                мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	ПодготовитьДеревоСтраницДляНастройки();
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, ФормаНастройкиОтчета.Дерево);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", , ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоСтраницДляНастройки()
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	ДеревоСтраниц = РеквизитФормыВЗначение("мДеревоСтраницОтчета");
	
	СтрокаУровня1 = мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Форма1ТСтраница1";
	СтрокаУровня1.Представление            = "Форма 1-Т (годовая)";
	СтрокаУровня1.ОриентацияСтраницы       = "Ландшафт";
	
	Строка = ДеревоСтраниц.Строки.Найти("Форма1ТСтраница1","ИмяСтраницы");
	СтрокаУровня1.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
	СтрокаУровня1.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
	СтрокаУровня1.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	флЗначенияИдентичны = ПеренестиДанныеДереваСтраниц();
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДанныеДереваСтраниц()
	
	флЗначенияИдентичны = Истина;
	
	ДеревоВыбСтраниц = РеквизитФормыВЗначение("мДеревоВыбранныхСтраниц");
	
	Для Каждого ЭлементДерева Из мДеревоСтраницОтчета.ПолучитьЭлементы() Цикл
		
		Строка = ДеревоВыбСтраниц.Строки.Найти(Лев(ЭлементДерева.Представление,12),"Представление");
		
		Если ЭлементДерева.ПоказатьСтраницу <> ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1) Тогда
			
			флЗначенияИдентичны = Ложь;
			
		КонецЕсли;
		
		ЭлементДерева.ВыводНаПечать            = ?(Строка <> Неопределено,Строка.ВыводНаПечать,1);
		ЭлементДерева.ПоказатьСтраницу         = ?(Строка <> Неопределено,Строка.ПоказатьСтраницу,1);
		ЭлементДерева.ВыгрузитьСтраницу        = ?(Строка <> Неопределено,Строка.ВыгрузитьСтраницу,1);
		
	КонецЦикла;
	
	Возврат флЗначенияИдентичны;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		ВставитьДополнительнуюСтрокуНаСервере();
	#Иначе
		ВставитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтрокуНаСервере()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьДополнительнуюСтрокуНаКлиенте()
	
	ВставитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ИмяГруппыБлока = Неопределено, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	Если ИмяГруппыБлока = Неопределено Тогда
		// Сначала выполним проверку на активную страницу панели формы,
		// которая содержит многострочный раздел
		#Если НаКлиенте Тогда
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#Иначе
			ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела);
		#КонецЕсли
		
		Если ИмяГруппы = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		ИмяГруппы = ИмяГруппыБлока;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=0");
	Если КолСтрокСтр = "" Тогда
		ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_1";
	Иначе
		ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "01_" + КолСтрокСтр;
	КонецЕсли;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];

	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
	НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;

	// номера строк вставляемой области
	НомерВерхЯчейкиНовойОбласти = НомерВерхЯчейкиОбласти + СдвигСтрок;
	НомерНижнЯчейкиНовойОбласти = НомерНижнЯчейкиОбласти + СдвигСтрок;
	
	НазначитьИмяОбластиМЧ = Ложь;
	ВставляемаяОбласть = ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, );
	Если СтрНайти(ВставляемаяОбласть.Имя, "МногострочнаяЧасть") Тогда
		НазначитьИмяОбластиМЧ = Истина;
		ИмяМногострочнойЧасти = ВставляемаяОбласть.Имя;
	КонецЕсли;
	
	Если НЕ СпециальноеДобавление Тогда
		
		РегламентированнаяОтчетностьВызовСервера.ВставитьОбластьВТабличныйДокумент(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	Если НазначитьИмяОбластиМЧ Тогда
		ТекТабличноеПоле.Область(НомерНижнЯчейкиОбласти + 1, , НомерНижнЯчейкиОбласти + (НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти) + 1, ).Имя = "";
		ТекТабличноеПоле.Область(НомерВерхЯчейкиОбласти, , НомерНижнЯчейкиОбласти, ).Имя = ИмяМногострочнойЧасти;
	КонецЕсли;
	
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=0");
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Области["УдалитьСтроку" + ИмяОбластиЯчейки].Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
			КонецЕсли;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если (НомерГрафы = 1) Тогда
				ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1, НомерНижнСтрокиЯчейки, НомерЛевоКолонкиЯчейки - 1).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
			
			Если ИмяКолонкиНомера <> Неопределено Тогда
				Если ИмяКолонкиНомера = ИмяКолонки Тогда
					Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
						ОбластьЯчейки.Значение = КолСтрокСтр1;
					Иначе
						ОбластьЯчейки.Текст = КолСтрокСтр1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИмяГруппыБлока = Неопределено Тогда
			
		ИмяТекущейОбласти = ИмяГруппы + "01_" + КолСтрокСтр1;
		
		Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
		
		// установим фокус на поле табличн. документа
		ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
		
	КонецЕсли;
	
	// добавляем в структуру многострочной группы новую строку
	ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);

	//ПрописатьФункцию добавления по всем страницам приложения
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			ОбластьТД.Гиперссылка = Истина;
			ОбластьТД.Текст = "х";
		КонецЕсли;
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
		
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппы21 Тогда
		
		ТекТабличноеПоле = "Форма1ТСтраница3";
		
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
		
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "Форма1ТСтраница3" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппы21;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
		ДобавитьСтроку("");
	ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
		УдалитьСтроку("");
	КонецЕсли;
	
	ИмяЯчейки = Область.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Модифицированность = Истина;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	РасчетНаКлиенте(ИмяРаздела,Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт

	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы, Форма)
	
	Если Число(Сред(ИмяГруппы,10,1)) = 4 Тогда
		
		СтруктураГруппы = Форма["П0000010040"];
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
				
	КонецЕсли;
	
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, СтруктураГруппы.Количество(), Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма, НомерСтроки, УдалитьСтроку)
	
	//НомерСтроки = НомерСтроки + 1;
	
	Если УдалитьСтроку = Ложь Тогда
		ИндексПересчета = НомерСтроки - 2;
	Иначе
		ИндексПересчета = НомерСтроки;
	КонецЕсли;
	
	Если Число(Сред(ИмяГруппы,10,1)) = 4 Тогда
		
		СтруктураГруппы = Форма["П0000010040"];		
		
		Если не УдалитьСтроку Тогда
			
			Если ИндексПересчета = 0 Тогда
				
				Форма.ПоследняяНумерация = 2.0;
				
				Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
					Форма.ПоследняяНумерация = Форма.ПоследняяНумерация+0.1;					
					СтруктураГруппы[Индекс].П000001004001 = Форма.ПоследняяНумерация;		    																
				КонецЦикла;		

			Иначе	
				
				ИндексПересчета = ИндексПересчета + 1;
				
				Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
					Форма.ПоследняяНумерация = Форма.ПоследняяНумерация+0.1;					
					Если ЗначениеЗаполнено(СтруктураГруппы[Индекс-1].П000001004001) Тогда 
							
						СтруктураГруппы[Индекс].П000001004001 = СтруктураГруппы[Индекс-1].П000001004001+0.1;
						
					Иначе	
						СтруктураГруппы[Индекс].П000001004001 = Форма.ПоследняяНумерация;		    											
					КонецЕсли;	
					
				КонецЦикла;		
				
			КонецЕсли;
												
		Иначе
			
			Если Не ИндексПересчета = 0 Тогда
				
				НомерПозицииПередУдаляемой = СтруктураГруппы[ИндексПересчета-1].П000001004001;
				
			Иначе
				
				НомерПозицииПередУдаляемой = 2.0;
				
			КонецЕсли;	

			Для Индекс = ИндексПересчета по СтруктураГруппы.Количество()-1 Цикл
					
				НомерПозицииПередУдаляемой = НомерПозицииПередУдаляемой + 0.1;
					
				СтруктураГруппы[Индекс].П000001004001 = НомерПозицииПередУдаляемой;
								
			КонецЦикла;				
			
		КонецЕсли;	
					
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма)
	
	Если Число(Сред(ИмяГруппы,10,1)) = 4 Тогда
		
		СтруктураГруппы = Форма["П0000010040"];
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);	
			
	КонецЕсли;
		
	ПересчитатьНумерациюМногострочныхРазделов(ИмяГруппы, Форма,НомерСтрокиТаблицы, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	
	ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	#Если ВебКлиент Тогда
		УдалитьДополнительнуюСтрокуНаСервере();
	#Иначе
		УдалитьДополнительнуюСтрокуНаКлиенте();
	#КонецЕсли
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте()
	
	УдалитьДополнительнуюСтроку(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;

	ТекущаяСтраница = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	ТекТабличноеПоле = Форма.ТабличныйДокумент;

	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;

	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли

	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);

	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];

	// Выполним также проверку вхождения текущей (выделенной) ячейки в многострочный раздел
	ТекущаяОбласть = Форма.Элементы["ТабличныйДокумент"].ТекущаяОбласть;
	
	ИмяЯчейки = ТекущаяОбласть.Имя;

	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число(Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы Тогда
		
		ИмяПервойЯчейкиУдаляемойСтроки = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомУдаляемойСтроки, "ЧГ=0");

		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];

		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх;
		НомерНижнЯчейкиОбласти = ОбластьЯчейки.Верх + ВысотаСтроки - 1;
		
		МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе");
		МногострочностьВРазделеТип = ТипЗнч(МногострочностьВРазделе);
		Если МногострочностьВРазделеТип = Тип("Число") Тогда
			ИмяОбластиМнгЧ = "МногострочнаяЧасть";
		ИначеЕсли МногострочностьВРазделеТип = Тип("ДанныеФормыКоллекция") Тогда
			ИмяОбластиМнгЧ = МногострочностьВРазделе.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].Область;
		КонецЕсли;
		// Найдем координаты области, для последующего восстановления.

		Если ТекТабличноеПоле.Области.Найти(ИмяОбластиМнгЧ) <> Неопределено Тогда
			ОбластьВерх = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Верх;
			ОбластьНиз = ТекТабличноеПоле.Области[ИмяОбластиМнгЧ].Низ;
		КонецЕсли;

		Если СпециальноеДобавление Тогда
			
		Иначе
					
			РегламентированнаяОтчетностьВызовСервера.УдалитьОбластьИзТабличногоДокумента(ТекТабличноеПоле, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
			Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
			
		КонецЕсли;
		// Восстановим область.
		ТекТабличноеПоле.Область(ОбластьВерх, 0, ОбластьНиз, 0).Имя = ИмяОбластиМнгЧ;

		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;

		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда

			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл

				ТекСтрока = СтруктураГруппы[НСтр - 1];

				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=");
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		// обновляем структуру многострочного раздела
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
	Иначе
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк

		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		
		//Процедура удаления по всем страницам приложения
		УдалитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,НомерСтрокиТаблицы,Форма);
		
		//Процедура удаления по всем страницам приложения
		ДобавитьСтрокиВоВсехСтраницахПриложения(ИмяГруппы,Форма);

		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					Если ИмяКолонкиНомера <> Неопределено Тогда
						Если ИмяКолонкиНомера = КолонкаТаблицыИмя Тогда
							// обновляем порядковый номер строки
							СтрокаТаблицы[КолонкаТаблицыИмя] = НомерСтрокиВФормеТаблицы;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
		
		КонецЦикла;

		// Данные в многострочном блоке обновляются в декларациях!
		// Форма.ОбновитьСтруктуруМногострочногоРаздела(ИмяГруппы);
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
	
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае

	// определяем текущую область таблицы
	НомТекущейСтроки = Мин(НомУдаляемойСтроки, СтруктураГруппы.Количество());
	
	ИмяТекущейОбласти = "УдалитьСтроку" + ИмяГруппы + "01_" + Формат(НомТекущейСтроки, "ЧГ=0");
		
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];

	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	ЕстьДопСтроки = Ложь;
	
	Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
			ЕстьДопСтроки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДопСтроки Тогда
		Для Каждого ОбластьТД Из ТекТабличноеПоле.Области Цикл
			Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
		
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
			
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), 
	ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, 
	, 
	МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), 
	ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
						
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
							
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Формат(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1, "ЧГ=0");
				
			КонецЕсли;
			
		КонецЦикла;
						
	КонецЦикла;	
		
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
		
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
		
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
		
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицы = НомерСтрокиВТаблице + 1;
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВФормеТаблицы, "ЧГ=0");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
			
			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки      = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппы21", СтруктураРеквизитовФормы.мИдГруппы21);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхФорма1ТСтраница1.Очистить();
	СтруктураДанныхФорма1ТСтраница2.Очистить();
	СтруктураДанныхФорма1ТСтраница3.Очистить();
	СтруктураДанныхФорма1ТСтраница4.Очистить();
	СтруктураДанныхФорма1ТСтраница5.Очистить();
	СтруктураДанныхФорма1ТСтраница6.Очистить();
	СтруктураДанныхФорма1ТСтраница7.Очистить();
	СтруктураДанныхФорма1ТСтраница8.Очистить();
	СтруктураДанныхФорма1ТСтраница9.Очистить();
	СтруктураДанныхФорма1ТСтраница10.Очистить();
	СтруктураДанныхФорма1ТСтраница11.Очистить();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма1ТСтраница1", 1);
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	ВыбТабличноеПоле = Форма.ТабличныйДокумент;
	
	// Непосредственно очищаем ячейки табличного документа.
	Для Инд = 0 По ВыбТабличноеПоле.Области.Количество() - 1 Цикл
		ТекущаяОбласть = ВыбТабличноеПоле.Области[Инд];
		
		Если Не ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			Продолжить;
		КонецЕсли;
	
		Если ТекущаяОбласть.СодержитЗначение <> Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяОбласть.Защита Тогда
			Продолжить;
		КонецЕсли;

		ТекущаяОбласть.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
		
		РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела" + Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОтчета(ЭтаФормаИмя)
	Форма_Имя = СтрЗаменить(ЭтаФормаИмя, "Внешний", "");
	Возврат Сред(Лев(Форма_Имя, СтрНайти(Форма_Имя, ".Форма.") - 1), 7);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФормыОтчета(ЭтаФормаИмя)
	Возврат Сред(ЭтаФормаИмя, СтрНайти(ЭтаФормаИмя, ".Форма.") + 7);
КонецФункции

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Печать(ДополнительныеПараметры.ВидПечати);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	Контейнер = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если Контейнер = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИдентификаторЗадания = Неопределено;
	Контейнер = ?(Контейнер.Свойство("Контейнер"), Контейнер.Контейнер, Контейнер); 
	Для Каждого ЭлементКонтейнера Из Контейнер Цикл
		
		ИмяСтраницы = ЭлементКонтейнера.Ключ;
		
		Если ИмяСтраницы = "Форма1ТСтраница3_ДанныеДопСтрок" Тогда
			ЗначениеВДанныеФормы(ЭлементКонтейнера.Значение, П0000010040);
		Иначе
			ЭтаФорма["СтруктураДанных" + ИмяСтраницы] = ЭлементКонтейнера.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере("Форма1ТСтраница1", 1);
	ЗаполнитьСведенияОбОрганизацииНаСервере();
	
	Модифицированность = Истина;
	
	ЭтаФорма.Доступность = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеИспользовать");
	РасчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
			ЭтаФорма.Доступность = Истина;
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеИспользовать");
		ИначеЕсли ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ЗагрузитьПодготовленныеДанные();
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ЭтаФорма.Доступность = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ТабличныйДокумент, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции
