#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОкругления Из ЭтотОбъект Цикл
		
		Если СтрокаОкругления.ВидРасчета = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС
			И СтрокаОкругления.Период >= Дата(2020, 1, 1) Тогда
			
			СообщениеОбОшибке = НСтр("ru = 'Данные о порядке округления ""Взносы на ОСМС"" вводятся до 2020 года. С 2020 года округление производится автоматически, согласно действующим нормам законодательства'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			Отказ = Истина;

		ИначеЕсли СтрокаОкругления.ВидРасчета = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС
			И СтрокаОкругления.Период >= Дата(2022, 1, 1) Тогда
			
			СообщениеОбОшибке = НСтр("ru = 'Данные о порядке округления ""Отчисления на ОСМС"" вводятся до 2022 года. С 2022 года округление производится автоматически, согласно действующим нормам законодательства'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			Отказ = Истина;

		ИначеЕсли СтрокаОкругления.ВидРасчета = Перечисления.ВидыНалоговВзносовОтчислений.СО
			И СтрокаОкругления.Период >= Дата(2022, 1, 1) Тогда
			
			Точность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОкругления.СпособОкругления, "Точность");
			
			Если НЕ Точность = Неопределено Тогда
				РазницаСотые = Точность - Цел(Точность);
			Иначе
				РазницаСотые = 0;
			КонецЕсли;
			
			Если НЕ РазницаСотые = 0 Тогда
				СообщениеОбОшибке = НСтр("ru = 'Порядок округления ""Социальных отчислений"" регламентирован, необходимо выбрать округление до целого.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
				Отказ = Истина;
			КонецЕсли;

		ИначеЕсли СтрокаОкругления.ВидРасчета = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
			
			Точность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОкругления.СпособОкругления, "Точность");
			
			Если Точность = 0 ИЛИ Точность <= 0.001 Тогда
				СообщениеОбОшибке = НСтр("ru = 'Округление единого платежа может быть установлено в интервале от сотых тенге (тиын) до целых тенге'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
				Отказ = Истина;
			КонецЕсли;

        КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	// Обновляем кэш платформы для зачитывания актуальных настроек
	// используется в ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления.
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

#КонецЕсли
