
#Область СлужебныйПрограммныйИнтерфейс

Процедура НалогиВзносыОтчисленияДополнитьФорму(Форма, ИмяГруппы = "ГруппаНалогиВзносыОтчисления", ДобавлятьЭлементыФормы = Истина, ДобавлятьРеквизитыФормы = Истина, ОтложенноеИзменение = Ложь) Экспорт
	
	Если ДобавлятьРеквизитыФормы Тогда
		
		Объект = Форма.Объект;
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОрганизацияПорядокОбложенияДоходовРаботников", Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокОбложенияДоходовРаботников")));
		Если Объект.Свойство("Сотрудник") Тогда
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Нерезидент", Новый ОписаниеТипов("Булево")));
		КонецЕсли;
		
		МассивИменРеквизитовФормы = Новый Массив;
		ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
		ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
		
	КонецЕсли;
	
	Если ДобавлятьЭлементыФормы Тогда
		
		// Установка свойств элементов формы.
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеречислениеТретьемуЛицуДополнитьФорму(Форма, ДобавлятьЭлементыФормы = Истина, ДобавлятьРеквизитыФормы = Истина) Экспорт
	
	Если ДобавлятьРеквизитыФормы Тогда
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПеречислениеТретьемуЛицу", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица")));
		
		МассивИменРеквизитовФормы = Новый Массив;
		ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
		ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
		
	КонецЕсли;
	
	Если ДобавлятьЭлементыФормы Тогда
		
		ПеречислениеТретьемуЛицуГруппа = Форма.Элементы.Добавить("ПеречислениеТретьемуЛицуГруппа", Тип("ГруппаФормы"), Форма.Элементы.ГруппаВтораяВыборМестаВыплаты);
		ПеречислениеТретьемуЛицуГруппа.Вид					= ВидГруппыФормы.ОбычнаяГруппа;
		ПеречислениеТретьемуЛицуГруппа.Объединенная			= Ложь;
		ПеречислениеТретьемуЛицуГруппа.ОтображатьЗаголовок	= Ложь;
		
		ПеречислениеТретьемуЛицуЗаголовок = Форма.Элементы.Вставить("ПеречислениеТретьемуЛицуЗаголовок", Тип("ДекорацияФормы"), ПеречислениеТретьемуЛицуГруппа);
		ПеречислениеТретьемуЛицуЗаголовок.Заголовок = "Перечисление третьему лицу:";
		
		ПеречислениеТретьемуЛицу = Форма.Элементы.Вставить("ПеречислениеТретьемуЛицу", Тип("ПолеФормы"), ПеречислениеТретьемуЛицуГруппа);
		ПеречислениеТретьемуЛицу.ПоложениеЗаголовка		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПеречислениеТретьемуЛицу.ПутьКДанным			= "ПеречислениеТретьемуЛицу";
		ПеречислениеТретьемуЛицу.Вид					= ВидПоляФормы.ПолеВвода;
		ПеречислениеТретьемуЛицу.МаксимальнаяШирина		= 45;
		ПеречислениеТретьемуЛицу.АвтоМаксимальнаяШирина = Ложь;
		ПеречислениеТретьемуЛицу.УстановитьДействие("ПриИзменении", "Подключаемый_ПеречислениеТретьемуЛицуПриИзменении");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
