
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	КадровыйУчет.ОснованияУвольненияОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	КадровыйУчет.ОбработкаПолученияДанныхВыбораОснованийУвольнения(
		ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ПредставленияОбщихДанныхВызовСервера.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Процедура выполняет первоначальное заполнение статей ТК - оснований увольнения.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗагрузитьКлассификатор();
	
КонецПроцедуры

Процедура ЗагрузитьКлассификатор() Экспорт
	
	ОбновитьСтатьиУвольненияУмершихСотрудников();
	
	КадровыйУчет.ЗаполнитьКлассификаторОснованийУвольнения(
		Метаданные.Справочники.ОснованияУвольнения.Имя,
		ПолучитьМакет("ОснованияУвольненияПоТКРФ"));
	
КонецПроцедуры

Процедура ОбновитьОснованияВАрхиве(ПараметрыОбновления = Неопределено) Экспорт
	КадровыйУчет.ОбновитьОснованияУвольненияВАрхиве(
		Метаданные.Справочники.ОснованияУвольнения.Имя);
КонецПроцедуры

Процедура ОбновитьСтатьиУвольненияУмершихСотрудников()
	
	// ЗУПК
	Возврат;
	// ЗУПК
	
	КадровыйУчет.УстановитьИмяПредопределенногоОснованиюУвольнения(
		Метаданные.Справочники.ОснованияУвольнения.Имя, "Статья83ч1п6", НСтр("ru = 'п. 6 ч. 1 ст. 83'"));
	
КонецПроцедуры

Процедура ОбновитьОснованияУвольненийСтатьи55п2() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОснованияУвольнения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОснованияУвольнения КАК ОснованияУвольнения
		|ГДЕ
		|	ОснованияУвольнения.Наименование = ""Статья 55 п. 2""";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
  		ОбъектСправочника.Наименование = "(НЕ ИСПОЛЬЗУЕТСЯ) Статья 55 п. 2";
        ОбъектСправочника.ПометкаУдаления = Истина;
		ОбъектСправочника.ОбменДанными.Загрузка = Истина;
		ОбъектСправочника.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьОснованияУвольненийСтатьи57п1пп1() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОснованияУвольнения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОснованияУвольнения КАК ОснованияУвольнения
		|ГДЕ
		|	ОснованияУвольнения.Наименование = ""Статья 57 п. 1 пп. 1)""";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.ТекстОснования = НСтр("ru = 'При отзыве местными исполнительными органами разрешения на привлечение иностранной рабочей силы либо истечении срока действия вида на жительство иностранца в Республике Казахстан или удостоверения лица без гражданства'");
		ОбъектСправочника.ОбменДанными.Загрузка = Истина;
		ОбъектСправочника.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьОснованияУвольненийСтатьи52п1пп24() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОснованияУвольнения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОснованияУвольнения КАК ОснованияУвольнения
		|ГДЕ
		|	ОснованияУвольнения.Наименование = ""Статья 52 п. 1 пп. 24)""";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.ПричинаУвольненияИзОрганизации = Перечисления.ПричиныУвольненияИзОрганизации.ДругиеПричины;
		ОбъектСправочника.ОбменДанными.Загрузка = Истина;
		ОбъектСправочника.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьОснованияУвольненийСтатьи52п1() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОснованияУвольнения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОснованияУвольнения КАК ОснованияУвольнения
		|ГДЕ
		|	ОснованияУвольнения.Наименование В (&МассивСтатей)"; 
    
    МассивСтатей = Новый Массив;
    МассивСтатей.Добавить("Статья 52 п. 1 пп. 8)");
    МассивСтатей.Добавить("Статья 52 п. 1 пп. 9)");
    МассивСтатей.Добавить("Статья 52 п. 1 пп. 10)");
    МассивСтатей.Добавить("Статья 52 п. 1 пп. 11)");
    
    Запрос.УстановитьПараметр("МассивСтатей", МассивСтатей);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.ПричинаУвольненияИзОрганизации = Перечисления.ПричиныУвольненияИзОрганизации.НарушениеТрудовойДисциплины;
		ОбъектСправочника.ОбменДанными.Загрузка = Истина;
		ОбъектСправочника.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли