#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОтражениеВБухучете");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения для формирования проводок в бухгалтерском учете: начисленная 
		// ЗУПК
		|зарплата, соответствующие ей взносы, а также налоги, отчисления и другие удержания.'");
		// ЗУПК
	// ЗУПК
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	// ЗУПК
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОтражениеВБухучетеПоИсточникам");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения для формирования проводок в бухгалтерском учете: начисленная 
		// ЗУПК
		|зарплата, соответствующие ей взносы, а также налоги, отчисления и другие удержания.'");
		// ЗУПК
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли