#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "ФизическиеЛица.ФизическоеЛицо");
	
КонецПроцедуры

// Подсистема "Управление доступом".

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать сумму документа и записать ее в соответствующий реквизит шапки.
	СуммаПоДокументу = НалогиВзносыОтчисления.Итог("НалогВзнос");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		
		МассивВидовПлатежей = Перечисления.ВидыПлатежейВГосБюджет.ВидыНалоговыхПлатежей();
		
		Если НЕ МассивВидовПлатежей.Найти(ВидПлатежа) = Неопределено Тогда
			
			Для Каждого СтрокаВедомости Из НалогиВзносыОтчисления Цикл
				
				Если (НЕ СтрокаВедомости.ВключаетВОСМС
					И НЕ СтрокаВедомости.ВключаетОПВ
					И НЕ СтрокаВедомости.ВключаетИПН
					И НЕ СтрокаВедомости.ВключаетСО
					И НЕ СтрокаВедомости.ВключаетООСМС
					И НЕ СтрокаВедомости.ВключаетОПВР) Тогда
					
					Отказ = Истина;
		
					ТекстСообщения = НСтр("ru='По сотруднику %1 в строке перечисления не отмечены включаемые компоненты единого платежа. При автоматическом заполнении такая ситуация возможна, если компоненты единого платежа не рассчитаны документом окончательного расчета.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаВедомости.ФизическоеЛицо);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаВедомости.СуммаПлатежа) Тогда
					
					Отказ = Истина;
		
					ТекстСообщения = НСтр("ru='По сотруднику %1 в строке перечисления не указана полная сумма единого платежа.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтрокаВедомости.ФизическоеЛицо);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Документы.ВедомостьНаПеречислениеВзносовОтчислений.ПеречислятьПоМесяцуПериода(ПериодРегистрации, ВидНалогаВзносаОтчисления, ВидПлатежа, Организация) Тогда
			
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "НалогиВзносыОтчисления.МесяцПериода");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МожноЗаполнитьНалогиВзносыОтчисления() Экспорт
	
	ПравилаПроверки = Новый Структура;
	
	ПравилаПроверки.Вставить("Организация",					НСтр("ru='Не выбрана организация'"));
	ПравилаПроверки.Вставить("ПериодРегистрации",			НСтр("ru='Не задан период регистрации'"));
	ПравилаПроверки.Вставить("Дата",						НСтр("ru='Не задана дата документа'"));
	ПравилаПроверки.Вставить("ВидНалогаВзносаОтчисления",	НСтр("ru='Не указан вид взноса, отчисления'"));
	ПравилаПроверки.Вставить("ВидПлатежа",					НСтр("ru='Не указан вид платежа'"));
	
	Возврат	ЗарплатаКадры.СвойстваЗаполнены(ЭтотОбъект, ПравилаПроверки);

КонецФункции

#Область ПроцедурыИФункцииЗаполненияДокумента

Процедура ЗаполнитьНалогиВзносыОтчисления() Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Отбираем сотрудников в соответствии с реквизитами шапки ведомости.
	СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц, ЭтотОбъект);
	
	// Получаем взносы и отчисления для отобранных сотрудников.
	ПараметрыПолученияНалоговВзносовОтчислений = ПараметрыПолученияНалоговВзносовОтчисленийКВыплатеВедомости(ЭтотОбъект);
	
	СоздатьВТНалогиВзносыКВыплате(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияНалоговВзносовОтчислений, "ВТСотрудникиДляВедомости");

	СоздатьВТПериодыОплатыМедицинскогоСтрахования(МенеджерВременныхТаблиц, ПараметрыПолученияНалоговВзносовОтчислений);
	
	// Получаем кадровые данные сотрудников с полями для сортировки. 	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, "ВТСотрудникиДляВедомости");
	КадровыеДанные = "";
	ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	ОтборПоПодразделению = Ложь;
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") 
			 И ЗначениеЗаполнено(Подразделение) Тогда
		ОтборПоПодразделению = Истина;
	КонецЕсли;
	
	// Формируем отсортированные налоги, взносы, отчисления сотрудников к выплате.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	НалогиВзносыОтчисления.НалогВзнос КАК НалогВзнос,
	|	НалогиВзносыОтчисления.СуммаПлатежа КАК СуммаПлатежа,
	|	НалогиВзносыОтчисления.ВключаетОПВ КАК ВключаетОПВ,
	|	НалогиВзносыОтчисления.ВключаетВОСМС КАК ВключаетВОСМС,
	|	НалогиВзносыОтчисления.ВключаетИПН КАК ВключаетИПН,
	|	НалогиВзносыОтчисления.ВключаетСО КАК ВключаетСО,
	|	НалогиВзносыОтчисления.ВключаетООСМС КАК ВключаетООСМС,
	|	НалогиВзносыОтчисления.ВключаетОПВР КАК ВключаетОПВР,
	|	НалогиВзносыОтчисления.МесяцПериода КАК МесяцПериода,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.ВидДохода КАК ВидДохода,
	|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|		ПО (НалогиВзносыОтчисления.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	НалогиВзносыОтчисленияПрочиеФизЛица.НалогВзнос,
	|	0,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВключаетОПВ,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВключаетВОСМС,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВключаетИПН,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВключаетСО,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВключаетООСМС,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВключаетОПВР,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.МесяцПериода КАК МесяцПериода,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВидДохода,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТНалогиВзносыОтчисленияПрочиеФизЛица КАК НалогиВзносыОтчисленияПрочиеФизЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК Сотрудники
	|		ПО НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|ГДЕ
	|	&ОтборПоПодразделению = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОтборПоПодразделению",ОтборПоПодразделению);
	
	ЗарплатаКадры.ДополнитьТекстЗапросаУпорядочиваниемСотрудниковПоВТСДаннымиПорядка(Запрос, "Сотрудники");	
	
	НалогиВзносыОтчисленияОстатки = Запрос.Выполнить().Выгрузить();

	ПериодыОплатыМедицинскогоСтрахования = ПолучитьПериодыОплатыМедицинскогоСтрахования(МенеджерВременныхТаблиц);
	
	ЗаполнитьПоТаблицеНалогиВзносы(ЭтотОбъект, НалогиВзносыОтчисленияОстатки, ПериодыОплатыМедицинскогоСтрахования);
	
КонецПроцедуры

Процедура СоздатьВТСотрудникиДляВедомостиПоШапке(МенеджерВременныхТаблиц, Ведомость, ИмяВТСотрудники = "") Экспорт
	
	// Отбор сотрудников по организации и подразделению.
	СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц, Ведомость, ИмяВТСотрудники);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаДляКадровыхДанных", Ведомость.Дата);
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	&ДатаДляКадровыхДанных КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиДляВедомости
	|ИЗ
	|	#ВТСотрудники КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ #ВТСотрудники";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
	
	Запрос.Выполнить();
	
КонецПроцедуры	

Процедура СоздатьВТСотрудникиДляВедомостиПоМестуРаботы(МенеджерВременныхТаблиц, Ведомость, ИмяВТСотрудники)
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников, Ведомость);

	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиПоМестуРаботыПоШапкеВедомости");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// при отборе по подразделениям	берем относящихся к нему на конец периода
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") 
			 И ЗначениеЗаполнено(Ведомость.Подразделение) Тогда
		ОтборПоПодразделению = Истина;
		Запрос.УстановитьПараметр("Подразделение", Ведомость.Подразделение);
		Запрос.УстановитьПараметр("ОтборПоПодразделению", Истина);
		
		// КадровыйУчет.СоздатьВТСотрудникиОрганизации возвращает всех сотрудников, работавших когда-либо
		// по переданному в параметрах подразделению. Сотрудники, работающие по договорам ГПХ
		// возвращаются без указания подразделения.
		// Поэтому необходимо дополнить сотрудников ГПХ подразделением и отобрать тех сотрудников,
		// которые работают в нужном подразделении на конец периода.
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТСотрудникиОрганизацииПоДоговорамГПХ.Сотрудник КАК Сотрудник,
		|	&НачалоПериода КАК НачалоПериода,
		|	&ОкончаниеПериода КАК ОкончаниеПериода
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК ВТСотрудникиОрганизацииПоДоговорамГПХ
		|ГДЕ
		|	ВТСотрудникиОрганизацииПоДоговорамГПХ.Подразделение ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("НачалоПериода", ПараметрыПолученияСотрудников.НачалоПериода);
		Запрос.УстановитьПараметр("ОкончаниеПериода", ПараметрыПолученияСотрудников.ОкончаниеПериода);
		Запрос.Выполнить();
		
		ПараметрыПоВременнойТаблице = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(
			"ВТСотрудникиПериоды", "Сотрудник", "НачалоПериода", "ОкончаниеПериода");
		ПараметрыПоВременнойТаблице.РаботникиПоДоговорамГПХ = Истина;
		ПараметрыПоВременнойТаблице.РаботникиПоТрудовымДоговорам = Неопределено;
		
		КадровыйУчет.СоздатьВТРабочиеМестаСотрудниковПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц, Ложь, 
			ПараметрыПоВременнойТаблице, "ВТРабочиеМестаСотрудниковГПХ");
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПоМестуРаботыПоШапкеВедомости.Сотрудник КАК Сотрудник,
		|	СотрудникиПоМестуРаботыПоШапкеВедомости.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫБОР
		|		КОГДА СотрудникиПоМестуРаботыПоШапкеВедомости.Подразделение ЕСТЬ NULL
		|			ТОГДА РабочиеМестаСотрудниковГПХ.Подразделение
		|		ИНАЧЕ СотрудникиПоМестуРаботыПоШапкеВедомости.Подразделение
		|	КОНЕЦ КАК Подразделение,
		|	NULL КАК ВидЗанятости
		|ПОМЕСТИТЬ ВТСотрудникиПоМестуРаботыСГПХ
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК СотрудникиПоМестуРаботыПоШапкеВедомости
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМестаСотрудниковГПХ КАК РабочиеМестаСотрудниковГПХ
		|		ПО СотрудникиПоМестуРаботыПоШапкеВедомости.Сотрудник = РабочиеМестаСотрудниковГПХ.Сотрудник
		|			И СотрудникиПоМестуРаботыПоШапкеВедомости.ФизическоеЛицо = РабочиеМестаСотрудниковГПХ.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСотрудникиПериоды
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТРабочиеМестаСотрудниковГПХ";
		
		Запрос.Выполнить();
		
		ИмяВТДоговорникиПоМестуРаботы = "ВТСотрудникиПоМестуРаботыСГПХ";
	Иначе
		Запрос.УстановитьПараметр("Подразделение", Ведомость.Подразделение);
		Запрос.УстановитьПараметр("ОтборПоПодразделению", Ложь);
		
		ИмяВТДоговорникиПоМестуРаботы = "ВТСотрудникиПоМестуРаботыПоШапкеВедомости";
	КонецЕсли;
	
	Запрос.Текст = 
		 "ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.Организация КАК Организация,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСотрудникиОсновныеМестаРаботы
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	ВЫБОР
		|		КОГДА Сотрудники.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА 3
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|					ТОГДА 2
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|	КОНЕЦ КАК ПриоритетСостояния,
		|	ВЫБОР
		|		КОГДА Сотрудники.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|			ТОГДА Сотрудники.ДатаУвольнения
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТСотрудникиПоПриоритетам
		|ИЗ
		|	ВТСотрудникиПоМестуРаботыПоШапкеВедомости КАК Сотрудники
		// исключим внутренних совместителей в рамках одной организации
		// записи с внутренними совместителями филиала остануться
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОсновныеМестаРаботы КАК СотрудникиОсновныеМестаРаботы
		|		ПО Сотрудники.ФизическоеЛицо = СотрудникиОсновныеМестаРаботы.ФизическоеЛицо
		|			И Сотрудники.Организация = СотрудникиОсновныеМестаРаботы.Организация
		|ГДЕ
		|	(НЕ &ОтборПоПодразделению
		|				И Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|			ИЛИ &ОтборПоПодразделению
		|				И Сотрудники.Подразделение В ИЕРАРХИИ (&Подразделение)
		|				И (Сотрудники.ВидЗанятости В (ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы), ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство))
		|					ИЛИ Сотрудники.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)
		|						И СотрудникиОсновныеМестаРаботы.Сотрудник ЕСТЬ NULL))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		// если несколько разных договорников в рамках подразделений выберем по одному
		|	МАКСИМУМ(Сотрудники.Сотрудник) КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение,
		|	1 КАК ПриоритетСостояния,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаУвольнения
		|ИЗ
		|	#ВТДоговорникиПоМестуРаботы КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ВидЗанятости ЕСТЬ NULL 
		|	И (НЕ &ОтборПоПодразделению
		|			ИЛИ &ОтборПоПодразделению
		|				И Сотрудники.Подразделение В ИЕРАРХИИ (&Подразделение))
		|	И НЕ Сотрудники.ФизическоеЛицо В
		|				(ВЫБРАТЬ
		|					ВТСотрудникиПринятыеНаРаботу.ФизическоеЛицо
		|				ИЗ
		|					ВТСотрудникиОсновныеМестаРаботы КАК ВТСотрудникиПринятыеНаРаботу)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.ФизическоеЛицо,
		|	Сотрудники.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо,
		|	МИНИМУМ(ВТСотрудникиПоПриоритетам.ПриоритетСостояния) КАК ПриоритетСостояния,
		|	МАКСИМУМ(ВТСотрудникиПоПриоритетам.ДатаУвольнения) КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТПриоритеты
		|ИЗ
		|	ВТСотрудникиПоПриоритетам КАК ВТСотрудникиПоПриоритетам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиПоПриоритетам.Сотрудник,
		|	ВТСотрудникиПоПриоритетам.ФизическоеЛицо,
		|	ВТСотрудникиПоПриоритетам.Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиАктуальные
		|ИЗ
		|	ВТСотрудникиПоПриоритетам КАК ВТСотрудникиПоПриоритетам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПриоритеты КАК ВТПриоритеты
		|		ПО ВТСотрудникиПоПриоритетам.ФизическоеЛицо = ВТПриоритеты.ФизическоеЛицо
		|			И ВТСотрудникиПоПриоритетам.ПриоритетСостояния = ВТПриоритеты.ПриоритетСостояния
		|			И (ВЫБОР
		|				КОГДА ВТСотрудникиПоПриоритетам.ПриоритетСостояния = 3
		|					ТОГДА ВТСотрудникиПоПриоритетам.ДатаУвольнения = ВТПриоритеты.ДатаУвольнения
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТДоговорникиПоМестуРаботы", ИмяВТДоговорникиПоМестуРаботы);
		
	Запрос.Выполнить();	
		
	ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиАктуальные";
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТСотрудникиАктуальные";
	// при отборе по подразделениям	берем относящихся к нему на конец периода
	Если ЗначениеЗаполнено(ПараметрыПолученияСотрудников.Подразделение) Тогда
		
		Запрос.УстановитьПараметр("Подразделение", ПараметрыПолученияСотрудников.Подразделение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТСотрудникиОтносящиесяКПодразделению
		|ИЗ
		|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Подразделение В ИЕРАРХИИ(&Подразделение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
		
		Запрос.Выполнить();

		ИмяВТСотрудникиПоМестуРаботы = "ВТСотрудникиОтносящиесяКПодразделению";
		
	КонецЕсли;	
	
	// если передан список сотрудников, берем только присутствующих в нем
	Если ЗначениеЗаполнено(ИмяВТСотрудники) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТВходящиеСотрудникиПоМестуРаботы
		|ИЗ
		|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТСотрудники КАК ВходящиеСотрудники
		|		ПО Сотрудники.Сотрудник = ВходящиеСотрудники.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ #ВТСотрудники";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
		
		Запрос.Выполнить();

		ИмяВТСотрудникиПоМестуРаботы = "ВТВходящиеСотрудникиПоМестуРаботы";
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Подразделение
	|ПОМЕСТИТЬ ВТСотрудникиПоМестуРаботы
	|ИЗ
	|	#ВТСотрудникиПоМестуРаботы КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ #ВТСотрудникиПоМестуРаботы";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудникиПоМестуРаботы", ИмяВТСотрудникиПоМестуРаботы);
	
	Запрос.Выполнить();
	
	ИмяВТСотрудники = "ВТСотрудникиПоМестуРаботы"
	
КонецПроцедуры	

Процедура СоздатьВТПериодыОплатыМедицинскогоСтрахования(МенеджерВременныхТаблиц, Параметры)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	УничтожитьВТ = Новый Массив;
	
	Если Параметры.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.ПениАкт
		ИЛИ Параметры.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.ПениСам Тогда
			
		Возврат;
		
	КонецЕсли;
	
	Если НЕ Документы.ВедомостьНаПеречислениеВзносовОтчислений.ПеречислятьПоМесяцуПериода(ПериодРегистрации, ВидНалогаВзносаОтчисления, ВидПлатежа, Организация) Тогда
			
		Возврат;
		
	КонецЕсли;
	
	ПоЗадолженностиЗаМесяц = (СпособРасчетаСуммКПеречислению = Перечисления.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений.ПоЗадолженностиЗаМесяц);

	Если НЕ ПоЗадолженностиЗаМесяц Тогда
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	МИНИМУМ(НалогиВзносыОтчисления.МесяцНалоговогоПериода) КАК МинимумМесяцНалоговогоПериода,
			|	МАКСИМУМ(НалогиВзносыОтчисления.МесяцНалоговогоПериода) КАК МаксимумМесяцНалоговогоПериода
			|ИЗ
			|	ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
			|";
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаРезультата = РезультатЗапроса.Выбрать();
		
		Если ВыборкаРезультата.Следующий() Тогда
			
			Если ВыборкаРезультата.МинимумМесяцНалоговогоПериода = NULL Тогда
				Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.ПериодРегистрации));
				Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.ПериодРегистрации));
			Иначе
				Запрос.УстановитьПараметр("НачалоПериода", ВыборкаРезультата.МинимумМесяцНалоговогоПериода);
				Запрос.УстановитьПараметр("КонецПериода", ВыборкаРезультата.МаксимумМесяцНалоговогоПериода);
			КонецЕсли;
			
		Иначе
			
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.ПериодРегистрации));
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.ПериодРегистрации));
			
		КонецЕсли;
		
	Иначе
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.ПериодРегистрации));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.ПериодРегистрации));
	
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПериодыОплатыДляМедицинскогоСтрахования.ПериодРегистрации КАК ПериодРегистрации,
	               |	ПериодыОплатыДляМедицинскогоСтрахования.Организация КАК Организация,
	               |	ПериодыОплатыДляМедицинскогоСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	НАЧАЛОПЕРИОДА(ПериодыОплатыДляМедицинскогоСтрахования.МесяцСобытия, МЕСЯЦ) КАК МесяцСобытия,
	               |	МАКСИМУМ(ПериодыОплатыДляМедицинскогоСтрахования.УчитываемыеДниСобытия) КАК УчитываемыеДниСобытия,
	               |	МАКСИМУМ(ПериодыОплатыДляМедицинскогоСтрахования.УчитываемыеДниПериода) КАК УчитываемыеДниПериода,
	               |	СУММА(ПериодыОплатыДляМедицинскогоСтрахования.СуммаСобытия) КАК СуммаСобытия
	               |ПОМЕСТИТЬ ВТДанныеПериодовОплатыМедстрахования
	               |ИЗ
	               |	ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПериодыОплатыДляМедицинскогоСтрахования КАК ПериодыОплатыДляМедицинскогоСтрахования
	               |		ПО НалогиВзносыОтчисления.МесяцНалоговогоПериода = ПериодыОплатыДляМедицинскогоСтрахования.ПериодРегистрации
	               |			И НалогиВзносыОтчисления.ФизическоеЛицо = ПериодыОплатыДляМедицинскогоСтрахования.ФизическоеЛицо
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПериодыОплатыДляМедицинскогоСтрахования.ПериодРегистрации,
				   |	НАЧАЛОПЕРИОДА(ПериодыОплатыДляМедицинскогоСтрахования.МесяцСобытия, МЕСЯЦ),
	               |	ПериодыОплатыДляМедицинскогоСтрахования.Организация,
	               |	ПериодыОплатыДляМедицинскогоСтрахования.ФизическоеЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ПериодМесяц КАК ПериодРегистрации,
	               |	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.Организация КАК Организация,
	               |	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты.ОблагаемыйДоходОборот КАК ОблагаемыйДоход
	               |ПОМЕСТИТЬ ВТДанныеОблагаемогоДоходаПоВидуОСМС
	               |ИЗ
	               |	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Авто,
	               |			(ФизическоеЛицо, Организация) В
	               |					(ВЫБРАТЬ
	               |						ДанныеПериодовОплатыМедстрахования.ФизическоеЛицо,
	               |						ДанныеПериодовОплатыМедстрахования.Организация
	               |					ИЗ
	               |						ВТДанныеПериодовОплатыМедстрахования КАК ДанныеПериодовОплатыМедстрахования)
	               |				И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
	               |				И ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходов.ДоходыОтРаботодателя)) КАК СведенияОбИсчисленииНалоговВзносовОтчисленийОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДанныеПериодовОплатыМедстрахования.ПериодРегистрации КАК ПериодРегистрации,
	               |	ДанныеПериодовОплатыМедстрахования.Организация КАК Организация,
	               |	ДанныеПериодовОплатыМедстрахования.МесяцСобытия КАК МесяцСобытия,
	               |	ДанныеПериодовОплатыМедстрахования.УчитываемыеДниСобытия КАК УчитываемыеДниСобытия,
	               |	ДанныеПериодовОплатыМедстрахования.УчитываемыеДниПериода КАК УчитываемыеДниПериода,
	               |	ДанныеПериодовОплатыМедстрахования.СуммаСобытия КАК СуммаСобытия,
	               |	ДанныеПериодовОплатыМедстрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ЕСТЬNULL(ДанныеОблагаемогоДоходаПоВидуОСМС.ОблагаемыйДоход, 0) КАК ОблагаемыйДоход
	               |ПОМЕСТИТЬ ВТДанныеПериодаДействияДляМедицинскогоСтрахования
	               |ИЗ
	               |	ВТДанныеПериодовОплатыМедстрахования КАК ДанныеПериодовОплатыМедстрахования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОблагаемогоДоходаПоВидуОСМС КАК ДанныеОблагаемогоДоходаПоВидуОСМС
	               |		ПО ДанныеПериодовОплатыМедстрахования.Организация = ДанныеОблагаемогоДоходаПоВидуОСМС.Организация
	               |			И ДанныеПериодовОплатыМедстрахования.ПериодРегистрации = ДанныеОблагаемогоДоходаПоВидуОСМС.ПериодРегистрации
	               |			И ДанныеПериодовОплатыМедстрахования.ФизическоеЛицо = ДанныеОблагаемогоДоходаПоВидуОСМС.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", Параметры.ВидНалогаВзносаОтчисления);	
	Запрос.УстановитьПараметр("ПериодРегистрации", Параметры.ПериодРегистрации);	
	
	Запрос.Выполнить();	
	
	УничтожитьВТ.Добавить("ВТДанныеПериодовОплатыМедстрахования");
	УничтожитьВТ.Добавить("ВТДанныеОблагаемогоДоходаПоВидуОСМС");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры
	
Процедура СоздатьВТНалогиВзносыКВыплате(МенеджерВременныхТаблиц, ТолькоРазрешенные, Параметры, ИмяВТСотрудники) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УничтожитьВТ = Новый Массив;
	
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", Параметры.ПериодРегистрации);
	Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", Параметры.ВидНалогаВзносаОтчисления);
    Запрос.УстановитьПараметр("ВидДохода",  Параметры.ВидДохода);
    Запрос.УстановитьПараметр("ВидПлатежа", Параметры.ВидПлатежа);
	
	Запрос.УстановитьПараметр("ВидыПлатежейПени", Перечисления.ВидыПлатежейВГосБюджет.ВидыПениПлатежей());
	
	ПоЗадолженностиЗаМесяц = (СпособРасчетаСуммКПеречислению = Перечисления.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений.ПоЗадолженностиЗаМесяц);

	КонецПериодаГраница = Новый Граница(Макс(?(ЗначениеЗаполнено(Параметры.Дата), Параметры.Дата, ТекущаяДатаСеанса()), КонецМесяца(Параметры.ПериодРегистрации)));	
	
	Запрос.УстановитьПараметр("КонецПериодаГраница", КонецПериодаГраница);

	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалогиВзносыОтчисленияОстатки.Организация,
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане,
    |   НалогиВзносыОтчисленияОстатки.ВидДохода,
	|	СУММА(НалогиВзносыОтчисленияОстатки.НалогВзносОстаток) КАК НалогВзнос,
	|	0 КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВТНалогиВзносыОтчисленияОстатки
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И ФизическоеЛицо В
	|					(ВЫБРАТЬ
	|						Сотрудники.ФизическоеЛицо
	|					ИЗ
	|						#ВТСотрудники КАК Сотрудники)
	|				И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
    |               И ВидДохода = &ВидДохода
	|				" + ?(ПоЗадолженностиЗаМесяц, "
	|				И МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)", "
	|				И МесяцНалоговогоПериода <= КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)") + "
	|				И ВидПлатежа = &ВидПлатежа) КАК НалогиВзносыОтчисленияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыОтчисленияОстатки.Организация,
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода,
    |   НалогиВзносыОтчисленияОстатки.ВидДохода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
    Если Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП
        ИЛИ Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС
        ИЛИ Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВР
        ИЛИ Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ Тогда
	   Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидДохода = &ВидДохода", "");                         
    КонецЕсли;
	Запрос.Выполнить();
	
	Если Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЧНалогиВзносыОтчисления.Организация КАК Организация,
		|	ТЧНалогиВзносыОтчисления.МесяцНалоговогоПериода КАК Период
		|ПОМЕСТИТЬ ВТДатыПоМесяцам
		|ИЗ
		|	ВТНалогиВзносыОтчисленияОстатки КАК ТЧНалогиВзносыОтчисления
		|";
		
		Запрос.Выполнить();
		
		УчетНалоговВзносовОтчислений.СоздатьВТСтавкиНалоговВзносовПоПериодам(Организация, МенеджерВременныхТаблиц);

		Если НЕ ПоЗадолженностиЗаМесяц Тогда
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	МИНИМУМ(НалогиВзносыОтчисления.МесяцНалоговогоПериода) КАК МинимумМесяцНалоговогоПериода,
				|	МАКСИМУМ(НалогиВзносыОтчисления.МесяцНалоговогоПериода) КАК МаксимумМесяцНалоговогоПериода
				|ИЗ
				|	ВТНалогиВзносыОтчисленияОстатки КАК НалогиВзносыОтчисления
				|";
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаРезультата = РезультатЗапроса.Выбрать();
			
			Если ВыборкаРезультата.Следующий() Тогда
				
				Если ВыборкаРезультата.МинимумМесяцНалоговогоПериода = NULL Тогда
					Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.ПериодРегистрации));
					Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.ПериодРегистрации));
				Иначе
					Запрос.УстановитьПараметр("НачалоПериода", ВыборкаРезультата.МинимумМесяцНалоговогоПериода);
					Запрос.УстановитьПараметр("КонецПериода", ВыборкаРезультата.МаксимумМесяцНалоговогоПериода);
				КонецЕсли;
				
			Иначе
				
				Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.ПериодРегистрации));
				Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.ПериодРегистрации));
				
			КонецЕсли;
			
		Иначе
			
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Параметры.ПериодРегистрации));
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.ПериодРегистрации));
		
		КонецЕсли;

		Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", Перечисления.ВидыНалоговВзносовОтчислений.ЕП);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.ПериодРегистрации,
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.РегистрацияВНалоговомОргане,
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
			|	0 КАК НалогВзнос,
			|	СУММА(СведенияОбИсчисленииНалоговВзносовОтчислений.ОбъектИсчисленияОборот * ЕСТЬNULL(ВТСтавки.Ставка, 0)) КАК СуммаПлатежа
			|ПОМЕСТИТЬ ВТСведенияОбИсчисленииНалоговВзносовОтчислений
			|ИЗ
			|	РегистрНакопления.СведенияОбИсчисленииНалоговВзносовОтчислений.Обороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			Месяц,
			|			Организация = &Организация
			|				И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
			|				И ФизическоеЛицо В
			|					(ВЫБРАТЬ
			|						Сотрудники.ФизическоеЛицо
			|					ИЗ
			|						#ВТСотрудники КАК Сотрудники)) КАК СведенияОбИсчисленииНалоговВзносовОтчислений
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавки КАК ВТСтавки
			|	ПО ВТСтавки.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
			|		И СведенияОбИсчисленииНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговВзносовОтчислений.ЕП)
			|		И СведенияОбИсчисленииНалоговВзносовОтчислений.ПериодРегистрации = ВТСтавки.МесяцНалоговогоПериода
			|
			|СГРУППИРОВАТЬ ПО
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо,
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.ВидДохода,
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.ПериодРегистрации,
			|	СведенияОбИсчисленииНалоговВзносовОтчислений.РегистрацияВНалоговомОргане
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВТКомпонентыЕПГруппировка.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВТКомпонентыЕПГруппировка.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|	ВТКомпонентыЕПГруппировка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	ВЫБОР
			|		КОГДА ВТКомпонентыЕПГруппировка.ОПВ > 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВключаетОПВ,
			|	ВЫБОР
			|		КОГДА ВТКомпонентыЕПГруппировка.ВОСМС > 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВключаетВОСМС,
			|	ВЫБОР
			|		КОГДА ВТКомпонентыЕПГруппировка.ИПН > 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВключаетИПН,
			|	ВЫБОР
			|		КОГДА ВТКомпонентыЕПГруппировка.СО > 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВключаетСО,
			|	ВЫБОР
			|		КОГДА ВТКомпонентыЕПГруппировка.ООСМС > 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВключаетООСМС,
			|	ВЫБОР
			|		КОГДА ВТКомпонентыЕПГруппировка.ОПВР > 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВключаетОПВР
			|ПОМЕСТИТЬ ВТЕПКомпоненты
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕПКомпоненты.ФизическоеЛицо КАК ФизическоеЛицо,
			|		ЕПКомпоненты.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|		ЕПКомпоненты.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|		СУММА(ЕПКомпоненты.ОПВОборот) КАК ОПВ,
			|		СУММА(ЕПКомпоненты.ВОСМСОборот) КАК ВОСМС,
			|		СУММА(ЕПКомпоненты.ИПНОборот) КАК ИПН,
			|		СУММА(ЕПКомпоненты.ООСМСОборот) КАК ООСМС,
			|		СУММА(ЕПКомпоненты.СООборот) КАК СО,
			|		СУММА(ЕПКомпоненты.ОПВРОборот) КАК ОПВР
			|	ИЗ
			|		РегистрНакопления.ЕПКомпоненты.Обороты(
			|				,
			|				&КонецПериода,
			|				Месяц,
			|				Организация = &Организация
			|					И (МесяцНалоговогоПериода МЕЖДУ &НачалоПериода И &КонецПериода)
			|					И НЕ &ВидПлатежа В (&ВидыПлатежейПени) 
			|					И ФизическоеЛицо В
			|						(ВЫБРАТЬ
			|							Сотрудники.ФизическоеЛицо
			|						ИЗ
			|							#ВТСотрудники КАК Сотрудники)) КАК ЕПКомпоненты
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ЕПКомпоненты.ФизическоеЛицо,
			|		ЕПКомпоненты.МесяцНалоговогоПериода,
			|		ЕПКомпоненты.РегистрацияВНалоговомОргане) КАК ВТКомпонентыЕПГруппировка			
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцПериода,
			|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|	НалогиВзносыОтчисления.ВидДохода КАК ВидДохода,
			|	МАКСИМУМ(НалогиВзносыОтчисления.РегистрацияВНалоговомОргане) КАК РегистрацияВНалоговомОргане,
			|	МАКСИМУМ(НалогиВзносыОтчисления.НалогВзнос) КАК НалогВзнос,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА &ВидПлатежа В (&ВидыПлатежейПени)
			|				ТОГДА ЕСТЬNULL(НалогиВзносыОтчисления.НалогВзнос, 0)
			|			ИНАЧЕ ЕСТЬNULL(СведенияОбИсчисленииНалоговВзносовОтчислений.СуммаПлатежа, 0)
			|		КОНЕЦ) КАК СуммаПлатежа,
			|	МАКСИМУМ(ЕСТЬNULL(ЕПКомпоненты.ВключаетОПВ, ЛОЖЬ) 
			|			ИЛИ &ВидПлатежа В (&ВидыПлатежейПени)) КАК ВключаетОПВ,
			|	МАКСИМУМ(ЕСТЬNULL(ЕПКомпоненты.ВключаетВОСМС, ЛОЖЬ)
			|			ИЛИ &ВидПлатежа В (&ВидыПлатежейПени))  КАК ВключаетВОСМС,
			|	МАКСИМУМ(ЕСТЬNULL(ЕПКомпоненты.ВключаетИПН, ЛОЖЬ)
			|			ИЛИ &ВидПлатежа В (&ВидыПлатежейПени)) КАК ВключаетИПН,
			|	МАКСИМУМ(ЕСТЬNULL(ЕПКомпоненты.ВключаетСО, ЛОЖЬ)
			|			ИЛИ &ВидПлатежа В (&ВидыПлатежейПени)) КАК ВключаетСО,
			|	МАКСИМУМ(ЕСТЬNULL(ЕПКомпоненты.ВключаетООСМС, ЛОЖЬ)
			|			ИЛИ &ВидПлатежа В (&ВидыПлатежейПени)) КАК ВключаетООСМС,
			|	МАКСИМУМ(ЕСТЬNULL(ЕПКомпоненты.ВключаетОПВР, ЛОЖЬ)
			|			ИЛИ (&ВидПлатежа В (&ВидыПлатежейПени) 
			|				И &ПериодРегистрации >= ДАТАВРЕМЯ(2024,1,1))) КАК ВключаетОПВР
			|ПОМЕСТИТЬ ВТНалогиВзносыОтчисления
			|ИЗ
			|	ВТНалогиВзносыОтчисленияОстатки КАК НалогиВзносыОтчисления
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОбИсчисленииНалоговВзносовОтчислений КАК СведенияОбИсчисленииНалоговВзносовОтчислений
			|	ПО НалогиВзносыОтчисления.ФизическоеЛицо = СведенияОбИсчисленииНалоговВзносовОтчислений.ФизическоеЛицо
			|   	И НалогиВзносыОтчисления.МесяцНалоговогоПериода = СведенияОбИсчисленииНалоговВзносовОтчислений.ПериодРегистрации
			|       И НалогиВзносыОтчисления.РегистрацияВНалоговомОргане = СведенияОбИсчисленииНалоговВзносовОтчислений.РегистрацияВНалоговомОргане
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЕПКомпоненты КАК ЕПКомпоненты
			|	ПО НалогиВзносыОтчисления.ФизическоеЛицо = ЕПКомпоненты.ФизическоеЛицо
			|   	И НалогиВзносыОтчисления.МесяцНалоговогоПериода = ЕПКомпоненты.МесяцНалоговогоПериода
			|       И (НалогиВзносыОтчисления.РегистрацияВНалоговомОргане = ЕПКомпоненты.РегистрацияВНалоговомОргане
			// для сумм СО и ООСМС
			|       	ИЛИ ЕПКомпоненты.РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка))
			|
			|СГРУППИРОВАТЬ ПО
			|	НалогиВзносыОтчисления.ФизическоеЛицо,
   			|	НалогиВзносыОтчисления.ВидДохода,
			|	НалогиВзносыОтчисления.МесяцНалоговогоПериода
			|";
		
		УничтожитьВТ.Добавить("ВТСведенияОбИсчисленииНалоговВзносовОтчислений");
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
			|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцПериода,
			|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
			|	НалогиВзносыОтчисления.ВидДохода КАК ВидДохода,
			|	НалогиВзносыОтчисления.НалогВзнос КАК НалогВзнос,
			|	0 КАК СуммаПлатежа,
			|	ЛОЖЬ КАК ВключаетОПВ,
			|	ЛОЖЬ КАК ВключаетВОСМС,
			|	ЛОЖЬ КАК ВключаетИПН,
			|	ЛОЖЬ КАК ВключаетСО,
			|	ЛОЖЬ КАК ВключаетООСМС,
			|	ЛОЖЬ КАК ВключаетОПВР
			|ПОМЕСТИТЬ ВТНалогиВзносыОтчисления
			|ИЗ
			|	ВТНалогиВзносыОтчисленияОстатки КАК НалогиВзносыОтчисления";

	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст  + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода КАК МесяцПериода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогиВзносыОтчисленияОстатки.ВидДохода КАК ВидДохода,
	|	СУММА(НалогиВзносыОтчисленияОстатки.НалогВзносОстаток) КАК НалогВзнос
	|ПОМЕСТИТЬ ВТНалогиВзносыОтчисленияПрочиеФизЛицаОстатки
	|ИЗ
	|	РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Остатки(
	|			&КонецПериодаГраница,
	|			Организация = &Организация
	|				И НЕ ФизическоеЛицо В
	|						(ВЫБРАТЬ
	|							Т.ФизическоеЛицо
	|						ИЗ
	|							ВТНалогиВзносыОтчисления КАК Т)
	|				И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
    |               И ВидДохода = &ВидДохода
	|				" + ?(ПоЗадолженностиЗаМесяц, "
	|				И МесяцНалоговогоПериода МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)", "
	|				И МесяцНалоговогоПериода <= КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)") + "
	|				И ВидПлатежа = &ВидПлатежа) КАК НалогиВзносыОтчисленияОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НалогиВзносыОтчисленияОстатки.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияОстатки.МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисленияОстатки.ВидДохода,
	|	НалогиВзносыОтчисленияОстатки.РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыОтчисления.МесяцНалоговогоПериода КАК МесяцПериода,
	|	НалогиВзносыОтчисления.ВидДохода КАК ВидДохода,
	|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	НалогиВзносыОтчисления.НалогВзнос КАК НалогВзнос,
	|	0 КАК СуммаПлатежа,
	|	ЛОЖЬ КАК ВключаетОПВ,
	|	ЛОЖЬ КАК ВключаетВОСМС,
	|	ЛОЖЬ КАК ВключаетИПН,
	|	ЛОЖЬ КАК ВключаетСО,
	|	ЛОЖЬ КАК ВключаетООСМС,
	|	ЛОЖЬ КАК ВключаетОПВР
	|ПОМЕСТИТЬ ВТНалогиВзносыОтчисленияПрочиеФизЛица
	|ИЗ
	|	ВТНалогиВзносыОтчисленияПрочиеФизЛицаОстатки КАК НалогиВзносыОтчисления";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТСотрудники", ИмяВТСотрудники);
    Если Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП
        ИЛИ Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС
        ИЛИ Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВР
        ИЛИ Параметры.ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ Тогда
	   Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВидДохода = &ВидДохода", "");                         
    КонецЕсли;

    Запрос.Выполнить();
	
	УничтожитьВТ.Добавить("ВТНалогиВзносыОтчисленияОстатки");
	УничтожитьВТ.Добавить("ВТНалогиВзносыОтчисленияПрочиеФизЛицаОстатки");
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УничтожитьВТ);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников, Ведомость)
	
	ДлинаСуток = 86400;
	
	НачалоПериода 		=   '00010101';
	ОкончаниеПериода	=  КонецМесяца(Ведомость.ПериодРегистрации);
	РаботникиПоДоговорамГПХ = Истина;
	
	ПараметрыПолученияСотрудников.Организация	= Ведомость.Организация;
	// отбор по подразделению осуществляем в запросе, тк необходим анализ совместительства в разных организациях/подразделениях
	ПараметрыПолученияСотрудников.НачалоПериода 	= НачалоПериода;
	ПараметрыПолученияСотрудников.ОкончаниеПериода	= ОкончаниеПериода;
	ПараметрыПолученияСотрудников.РаботникиПоТрудовымДоговорам	= Истина;
	ПараметрыПолученияСотрудников.РаботникиПоДоговорамГПХ		= РаботникиПоДоговорамГПХ;
	
	ПараметрыПолученияСотрудников.КадровыеДанные = "Подразделение,ВидЗанятости,ВидСобытия,ДатаУвольнения,Организация";	
	
	КадровыйУчетРасширенный.ПрименитьОтборПоФункциональнойОпцииВыполнятьРасчетЗарплатыПоПодразделениям(ПараметрыПолученияСотрудников);
	
КонецПроцедуры

Функция ПараметрыПолученияНалоговВзносовОтчисленийКВыплатеВедомости(Ведомость) Экспорт
		
	ПараметрыПолученияНалоговВзносовОтчислений = Новый Структура;
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("Организация",				Справочники.Организации.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("Подразделение",			Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ВидНалогаВзносаОтчисления",Перечисления.ВидыНалоговВзносовОтчислений.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ВидДохода",                Справочники.ВидыДоходов.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ВидПлатежа",				Перечисления.ВидыПлатежейВГосБюджет.ПустаяСсылка());
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ПериодРегистрации",		Дата(1,1,1));
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("Дата",						Дата(1,1,1));
	ПараметрыПолученияНалоговВзносовОтчислений.Вставить("ИгнорируемыеРегистраторы",	Новый Массив);
	
	ПараметрыПолученияНалоговВзносовОтчислений.Организация				= Ведомость.Организация;
	ПараметрыПолученияНалоговВзносовОтчислений.Подразделение			= Ведомость.Подразделение;
	ПараметрыПолученияНалоговВзносовОтчислений.ВидНалогаВзносаОтчисления= Ведомость.ВидНалогаВзносаОтчисления; 
	ПараметрыПолученияНалоговВзносовОтчислений.ВидДохода                = Ведомость.ВидДохода; 
	ПараметрыПолученияНалоговВзносовОтчислений.ВидПлатежа				= Ведомость.ВидПлатежа; 
	ПараметрыПолученияНалоговВзносовОтчислений.ПериодРегистрации		= Ведомость.ПериодРегистрации;
	ПараметрыПолученияНалоговВзносовОтчислений.Дата						= ?(ЗначениеЗаполнено(Ведомость.Ссылка), Ведомость.Дата, ТекущаяДатаСеанса());
	ПараметрыПолученияНалоговВзносовОтчислений.ИгнорируемыеРегистраторы	= Ведомость.Ссылка;

	Возврат ПараметрыПолученияНалоговВзносовОтчислений;
	
КонецФункции
	
Процедура ЗаполнитьПоТаблицеНалогиВзносы(Ведомость, ТаблицаНалогиВзносы, ПериодыОплатыМедицинскогоСтрахования) Экспорт
	
	Если Документы.ВедомостьНаПеречислениеВзносовОтчислений.ПеречислятьПоМесяцуПериода(ПериодРегистрации, ВидНалогаВзносаОтчисления, ВидПлатежа, Организация) Тогда

		РаспределитьДанныеМедстрахования(ТаблицаНалогиВзносы, ПериодыОплатыМедицинскогоСтрахования);
			
	Иначе		
		
		Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
			НастройкиОкругления = Новый Структура("ТочностьОкругления,ПравилоОкругления");
			ЗаполнитьНастройкиОкругления(НастройкиОкругления);
			
			Для Каждого СтрокаНаПеречисление Из ТаблицаНалогиВзносы Цикл
				СтрокаНаПеречисление.СуммаПлатежа = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаНаПеречисление.СуммаПлатежа, НастройкиОкругления.ТочностьОкругления, НастройкиОкругления.ПравилоОкругления);
			КонецЦикла;
		КонецЕсли;
		
		НалогиВзносыОтчисления.Загрузить(ТаблицаНалогиВзносы);
		
	КонецЕсли;
	
	// Убираем нулевые строки
	УдаляемыеСтрокиНалогиВзносыОтчисления = Новый Массив;
	
	Для Каждого СтрокаНалогиВзносы Из НалогиВзносыОтчисления Цикл
		Если СтрокаНалогиВзносы.НалогВзнос = 0 Тогда
			УдаляемыеСтрокиНалогиВзносыОтчисления.Добавить(СтрокаНалогиВзносы);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрокаНалогиВзносыОтчисления Из УдаляемыеСтрокиНалогиВзносыОтчисления Цикл
		НалогиВзносыОтчисления.Удалить(УдаляемаяСтрокаНалогиВзносыОтчисления);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьНалогиВзносыОтчисления(ФизическиеЛица) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Отбираем сотрудников по переданным физическим лицам.
	СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица);
	
	// Получаем взносы и отчисления для отобранных сотрудников.
	ПараметрыПолученияНалоговВзносовОтчислений = ПараметрыПолученияНалоговВзносовОтчисленийКВыплатеВедомости(ЭтотОбъект);

	СоздатьВТНалогиВзносыКВыплате(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияНалоговВзносовОтчислений, "ВТСотрудникиДляВедомости");

	СоздатьВТПериодыОплатыМедицинскогоСтрахования(МенеджерВременныхТаблиц, ПараметрыПолученияНалоговВзносовОтчислений);
	
	НастройкиОкругления = Новый Структура("ТочностьОкругления,ПравилоОкругления");
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		ЗаполнитьНастройкиОкругления(НастройкиОкругления);
	КонецЕсли;
	
	ОтборПоПодразделению = Ложь;
	Если ПолучитьФункциональнуюОпцию("ВыполнятьРасчетЗарплатыПоПодразделениям") 
			 И ЗначениеЗаполнено(Подразделение) Тогда
		ОтборПоПодразделению = Истина;
	КонецЕсли;
	
	// Формируем отсортированные налоги, взносы, отчисления сотрудников к выплате.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ВидДохода", ВидДохода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыОтчисления.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.НалогВзнос, 0) КАК НалогВзнос,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.ВидДохода, &ВидДохода) КАК ВидДохода,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.СуммаПлатежа, 0) КАК СуммаПлатежа,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.ВключаетОПВ, ЛОЖЬ) КАК ВключаетОПВ,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.ВключаетВОСМС, ЛОЖЬ) КАК ВключаетВОСМС,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.ВключаетИПН, ЛОЖЬ) КАК ВключаетИПН,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.ВключаетСО, ЛОЖЬ) КАК ВключаетСО,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.ВключаетООСМС, ЛОЖЬ) КАК ВключаетООСМС,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.ВключаетОПВР, ЛОЖЬ) КАК ВключаетОПВР,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.МесяцПериода, &ПериодРегистрации) КАК МесяцПериода,
	|	ЕСТЬNULL(НалогиВзносыОтчисления.МесяцНалоговогоПериода, &ПериодРегистрации) КАК МесяцНалоговогоПериода
	|ИЗ
	|	ВТСотрудникиДляВедомости КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогиВзносыОтчисления КАК НалогиВзносыОтчисления
	|		ПО (НалогиВзносыОтчисления.ФизическоеЛицо = Сотрудники.ФизическоеЛицо)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.РегистрацияВНалоговомОргане,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.НалогВзнос,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ВидДохода,
	|	0 КАК СуммаПлатежа,
	|	ЛОЖЬ КАК ВключаетОПВ,
	|	ЛОЖЬ КАК ВключаетВОСМС,
	|	ЛОЖЬ КАК ВключаетИПН,
	|	ЛОЖЬ КАК ВключаетСО,
	|	ЛОЖЬ КАК ВключаетООСМС,
	|	ЛОЖЬ КАК ВключаетОПВР,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.МесяцПериода,
	|	НалогиВзносыОтчисленияПрочиеФизЛица.МесяцНалоговогоПериода
	|ИЗ
	|	ВТНалогиВзносыОтчисленияПрочиеФизЛица КАК НалогиВзносыОтчисленияПрочиеФизЛица
	|ГДЕ
	|	НалогиВзносыОтчисленияПрочиеФизЛица.ФизическоеЛицо В (&МассивФизЛиц)
	|	И &ОтборПоПодразделению = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОтборПоПодразделению",ОтборПоПодразделению);
	Запрос.УстановитьПараметр("МассивФизЛиц",ФизическиеЛица);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ПериодыОплатыМедицинскогоСтрахования = ПолучитьПериодыОплатыМедицинскогоСтрахования(МенеджерВременныхТаблиц);
	
	Если ПериодыОплатыМедицинскогоСтрахования = Неопределено Тогда
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаНаПеречисление = НалогиВзносыОтчисления.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНаПеречисление, Выборка);
			Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
				СтрокаНаПеречисление.СуммаПлатежа = ЗарплатаКадрыКлиентСервер.Округлить(СтрокаНаПеречисление.СуммаПлатежа, НастройкиОкругления.ТочностьОкругления, НастройкиОкругления.ПравилоОкругления);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		ТаблицаНалогиВзносы = Результат.Выгрузить();
		РаспределитьДанныеМедстрахования(ТаблицаНалогиВзносы, ПериодыОплатыМедицинскогоСтрахования, Истина);
		
	КонецЕсли;
	
	Для Каждого Элемент Из ФизическиеЛица Цикл
		
		НайденнаяСтрока = НалогиВзносыОтчисления.Найти(Элемент,"ФизическоеЛицо");
		
		Если НайденнаяСтрока = Неопределено Тогда
			
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для сотрудника: %1 отсутствуют остатки по виду налога, взноса, отчисления: %2 на %3'"),
				Элемент,ВидНалогаВзносаОтчисления,Формат(ПериодРегистрации,"ДЛФ=DD"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьВТСотрудникиДляВедомостиПоФизическимЛицам(МенеджерВременныхТаблиц, ФизическиеЛица);

	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = ФизическиеЛица;
	
	ЗаполнитьПараметрыПолученияСотрудниковПоШапкеВедомости(ПараметрыПолученияСотрудников, ЭтотОбъект);	
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(
		МенеджерВременныхТаблиц, Истина, 
		ПараметрыПолученияСотрудников, 
		"ВТСотрудникиДляВедомости");  
		
КонецПроцедуры

Процедура РаспределитьДанныеМедстрахования(ТаблицаНалогиВзносы, ПериодыОплатыМедицинскогоСтрахования, ТолькоДобавить = Ложь)

	// рассчитываем данные в таблице ТаблицаНалогиВзносыИтерация
	// если при распределении нет проблем, то переносим в таблицу ТаблицаНалогиВзносыОбработанная
	// если при распределении есть проблемы, то данные не переносим
	ТаблицаНалогиВзносыИтерация = ТаблицаНалогиВзносы.СкопироватьКолонки();

	// создаем вторую временную таблицу, в которой формируем данные последовательно 
	// с учетом ранее произведенной в запросе сортировки по настройкам пользователя
	ТаблицаНалогиВзносыОбработанная = ТаблицаНалогиВзносы.СкопироватьКолонки();
	
	ОтборТаблицы = Новый Структура("ФизическоеЛицо, МесяцНалоговогоПериода");
	ОтборОсновнойСтроки = Новый Структура("ФизическоеЛицо, МесяцНалоговогоПериода, МесяцПериода");
	МассивДополнительныхСообщений = Новый Массив;
	
	Для Каждого СтрокаНВО Из ТаблицаНалогиВзносы Цикл
		
		Если СтрокаНВО.НалогВзнос = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОтборТаблицы, СтрокаНВО);
		ЗаполнитьЗначенияСвойств(ОтборОсновнойСтроки, СтрокаНВО);
		
		ПериодыОплатыФизическогоЛица = ПериодыОплатыМедицинскогоСтрахования.НайтиСтроки(ОтборТаблицы);
		
		// основную строку определяем по периоду регистрации
		ДанныеОсновнойСтроки = ПериодыОплатыМедицинскогоСтрахования.НайтиСтроки(ОтборОсновнойСтроки);
		
		ОсновнаяСтрока = Неопределено;
        ЭтоСтрокаПериодаРегистрации = Ложь;
		
		// основную строку определяем по периоду регистрации
		Если ДанныеОсновнойСтроки.Количество() > 0 Тогда
			
			ОсновнаяСтрока = ДанныеОсновнойСтроки[0];
        	ЭтоСтрокаПериодаРегистрации = Истина;
			
		КонецЕсли;
		
		МассивДополнительныхСообщений.Очистить();
		ТаблицаНалогиВзносыИтерация.Очистить();
		
		Если ПериодыОплатыФизическогоЛица.Количество() > 0 Тогда
			
            // если нет строки периода регистрации, то относим на последнюю строку
			Если НЕ ЭтоСтрокаПериодаРегистрации Тогда
				ОсновнаяСтрока = ПериодыОплатыФизическогоЛица[ПериодыОплатыФизическогоЛица.Количество() - 1];
			КонецЕсли;

			СуммаРаспределенияБезМесяцаЗаполнения = 0;
			
			ОшибкаАлгоритмаПриРаспределении = Ложь;
			ОсновнаяСтрокаИтерации = Неопределено;
			
			Для Каждого ПериодОплаты Из ПериодыОплатыФизическогоЛица Цикл
				
				// проверим делитель
				Если ПериодОплаты.УчитываемыеДниСобытия = 0
					ИЛИ ПериодОплаты.ОблагаемыйДоход = 0 Тогда
					
					МассивДополнительныхСообщений.Добавить(НСтр("ru = ' - учитываемые дни события или облагаемый доход равен нулю'"));
					ОшибкаАлгоритмаПриРаспределении	= Истина;
					
					Продолжить;
					
				КонецЕсли;
					
				КоэффициентУчитываемыхДней = ПериодОплаты.УчитываемыеДниПериода / ПериодОплаты.УчитываемыеДниСобытия;
				КоэффициентСуммыОСМС = ПериодОплаты.СуммаСобытия / ПериодОплаты.ОблагаемыйДоход;
				
				СтрокаНВОИтерация = ТаблицаНалогиВзносыИтерация.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНВОИтерация, СтрокаНВО);
				
				СтрокаНВОИтерация.МесяцПериода = ПериодОплаты.МесяцПериода;
				
                // распределяем целиком на отпуск, если нет других начислений в периоде КоэффициентСуммыОСМС = 1 
				Если ОсновнаяСтрока = ПериодОплаты
					И КоэффициентСуммыОСМС = 1 Тогда
					
					ОсновнаяСтрокаИтерации = СтрокаНВОИтерация;
					
				ИначеЕсли ОсновнаяСтрока = ПериодОплаты
					И ЭтоСтрокаПериодаРегистрации Тогда
					
					ОсновнаяСтрокаИтерации = СтрокаНВОИтерация;
					
				Иначе
										
					СтрокаНВОИтерация.НалогВзнос = Окр(СтрокаНВОИтерация.НалогВзнос * КоэффициентСуммыОСМС * КоэффициентУчитываемыхДней);
					СуммаРаспределенияБезМесяцаЗаполнения = СуммаРаспределенияБезМесяцаЗаполнения + СтрокаНВОИтерация.НалогВзнос;

				КонецЕсли;
					
				// проверим сумму после распределения
				Если СтрокаНВОИтерация.НалогВзнос = 0 Тогда
					
					МассивДополнительныхСообщений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = ' - сумма в периоде события %1 равна 0'"), СтрокаНВОИтерация.НалогВзнос));
					ОшибкаАлгоритмаПриРаспределении	= Истина;
					
					Продолжить;
					
				КонецЕсли;

			КонецЦикла;
			
			// выводим информационное сообщение пользователю и добавляем строку без распределения для самостоятельного распределения пользователем
			Если ОшибкаАлгоритмаПриРаспределении Тогда
				
				ТекстДополнительныхСообщений = "";
				
				Для Каждого СтрокаСообщения Из МассивДополнительныхСообщений Цикл
					
					ТекстДополнительныхСообщений = Символы.ПС + СтрокаСообщения;
					
				КонецЦикла;						
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось распределить сумму медицинского страхования по физическому лицу %1 в периоде %2%3
																								|Сумму необходимо распределить вручную по месяцам периода события в форме строки.'"), 
																								СтрокаНВО.ФизическоеЛицо, СтрокаНВО.МесяцНалоговогоПериода, ТекстДополнительныхСообщений);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				СтрокаНВООбработанная = ТаблицаНалогиВзносыОбработанная.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНВООбработанная, СтрокаНВО);
				
			Иначе
				
				// при начислении в месяце регистрации сумм за будущие периоды и отсутствии в этом месяце дохода
				// добавляем строку остатка на период заполнения документа
				Если ОсновнаяСтрокаИтерации = Неопределено Тогда
					
					СтрокаНВООбработанная = ТаблицаНалогиВзносыИтерация.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНВООбработанная, СтрокаНВО);
					
					ОсновнаяСтрокаИтерации = СтрокаНВООбработанная;
					
					ТаблицаНалогиВзносыИтерация.Сортировать("МесяцНалоговогоПериода, МесяцПериода")
					
				КонецЕсли;

				Для Каждого СтрокаИтерации Из ТаблицаНалогиВзносыИтерация Цикл
					
					СтрокаНВООбработанная = ТаблицаНалогиВзносыОбработанная.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаНВООбработанная, СтрокаИтерации);
					
					Если ОсновнаяСтрокаИтерации = СтрокаИтерации Тогда
						СтрокаНВООбработанная.НалогВзнос = СтрокаНВООбработанная.НалогВзнос - СуммаРаспределенияБезМесяцаЗаполнения;		
					КонецЕсли;
					
				КонецЦикла;						
				
			КонецЕсли;				
			
		Иначе
			
			СтрокаНВООбработанная = ТаблицаНалогиВзносыОбработанная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНВООбработанная, СтрокаНВО);
			
		КонецЕсли;
		
	КонецЦикла;			
	
	Если ТолькоДобавить Тогда
		
		Для Каждого СтрокаНВО Из ТаблицаНалогиВзносыОбработанная Цикл
			
			СтрокаНалогиВзносыОтчисления = НалогиВзносыОтчисления.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНалогиВзносыОтчисления, СтрокаНВО);
		
		КонецЦикла;
		
	Иначе
		
		НалогиВзносыОтчисления.Загрузить(ТаблицаНалогиВзносыОбработанная);
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьПериодыОплатыМедицинскогоСтрахования(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если Документы.ВедомостьНаПеречислениеВзносовОтчислений.ПеречислятьПоМесяцуПериода(ПериодРегистрации, ВидНалогаВзносаОтчисления, ВидПлатежа, Организация) Тогда

		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ДанныеПериодовОплатыМедстрахования.ПериодРегистрации КАК МесяцНалоговогоПериода,
		               |	ДанныеПериодовОплатыМедстрахования.МесяцСобытия КАК МесяцПериода,
		               |	ДанныеПериодовОплатыМедстрахования.УчитываемыеДниСобытия КАК УчитываемыеДниСобытия,
		               |	ДанныеПериодовОплатыМедстрахования.УчитываемыеДниПериода КАК УчитываемыеДниПериода,
		               |	ДанныеПериодовОплатыМедстрахования.СуммаСобытия КАК СуммаСобытия,
		               |	ДанныеПериодовОплатыМедстрахования.ФизическоеЛицо КАК ФизическоеЛицо,
		               |	ДанныеПериодовОплатыМедстрахования.ОблагаемыйДоход КАК ОблагаемыйДоход,
		               |	ВЫБОР
		               |		КОГДА ДанныеПериодовОплатыМедстрахования.ПериодРегистрации = ДанныеПериодовОплатыМедстрахования.МесяцСобытия
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Сортироровка
		               |ИЗ
		               |	ВТДанныеПериодаДействияДляМедицинскогоСтрахования КАК ДанныеПериодовОплатыМедстрахования
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Сортироровка УБЫВ";

		ПериодыОплатыМедицинскогоСтрахования = Запрос.Выполнить().Выгрузить();
		ПериодыОплатыМедицинскогоСтрахования.Индексы.Добавить("ФизическоеЛицо, МесяцНалоговогоПериода")
		
	Иначе
		
		ПериодыОплатыМедицинскогоСтрахования = Неопределено;

	КонецЕсли;
	
	Возврат ПериодыОплатыМедицинскогоСтрахования;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьНастройкиОкругления(НастройкиОкругления)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Таблица ВТСпособыОкругления
	УчетНалоговВзносовОтчислений.СоздатьВТСпособыОкругления(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);
	
	ДанныеОкругления = УчетНалоговВзносовОтчислений.ПолучитьСпособОкругленияСПериодом(МенеджерВременныхТаблиц, ВидНалогаВзносаОтчисления);
	СпособОкругления = ДанныеОкругления.СпособОкругления;
	
	ОписаниеСпособаОкругления = ЗарплатаКадрыРасширенныйПовтИсп.ОписаниеСпособаОкругления(СпособОкругления);
	
	НастройкиОкругления.ТочностьОкругления = ОписаниеСпособаОкругления.Точность;
	НастройкиОкругления.ПравилоОкругления = ОписаниеСпособаОкругления.ПравилоОкругления;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли