

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ИсключаемыеЗначения() Экспорт
	
	МассивИсключаемыхЗначений = Новый Массив;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда 
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.Старшина);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйКорабельныйСтаршина);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.Прапорщик);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.Мичман);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.СтаршийПрапорщик);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМичман);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.МладшийЛейтенант);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.АдмиралФлота);
		МассивИсключаемыхЗначений.Добавить(Перечисления.КлассификаторВоинскихЗваний.МаршалРоссийскойФедерации);
	КонецЕсли;
		
	Возврат МассивИсключаемыхЗначений;
	
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СписокИсключений  = ИсключаемыеЗначения();
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ЗначениеПеречисления Из Перечисления.КлассификаторВоинскихЗваний Цикл
		Если СписокИсключений.Найти(ЗначениеПеречисления) = Неопределено Тогда
			ДанныеВыбора.Добавить(ЗначениеПеречисления);
		КонецЕсли;
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
