
#Область ПрограммныйИнтерфейс

// Возвращает параметры обмена с сервисом ЭТД: Адреса веб-страниц, логины и пароли.
// 
// Возвращаемое значение:
//  Структура - Актуальные параметры обмена
//
Функция ПолучитьПараметрыЭТД() Экспорт
	
	ПараметрыЭТД = Константы.ПараметрыЭТД.Получить().Получить();
	Если ПараметрыЭТД = Неопределено Тогда
		ПараметрыЭТД = Новый Структура;
		ПараметрыЭТД.Вставить("АдресСервисаЭТД", ЭТДКлиентСервер.АдресПродуктивногоСтенда());
	КонецЕсли;
	
	Возврат ПараметрыЭТД;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
