#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокГражданПодлежащихПостановкеНаВоинскийУчет");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения о работниках, состоящих на воинском учете, а также о работниках, не состоящих, 
		|но обязанных состоять на воинском учете, для предоставления в военкомат.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокЮношейДляОВК");
	НастройкиВарианта.Описание =
    // ЗУПК
	НСтр("ru = 'Список работников мужского пола 15- и 16-летнего, подлежащих приписке к призывному пункту (до 2017 года)'");
    // ЗУПК
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокПервоначальнойПостановкиНаВоинскийУчет");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Список работников, подлежащих первоначальной постановке на воинский учет в указанном году, 
		|для предоставления в военкомат.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокДляСверкиСВоенкоматом");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения о воинском учете из личных карточек военнослужащих запаса 
		|для предоставления в военкомат.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КарточкаОповещения");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Оповещение работника о вызове на учения в мирное время и на воинские действия - в военное.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РаспискаПриПриемеДокументов");
	НастройкиВарианта.Описание =
	// ЗУПК
		НСтр("ru = 'Расписка, выдаваемая работнику при приеме документов воинского учета (до 2024 года)'");
	// ЗУПК
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИзвещениеОПриемеУвольнении");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сообщения для военкоматов о приемах или увольнениях подлежащих 
		|воинскому учету работников за заданный период.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПринятыеУволенныеВоеннообязанные");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Список принятых и уволенных военнослужащих запаса за заданный период.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПринятыеУволенныеПризывники");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Список принятых и уволенных призывников за заданный период.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализКарточекВоинскогоУчета");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Данные воинского учета работников на заданную дату.'");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КарточкаУчетаОрганизации");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения о количестве работающих военнообязанных и призывников.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КарточкаУчетаОрганизации2015");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения о количестве работающих военнообязанных и призывников.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КарточкаГражданинаПодлежащегоВоинскомуУчету");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения о работниках, подлежащих воинскому учету в организации.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ОтключенныйФункционалЗарплатаКадры");
		
    // ЗУПК
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокПодлежащихПодготовкеКСрочнойСлужбе");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Список военнообязанных, подлежащих подготовке к срочной службе'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СписокВоеннообязанныхПризывниковПринятыхУволенных");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Список военнообязанных и призывников принятых или уволенных с работы (до 2020 года)'");	
    // ЗУПК
		
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли