#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, ,
		"НесчастныеСлучаи");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.НесчастныйСлучайНаПроизводстве;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ДатаПриказа223Н = ОхранаТруда.ДатаВступленияВСилуПриказа223Н();
	
	// Акт о несчастном случае
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОНесчастномСлучае2003Кв1";
	КомандаПечати.Представление = НСтр("ru = 'Акт о несчастном случае'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.Меньше);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОНесчастномСлучае2022Кв3";
	КомандаПечати.Представление = НСтр("ru = 'Акт о несчастном случае'");
	КомандаПечати.Порядок = 15;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	// Акт о расследовании группового несчастного случая
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОГрупповомНесчастномСлучае2003Кв1";
	КомандаПечати.Представление = НСтр("ru = 'Акт о расследовании группового несчастного случая'");
	КомандаПечати.Порядок = 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.Меньше);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОГрупповомНесчастномСлучае2022Кв3";
	КомандаПечати.Представление = НСтр("ru = 'Акт о расследовании группового несчастного случая'");
	КомандаПечати.Порядок = 25;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	// Извещение о групповом несчастном случае
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2003Кв1";
	КомандаПечати.Представление = НСтр("ru = 'Извещение о групповом несчастном случае'");
	КомандаПечати.Порядок = 30;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.Меньше);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2022Кв3";
	КомандаПечати.Представление = НСтр("ru = 'Извещение о несчастном случае на производстве'");
	КомандаПечати.Порядок = 35;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	// Сообщение о страховом случае
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_СообщениеОСтраховомСлучае";
	КомандаПечати.Представление = НСтр("ru = 'Сообщение о страховом случае'");
	КомандаПечати.Порядок = 40;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	// Приказ о создании комиссии
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПриказОСозданииКомиссии";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о создании комиссии'");
	КомандаПечати.Порядок = 50;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	// Протокол осмотра
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПротоколОсмотра2003Кв1";
	КомандаПечати.Представление = НСтр("ru = 'Протокол осмотра'");
	КомандаПечати.Порядок = 60;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.Меньше);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПротоколОсмотра2022Кв3";
	КомандаПечати.Представление = НСтр("ru = 'Протокол осмотра'");
	КомандаПечати.Порядок = 65;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(
		КомандаПечати, "ДатаПроисшествия", ДатаПриказа223Н, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	// ЗУПК
	КомандаПечати.ФункциональныеОпции = "ОтключенныйФункционалЗарплатаКадрыКОРП";
	// ЗУПК
	
	// ЗУПК
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктОНесчастномСлучае";
	КомандаПечати.Представление = НСтр("ru = 'Акт о несчастном случае'");
	КомандаПечати.Порядок = 55;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.НесчастныйСлучайНаПроизводстве";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктРасследованияНесчастногоСлучая";
	КомандаПечати.Представление = НСтр("ru = 'Акт расследования несчастного случая'");
	КомандаПечати.Порядок = 70;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	// ЗУПК
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОГрупповомНесчастномСлучае2003Кв1") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОГрупповомНесчастномСлучае2003Кв1");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОГрупповомНесчастномСлучае2003Кв1",
			НСтр("ru = 'Акт о расследовании группового несчастного случая'"),
			ПечатьАктаОГрупповомНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОГрупповомНесчастномСлучае2003Кв1");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОГрупповомНесчастномСлучае2022Кв3") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОГрупповомНесчастномСлучае2022Кв3");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОГрупповомНесчастномСлучае2022Кв3",
			НСтр("ru = 'Акт о расследовании группового несчастного случая'"),
			ПечатьАктаОГрупповомНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОГрупповомНесчастномСлучае2022Кв3");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОНесчастномСлучае2003Кв1") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОНесчастномСлучае2003Кв1");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОНесчастномСлучае2003Кв1",
			НСтр("ru = 'Акт о несчастном случае'"), ПечатьАктаОНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОНесчастномСлучае2003Кв1");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОНесчастномСлучае2022Кв3") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОНесчастномСлучае2022Кв3");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОНесчастномСлучае2022Кв3",
			НСтр("ru = 'Акт о несчастном случае'"), ПечатьАктаОНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОНесчастномСлучае2022Кв3");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2003Кв1") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2003Кв1");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2003Кв1",
			НСтр("ru = 'Извещение о групповом несчастном случае'"), ПечатьИзвещенияОГрупповомНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2003Кв1");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2022Кв3") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2022Кв3");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2022Кв3",
			НСтр("ru = 'Извещение о несчастном случае на производстве'"), ПечатьИзвещенияОГрупповомНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ИзвещениеОГрупповомНесчастномСлучае2022Кв3");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказОСозданииКомиссии") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказОСозданииКомиссии",
			НСтр("ru = 'Приказ о создании комиссии'"), ПечатьПриказОСозданииКомиссии(МассивОбъектов, ОбъектыПечати), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ПриказОСозданииКомиссии");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОсмотра2003Кв1") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ПротоколОсмотра2003Кв1");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОсмотра2003Кв1",
			НСтр("ru = 'Протокол осмотра'"), ПечатьПротоколОсмотра(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ПротоколОсмотра2003Кв1");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОсмотра2022Кв3") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ПротоколОсмотра2022Кв3");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколОсмотра2022Кв3",
			НСтр("ru = 'Протокол осмотра'"), ПечатьПротоколОсмотра(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ПротоколОсмотра2022Кв3");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СообщениеОСтраховомСлучае") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СообщениеОСтраховомСлучае",
			НСтр("ru = 'Сообщение о страховом случае'"), ПечатьСообщениеОСтраховомСлучае(МассивОбъектов, ОбъектыПечати), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_СообщениеОСтраховомСлучае");
	
	// ЗУПК
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктОНесчастномСлучае") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОНесчастномСлучае");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктОНесчастномСлучае",
			НСтр("ru = 'Акт о несчастном случае'"), ПечатьАктОНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктОНесчастномСлучае");
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктРасследованияНесчастногоСлучая") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктРасследованияНесчастногоСлучая");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктРасследованияНесчастногоСлучая",
			НСтр("ru = 'Акт расследования несчастного случая'"), ПечатьАктРасследованияНесчастногоСлучая(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_АктРасследованияНесчастногоСлучая");
	// ЗУПК
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьАктаОГрупповомНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_АктОГрупповомНесчастномСлучае";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	ДатаПриказа223Н = ОхранаТруда.ДатаВступленияВСилуПриказа223Н();
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЭтоПриказ223Н = ДанныеДокумента.ДатаПроисшествияДатаВремя >= ДатаПриказа223Н;
		
		ПервыйПострадавший = Истина;
		Для каждого СтрокаПострадавшего Из ДанныеДокумента.Пострадавшие Цикл
			
			// Документы нужно выводить на разных страницах.
			Если Не ПервыйПострадавший Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйПострадавший = Ложь;
			КонецЕсли;
			
			Область1 = Макет.ПолучитьОбласть("Область1");
			Область2 = Макет.ПолучитьОбласть("Область2");
			Область3 = Макет.ПолучитьОбласть("Область3");
			Область4_1_1 = Макет.ПолучитьОбласть("Область4_1_1");
			Область4_1_2 = Макет.ПолучитьОбласть("Область4_1_2");
			Область4_2 = Макет.ПолучитьОбласть("Область4_2");
			Область5 = Макет.ПолучитьОбласть("Область5");
			Область5_1_1 = Макет.ПолучитьОбласть("Область5_1_1");
			Область5_1_2 = Макет.ПолучитьОбласть("Область5_1_2");
			Область6 = Макет.ПолучитьОбласть("Область6");
			Область7 = Макет.ПолучитьОбласть("Область7");
			Область8 = Макет.ПолучитьОбласть("Область8");
			Область9 = Макет.ПолучитьОбласть("Область9");
			Область10 = Макет.ПолучитьОбласть("Область10");
			Область11 = Макет.ПолучитьОбласть("Область11");
			Область12 = Макет.ПолучитьОбласть("Область12");
			ДопСтрока = Макет.ПолучитьОбласть("ДопСтрока");
			ДопПодпись = Макет.ПолучитьОбласть("ДопПодпись");
			ОбластьПояснения = Макет.ПолучитьОбласть("ОбластьПояснения");
			
			////////////////////////////////////////////////
			// Область 1
			Область1.Параметры.Заполнить(ДанныеДокумента);
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОбОрганизации, "100,100,999");
			Область1.Параметры.СведенияОбОрганизацииЧасть1 = СписокСтрок[0];
			Область1.Параметры.СведенияОбОрганизацииЧасть2 = СписокСтрок[1];
			Область1.Параметры.СведенияОбОрганизацииЧасть3 = СписокСтрок[2];
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаЧленыКомиссии, "100");
			Область1.Параметры.ЧленыКомиссииЧасть1 = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область1);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 2
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаУчастникиОсмотра, "100,100");
			Область2.Параметры.УчастникиОсмотраЧасть1 = СписокСтрок[0];
			Область2.Параметры.УчастникиОсмотраЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область2);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 3
			
			Область3.Параметры.ФИО = СтрокаПострадавшего.ФИОПолные;
			Область3.Параметры.Пол = СтрокаПострадавшего.Пол;
			Область3.Параметры.ДатаРождения = Формат(СтрокаПострадавшего.ДатаРождения, "ДЛФ=ДД");
			Область3.Параметры.Профессии = СтрокаПострадавшего.Профессии;
			Область3.Параметры.Должность = СтрокаПострадавшего.ДолжностьНаименование;
			Область3.Параметры.СтажРаботы = СтрокаПострадавшего.СтажОбщийПредставление;
			Область3.Параметры.СтажРаботыВОрганизации = СтрокаПострадавшего.СтажВОрганизацииПредставление;
			Если ЭтоПриказ223Н Тогда
				Область3.Параметры.СтатусЗанятости = СтрокаПострадавшего.ВидДоговора;
			КонецЕсли;
			
			СписокСтрок = Новый Массив;
			Если ЗначениеЗаполнено(СтрокаПострадавшего.СостояниеВБраке) Тогда
				СписокСтрок.Добавить(Строка(СтрокаПострадавшего.СостояниеВБраке));
			КонецЕсли;
			СтрокаСоставСемьи = Новый ТекстовыйДокумент;
			СтрокаСоставСемьи.УстановитьТекст(СтрокаПострадавшего.СоставСемьи);
			Для Шаг = 1 По СтрокаСоставСемьи.КоличествоСтрок() Цикл
				СписокСтрок.Добавить(СтрокаСоставСемьи.ПолучитьСтроку(Шаг));
			КонецЦикла;
			Если СписокСтрок.Количество() = 0 Тогда
				СписокСтрок.Добавить("");
			КонецЕсли;
			Область3.Параметры.СемейноеПоложениеЧасть1 = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область3);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 4_1
			
			СтрокиИнструктажей = ДанныеДокумента.Инструктажи.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаИнструктажей Из СтрокиИнструктажей Цикл
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаВводногоИнструктажа) Тогда
					Область4_1_1.Параметры.ДатаВводногоИнструктажа = Формат(СтрокаИнструктажей.ДатаВводногоИнструктажа, "ДЛФ=ДД");
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте) Тогда
					Область4_1_1.Параметры.ИнструктажНаРабочемМесте = СтрокаИнструктажей.ВидИнструктажа;
					Область4_1_2.Параметры.ДатаИнструктажаНаРабочемМесте = Формат(СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте, "ДЛФ=ДД");
				КонецЕсли;
			КонецЦикла;
			ТабличныйДокумент.Вывести(Область4_1_1);
			
			Область4_1_2.Параметры.НачалоСтажировки = Формат(СтрокаПострадавшего.НачалоСтажировки, "ДЛФ=ДД");
			Область4_1_2.Параметры.ОкончаниеСтажировки = Формат(СтрокаПострадавшего.ОкончаниеСтажировки, "ДЛФ=ДД");
			
			Если ЭтоПриказ223Н Тогда
				СтрокиМедицинскиеОсмотры = ДанныеДокумента.МедицинскиеОсмотры.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
				Для Каждого СтрокаМедицинскиеОсмотры Из СтрокиМедицинскиеОсмотры Цикл
					Если СтрокаМедицинскиеОсмотры.ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр Тогда
						Область4_1_2.Параметры.ДатаМедицинскогоОсмотра = Формат(СтрокаМедицинскиеОсмотры.ДатаПройденногоОсмотра, "ДЛФ=ДД");
						Область4_1_2.Параметры.РезультатМедицинскогоОсмотра = Строка(СтрокаМедицинскиеОсмотры.РезультатОсмотра);
					КонецЕсли;
					Если СтрокаМедицинскиеОсмотры.ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
						Область4_1_2.Параметры.ДатаПсихиатрическогоОсвидетельствования = Формат(СтрокаМедицинскиеОсмотры.ДатаПройденногоОсмотра, "ДЛФ=ДД");
						Область4_1_2.Параметры.РезультатПсихиатрическогоОсвидетельствования = Строка(СтрокаМедицинскиеОсмотры.РезультатОсмотра);
					КонецЕсли;
				КонецЦикла;
				Если Не ЗначениеЗаполнено(Область4_1_2.Параметры.РезультатМедицинскогоОсмотра) Тогда
					Область4_1_2.Параметры.РезультатМедицинскогоОсмотра = НСтр("ru = 'не требуется'");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Область4_1_2.Параметры.РезультатПсихиатрическогоОсвидетельствования) Тогда
					Область4_1_2.Параметры.РезультатПсихиатрическогоОсвидетельствования = НСтр("ru = 'не требуется'");
				КонецЕсли;
			КонецЕсли;
			ТабличныйДокумент.Вывести(Область4_1_2);
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ХарактеристикаМестаПроисшествия, "25, 100,100");
			Область4_2.Параметры.ХарактеристикаМестаПроисшествияЧасть1 = СписокСтрок[0];
			Область4_2.Параметры.ХарактеристикаМестаПроисшествияЧасть2 = СписокСтрок[1];
			Область4_2.Параметры.ХарактеристикаМестаПроисшествияЧасть3 = СписокСтрок[2];
			
			ТабличныйДокумент.Вывести(Область4_2);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 3);
			
			/////////////////////////////////////////////////
			// Область 5
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОписаниеОборудования, "30,100");
			Область5.Параметры.ОписаниеОборудованияЧасть1 = СписокСтрок[0];
			Область5.Параметры.ОписаниеОборудованияЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область5);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 5_1_1
			
			ТабличныйДокумент.Вывести(Область5_1_1);
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.СведенияСОУТ, "100");
			ДопСтрока.Параметры.ТекстСтроки = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(ДопСтрока);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 5_1_2
			
			ТабличныйДокумент.Вывести(Область5_1_2);
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.СведенияОПСОУТ, "100");
			ДопСтрока.Параметры.ТекстСтроки = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(ДопСтрока);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 6
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОбстоятельстваПроисшествия, "100,100,100, 100,100,100, 100,100,100");
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть1 = СписокСтрок[0];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть2 = СписокСтрок[1];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть3 = СписокСтрок[2];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть4 = СписокСтрок[3];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть5 = СписокСтрок[4];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть6 = СписокСтрок[5];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть7 = СписокСтрок[6];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть8 = СписокСтрок[7];
			Область6.Параметры.ОбстоятельстваПроисшествияЧасть9 = СписокСтрок[8];
			
			ТабличныйДокумент.Вывести(Область6);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 9);
			
			/////////////////////////////////////////////////
			// Область 7
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПричиныПроисшествия, "25,100,100");
			Область7.Параметры.ПричиныПроисшествияЧасть1 = СписокСтрок[0];
			Область7.Параметры.ПричиныПроисшествияЧасть2 = СписокСтрок[1];
			Область7.Параметры.ПричиныПроисшествияЧасть3 = СписокСтрок[2];
			
			ТабличныйДокумент.Вывести(Область7);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 3);
			
			/////////////////////////////////////////////////
			// Область 8
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаВиновныеЛица, "100,100, 100,100, 100");
			Область8.Параметры.ВиновныеЛицаЧасть1 = СписокСтрок[0];
			Область8.Параметры.ВиновныеЛицаЧасть2 = СписокСтрок[1];
			Область8.Параметры.ВиновныеЛицаЧасть3 = СписокСтрок[2];
			Область8.Параметры.ВиновныеЛицаЧасть4 = СписокСтрок[3];
			Область8.Параметры.ВиновныеЛицаЧасть5 = СписокСтрок[4];
			
			ТабличныйДокумент.Вывести(Область8);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 5);
			
			/////////////////////////////////////////////////
			// Область 9
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.КвалификацияНесчастногоСлучая, "100,100, 100,100, 100,100, 100,100");
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть1 = СписокСтрок[0];
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть2 = СписокСтрок[1];
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть3 = СписокСтрок[2];
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть4 = СписокСтрок[3];
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть5 = СписокСтрок[4];
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть6 = СписокСтрок[5];
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть7 = СписокСтрок[6];
			Область9.Параметры.КвалификацияНесчастногоСлучаяЧасть8 = СписокСтрок[7];
			
			ТабличныйДокумент.Вывести(Область9);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 8);
			
			/////////////////////////////////////////////////
			// Область 10
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.МероприятияПоУстранениюПричин, "100");
			Область10.Параметры.МероприятияПоУстранениюПричин = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область10);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 11
			
			ТабличныйДокумент.Вывести(Область11);
			
			/////////////////////////////////////////////////
			// Область 12
			
			ПервыйЧленКомиссии = Истина;
			Для каждого ФИОЧленаКомиссии Из ДанныеДокумента.МассивФИОЧленовКомиссии Цикл
				Если ПервыйЧленКомиссии Тогда
					ПервыйЧленКомиссии = Ложь;
					Область12.Параметры.ФИОЧленКомиссии = ФИОЧленаКомиссии;
					ТабличныйДокумент.Вывести(Область12);
				Иначе
					ДопПодпись.Параметры.ФИОЧленКомиссии = ФИОЧленаКомиссии;
					ТабличныйДокумент.Вывести(ДопПодпись);
				КонецЕсли;
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьПояснения);
			
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьАктаОНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_АктОНесчастномСлучае";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	ДатаПриказа223Н = ОхранаТруда.ДатаВступленияВСилуПриказа223Н();
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЭтоПриказ223Н = ДанныеДокумента.ДатаПроисшествияДатаВремя >= ДатаПриказа223Н;
		
		ПервыйПострадавший = Истина;
		Для каждого СтрокаПострадавшего Из ДанныеДокумента.Пострадавшие Цикл
			
			// Документы нужно выводить на разных страницах.
			Если Не ПервыйПострадавший Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйПострадавший = Ложь;
			КонецЕсли;
			
			Область1 = Макет.ПолучитьОбласть("Область1");
			Область21= Макет.ПолучитьОбласть("Область21");
			Область22= Макет.ПолучитьОбласть("Область22");
			Область3= Макет.ПолучитьОбласть("Область3");
			Область3_1_1= Макет.ПолучитьОбласть("Область3_1_1");
			Область3_1_2= Макет.ПолучитьОбласть("Область3_1_2");
			Область4= Макет.ПолучитьОбласть("Область4");
			Область5= Макет.ПолучитьОбласть("Область5");
			Область6= Макет.ПолучитьОбласть("Область6");
			Область7= Макет.ПолучитьОбласть("Область7");
			Область8= Макет.ПолучитьОбласть("Область8");
			Область9= Макет.ПолучитьОбласть("Область9");
			Область10= Макет.ПолучитьОбласть("Область10");
			Область11= Макет.ПолучитьОбласть("Область11");
			Область12= Макет.ПолучитьОбласть("Область12");
			ДопСтрока = Макет.ПолучитьОбласть("ДопСтрока");
			ДопПодпись = Макет.ПолучитьОбласть("ДопПодпись");
			ОбластьПояснения = Макет.ПолучитьОбласть("ОбластьПояснения");
			
			////////////////////////////////////////////////
			// Область 1
			
			Область1.Параметры.Заполнить(ДанныеДокумента);
			Если Не ЭтоПриказ223Н Тогда
				Область1.Параметры.ДатаПроисшествияЧасть1 = Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДЛФ=DDT");
			Иначе
				Область1.Параметры.ДатаПроисшествияЧасть1 = Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДЛФ=DD;");
				Область1.Параметры.ДатаПроисшествияЧасть2 = Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДЛФ=T;");
			КонецЕсли;
			Область1.Параметры.ЧасовОтНачалаРаботы = ДанныеДокумента.ПолныхЧасовОтНачалаРаботы;
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОбОрганизации, "100,100,999");
			Область1.Параметры.СведенияОбОрганизацииЧасть1 = СписокСтрок[0];
			Область1.Параметры.СведенияОбОрганизацииЧасть2 = СписокСтрок[1];
			Область1.Параметры.СведенияОбОрганизацииЧасть3 = СписокСтрок[2];
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.НаименованиеПодразделения, "50, 999");
			Область1.Параметры.НаименованиеПодразделенияЧасть1 = СписокСтрок[0];
			Область1.Параметры.НаименованиеПодразделенияЧасть2 = СписокСтрок[1];
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОбОрганизацииНаправившейРаботника, "50, 999");
			Область1.Параметры.ОрганизацияНаправившаяРаботникаЧасть1 = СписокСтрок[0];
			Область1.Параметры.ОрганизацияНаправившаяРаботникаЧасть2 = СписокСтрок[1];
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаЧленыКомиссии, "100,100");
			Область1.Параметры.ЧленыКомиссииЧасть1 = СписокСтрок[0];
			Область1.Параметры.ЧленыКомиссииЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область1);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 2
			
			Область21.Параметры.ПострадавшийФИО = СтрокаПострадавшего.ФИОПолные;
			Область21.Параметры.ПострадавшийПол = СтрокаПострадавшего.Пол;
			Область21.Параметры.ПострадавшийДатаРождения = Формат(СтрокаПострадавшего.ДатаРождения, "ДЛФ=ДД");
			Область21.Параметры.ПострадавшийПрофессия = СтрокаПострадавшего.Профессии;
			Область21.Параметры.ПострадавшийДолжность = СтрокаПострадавшего.ДолжностьНаименование;
			Область21.Параметры.ПострадавшийСтаж = СтрокаПострадавшего.СтажОбщийПредставление;
			Область21.Параметры.ПострадавшийСтажВОрганизации = СтрокаПострадавшего.СтажВОрганизацииПредставление;
			Если ЭтоПриказ223Н Тогда
				Область21.Параметры.ПострадавшийСтатусЗанятости = СтрокаПострадавшего.ВидДоговора;
			КонецЕсли;
			
			СтрокиИнструктажей = ДанныеДокумента.Инструктажи.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаИнструктажей Из СтрокиИнструктажей Цикл
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаВводногоИнструктажа) Тогда
					Область21.Параметры.ДатаВводногоИнструктажа = Формат(СтрокаИнструктажей.ДатаВводногоИнструктажа, "ДЛФ=ДД");
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте) Тогда
					Область21.Параметры.ИнструктажНаРабочемМесте = СтрокаИнструктажей.ВидИнструктажа;
					Область22.Параметры.ДатаИнструктажаНаРабочемМесте = Формат(СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте, "ДЛФ=ДД");
				КонецЕсли;
			КонецЦикла;
			ТабличныйДокумент.Вывести(Область21);
			
			Область22.Параметры.НачалоСтажировки = Формат(СтрокаПострадавшего.НачалоСтажировки, "ДЛФ=ДД");
			Область22.Параметры.ОкончаниеСтажировки = Формат(СтрокаПострадавшего.ОкончаниеСтажировки, "ДЛФ=ДД");
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ХарактеристикаМестаПроисшествия, "25,100,100,100");
			Область22.Параметры.ХарактеристикаМестаПроисшествияЧасть1 = СписокСтрок[0];
			Область22.Параметры.ХарактеристикаМестаПроисшествияЧасть2 = СписокСтрок[1];
			Область22.Параметры.ХарактеристикаМестаПроисшествияЧасть3 = СписокСтрок[2];
			Область22.Параметры.ХарактеристикаМестаПроисшествияЧасть4 = СписокСтрок[3];
			
			Если ЭтоПриказ223Н Тогда
				СтрокиМедицинскиеОсмотры = ДанныеДокумента.МедицинскиеОсмотры.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
				Для Каждого СтрокаМедицинскиеОсмотры Из СтрокиМедицинскиеОсмотры Цикл
					Если СтрокаМедицинскиеОсмотры.ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр Тогда
						Область22.Параметры.ДатаМедицинскогоОсмотра = Формат(СтрокаМедицинскиеОсмотры.ДатаПройденногоОсмотра, "ДЛФ=ДД");
						Область22.Параметры.РезультатМедицинскогоОсмотра = Строка(СтрокаМедицинскиеОсмотры.РезультатОсмотра);
					КонецЕсли;
					Если СтрокаМедицинскиеОсмотры.ВидОсмотра = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование Тогда
						Область22.Параметры.ДатаПсихиатрическогоОсвидетельствования = Формат(СтрокаМедицинскиеОсмотры.ДатаПройденногоОсмотра, "ДЛФ=ДД");
						Область22.Параметры.РезультатПсихиатрическогоОсвидетельствования = Строка(СтрокаМедицинскиеОсмотры.РезультатОсмотра);
					КонецЕсли;
				КонецЦикла;
				Если Не ЗначениеЗаполнено(Область22.Параметры.РезультатМедицинскогоОсмотра) Тогда
					Область22.Параметры.РезультатМедицинскогоОсмотра = НСтр("ru = 'не требуется'");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Область22.Параметры.РезультатПсихиатрическогоОсвидетельствования) Тогда
					Область22.Параметры.РезультатПсихиатрическогоОсвидетельствования = НСтр("ru = 'не требуется'");
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Область22);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 4);
			
			/////////////////////////////////////////////////
			// Область 3
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОписаниеОборудования, "30,100");
			Область3.Параметры.ОписаниеОборудованияЧасть1 = СписокСтрок[0];
			Область3.Параметры.ОписаниеОборудованияЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область3);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 3_1_1
			
			ТабличныйДокумент.Вывести(Область3_1_1);
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.СведенияСОУТ, "100");
			ДопСтрока.Параметры.ТекстСтроки = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(ДопСтрока);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 3_1_2
			
			ТабличныйДокумент.Вывести(Область3_1_2);
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.СведенияОПСОУТ, "100");
			ДопСтрока.Параметры.ТекстСтроки = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(ДопСтрока);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 4
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОбстоятельстваПроисшествия, "100,100,100");
			Область4.Параметры.ОбстоятельстваПроисшествияЧасть1 = СписокСтрок[0];
			Область4.Параметры.ОбстоятельстваПроисшествияЧасть2 = СписокСтрок[1];
			Область4.Параметры.ОбстоятельстваПроисшествияЧасть3 = СписокСтрок[2];
			
			ТабличныйДокумент.Вывести(Область4);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 3);
			
			/////////////////////////////////////////////////
			// Область 5
			
			Если ЗначениеЗаполнено(ДанныеДокумента.ВидПроисшествия) Тогда
				ВидПроисшествияНаименование = ДанныеДокумента.ВидПроисшествия;
			Иначе
				ВидПроисшествияНаименование = "";
			КонецЕсли;
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ВидПроисшествияНаименование, "65,100");
			Область5.Параметры.ВидПроисшествияЧасть1 = СписокСтрок[0];
			Область5.Параметры.ВидПроисшествияЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область5);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 6
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.ХарактерПовреждений, "60, 100");
			Область6.Параметры.ХарактерПоврежденийЧасть1 = СписокСтрок[0];
			Область6.Параметры.ХарактерПоврежденийЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область6);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 7
			
			Если ПустаяСтрока(СтрокаПострадавшего.ВидИСтепеньОпьянения) Тогда
				СтрокаПострадавшего.ВидИСтепеньОпьянения = "Нет";
			Иначе
				СтрокаПострадавшего.ВидИСтепеньОпьянения = "Да - " + СтрокаПострадавшего.ВидИСтепеньОпьянения;
			КонецЕсли;
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.ВидИСтепеньОпьянения, "100, 100");
			Область7.Параметры.ОпьянениеПострадавшегоЧасть1 = СписокСтрок[0];
			Область7.Параметры.ОпьянениеПострадавшегоЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область7);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 8
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаОчевидцы, "60, 100");
			Область8.Параметры.ОчевидцыЧасть1 = СписокСтрок[0];
			Область8.Параметры.ОчевидцыЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область8);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 9
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПричиныПроисшествия, "55, 90, 110");
			Область9.Параметры.ПричиныПроисшествияЧасть1 = СписокСтрок[0];
			Область9.Параметры.ПричиныПроисшествияЧасть2 = СписокСтрок[1];
			Область9.Параметры.ПричиныПроисшествияЧасть3 = СписокСтрок[2];
			
			ТабличныйДокумент.Вывести(Область9);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 3);
			
			/////////////////////////////////////////////////
			// Область 10
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаВиновныеЛица, "100, 100, 100, 100, 100");
			Область10.Параметры.ВиновныеЛицаЧасть1 = СписокСтрок[0];
			Область10.Параметры.ВиновныеЛицаЧасть2 = СписокСтрок[1];
			Область10.Параметры.ВиновныеЛицаЧасть3 = СписокСтрок[2];
			Область10.Параметры.ВиновныеЛицаЧасть4 = СписокСтрок[3];
			Область10.Параметры.ВиновныеЛицаЧасть5 = СписокСтрок[4];
			
			ТабличныйДокумент.Вывести(Область10);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 5);
			
			/////////////////////////////////////////////////
			// Область 11
			
			Область11.Параметры.ОрганизацияНаименованиеАдрес = ДанныеДокумента.НаименованиеОрганизации + " " + ДанныеДокумента.СведенияОбОрганизацииФактическийАдрес;
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.МероприятияПоУстранениюПричин, "100");
			Область11.Параметры.УстранениеПричинЧасть1 = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область11);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 12
			
			ПервыйЧленКомиссии = Истина;
			Для каждого ФИОЧленаКомиссии Из ДанныеДокумента.МассивФИОЧленовКомиссии Цикл
				Если ПервыйЧленКомиссии Тогда
					ПервыйЧленКомиссии = Ложь;
					Область12.Параметры.ФИОЧленаКомиссии = ФИОЧленаКомиссии;
					ТабличныйДокумент.Вывести(Область12);
				Иначе
					ДопПодпись.Параметры.ФИОЧленаКомиссии = ФИОЧленаКомиссии;
					ТабличныйДокумент.Вывести(ДопПодпись);
				КонецЕсли;
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьПояснения);
			
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьИзвещенияОГрупповомНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_ИзвещениеОГрупповомНесчастномСлучае";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область1 = Макет.ПолучитьОбласть("Область1");
		Область2 = Макет.ПолучитьОбласть("Область2");
		Область3 = Макет.ПолучитьОбласть("Область3");
		Область4 = Макет.ПолучитьОбласть("Область4");
		ДопСтрока = Макет.ПолучитьОбласть("ДопСтрока");
		
		////////////////////////////////////////////////
		// Область 1
		
		ДанныеДокумента = ДанныеПечати.Значение;
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОбОрганизации, "100,100,100, 100");
		Область1.Параметры.СведенияОбОрганизацииЧасть1 = СписокСтрок[0];
		Область1.Параметры.СведенияОбОрганизацииЧасть2 = СписокСтрок[1];
		Область1.Параметры.СведенияОбОрганизацииЧасть3 = СписокСтрок[2];
		Область1.Параметры.СведенияОбОрганизацииЧасть4 = СписокСтрок[3];
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДЛФ=DDT") + ", "
			+ ДанныеДокумента.ХарактеристикаМестаПроисшествия + ", " + ДанныеДокумента.ОбстоятельстваПроисшествия, "100,100");
		Область1.Параметры.СведенияОПроисшествииЧасть1 = СписокСтрок[0];
		Область1.Параметры.СведенияОПроисшествииЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Область1);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
		
		/////////////////////////////////////////////////
		// Область 2
		
		Область2.Параметры.ЧислоПострадавших = ДанныеДокумента.ЧислоПострадавших;
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПострадавшие, "100,100");
		Область2.Параметры.СведенияОПострадавшихЧасть1 = СписокСтрок[0];
		Область2.Параметры.СведенияОПострадавшихЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Область2);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
		
		////////////////////////////////////////////////
		// Область 3
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОПовреждениях, "100,100");
		Область3.Параметры.СведенияОПоврежденияхЧасть1 = СписокСтрок[0];
		Область3.Параметры.СведенияОПоврежденияхЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Область3);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
		
		////////////////////////////////////////////////
		// Область 4
		
		ТабличныйДокумент.Вывести(Область4);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьПриказОСозданииКомиссии(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_ПриказОСозданииКомиссии";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_ПриказОСозданииКомиссии");
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьУчастникКомиссии = Макет.ПолучитьОбласть("УчастникКомиссии");
		ОбластьПодписьУчастникКомиссии = Макет.ПолучитьОбласть("ПодписьУчастникКомиссии");
		
		ОбластьЗаголовок.Параметры.Организация = ДанныеДокумента.НаименованиеОрганизации;
		ОбластьЗаголовок.Параметры.НомерПриказа = ДанныеДокумента.НомерПриказа;
		ОбластьЗаголовок.Параметры.ДатаПриказа = ДанныеДокумента.ДатаПриказа;
		ОбластьЗаголовок.Параметры.Город = ДанныеДокумента.Город;
		ОбластьЗаголовок.Параметры.ДатаПроисшествия =
			Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, НСтр("ru='ДФ=''дд ММММ гггг ""г. в "" ЧЧ:мм'''"));
		ОбластьЗаголовок.Параметры.СписокПострадавших = ДанныеДокумента.СписокПострадавших;
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		Для Каждого СтрокаУчастникаКомиссии Из ДанныеДокумента.МассивФИОЧленовКомиссииСДолжностями Цикл
			ОбластьУчастникКомиссии.Параметры.УчастникКомиссии = СтрокаУчастникаКомиссии;
			ТабличныйДокумент.Вывести(ОбластьУчастникКомиссии);
		КонецЦикла;
		
		ФИООтветственногоСклоняемое = "";
		ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеДокумента.ФамилияОтветственного), 3, ФИООтветственногоСклоняемое, ДанныеДокумента.ПолОтветственного);
		ФИООтветственногоСклоняемое = СтрЗаменить(ДанныеДокумента.ФИООтветственногоЗаОхрануТруда, ДанныеДокумента.ФамилияОтветственного, ФИООтветственногоСклоняемое);
		ФИОДолжностьОтветственного = ФИООтветственногоСклоняемое + ?(ЗначениеЗаполнено(ДанныеДокумента.ДолжностьОтветственногоЗаОхрануТруда), " (" + ДанныеДокумента.ДолжностьОтветственногоЗаОхрануТруда + ")", "");
		
		ФИОРуководителяСклоняемое = "";
		ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ДанныеДокумента.ФамилияРуководителя), 2, ФИОРуководителяСклоняемое, ДанныеДокумента.ПолРуководителя);
		ФИОРуководителяСклоняемое = СтрЗаменить(ДанныеДокумента.ФИОРуководителя, ДанныеДокумента.ФамилияРуководителя, ФИОРуководителяСклоняемое);
		
		ОбластьПодвал.Параметры.ФИОДолжностьОтветственного = ФИОДолжностьОтветственного; 
		ОбластьПодвал.Параметры.ФИОРуководителяРод = ФИОРуководителяСклоняемое;
		ОбластьПодвал.Параметры.СписокКомиссии = ДанныеДокумента.СписокКомиссии;
		ОбластьПодвал.Параметры.ДатаПриказа = ДанныеДокумента.Дата;
		ОбластьПодвал.Параметры.ДолжностьРуководителя = ДанныеДокумента.ДолжностьРуководителя;
		ОбластьПодвал.Параметры.Организация = ДанныеДокумента.НаименованиеОрганизации;
		ОбластьПодвал.Параметры.ФИОРуководителя = ДанныеДокумента.ФИОРуководителя;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		Для каждого ФИОЧленаКомиссии Из ДанныеДокумента.МассивФИОЧленовКомиссии Цикл
			ОбластьПодписьУчастникКомиссии.Параметры.ФИОУчастникаКомиссии = ФИОЧленаКомиссии;
			ТабличныйДокумент.Вывести(ОбластьПодписьУчастникКомиссии);
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьПротоколОсмотра(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_ПротоколОсмотра";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	ДатаПриказа223Н = ОхранаТруда.ДатаВступленияВСилуПриказа223Н();
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЭтоПриказ223Н = ДанныеДокумента.ДатаПроисшествияДатаВремя >= ДатаПриказа223Н;
		
		ПервыйПострадавший = Истина;
		Для каждого СтрокаПострадавшего Из ДанныеДокумента.Пострадавшие Цикл
			
			// Документы нужно выводить на разных страницах.
			Если Не ПервыйПострадавший Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйПострадавший = Ложь;
			КонецЕсли;
			
			Область1 = Макет.ПолучитьОбласть("Область1");
			Область2 = Макет.ПолучитьОбласть("Область2");
			Область3 = Макет.ПолучитьОбласть("Область3");
			Область4 = Макет.ПолучитьОбласть("Область4");
			Область5 = Макет.ПолучитьОбласть("Область5");
			Область6 = Макет.ПолучитьОбласть("Область6");
			Область7 = Макет.ПолучитьОбласть("Область7");
			Область8 = Макет.ПолучитьОбласть("Область8");
			Область9 = Макет.ПолучитьОбласть("Область9");
			Область10 = Макет.ПолучитьОбласть("Область10");
			Область11 = Макет.ПолучитьОбласть("Область11");
			Область12 = Макет.ПолучитьОбласть("Область12");
			Область13 = Макет.ПолучитьОбласть("Область13");
			Область14 = Макет.ПолучитьОбласть("Область14");
			Область15 = Макет.ПолучитьОбласть("Область15");
			Область16 = Макет.ПолучитьОбласть("Область16");
			ОбластьСОУТ_1 = Макет.ПолучитьОбласть("ОбластьСОУТ_1");
			ОбластьСОУТ_2 = Макет.ПолучитьОбласть("ОбластьСОУТ_2");
			ДопСтрока = Макет.ПолучитьОбласть("ДопСтрока");
			ДопПодпись1 = Макет.ПолучитьОбласть("ДопПодпись1");
			ДопПодпись2 = Макет.ПолучитьОбласть("ДопПодпись2");
			ОбластьПояснения = Макет.ПолучитьОбласть("ОбластьПояснения");
			
			////////////////////////////////////////////////
			// Область 1
			
			Область1.Параметры.ДатаПроисшествия = ДанныеДокумента.ДатаПроисшествия;
			
			ФИОПострадавшегоСклоняемое = "";
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(СтрокаПострадавшего.Фамилия), 5, ФИОПострадавшегоСклоняемое, СтрокаПострадавшего.Пол);
			ФИОПострадавшегоСклоняемое = СтрЗаменить(СтрокаПострадавшего.ФамилияИО, СтрокаПострадавшего.Фамилия, ФИОПострадавшегоСклоняемое);
			Область1.Параметры.ФИОДолжностьПострадавшего = ФИОПострадавшегоСклоняемое + " (" + СтрокаПострадавшего.ДолжностьНаименование + ")";
			Область1.Параметры.МестоСоставленияПротоколаОсмотра = ДанныеДокумента.МестоСоставленияПротоколаОсмотра;
			Область1.Параметры.ДатаСоставленияПротоколаОсмотра = ДанныеДокумента.ДатаСоставленияПротоколаОсмотра;
			Область1.Параметры.ДатаПриказа = ДанныеДокумента.ДатаПриказа;
			Область1.Параметры.НомерПриказа = ДанныеДокумента.НомерПриказа;
			
			Область1.Параметры.НачалоОсмотраЧасы = Час(ДанныеДокумента.ОсмотрНачат);
			Область1.Параметры.НачалоОсмотраМинуты = Формат(ДанныеДокумента.ОсмотрНачат, "ДФ=мм");
			Область1.Параметры.ОкончаниеОсмотраЧасы = Час(ДанныеДокумента.ОсмотрОкончен);
			Область1.Параметры.ОкончаниеОсмотраМинуты = Формат(ДанныеДокумента.ОсмотрОкончен, "ДФ=мм");
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.НаименованиеОрганизации, "65, 999");
			Область1.Параметры.НаименованиеОрганизацииЧасть1 = СписокСтрок[0];
			Область1.Параметры.НаименованиеОрганизацииЧасть2 = СписокСтрок[1];
			
			Область1.Параметры.СведенияОПредседателеКомиссии = ДанныеДокумента.СведенияОПредседателеКомиссии;
			
			ОрганизацияИДата = ДанныеДокумента.НаименованиеСокращенное + " " + ДанныеДокумента.НаименованиеПодразделения
				+ " " + ДанныеДокумента.ДатаПроисшествия;
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ОрганизацияИДата, "50, 999");
			Область1.Параметры.ОрганизацияИДатаЧасть1 = СписокСтрок[0];
			Область1.Параметры.ОрганизацияИДатаЧасть2 = СписокСтрок[1];
			
			ДолжностьСклоняемая = "";
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(СтрокаПострадавшего.ДолжностьНаименование), 5, ДолжностьСклоняемая, СтрокаПострадавшего.Пол);
			
			СведенияОПострадавшем = ДолжностьСклоняемая + " " + ФИОПострадавшегоСклоняемое;
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СведенияОПострадавшем, "100, 999");
			Область1.Параметры.СведенияОПострадавшемЧасть1 = СписокСтрок[0];
			Область1.Параметры.СведенияОПострадавшемЧасть2 = СписокСтрок[1];
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаУчастникиОсмотраБезПредседателя, "55,100,100");
			Область1.Параметры.УчастникиОсмотраЧасть1 = СписокСтрок[0];
			Область1.Параметры.УчастникиОсмотраЧасть2 = СписокСтрок[1];
			Область1.Параметры.УчастникиОсмотраЧасть3 = СписокСтрок[2];
			
			ТабличныйДокумент.Вывести(Область1);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 3);
			
			/////////////////////////////////////////////////
			// Область 2
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОбстановкаИСостояниеМестаПроисшествия, "100,100");
			Область2.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть1 = СписокСтрок[0];
			Область2.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область2);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 3
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОписаниеРабочегоМеста, "65,100");
			Область3.Параметры.ОписаниеРабочегоМестаЧасть1 = СписокСтрок[0];
			Область3.Параметры.ОписаниеРабочегоМестаЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область3);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область СОУТ до 1.09.2022
			
			Если Не ЭтоПриказ223Н Тогда
				ТабличныйДокумент.Вывести(ОбластьСОУТ_1);
				СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.СведенияСОУТ, "100");
				ДопСтрока.Параметры.ТекстСтроки = СписокСтрок[0];
				
				ТабличныйДокумент.Вывести(ДопСтрока);
				ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
				
				ТабличныйДокумент.Вывести(ОбластьСОУТ_2);
				СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СтрокаПострадавшего.СведенияОПСОУТ, "100");
				ДопСтрока.Параметры.ТекстСтроки = СписокСтрок[0];
				
				ТабличныйДокумент.Вывести(ДопСтрока);
				ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			КонецЕсли;
			
			/////////////////////////////////////////////////
			// Область 4
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОписаниеОборудования, "55,100");
			Область4.Параметры.ОписаниеОборудованияЧасть1 = СписокСтрок[0];
			Область4.Параметры.ОписаниеОборудованияЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область4);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 5
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СостояниеЗащитныхОграждений, "25,100");
			Область5.Параметры.СостояниеЗащитныхОгражденийЧасть1 = СписокСтрок[0];
			Область5.Параметры.СостояниеЗащитныхОгражденийЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область5);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 6
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СостояниеЗащитныхСредств, "100,100");
			Область6.Параметры.СостояниеЗащитныхСредствЧасть1 = СписокСтрок[0];
			Область6.Параметры.СостояниеЗащитныхСредствЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область6);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 7
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СостояниеОбщеобменнойВентиляции, "35");
			Область7.Параметры.СостояниеОбщеобменнойВентиляцииЧасть1 = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область7);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 8
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СостояниеОсвещенности, "50,100");
			Область8.Параметры.СостояниеОсвещенностиЧасть1 = СписокСтрок[0];
			Область8.Параметры.СостояниеОсвещенностиЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область8);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область СОУТ после 1.09.2022
			
			Если ЭтоПриказ223Н Тогда
				ОбластьСОУТ_1.Параметры.СведенияСОУТ = СтрокаПострадавшего.СведенияСОУТ;
				ТабличныйДокумент.Вывести(ОбластьСОУТ_1);
				
				ОбластьСОУТ_2.Параметры.СведенияОбОрганизацииПроводившейСОУТ = СтрокаПострадавшего.СведенияОПСОУТ;
				ТабличныйДокумент.Вывести(ОбластьСОУТ_2);
			КонецЕсли;
			
			/////////////////////////////////////////////////
			// Область 9
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ТехническиеСредстваОсмотра, "60,100");
			Область9.Параметры.ТехническиеСредстваОсмотра = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область9);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 10
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ИзъятыеПредметы, "60,100");
			Область10.Параметры.ИзъятыеПредметы = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область10);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 11
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ПрилагаемыеДокументы, "55,100");
			Область11.Параметры.МатериалыОсмотра = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область11);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 12
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаУчастникиОсмотра, "25,100");
			Область12.Параметры.СведенияОбУчаствующихВОсмотреЧасть1 = СписокСтрок[0];
			Область12.Параметры.СведенияОбУчаствующихВОсмотреЧасть2 = СписокСтрок[1];
			
			ТабличныйДокумент.Вывести(Область12);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
			
			/////////////////////////////////////////////////
			// Область 13
			
			Область13.Параметры.ЗаявленияПоступили = ?(ДанныеДокумента.СтрокаПоступившихЗаявлений = "", НСтр("ru = 'не поступили'"), НСтр("ru = 'поступили'"));
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПоступившихЗаявлений, "35,100");
			Область13.Параметры.ПоступившиеЗаявленияЧасть1 = СписокСтрок[0];
			
			ТабличныйДокумент.Вывести(Область13);
			ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
			
			/////////////////////////////////////////////////
			// Область 14
			
			Область14.Параметры.ОсмотрМестаПроизвел = ДанныеДокумента.ФИООсмотрМестаПроизвел;
			ТабличныйДокумент.Вывести(Область14);
			Для каждого ФИОУчастникаОсмотра Из ДанныеДокумента.МассивУчастниковОсмотра Цикл
				ДопПодпись1.Параметры.ОсмотрМестаПроизвел = ФИОУчастникаОсмотра;
				ТабличныйДокумент.Вывести(ДопПодпись1);
			КонецЦикла;
			
			/////////////////////////////////////////////////
			// Область 15
			
			ПервыйЧленКомиссии = Истина;
			Для каждого ФИОЧленаКомиссии Из ДанныеДокумента.МассивФИОЧленовКомиссии Цикл
				Если ПервыйЧленКомиссии Тогда
					ПервыйЧленКомиссии = Ложь;
					Область15.Параметры.Участник = ФИОЧленаКомиссии;
					ТабличныйДокумент.Вывести(Область15);
				Иначе
					ДопПодпись2.Параметры.Участник = ФИОЧленаКомиссии;
					ТабличныйДокумент.Вывести(ДопПодпись2);
				КонецЕсли;
			КонецЦикла;
			
			/////////////////////////////////////////////////
			// Область 16
			
			Область16.Параметры.ОсмотрМестаПроизвел = ДанныеДокумента.ФИООсмотрМестаПроизвел;
			Область16.Параметры.ПротоколОсмотраСоставил = ДанныеДокумента.ФИОПротоколОсмотраСоставил;
			
			ТабличныйДокумент.Вывести(Область16);
			
			ТабличныйДокумент.Вывести(ОбластьПояснения);
			
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// ЗУПК
Функция ПечатьАктОНесчастномСлучае(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_АктОНесчастномСлучае";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ПервыйПострадавший = Истина;
		Для Каждого СтрокаПострадавшего Из ДанныеДокумента.Пострадавшие Цикл
			
			// Документы нужно выводить на разных страницах.
			Если Не ПервыйПострадавший Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Иначе
				ПервыйПострадавший = Ложь;
			КонецЕсли;
			
			Область1 = Макет.ПолучитьОбласть("Область1");
			
			////////////////////////////////////////////////
			// Область 1
			
			Область1.Параметры.Заполнить(ДанныеДокумента);
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОбОрганизацииРК, "50,999");
			Область1.Параметры.СведенияОбОрганизацииЧасть1 = СписокСтрок[0];
			Область1.Параметры.СведенияОбОрганизацииЧасть2 = СписокСтрок[1];
			
			Область1.Параметры.ВремяДатаСлучая = """" + Час(ДанныеДокумента.ДатаПроисшествияДатаВремя) + """ "
				+ """" + День(ДанныеДокумента.ДатаПроисшествияДатаВремя) + """ "
				+ """" + Месяц(ДанныеДокумента.ДатаПроисшествияДатаВремя) + """ "
				+ """" + Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДФ=yy") + """";
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ХарактеристикаМестаПроисшествия, "60,999");
			Область1.Параметры.ОписаниеРабочегоМестаЧасть1 = СписокСтрок[0];
			Область1.Параметры.ОписаниеРабочегоМестаЧасть2 = СписокСтрок[1];
			
			Если ЗначениеЗаполнено(ДанныеДокумента.ВидПроисшествия) Тогда
				ВидПроисшествияНаименование = ДанныеДокумента.ВидПроисшествия.ПолноеНаименование;
				ВидПроисшествияКод = """" + ДанныеДокумента.ВидПроисшествия.КодПоКлассификатору + """";
			Иначе
				ВидПроисшествияНаименование = "";
				ВидПроисшествияКод = "";
			КонецЕсли;
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ВидПроисшествияНаименование, "50,999");
			Область1.Параметры.ВидПроисшествияЧасть1 = СписокСтрок[0];
			Область1.Параметры.ВидПроисшествияЧасть2 = СписокСтрок[1];
			Область1.Параметры.ВидПроисшествияКод = ВидПроисшествияКод;
			
			Область1.Параметры.ПострадавшийФИО = СтрокаПострадавшего.ФИОПолные;
			
			ПолКод = "";
			Если СтрокаПострадавшего.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				ПолКод = """1""";
			ИначеЕсли СтрокаПострадавшего.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				ПолКод = """2""";
			КонецЕсли;
			Область1.Параметры.ПострадавшийПол = Строка(СтрокаПострадавшего.Пол);
			Область1.Параметры.ПострадавшийПолКод = ПолКод;
			Возраст = Строка(СтрокаПострадавшего.Возраст);
			Область1.Параметры.ПострадавшийВозраст = Возраст;
			Область1.Параметры.ПострадавшийВозрастКод = """" + Возраст + """";
			Область1.Параметры.ПострадавшийДолжность = СтрокаПострадавшего.ДолжностьНаименование;
			Область1.Параметры.ПострадавшийДолжностьКод = """" + СтрокаПострадавшего.КодДолжности + """";
			Если СтрокаПострадавшего.СтажРаботыНаПредприятииЛет = 0 Тогда
				СтажРаботыЛет = """00""";
			Иначе
				СтажРаботыЛет = """" + Строка(СтрокаПострадавшего.СтажРаботыНаПредприятииЛет) + """";
			КонецЕсли;
			Область1.Параметры.ПострадавшийСтажВОрганизации = СтрокаПострадавшего.СтажВОрганизацииПредставление;
			Область1.Параметры.ПострадавшийСтажВОрганизацииКод = СтажРаботыЛет;
			
			СтрокиИнструктажей = ДанныеДокумента.Инструктажи.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаИнструктажей Из СтрокиИнструктажей Цикл
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаВводногоИнструктажа) Тогда
					Область1.Параметры.ДатаВводногоИнструктажа = Формат(СтрокаИнструктажей.ДатаВводногоИнструктажа, "ДЛФ=ДД");
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте) Тогда
					Область1.Параметры.ДатаИнструктажаНаРабочемМесте = Формат(СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте, "ДЛФ=ДД");
				КонецЕсли;
			КонецЦикла;
			
			СтрокиМедицинскиеОсмотры = ДанныеДокумента.МедицинскиеОсмотры.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаМедицинскиеОсмотры Из СтрокиМедицинскиеОсмотры Цикл
				Если СтрокаМедицинскиеОсмотры.ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр Тогда
					Область1.Параметры.ДатаМедицинскогоОсмотра = Формат(СтрокаМедицинскиеОсмотры.ДатаПройденногоОсмотра, "ДЛФ=ДД");
				КонецЕсли;
			КонецЦикла;
			
			СтрокиМедицинскиеОсмотры = ДанныеДокумента.ПредварительныеМедицинскиеОсмотры.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаМедицинскиеОсмотры Из СтрокиМедицинскиеОсмотры Цикл
				Область1.Параметры.ДатаПредварительногоМедицинскогоОсмотра = Формат(СтрокаМедицинскиеОсмотры.ДатаПройденногоОсмотра, "ДЛФ=ДД");
			КонецЦикла;
			
			СтрокиДиагнозы = ДанныеДокумента.ОкончательныеДиагнозы.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаДиагноза Из СтрокиДиагнозы Цикл
				Область1.Параметры.ОкончательныйДиагноз = СтрокаДиагноза.ОкончательныйДиагноз;
			КонецЦикла;
			
			ЧасовОтНачалаРаботы = Строка(ДанныеДокумента.ПолныхЧасовОтНачалаРаботы);
			Область1.Параметры.ЧасовОтНачалаРаботы = ЧасовОтНачалаРаботы;
			Область1.Параметры.ЧасовОтНачалаРаботыКод = """" + ЧасовОтНачалаРаботы + """";
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОбстоятельстваПроисшествия, "60,100,100,999");
			Область1.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть1 = СписокСтрок[0];
			Область1.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть2 = СписокСтрок[1];
			Область1.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть3 = СписокСтрок[2];
			Область1.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть4 = СписокСтрок[3];
			
			Если ДанныеДокумента.ОсновныеПричиныПроисшествия.Количество() = 2 Тогда
				Область1.Параметры.ПричинаНесчастногоСлучая1 = ДанныеДокумента.ОсновныеПричиныПроисшествия[0];
				Область1.Параметры.ПричинаНесчастногоСлучая1Код = ДанныеДокумента.ОсновныеПричиныПроисшествия[1];
			ИначеЕсли ДанныеДокумента.ОсновныеПричиныПроисшествия.Количество() = 4 Тогда
				Область1.Параметры.ПричинаНесчастногоСлучая1 = ДанныеДокумента.ОсновныеПричиныПроисшествия[0];
				Область1.Параметры.ПричинаНесчастногоСлучая1Код = ДанныеДокумента.ОсновныеПричиныПроисшествия[1];
				Область1.Параметры.ПричинаНесчастногоСлучая2 = ДанныеДокумента.ОсновныеПричиныПроисшествия[2];
				Область1.Параметры.ПричинаНесчастногоСлучая2Код = ДанныеДокумента.ОсновныеПричиныПроисшествия[3];
			КонецЕсли;
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаОчевидцыФИО, "60,999");
			Область1.Параметры.ОчевидцыЧасть1 = СписокСтрок[0];
			Область1.Параметры.ОчевидцыЧасть2 = СписокСтрок[1];
			
			Область1.Параметры.ПострадавшийФизическоеСостояние = НСтр("ru = 'Характер повреждений: '") + СтрокаПострадавшего.ХарактерПовреждений
				+ НСтр("ru = '; вид и степень опьянения: '") + СтрокаПострадавшего.ВидИСтепеньОпьянения;
			
			Область1.Параметры.ПострадавшийСтепеньТравмы = ДанныеДокумента.СтепеньТравмы;
			Если ДанныеДокумента.СтепеньТравмы = "Легкая" Тогда
				ПострадавшийСтепеньТравмыКод = """01""";
			ИначеЕсли ДанныеДокумента.СтепеньТравмы = "Средняя" Тогда
				ПострадавшийСтепеньТравмыКод = """02""";
			ИначеЕсли ДанныеДокумента.СтепеньТравмы = "Тяжелая" Тогда
				ПострадавшийСтепеньТравмыКод = """03""";
			ИначеЕсли ДанныеДокумента.СтепеньТравмы = "Умер" Тогда
				ПострадавшийСтепеньТравмыКод = """04""";
			Иначе
				ПострадавшийСтепеньТравмыКод = "";
			КонецЕсли;
			Область1.Параметры.ПострадавшийСтепеньТравмыКод = ПострадавшийСтепеньТравмыКод;
			
			СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.МероприятияПоУстранениюПричин, "60,999");
			Область1.Параметры.УстранениеПричинЧасть1 = СписокСтрок[0];
			Область1.Параметры.УстранениеПричинЧасть2 = СписокСтрок[1];
			
			СтрокиСтепениВины = ДанныеДокумента.СтепениВины.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаСтепениВины Из СтрокиСтепениВины Цикл
				Область1.Параметры.СтепеньВиныРаботника = Строка(СтрокаСтепениВины.СтепеньВиныРаботника) + "%";
				Область1.Параметры.СтепеньВиныРаботодателя = Строка(СтрокаСтепениВины.СтепеньВиныРаботодателя) + "%";
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ДанныеДокумента.ФИООтветственногоЗаОхрануТруда) Тогда
				Область1.Параметры.ФИОПредставителя = ДанныеДокумента.ФИООтветственногоЗаОхрануТрудаРК;
			Иначе
				Область1.Параметры.ФИОПредставителя = ДанныеДокумента.ФИОРуководителяРК;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Область1);
			
		КонецЦикла;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьАктРасследованияНесчастногоСлучая(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_АктРасследованияНесчастногоСлучая";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область1 = Макет.ПолучитьОбласть("Область1");
		СтрокаТаблицы1 = Макет.ПолучитьОбласть("СтрокаТаблицы1");
		Область2 = Макет.ПолучитьОбласть("Область2");
		СтрокаТаблицы2 = Макет.ПолучитьОбласть("СтрокаТаблицы2");
		Область3 = Макет.ПолучитьОбласть("Область3");
		СтрокаЧленКомиссии = Макет.ПолучитьОбласть("СтрокаЧленКомиссии");
		
		////////////////////////////////////////////////
		// Область 1
		
		Область1.Параметры.Заполнить(ДанныеДокумента);
		
		Область1.Параметры.ПроисшествиеЧасы = Час(ДанныеДокумента.ДатаПроисшествияДатаВремя);
		Область1.Параметры.ПроисшествиеМинуты = Формат(ДанныеДокумента.ДатаПроисшествияДатаВремя, "ДФ=мм");
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.НаименованиеОрганизации, "55, 999");
		Область1.Параметры.НаименованиеОрганизацииЧасть1 = СписокСтрок[0];
		Область1.Параметры.НаименованиеОрганизацииЧасть2 = СписокСтрок[1];
		
		Если ЗначениеЗаполнено(ДанныеДокумента.СведенияОбОрганизацииНаправившейРаботника) Тогда
			СведенияОПострадавших = ДанныеДокумента.СведенияОбОрганизацииНаправившейРаботника;
		Иначе
			СведенияОПострадавших = ДанныеДокумента.НаименованиеОрганизации;
		КонецЕсли;
		СведенияОПострадавших = СведенияОПострадавших + ", ";
		Для Каждого СтрокаПострадавшего Из ДанныеДокумента.Пострадавшие Цикл
			ФИОПострадавшегоСклоняемое = "";
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(СтрокаПострадавшего.ФИОПолные), 5, ФИОПострадавшегоСклоняемое, СтрокаПострадавшего.Пол);
			
			СведенияОПострадавших = СведенияОПострадавших + ФИОПострадавшегоСклоняемое + ", ";
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СведенияОПострадавших, 2);
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СведенияОПострадавших, "100, 999");
		Область1.Параметры.СведенияОПострадавшихЧасть1 = СписокСтрок[0];
		Область1.Параметры.СведенияОПострадавшихЧасть2 = СписокСтрок[1];
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаЧленыКомиссииБезОрганизации, "75,75,999");
		Область1.Параметры.УчастникиОсмотраЧасть1 = СписокСтрок[0];
		Область1.Параметры.УчастникиОсмотраЧасть2 = СписокСтрок[1];
		Область1.Параметры.УчастникиОсмотраЧасть3 = СписокСтрок[2];
		
		ТабличныйДокумент.Вывести(Область1);
		
		////////////////////////////////////////////////
		// Область 2
		
		Номер = 1;
		Для Каждого СтрокаПострадавшего Из ДанныеДокумента.Пострадавшие Цикл
			СтрокаТаблицы1.Параметры.ПострадавшиеНомер = Номер;
			СтрокаТаблицы1.Параметры.ПострадавшиеФИО = СтрокаПострадавшего.ФИОПолные;
			СтрокаТаблицы1.Параметры.ПострадавшиеГодРождения = Формат(СтрокаПострадавшего.ДатаРождения, "ДФ = yyyy");
			СтрокаТаблицы1.Параметры.ПострадавшиеДолжностьСтаж = СтрокаПострадавшего.ДолжностьНаименование + ", стаж " + СтрокаПострадавшего.СтажВОрганизацииПредставление;
			СтрокаТаблицы1.Параметры.ПострадавшиеСтепеньТравмы = ДанныеДокумента.СтепеньТравмы;
			СтрокаТаблицы1.Параметры.ПострадавшиеИждивенцы = СтрокаПострадавшего.СоставСемьи;
			
			ДатаВводногоИнструктажа = Дата(1,1,1);
			ДатаИнструктажаНаРабочемМесте = Дата(1,1,1);
			СтрокиИнструктажей = ДанныеДокумента.Инструктажи.НайтиСтроки(Новый Структура("Пострадавший", СтрокаПострадавшего.Пострадавший));
			Для Каждого СтрокаИнструктажей Из СтрокиИнструктажей Цикл
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаВводногоИнструктажа) Тогда
					ДатаВводногоИнструктажа = СтрокаИнструктажей.ДатаВводногоИнструктажа;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте) Тогда
					ДатаИнструктажаНаРабочемМесте = СтрокаИнструктажей.ДатаИнструктажаНаРабочемМесте;
				КонецЕсли;
			КонецЦикла;
			Если ДатаВводногоИнструктажа > ДатаИнструктажаНаРабочемМесте Тогда
				ПоследнийИнструктаж = ДатаВводногоИнструктажа;
			Иначе
				ПоследнийИнструктаж = ДатаИнструктажаНаРабочемМесте;
			КонецЕсли;
			СтрокаТаблицы1.Параметры.ПострадавшиеДатаИнструктажа = Формат(ПоследнийИнструктаж, "ДЛФ=ДД");
			
			ТабличныйДокумент.Вывести(СтрокаТаблицы1);
			Номер = Номер + 1;
		КонецЦикла;
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ХарактеристикаМестаПроисшествия, "100,999");
		Область2.Параметры.ОписаниеРабочегоМестаЧасть1 = СписокСтрок[0];
		Область2.Параметры.ОписаниеРабочегоМестаЧасть2 = СписокСтрок[1];
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.ОбстоятельстваПроисшествия, "100,999");
		Область2.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть1 = СписокСтрок[0];
		Область2.Параметры.ОбстановкаИСостояниеМестаПроисшествияЧасть2 = СписокСтрок[1];
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПричиныПроисшествия, "100,999");
		Область2.Параметры.ПричиныНесчастногоСлучаяЧасть1 = СписокСтрок[0];
		Область2.Параметры.ПричиныНесчастногоСлучаяЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Область2);
		
		ТабличныйДокумент.Вывести(СтрокаТаблицы2);
		
		////////////////////////////////////////////////
		// Область 3
		
		Область3.Параметры.ПредседательКомиссии = ДанныеДокумента.СведенияОПредседателеКомиссииБезДолжности;
		
		ЭтоПервый = Истина;
		Для Каждого ЧленКомиссии Из ДанныеДокумента.МассивФИОЧленовКомиссииРК Цикл
			Если ЧленКомиссии = ДанныеДокумента.СведенияОПредседателеКомиссииБезДолжности Тогда
				Продолжить;
			КонецЕсли;
			Если ЭтоПервый Тогда
				Область3.Параметры.ЧленКомиссии = ЧленКомиссии;
				ЭтоПервый = Ложь;
				ТабличныйДокумент.Вывести(Область3);
			Иначе
				СтрокаЧленКомиссии.Параметры.ЧленКомиссии = ЧленКомиссии;
				ТабличныйДокумент.Вывести(СтрокаЧленКомиссии);
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоПервый Тогда // члены комиссии не заполнены
			ТабличныйДокумент.Вывести(Область3);
		КонецЕсли;
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
// ЗУПК

Функция ПечатьСообщениеОСтраховомСлучае(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НесчастныйСлучайНаПроизводстве_СообщениеОСтраховомСлучае";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НесчастныйСлучайНаПроизводстве.ПФ_MXL_СообщениеОСтраховомСлучае");
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область1 = Макет.ПолучитьОбласть("Область1");
		Область2 = Макет.ПолучитьОбласть("Область2");
		Область3 = Макет.ПолучитьОбласть("Область3");
		Область4 = Макет.ПолучитьОбласть("Область4");
		ДопСтрока = Макет.ПолучитьОбласть("ДопСтрока");
		
		////////////////////////////////////////////////
		// Область 1
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОбОрганизацииФСС, "100,100,100");
		Область1.Параметры.СведенияОбОрганизацииЧасть1 = СписокСтрок[0];
		Область1.Параметры.СведенияОбОрганизацииЧасть2 = СписокСтрок[1];
		Область1.Параметры.СведенияОбОрганизацииЧасть3 = СписокСтрок[2];
		
		СведенияОПроисшествии = ДанныеДокумента.ДатаПроисшествия + " в " + ДанныеДокумента.ДатаПроисшествияЧасы + ":" + ДанныеДокумента.ДатаПроисшествияМинуты
			+ ", " + ДанныеДокумента.ХарактеристикаМестаПроисшествия + ", " + ДанныеДокумента.ОбстоятельстваПроисшествия;
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(СведенияОПроисшествии, "100,100,100,100");
		Область1.Параметры.СведенияОПроисшествииЧасть1 = СписокСтрок[0];
		Область1.Параметры.СведенияОПроисшествииЧасть2 = СписокСтрок[1];
		Область1.Параметры.СведенияОПроисшествииЧасть3 = СписокСтрок[2];
		Область1.Параметры.СведенияОПроисшествииЧасть4 = СписокСтрок[3];
		
		ТабличныйДокумент.Вывести(Область1);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 4);
		
		/////////////////////////////////////////////////
		// Область 2
		
		Область2.Параметры.ЧислоПострадавших = ДанныеДокумента.ЧислоПострадавших;
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СтрокаПострадавшиеФИОПолные, "100,100,100");
		Область2.Параметры.СведенияОПострадавшихЧасть1 = СписокСтрок[0];
		Область2.Параметры.СведенияОПострадавшихЧасть2 = СписокСтрок[1];
		Область2.Параметры.СведенияОПострадавшихЧасть3 = СписокСтрок[2];
		
		ТабличныйДокумент.Вывести(Область2);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 3);
		
		////////////////////////////////////////////////
		// Область 3
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ДанныеДокумента.СведенияОТрудовыхОтношениях, "100");
		Область3.Параметры.СведенияОТрудовыхОтношенияхЧасть1 = СписокСтрок[0];
		
		ТабличныйДокумент.Вывести(Область3);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 1);
		
		////////////////////////////////////////////////
		// Область 4
		
		ПередалСообщение = Строка(ДанныеДокумента.ОтветственныйЗаОхрануТруда) + " (" + ДанныеДокумента.ДолжностьОтветственногоЗаОхрануТруда + ")";
		
		СписокСтрок = ОхранаТруда.СтрокиДляПечатнойФормы(ПередалСообщение, "50,100");
		Область4.Параметры.ПередалСообщениеЧасть1 = СписокСтрок[0];
		Область4.Параметры.ПередалСообщениеЧасть2 = СписокСтрок[1];
		
		ТабличныйДокумент.Вывести(Область4);
		ОхранаТруда.ВывестиСтрокиМассива(ТабличныйДокумент, ДопСтрока, СписокСтрок, 2);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц  = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Легкого", НСтр("ru = 'Легкого'"));
	Запрос.УстановитьПараметр("Тяжелого", НСтр("ru = 'Тяжелого'"));
	// ЗУПК
	Запрос.УстановитьПараметр("Легкая", НСтр("ru = 'Легкая'"));
	Запрос.УстановитьПараметр("Средняя", НСтр("ru = 'Средняя'"));
	Запрос.УстановитьПараметр("Тяжелая", НСтр("ru = 'Тяжелая'"));
	Запрос.УстановитьПараметр("Умер", НСтр("ru = 'Умер'"));
	// ЗУПК
	Запрос.УстановитьПараметр("СоСмертельнымИсходом", НСтр("ru = 'Со смертельным исходом'"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводстве.Ссылка,
	|	НесчастныйСлучайНаПроизводстве.Номер,
	|	НесчастныйСлучайНаПроизводстве.Дата,
	|	НесчастныйСлучайНаПроизводстве.Организация,
	|	ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК НаименованиеОрганизации,
	|	ЕСТЬNULL(Организации.НаименованиеСокращенное, """") КАК НаименованиеСокращенное,
	|	НесчастныйСлучайНаПроизводстве.Подразделение,
	|	НесчастныйСлучайНаПроизводстве.Подразделение.Наименование КАК НаименованиеПодразделения,
	|	НесчастныйСлучайНаПроизводстве.ДатаПроисшествия КАК ДатаПроисшествияДатаВремя,
	|	НесчастныйСлучайНаПроизводстве.ПолныхЧасовОтНачалаРаботы,
	|	НесчастныйСлучайНаПроизводстве.СведенияОбОрганизацииНаправившейРаботника,
	|	ВЫБОР
	|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.Легкая)
	|			ТОГДА &Легкого
	|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.Тяжелая)
	|			ТОГДА &Тяжелого
	|		ИНАЧЕ &СоСмертельнымИсходом
	|	КОНЕЦ КАК ТипНесчастногоСлучая,
	// ЗУПК
	|	ВЫБОР
	|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.Легкая)
	|			ТОГДА &Легкая
	|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.Средняя)
	|			ТОГДА &Средняя
	|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.Тяжелая)
	|			ТОГДА &Тяжелая
	|		КОГДА НесчастныйСлучайНаПроизводстве.СтепеньТяжестиТравмы = ЗНАЧЕНИЕ(Перечисление.СтепениТяжестиТравмыНаПроизводстве.СоСмертельнымИсходом)
	|			ТОГДА &Умер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтепеньТравмы,
	// ЗУПК
	|	НесчастныйСлучайНаПроизводстве.ГрупповаяТравма,
	|	НесчастныйСлучайНаПроизводстве.ХарактеристикаМестаПроисшествия,
	|	НесчастныйСлучайНаПроизводстве.ОбстоятельстваПроисшествия,
	|	НесчастныйСлучайНаПроизводстве.ВидПроисшествия КАК ВидПроисшествия,
	|	НесчастныйСлучайНаПроизводстве.МероприятияПоУстранениюПричин,
	|	НесчастныйСлучайНаПроизводстве.КвалификацияНесчастногоСлучая,
	|	НесчастныйСлучайНаПроизводстве.ОсмотрМестаПроизвел,
	|	НесчастныйСлучайНаПроизводстве.ПротоколОсмотраСоставил,
	|	НесчастныйСлучайНаПроизводстве.ОбстановкаИСостояниеМестаПроисшествия,
	|	НесчастныйСлучайНаПроизводстве.ОписаниеРабочегоМеста,
	|	НесчастныйСлучайНаПроизводстве.ОписаниеОборудования,
	|	НесчастныйСлучайНаПроизводстве.СостояниеЗащитныхОграждений,
	|	НесчастныйСлучайНаПроизводстве.СостояниеЗащитныхСредств,
	|	НесчастныйСлучайНаПроизводстве.СостояниеОбщеобменнойВентиляции,
	|	НесчастныйСлучайНаПроизводстве.СостояниеОсвещенности,
	|	НесчастныйСлучайНаПроизводстве.ТехническиеСредстваОсмотра,
	|	НесчастныйСлучайНаПроизводстве.ИзъятыеПредметы,
	|	НесчастныйСлучайНаПроизводстве.ПрилагаемыеДокументы,
	|	НесчастныйСлучайНаПроизводстве.ОсмотрНачат,
	|	НесчастныйСлучайНаПроизводстве.ОсмотрОкончен,
	|	НесчастныйСлучайНаПроизводстве.МестоСоставленияПротоколаОсмотра,
	|	НесчастныйСлучайНаПроизводстве.ДатаСоставленияПротоколаОсмотра,
	|	НесчастныйСлучайНаПроизводстве.ДатаПриказа,
	|	НесчастныйСлучайНаПроизводстве.НомерПриказа,
	|	НесчастныйСлучайНаПроизводстве.ДатаАкта,
	|	НесчастныйСлучайНаПроизводстве.НомерАкта,
	|	НесчастныйСлучайНаПроизводстве.Руководитель,
	|	НесчастныйСлучайНаПроизводстве.ДолжностьРуководителя,
	|	НесчастныйСлучайНаПроизводстве.ОтветственныйЗаОхрануТруда,
	|	НесчастныйСлучайНаПроизводстве.ДолжностьОтветственногоЗаОхрануТруда,
	|	НесчастныйСлучайНаПроизводстве.Ответственный,
	|	НесчастныйСлучайНаПроизводстве.Комментарий
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве КАК НесчастныйСлучайНаПроизводстве
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО НесчастныйСлучайНаПроизводстве.Организация = Организации.Ссылка
	|ГДЕ
	|	НесчастныйСлучайНаПроизводстве.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеКомиссия.Ссылка,
	|	НесчастныйСлучайНаПроизводствеКомиссия.ЧленКомиссии,
	|	НесчастныйСлучайНаПроизводствеКомиссия.Должность,
	|	НесчастныйСлучайНаПроизводствеКомиссия.РольВКомиссии,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТКомиссия
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Комиссия КАК НесчастныйСлучайНаПроизводствеКомиссия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеКомиссия.Ссылка = ДанныеДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеУчастникиОсмотра.Ссылка,
	|	НесчастныйСлучайНаПроизводствеУчастникиОсмотра.Участник,
	|	НесчастныйСлучайНаПроизводствеУчастникиОсмотра.ПроцессуальноеПоложение,
	|	НесчастныйСлучайНаПроизводствеУчастникиОсмотра.ПоступившиеЗаявления,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТОсмотр
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.УчастникиОсмотра КАК НесчастныйСлучайНаПроизводствеУчастникиОсмотра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеУчастникиОсмотра.Ссылка = ДанныеДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Осмотр.Участник ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА Осмотр.Участник
	|	КОНЕЦ КАК Участник,
	|	Осмотр.Период
	|ПОМЕСТИТЬ ВТУчастникиОсмотраФизическиеЛица
	|ИЗ
	|	ВТОсмотр КАК Осмотр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка.Организация КАК Организация,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.РабочееМесто,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СтажОбщийПредставление,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СтажВОрганизацииПредставление,
	// ЗУПК
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СтажРаботыНаПредприятииЛет,
	// ЗУПК
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ОпьянениеПострадавшего,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ВидИСтепеньОпьянения,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ХарактерПовреждений,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СведенияСОУТ,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.СведенияОПСОУТ,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.НачалоСтажировки,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.ОкончаниеСтажировки,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТПострадавшиеФизическиеЛица
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = ДанныеДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеВиновныеЛица.Ссылка,
	|	НесчастныйСлучайНаПроизводствеВиновныеЛица.Ссылка.Организация КАК Организация,
	|	НесчастныйСлучайНаПроизводствеВиновныеЛица.ВиновноеЛицо,
	|	НесчастныйСлучайНаПроизводствеВиновныеЛица.ДопущенныеНарушения,
	|	НесчастныйСлучайНаПроизводствеВиновныеЛица.СтепеньВины,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТВиновныеЛицаФизическиеЛица
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.ВиновныеЛица КАК НесчастныйСлучайНаПроизводствеВиновныеЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеВиновныеЛица.Ссылка = ДанныеДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеОчевидцы.Ссылка,
	|	НесчастныйСлучайНаПроизводствеОчевидцы.Очевидец,
	|	НесчастныйСлучайНаПроизводствеОчевидцы.АдресПредставление,
	|	НесчастныйСлучайНаПроизводствеОчевидцы.КонтактныйТелефонПредставление,
	|	ДанныеДокументов.ДатаПроисшествияДатаВремя КАК Период
	|ПОМЕСТИТЬ ВТОчевидцыФизическиеЛица
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Очевидцы КАК НесчастныйСлучайНаПроизводствеОчевидцы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеОчевидцы.Ссылка = ДанныеДокументов.Ссылка";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТКомиссия", "ЧленКомиссии,Период");
	// ЗУПК
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФамилияИО, Пол, Фамилия, ФИОПолные");
	// ЗУПК
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Комиссия.Ссылка,
	|	Комиссия.ЧленКомиссии,
	|	Комиссия.Должность,
	|	ЕСТЬNULL(Должности.Наименование, Комиссия.Должность) КАК ДолжностьНаименование,
	|	Комиссия.РольВКомиссии,
	|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ФамилияИО, Комиссия.ЧленКомиссии) КАК ФамилияИО,
	|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.Фамилия, """") КАК Фамилия,
	// ЗУПК
	|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ФИОПолные, Комиссия.ЧленКомиссии) КАК ФИОПолные,
	// ЗУПК
	|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.Пол, НЕОПРЕДЕЛЕНО) КАК Пол
	|ПОМЕСТИТЬ ВТЧленыКомиссии
	|ИЗ
	|	ВТКомиссия КАК Комиссия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО Комиссия.ЧленКомиссии = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО Комиссия.Должность = Должности.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКомиссия";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТУчастникиОсмотраФизическиеЛица", "Участник,Период");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФамилияИО");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Осмотр.Ссылка,
	|	Осмотр.Участник,
	|	Осмотр.ПроцессуальноеПоложение,
	|	Осмотр.ПоступившиеЗаявления,
	|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ФамилияИО, Осмотр.Участник) КАК ФамилияИО
	|ПОМЕСТИТЬ ВТУчастникиОсмотра
	|ИЗ
	|	ВТОсмотр КАК Осмотр
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО Осмотр.Участник = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТУчастникиОсмотраФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсмотр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеФизическихЛиц";
	
	Запрос.Выполнить();
	
	СоздатьПустыеТаблицыОсновныхСотрудников(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПострадавшиеФизическиеЛица.Организация КАК Организация,
	|	ПострадавшиеФизическиеЛица.Пострадавший КАК ФизическоеЛицо,
	|	ПострадавшиеФизическиеЛица.Период КАК Период
	|ИЗ
	|	ВТПострадавшиеФизическиеЛица КАК ПострадавшиеФизическиеЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПострадавшиеФизическиеЛица.Организация,
	|	ПострадавшиеФизическиеЛица.Период";
	
	ВыборкаПострадавшие = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПострадавшие.СледующийПоЗначениюПоля("Организация") Цикл
		Пока ВыборкаПострадавшие.СледующийПоЗначениюПоля("Период") Цикл
			
			МассивФизическихЛиц = Новый Массив;
			Пока ВыборкаПострадавшие.Следующий() Цикл
				МассивФизическихЛиц.Добавить(ВыборкаПострадавшие.ФизическоеЛицо);
			КонецЦикла;
			
			ДополнитьОсновныхСотрудниковПоФизическимЛицам(
				Запрос.МенеджерВременныхТаблиц, МассивФизическихЛиц, ВыборкаПострадавшие.Организация, ВыборкаПострадавшие.Период);
			
		КонецЦикла;
	КонецЦикла;
	
	ПолучитьСотрудниковПоПриоритету(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	ВТОсновныеСотрудники КАК ОсновныеСотрудники";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	НЕОПРЕДЕЛЕНО КАК ФизическоеЛицо,
		|	НЕОПРЕДЕЛЕНО КАК Сотрудник,
		|	НЕОПРЕДЕЛЕНО КАК ФИОПолные,
		|	НЕОПРЕДЕЛЕНО КАК ФамилияИО,
		|	НЕОПРЕДЕЛЕНО КАК Пол,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРождения,
		|	НЕОПРЕДЕЛЕНО КАК Профессии,
		|	НЕОПРЕДЕЛЕНО КАК СоставСемьи,
		|	НЕОПРЕДЕЛЕНО КАК СостояниеВБраке,
		|	НЕОПРЕДЕЛЕНО КАК Фамилия,
		|	НЕОПРЕДЕЛЕНО КАК Имя,
		|	НЕОПРЕДЕЛЕНО КАК Отчество,
		|	НЕОПРЕДЕЛЕНО КАК ВидДоговора,
		|	ЛОЖЬ КАК ОформленПоТрудовомуДоговору
		|ПОМЕСТИТЬ ВТКадровыеДанныеСотрудников";
		
		Запрос.Выполнить();
		
	Иначе
		КадровыеДанные = "ФИОПолные, ФамилияИО, Пол, ДатаРождения, Профессии, СоставСемьи, СостояниеВБраке, Фамилия, Имя, Отчество, ВидДоговора, ОформленПоТрудовомуДоговору";
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц, "ВТОсновныеСотрудники");
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТрудовойДоговор", НСтр("ru = 'Трудовой договор'"));
	Запрос.УстановитьПараметр("ДоговорГражданскоПравовогоХарактера", НСтр("ru = 'Договор гражданско-правового характера'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пострадавшие.Ссылка,
	|	Пострадавшие.Пострадавший,
	|	Пострадавшие.РабочееМесто,
	|	ЕСТЬNULL(Должности.Наименование, """") КАК ДолжностьНаименование,
	|	Пострадавшие.СтажОбщийПредставление,
	|	Пострадавшие.СтажВОрганизацииПредставление,
	// ЗУПК
	|	Пострадавшие.СтажРаботыНаПредприятииЛет,
	|	ЕСТЬNULL(Должности.Ссылка, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК ДолжностьСсылка,
	|	Пострадавшие.Период,
	// ЗУПК
	|	Пострадавшие.ОпьянениеПострадавшего,
	|	Пострадавшие.ВидИСтепеньОпьянения,
	|	Пострадавшие.ХарактерПовреждений,
	|	Пострадавшие.СведенияСОУТ,
	|	Пострадавшие.СведенияОПСОУТ,
	|	Пострадавшие.НачалоСтажировки,
	|	Пострадавшие.ОкончаниеСтажировки,
	|	КадровыеДанныеСотрудников.Сотрудник,
	|	КадровыеДанныеСотрудников.ФИОПолные,
	|	КадровыеДанныеСотрудников.ФамилияИО,
	|	КадровыеДанныеСотрудников.Фамилия,
	|	КадровыеДанныеСотрудников.Имя,
	|	КадровыеДанныеСотрудников.Отчество,
	|	КадровыеДанныеСотрудников.Пол,
	|	КадровыеДанныеСотрудников.ДатаРождения,
	|	РАЗНОСТЬДАТ(КадровыеДанныеСотрудников.ДатаРождения, Пострадавшие.Период, ГОД) КАК Возраст,
	|	КадровыеДанныеСотрудников.Профессии,
	|	КадровыеДанныеСотрудников.СоставСемьи,
	|	ЕСТЬNULL(КадровыеДанныеСотрудников.СостояниеВБраке, """") КАК СостояниеВБраке,
	|	ВЫБОР
	|		КОГДА КадровыеДанныеСотрудников.ВидДоговора <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка)
	|			ТОГДА КадровыеДанныеСотрудников.ВидДоговора
	|		КОГДА КадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
	|			ТОГДА &ТрудовойДоговор
	|		ИНАЧЕ &ДоговорГражданскоПравовогоХарактера
	|	КОНЕЦ КАК ВидДоговора
	|ПОМЕСТИТЬ ВТПострадавшие
	|ИЗ
	|	ВТПострадавшиеФизическиеЛица КАК Пострадавшие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО Пострадавшие.Пострадавший = КадровыеДанныеСотрудников.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМестаОхраныТруда КАК РабочиеМеста
	|		ПО Пострадавшие.РабочееМесто = РабочиеМеста.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО (РабочиеМеста.Должность = Должности.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПострадавшиеФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеСотрудников";
	
	Запрос.Выполнить();
	
	СоздатьПустыеТаблицыОсновныхСотрудников(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВиновныеЛицаФизическиеЛица.Организация КАК Организация,
	|	ВиновныеЛицаФизическиеЛица.ВиновноеЛицо КАК ФизическоеЛицо,
	|	ВиновныеЛицаФизическиеЛица.Период КАК Период
	|ИЗ
	|	ВТВиновныеЛицаФизическиеЛица КАК ВиновныеЛицаФизическиеЛица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВиновныеЛицаФизическиеЛица.Организация,
	|	ВиновныеЛицаФизическиеЛица.Период";
	
	ВыборкаВиновныеЛица = Запрос.Выполнить().Выбрать();
	Пока ВыборкаВиновныеЛица.СледующийПоЗначениюПоля("Организация") Цикл
		Пока ВыборкаВиновныеЛица.СледующийПоЗначениюПоля("Период") Цикл
			
			МассивФизическихЛиц = Новый Массив;
			Пока ВыборкаВиновныеЛица.Следующий() Цикл
				МассивФизическихЛиц.Добавить(ВыборкаВиновныеЛица.ФизическоеЛицо);
			КонецЦикла;
			
			ДополнитьОсновныхСотрудниковПоФизическимЛицам(
				Запрос.МенеджерВременныхТаблиц, МассивФизическихЛиц, ВыборкаВиновныеЛица.Организация, ВыборкаВиновныеЛица.Период);
			
		КонецЦикла;
	КонецЦикла;
	
	ПолучитьСотрудниковПоПриоритету(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	ВТОсновныеСотрудники КАК ОсновныеСотрудники";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		КадровыеДанные = "ФамилияИО, Должность, Подразделение, Организация";
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(
			Запрос.МенеджерВременныхТаблиц, "ВТОсновныеСотрудники");
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	НЕОПРЕДЕЛЕНО КАК Сотрудник,
		|	НЕОПРЕДЕЛЕНО КАК ФизическоеЛицо,
		|	НЕОПРЕДЕЛЕНО КАК Период,
		|	НЕОПРЕДЕЛЕНО КАК ФамилияИО,
		|	НЕОПРЕДЕЛЕНО КАК Должность,
		|	НЕОПРЕДЕЛЕНО КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК Организация
		|ПОМЕСТИТЬ ВТКадровыеДанныеСотрудников";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВиновныеЛица.Ссылка,
	|	ВиновныеЛица.ВиновноеЛицо,
	|	ВиновныеЛица.ДопущенныеНарушения,
	|	ВиновныеЛица.СтепеньВины,
	|	КадровыеДанныеСотрудников.Сотрудник,
	|	КадровыеДанныеСотрудников.ФамилияИО,
	|	КадровыеДанныеСотрудников.Должность,
	|	Должности.Наименование КАК ДолжностьНаименование,
	|	КадровыеДанныеСотрудников.Подразделение
	|ПОМЕСТИТЬ ВТВиновныеЛица
	|ИЗ
	|	ВТВиновныеЛицаФизическиеЛица КАК ВиновныеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО ВиновныеЛица.ВиновноеЛицо = КадровыеДанныеСотрудников.ФизическоеЛицо
	|			И ВиновныеЛица.Организация = КадровыеДанныеСотрудников.Организация
	|			И ВиновныеЛица.Период = КадровыеДанныеСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|		ПО (КадровыеДанныеСотрудников.Должность = Должности.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВиновныеЛицаФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеСотрудников";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТОчевидцыФизическиеЛица", "Очевидец,Период");
	// ЗУПК
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ФамилияИО,ФИОПолные");
	// ЗУПК
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Очевидцы.Ссылка,
	|	Очевидцы.Очевидец,
	|	Очевидцы.АдресПредставление,
	|	Очевидцы.КонтактныйТелефонПредставление,
	// ЗУПК
	|	КадровыеДанныеФизическихЛиц.ФИОПолные,
	// ЗУПК
	|	КадровыеДанныеФизическихЛиц.ФамилияИО
	|ПОМЕСТИТЬ ВТОчевидцы
	|ИЗ
	|	ВТОчевидцыФизическиеЛица КАК Очевидцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
	|		ПО Очевидцы.Очевидец = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОчевидцыФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТКадровыеДанныеФизическихЛиц";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокументов.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ДанныеПечати = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		ДанныеПечати.Вставить("Дата", Формат(ДанныеПечати.Дата, "ДЛФ=ДД"));
		ДанныеПечати.Вставить("ДатаПроисшествия", Формат(ДанныеПечати.ДатаПроисшествияДатаВремя, "ДЛФ=ДД"));
		ДанныеПечати.Вставить("ДатаПроисшествияЧасы", Час(ДанныеПечати.ДатаПроисшествияДатаВремя));
		ДанныеПечати.Вставить("ДатаПроисшествияМинуты", Минута(ДанныеПечати.ДатаПроисшествияДатаВремя));
		ДанныеПечати.Вставить("ДатаСоставленияПротоколаОсмотра", Формат(ДанныеПечати.ДатаСоставленияПротоколаОсмотра, "ДЛФ=ДД"));
		ДанныеПечати.Вставить("ДатаПриказа", Формат(ДанныеПечати.ДатаПриказа, "ДЛФ=ДД"));
		// ЗУПК
		ДанныеПечати.Вставить("ДатаАктаРК", Формат(ДанныеПечати.ДатаАкта, "ДФ='''""''дд''""'' ММММ гггг ''года'''; ДП='""___"" ______________ 20____ года'"));
		// ЗУПК
		ДанныеПечати.Вставить("ДатаАкта", Формат(ДанныеПечати.ДатаАкта, "ДЛФ=ДД"));
		
		ДанныеПечати.Вставить("Город", "");
		ДанныеПечати.Вставить("СведенияОбОрганизации", "");
		ДанныеПечати.Вставить("СведенияОбОрганизацииФСС", "");
		ДанныеПечати.Вставить("СведенияОбОрганизацииЮридическийАдрес", "");
		ДанныеПечати.Вставить("СведенияОбОрганизацииФактическийАдрес", "");
		ДанныеПечати.Вставить("ФИОРуководителя", "");
		ДанныеПечати.Вставить("ПолРуководителя", "");
		ДанныеПечати.Вставить("ФамилияРуководителя", "");
		ДанныеПечати.Вставить("ФИООтветственногоЗаОхрануТруда", "");
		ДанныеПечати.Вставить("ПолОтветственного", "");
		ДанныеПечати.Вставить("ФамилияОтветственного", "");
		ДанныеПечати.Вставить("ФИОПротоколОсмотраСоставил", "");
		ДанныеПечати.Вставить("ПолПротоколОсмотраСоставил", "");
		ДанныеПечати.Вставить("ФамилияПротоколОсмотраСоставил", "");
		ДанныеПечати.Вставить("ФИООсмотрМестаПроизвел", "");
		ДанныеПечати.Вставить("ПолОсмотрМестаПроизвел", "");
		ДанныеПечати.Вставить("ФамилияОсмотрМестаПроизвел", "");
		ДанныеПечати.Вставить("СтрокаЧленыКомиссии", "");
		ДанныеПечати.Вставить("МассивФИОЧленовКомиссии", Новый Массив);
		ДанныеПечати.Вставить("СписокКомиссии", "");
		ДанныеПечати.Вставить("МассивФИОЧленовКомиссииСДолжностями", Новый Массив);
		ДанныеПечати.Вставить("СтрокаУчастникиОсмотра", "");
		ДанныеПечати.Вставить("СтрокаУчастникиОсмотраБезПредседателя", "");
		ДанныеПечати.Вставить("СтрокаПоступившихЗаявлений", "");
		ДанныеПечати.Вставить("МассивУчастниковОсмотра", Новый Массив);
		ДанныеПечати.Вставить("Пострадавшие", Новый ТаблицаЗначений);
		ДанныеПечати.Вставить("СтрокаПострадавшие", "");
		ДанныеПечати.Вставить("СтрокаПострадавшиеФИОПолные", "");
		ДанныеПечати.Вставить("СведенияОПовреждениях", "");
		ДанныеПечати.Вставить("СписокПострадавших", "");
		ДанныеПечати.Вставить("ЧислоПострадавших", "");
		ДанныеПечати.Вставить("СведенияОТрудовыхОтношениях", "");
		ДанныеПечати.Вставить("СтрокаПричиныПроисшествия", "");
		ДанныеПечати.Вставить("СтрокаВиновныеЛица", "");
		ПустаяТаблица = Новый ТаблицаЗначений;
		ПустаяТаблица.Колонки.Добавить("Пострадавший");
		ДанныеПечати.Вставить("Инструктажи", ПустаяТаблица);
		ДанныеПечати.Вставить("МедицинскиеОсмотры", ПустаяТаблица.СкопироватьКолонки());
		ДанныеПечати.Вставить("СтрокаОчевидцы", "");
		ДанныеПечати.Вставить("СведенияОПредседателеКомиссии", "");
		// ЗУПК
		ДанныеПечати.Вставить("СведенияОбОрганизацииРК", "");
		ДанныеПечати.Вставить("СведенияОбОрганизацииКод", "");
		ДанныеПечати.Вставить("БИН", "");
		ДанныеПечати.Вставить("ИИН", "");
		ДанныеПечати.Вставить("АдресРаботодателя1", "");
		ДанныеПечати.Вставить("АдресРаботодателя2", "");
		ДанныеПечати.Вставить("АдресРаботодателяКод", "");
		ДанныеПечати.Вставить("СведенияОПредседателеКомиссииБезДолжности", "");
		ДанныеПечати.Вставить("СтрокаЧленыКомиссииБезОрганизации", "");
		ДанныеПечати.Вставить("ОсновныеПричиныПроисшествия", Новый Массив);
		ДанныеПечати.Вставить("ПредварительныеМедицинскиеОсмотры", ПустаяТаблица);
		ДанныеПечати.Вставить("ОкончательныеДиагнозы", ПустаяТаблица);
		ДанныеПечати.Вставить("СтрокаОчевидцыФИО", "");
		ДанныеПечати.Вставить("СтепеньВины", ПустаяТаблица);
		ДанныеПечати.Вставить("Очевидцы", ПустаяТаблица);
		ДанныеПечати.Вставить("ФИОРуководителяРК", "");
		ДанныеПечати.Вставить("ФИООтветственногоЗаОхрануТрудаРК", "");
		ДанныеПечати.Вставить("МассивФИОЧленовКомиссииРК", Новый Массив);
		// ЗУПК
		
		Если ЗначениеЗаполнено(Выборка.Организация) Тогда
			// Сведения об организации
			КодыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				Выборка.Организация, "КодОКВЭД,НаименованиеОКВЭД,КодОКВЭД2,НаименованиеОКВЭД2,ИНН,НаименованиеОКФС,РегистрационныйНомерФСС");
			
			// ЗУПК
			Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадрыКОРП") Тогда
			// ЗУПК
			Если Выборка.Дата < '20170101' И Не ПустаяСтрока(КодыОрганизации.КодОКВЭД) Тогда
				КодОКВЭД = КодыОрганизации.КодОКВЭД;
				НаименованиеОКВЭД = КодыОрганизации.НаименованиеОКВЭД;
			Иначе
				КодОКВЭД = КодыОрганизации.КодОКВЭД2;
				НаименованиеОКВЭД = КодыОрганизации.НаименованиеОКВЭД2;
			КонецЕсли;
			// ЗУПК
			Иначе
				КодОКВЭД = КодыОрганизации.КодОКВЭД;
				НаименованиеОКВЭД = КодыОрганизации.НаименованиеОКВЭД;
			КонецЕсли;
			// ЗУПК
			
			// ЗУПК
			ДанныеОбОрганизации = ЗарплатаКадры.СведенияОбОрганизации(Выборка.Организация, "ТелОрганизации,ОргСубъект,ОргНПункт,ОргГород,ОКАТО");
			
			АдресВТаблице = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, Выборка.Дата, Ложь);
			АдресПоПолям = "";
			Для Каждого Адрес Из АдресВТаблице Цикл
				АдресПоПолям = Адрес.Значение;
			КонецЦикла;
			// ЗУПК
			ПредставлениеФактическогоАдреса = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, , Выборка.Дата);
			ПредставлениеЮридическогоАдреса = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, , Выборка.Дата);
				
			УстановитьПривилегированныйРежим(Истина);
			Численность = КадровыйУчет.СреднесписочнаяЧисленностьРаботающих(
				Выборка.Организация, ДанныеПечати.ДатаПроисшествияДатаВремя, ДанныеПечати.ДатаПроисшествияДатаВремя).Численность;
			УстановитьПривилегированныйРежим(Ложь);
			
			СведенияОбОрганизации = Выборка.НаименованиеОрганизации
				+ ?(ЗначениеЗаполнено(ПредставлениеЮридическогоАдреса), ", " + НСтр("ru = 'юр. адрес'") + ": " + ПредставлениеЮридическогоАдреса, "")
				+ ?(ЗначениеЗаполнено(ПредставлениеФактическогоАдреса), ", " + НСтр("ru = 'факт. адрес'") + ": " + ПредставлениеФактическогоАдреса, "")
				+ ?(ЗначениеЗаполнено(КодыОрганизации.ИНН), ", " + НСтр("ru = 'ИНН'") + " " + КодыОрганизации.ИНН, "")
				+ ?(ЗначениеЗаполнено(КодОКВЭД), ", " + НСтр("ru = 'ОКВЭД'") + ": " + КодОКВЭД, "")+ " " + НаименованиеОКВЭД
				+ ?(ЗначениеЗаполнено(Численность), ", " + НСтр("ru = 'Численность'") + ": " + Численность, "")
				+ ?(ЗначениеЗаполнено(ДанныеОбОрганизации.ТелОрганизации), ", " + НСтр("ru = 'тел'") + ": " + ДанныеОбОрганизации.ТелОрганизации, "");
			
			// ЗУПК
			СведенияОбОрганизацииРК = Выборка.НаименованиеОрганизации;
			СведенияОбОрганизацииКод =  ?(ЗначениеЗаполнено(КодОКВЭД), """" + КодОКВЭД + """", "");
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Организация, "ЮридическоеФизическоеЛицо") = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
				БИН = ?(ЗначениеЗаполнено(КодыОрганизации.ИНН), КодыОрганизации.ИНН, "");
				ИИН = "";
			Иначе
				ИИН = ?(ЗначениеЗаполнено(КодыОрганизации.ИНН), КодыОрганизации.ИНН, "");
				БИН = "";
			КонецЕсли;
			СтруктураАдресаЗаписи = РаботаСАдресами.СведенияОбАдресе(АдресПоПолям);
			ЗданиеНомер = ?(СтруктураАдресаЗаписи.Свойство("Здание") И СтруктураАдресаЗаписи.Здание.Свойство("Номер"), СтруктураАдресаЗаписи.Здание.Номер, "");
			Если ЗначениеЗаполнено(СтруктураАдресаЗаписи.НаселенныйПункт) Тогда
				АдресРаботодателя1 = СтруктураАдресаЗаписи.Регион + " " + СтруктураАдресаЗаписи.РегионТипКраткий + ", " + СтруктураАдресаЗаписи.Район + " " + СтруктураАдресаЗаписи.РайонТипКраткий;
				АдресРаботодателя2 = СтруктураАдресаЗаписи.НаселенныйПунктТипКраткий + " " + СтруктураАдресаЗаписи.НаселенныйПункт + ", " + СтруктураАдресаЗаписи.Улица + ", " + ЗданиеНомер;
			ИначеЕсли ЗначениеЗаполнено(СтруктураАдресаЗаписи.Город) Тогда
				АдресРаботодателя1 = СтруктураАдресаЗаписи.Регион + " " + СтруктураАдресаЗаписи.РегионТипКраткий + ", " + СтруктураАдресаЗаписи.Район + " " + СтруктураАдресаЗаписи.РайонТипКраткий;
				АдресРаботодателя2 = СтруктураАдресаЗаписи.ГородТипКраткий + " " + СтруктураАдресаЗаписи.Город + ", " + СтруктураАдресаЗаписи.Улица + ", " + ЗданиеНомер;
			Иначе
				АдресРаботодателя1 = СтруктураАдресаЗаписи.Район + " " + СтруктураАдресаЗаписи.РайонТипКраткий;
				АдресРаботодателя2 = "г. " + СтруктураАдресаЗаписи.Регион + ", " + СтруктураАдресаЗаписи.Улица + ", " + ЗданиеНомер;
			КонецЕсли;
			АдресРаботодателяКод = """" + Лев(ДанныеОбОрганизации.ОКАТО, 10) + """";
			// ЗУПК
			
			СведенияОбОрганизацииФСС = Выборка.НаименованиеОрганизации
				+ ?(ЗначениеЗаполнено(ПредставлениеЮридическогоАдреса), ", " + НСтр("ru = 'юр. адрес'") + ": " + ПредставлениеЮридическогоАдреса, "")
				+ ?(ЗначениеЗаполнено(ПредставлениеФактическогоАдреса), ", " + НСтр("ru = 'факт. адрес'") + ": " + ПредставлениеФактическогоАдреса, "")
				+ ?(ЗначениеЗаполнено(ДанныеОбОрганизации.ТелОрганизации), ", " + НСтр("ru = 'тел'") + ": " + ДанныеОбОрганизации.ТелОрганизации, "")
				+ ?(ЗначениеЗаполнено(КодОКВЭД), ", " + НСтр("ru = 'ОКВЭД'") + ": " + КодОКВЭД, "")+ " " + НаименованиеОКВЭД
				+ ?(ЗначениеЗаполнено(КодыОрганизации.НаименованиеОКФС),", " + КодыОрганизации.НаименованиеОКФС, "")
				+ ?(ЗначениеЗаполнено(КодыОрганизации.ИНН), ", " + НСтр("ru = 'ИНН'") + " " + КодыОрганизации.ИНН, "")
				+ ?(ЗначениеЗаполнено(КодыОрганизации.РегистрационныйНомерФСС), ", " + НСтр("ru = 'рег. номер'") + " " + КодыОрганизации.РегистрационныйНомерФСС, "");
			
			ДанныеПечати.Вставить("СведенияОбОрганизации", СведенияОбОрганизации);
			// ЗУПК
			ДанныеПечати.Вставить("СведенияОбОрганизацииРК", СведенияОбОрганизацииРК);
			ДанныеПечати.Вставить("СведенияОбОрганизацииКод", СведенияОбОрганизацииКод);
			ДанныеПечати.Вставить("БИН", БИН);
			ДанныеПечати.Вставить("ИИН", ИИН);
			ДанныеПечати.Вставить("АдресРаботодателя1", АдресРаботодателя1);
			ДанныеПечати.Вставить("АдресРаботодателя2", АдресРаботодателя2);
			ДанныеПечати.Вставить("АдресРаботодателяКод", АдресРаботодателяКод);
			// ЗУПК
			ДанныеПечати.Вставить("СведенияОбОрганизацииФСС", СведенияОбОрганизацииФСС);
			ДанныеПечати.Вставить("СведенияОбОрганизацииЮридическийАдрес", ПредставлениеЮридическогоАдреса);
			ДанныеПечати.Вставить("СведенияОбОрганизацииФактическийАдрес", ПредставлениеФактическогоАдреса);		
			ДанныеПечати.Вставить("Город", ОхранаТруда.ГородИзСведенийОбОрганизации(ДанныеОбОрганизации));
						
		КонецЕсли;
		
		// ФИОРуководителя
		// ЗУПК
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.Руководитель, "ФамилияИО, Пол, Фамилия, ФИОПолные", ДанныеПечати.ДатаПроисшествияДатаВремя);
		// ЗУПК
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ФИОРуководителя", СтрокаКадровыхДанных.ФамилияИО);
			ДанныеПечати.Вставить("ПолРуководителя", СтрокаКадровыхДанных.Пол);
			ДанныеПечати.Вставить("ФамилияРуководителя", СтрокаКадровыхДанных.Фамилия);
			// ЗУПК
			ДанныеПечати.Вставить("ФИОРуководителяРК", СтрокаКадровыхДанных.ФИОПолные);
			// ЗУПК
		КонецЦикла;
		
		// ФИООтветственногоЗаОхрануТруда
		// ЗУПК
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.ОтветственныйЗаОхрануТруда, "ФамилияИО, Пол, Фамилия, ФИОПолные", ДанныеПечати.ДатаПроисшествияДатаВремя);
		// ЗУПК
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ФИООтветственногоЗаОхрануТруда", СтрокаКадровыхДанных.ФамилияИО);
			ДанныеПечати.Вставить("ПолОтветственного", СтрокаКадровыхДанных.Пол);
			ДанныеПечати.Вставить("ФамилияОтветственного", СтрокаКадровыхДанных.Фамилия);
			// ЗУПК
			ДанныеПечати.Вставить("ФИООтветственногоЗаОхрануТрудаРК", СтрокаКадровыхДанных.ФИОПолные);
			// ЗУПК
		КонецЦикла;
		
		// ФИОПротоколОсмотраСоставил
		ДанныеПечати.Вставить("ФИОПротоколОсмотраСоставил", "");
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.ПротоколОсмотраСоставил, "ФамилияИО, Пол, Фамилия", ДанныеПечати.ДатаПроисшествияДатаВремя);
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ФИОПротоколОсмотраСоставил", СтрокаКадровыхДанных.ФамилияИО);
			ДанныеПечати.Вставить("ПолПротоколОсмотраСоставил", СтрокаКадровыхДанных.Пол);
			ДанныеПечати.Вставить("ФамилияПротоколОсмотраСоставил", СтрокаКадровыхДанных.Фамилия);
		КонецЦикла;
		
		// ФИООсмотрМестаПроизвел
		ДанныеПечати.Вставить("ФИООсмотрМестаПроизвел", "");
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.ОсмотрМестаПроизвел, "ФамилияИО, Пол, Фамилия", ДанныеПечати.ДатаПроисшествияДатаВремя);
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ФИООсмотрМестаПроизвел", СтрокаКадровыхДанных.ФамилияИО);
			ДанныеПечати.Вставить("ПолОсмотрМестаПроизвел", СтрокаКадровыхДанных.Пол);
			ДанныеПечати.Вставить("ФамилияОсмотрМестаПроизвел", СтрокаКадровыхДанных.Фамилия);
		КонецЦикла;
		
		// Заполнение соответствия
		ДанныеПечатиОбъектов.Вставить(Выборка.Ссылка, ДанныеПечати);
		
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧленыКомиссии.Ссылка,
	|	ЧленыКомиссии.ЧленКомиссии,
	|	ЧленыКомиссии.Должность,
	|	ЧленыКомиссии.Пол,
	|	ЧленыКомиссии.ДолжностьНаименование,
	|	ЧленыКомиссии.РольВКомиссии,
	|	ЧленыКомиссии.ФамилияИО,
	// ЗУПК
	|	ЧленыКомиссии.ФИОПолные,
	// ЗУПК
	|	ЧленыКомиссии.Фамилия
	|ИЗ
	|	ВТЧленыКомиссии КАК ЧленыКомиссии
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧленыКомиссии.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивФИОЧленовКомиссии = Новый Массив;
		МассивФИОЧленовКомиссииСДолжностями = Новый Массив;
		СтрокаЧленыКомиссии = "";
		СписокКомиссии = "";
		// ЗУПК
		СтрокаЧленыКомиссииБезОрганизации = "";
		МассивФИОЧленовКомиссииРК = Новый Массив;
		// ЗУПК
		Пока Выборка.Следующий() Цикл
			МассивФИОЧленовКомиссии.Добавить(Выборка.ФамилияИО);
			ДопСтрокаЧленаКомиссии = "";
			Если Выборка.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.Председатель Тогда
				// ЗУПК
				ДанныеПечати.Вставить("СведенияОПредседателеКомиссии", Выборка.ФИОПолные + ", " + Выборка.ДолжностьНаименование);
				ДанныеПечати.Вставить("СведенияОПредседателеКомиссииБезДолжности", Выборка.ФИОПолные);
				// ЗУПК
				ДанныеПечати.Вставить("ПредседательКомиссии", Выборка.ЧленКомиссии);
				ДопСтрокаЧленаКомиссии = " " + НСтр("ru = '(председатель комиссии)'");
			КонецЕсли;
			УчастникКомиссии = "- " + Выборка.ФамилияИО + " - " + Выборка.ДолжностьНаименование + ДопСтрокаЧленаКомиссии;
			МассивФИОЧленовКомиссииСДолжностями.Добавить(УчастникКомиссии);
			СтрокаЧленыКомиссии = СтрокаЧленыКомиссии + Выборка.ФамилияИО + " " + Выборка.ДолжностьНаименование;
			// ЗУПК
			Если Выборка.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.ЧленКомиссии Тогда
				СтрокаЧленыКомиссииБезОрганизации = СтрокаЧленыКомиссииБезОрганизации + Выборка.ФИОПолные + ", " + Выборка.ДолжностьНаименование + "; ";
			КонецЕсли;
			МассивФИОЧленовКомиссииРК.Добавить(Выборка.ФИОПолные);
			// ЗУПК
			Если ТипЗнч(Выборка.Должность) <> Тип("Строка") Тогда
				СтрокаЧленыКомиссии = СтрокаЧленыКомиссии + " " + ДанныеПечати.НаименованиеСокращенное + ", ";
			Иначе
				СтрокаЧленыКомиссии = СтрокаЧленыКомиссии + ", ";
			КонецЕсли;
			ФИОЧленаКомиссииСклоняемое = "";
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(Выборка.Фамилия), 2, ФИОЧленаКомиссииСклоняемое, Выборка.Пол);
			ФИОЧленаКомиссииСклоняемое = СтрЗаменить(Выборка.ФамилияИО, Выборка.Фамилия, ФИОЧленаКомиссииСклоняемое);
			СписокКомиссии = СписокКомиссии + ФИОЧленаКомиссииСклоняемое + ", ";
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаЧленыКомиссии, 2);
		// ЗУПК
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаЧленыКомиссииБезОрганизации, 2);
		// ЗУПК
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СписокКомиссии, 2);
		
		ДанныеПечати.Вставить("СтрокаЧленыКомиссии", СтрокаЧленыКомиссии);
		// ЗУПК
		ДанныеПечати.Вставить("СтрокаЧленыКомиссииБезОрганизации", СтрокаЧленыКомиссииБезОрганизации);
		ДанныеПечати.Вставить("МассивФИОЧленовКомиссииРК", МассивФИОЧленовКомиссииРК);
		// ЗУПК
		ДанныеПечати.Вставить("МассивФИОЧленовКомиссии", МассивФИОЧленовКомиссии);
		ДанныеПечати.Вставить("СписокКомиссии", СписокКомиссии);
		ДанныеПечати.Вставить("МассивФИОЧленовКомиссииСДолжностями", МассивФИОЧленовКомиссииСДолжностями);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчастникиОсмотра.Ссылка,
	|	УчастникиОсмотра.Участник,
	|	УчастникиОсмотра.ПроцессуальноеПоложение КАК ВидУчастника,
	|	УчастникиОсмотра.ПоступившиеЗаявления,
	|	УчастникиОсмотра.ФамилияИО
	|ИЗ
	|	ВТУчастникиОсмотра КАК УчастникиОсмотра
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчастникиОсмотра.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивУчастниковОсмотра = Новый Массив;
		СтрокаУчастникиОсмотра = "";
		СтрокаУчастникиОсмотраБезПредседателя = "";
		СтрокаПоступившихЗаявлений = "";
		Пока Выборка.Следующий() Цикл
			СтрокаУчастникиОсмотра = СтрокаУчастникиОсмотра + Выборка.ВидУчастника
				+ " " + Выборка.ФамилияИО + ", ";
			Если Выборка.Участник <> ДанныеПечати.ПредседательКомиссии Тогда
				СтрокаУчастникиОсмотраБезПредседателя = СтрокаУчастникиОсмотраБезПредседателя + Выборка.ВидУчастника
				+ " " + Выборка.ФамилияИО + ", ";
			КонецЕсли;
			Если Не ПустаяСтрока(Выборка.ПоступившиеЗаявления) Тогда
				СтрокаПоступившихЗаявлений = СтрокаПоступившихЗаявлений + Выборка.ВидУчастника + " "
					+ Выборка.ФамилияИО + ": " + Выборка.ПоступившиеЗаявления + ", ";
			КонецЕсли;
			Если ДанныеПечати.ОсмотрМестаПроизвел <> Выборка.Участник Тогда
				МассивУчастниковОсмотра.Добавить(Выборка.ФамилияИО);
			КонецЕсли;
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаУчастникиОсмотра, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаУчастникиОсмотраБезПредседателя, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПоступившихЗаявлений, 2);
		ДанныеПечати.Вставить("СтрокаУчастникиОсмотра", СтрокаУчастникиОсмотра);
		ДанныеПечати.Вставить("СтрокаУчастникиОсмотраБезПредседателя", СтрокаУчастникиОсмотраБезПредседателя);
		ДанныеПечати.Вставить("СтрокаПоступившихЗаявлений", СтрокаПоступившихЗаявлений);
		ДанныеПечати.Вставить("МассивУчастниковОсмотра", МассивУчастниковОсмотра);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	// ЗУПК
	|	Пострадавшие.Ссылка КАК Ссылка,
	|	Пострадавшие.Пострадавший КАК Пострадавший,
	|	Пострадавшие.РабочееМесто КАК РабочееМесто,
	|	Пострадавшие.ДолжностьСсылка КАК ДолжностьСсылка,
	|	МАКСИМУМ(СтатистическийУчет.Период) КАК ПериодКодаДолжности
	|ПОМЕСТИТЬ ВТПострадавшиеПериодКодаДолжности
	|ИЗ
	|	ВТПострадавшие КАК Пострадавшие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатистическийУчет КАК СтатистическийУчет
	|		ПО Пострадавшие.ДолжностьСсылка = СтатистическийУчет.Должность
	|			И Пострадавшие.Период >= СтатистическийУчет.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Пострадавшие.Ссылка,
	|	Пострадавшие.Пострадавший,
	|	Пострадавшие.РабочееМесто,
	|	Пострадавшие.ДолжностьСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	// ЗУПК
	|	Пострадавшие.Ссылка,
	|	Пострадавшие.Пострадавший,
	|	Пострадавшие.РабочееМесто,
	|	Пострадавшие.ДолжностьНаименование,
	|	Пострадавшие.СтажОбщийПредставление,
	|	Пострадавшие.СтажВОрганизацииПредставление,
	// ЗУПК
	|	Пострадавшие.СтажРаботыНаПредприятииЛет,
	|	СтатистическийУчет.КодЗанятия КАК КодДолжности,
	// ЗУПК
	|	Пострадавшие.ОпьянениеПострадавшего,
	|	Пострадавшие.ВидИСтепеньОпьянения,
	|	Пострадавшие.ХарактерПовреждений,
	|	Пострадавшие.СведенияСОУТ,
	|	Пострадавшие.СведенияОПСОУТ,
	|	Пострадавшие.Сотрудник,
	|	Пострадавшие.ФИОПолные,
	|	Пострадавшие.ФамилияИО,
	|	Пострадавшие.Фамилия,
	|	Пострадавшие.Имя,
	|	Пострадавшие.Отчество,
	|	Пострадавшие.Пол,
	|	Пострадавшие.ДатаРождения,
	|	Пострадавшие.Возраст,
	|	Пострадавшие.Профессии,
	|	Пострадавшие.СоставСемьи,
	|	Пострадавшие.СостояниеВБраке,
	|	Пострадавшие.ВидДоговора,
	|	Пострадавшие.НачалоСтажировки,
	|	Пострадавшие.ОкончаниеСтажировки
	|ИЗ
	|	ВТПострадавшие КАК Пострадавшие
	// ЗУПК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПострадавшиеПериодКодаДолжности КАК ПострадавшиеПериодКодаДолжности
	|		ПО Пострадавшие.Ссылка = ПострадавшиеПериодКодаДолжности.Ссылка
	|			И Пострадавшие.Пострадавший = ПострадавшиеПериодКодаДолжности.Пострадавший
	|			И Пострадавшие.РабочееМесто = ПострадавшиеПериодКодаДолжности.РабочееМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатистическийУчет КАК СтатистическийУчет
	|		ПО (ПострадавшиеПериодКодаДолжности.ДолжностьСсылка = СтатистическийУчет.Должность)
	|			И (ПострадавшиеПериодКодаДолжности.ПериодКодаДолжности = СтатистическийУчет.Период)
	// ЗУПК
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пострадавшие.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаПострадавших = РезультатЗапроса.Выгрузить();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НайденныеСтроки = ТаблицаПострадавших.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Пострадавшие = ТаблицаПострадавших.Скопировать(НайденныеСтроки);
		
		СтрокаПострадавшие = "";
		СтрокаПострадавшиеФИОПолные = "";
		СведенияОПовреждениях = "";
		СписокПострадавших = "";
		СведенияОТрудовыхОтношениях = "";
		Для каждого СтрокаТаблицыПострадавшие Из Пострадавшие Цикл
			СтрокаПострадавшие = СтрокаПострадавшие + СтрокаТаблицыПострадавшие.ФамилияИО + " " + СтрокаТаблицыПострадавшие.Профессии + " " + СтрокаТаблицыПострадавшие.ДолжностьНаименование + " " + СтрокаТаблицыПострадавшие.Возраст + " лет, ";
			СтрокаПострадавшиеФИОПолные = СтрокаПострадавшиеФИОПолные + СтрокаТаблицыПострадавшие.ФИОПолные + " " + СтрокаТаблицыПострадавшие.Профессии + " " + СтрокаТаблицыПострадавшие.ДолжностьНаименование + " " + СтрокаТаблицыПострадавшие.Возраст + " лет, ";
			СведенияОПовреждениях = СведенияОПовреждениях + СтрокаТаблицыПострадавшие.ФамилияИО + " " + СтрокаТаблицыПострадавшие.ХарактерПовреждений + ", ";
			
			ФамилияСклоняемая = "";
			ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(СтрокаТаблицыПострадавшие.Фамилия), 5, ФамилияСклоняемая, СтрокаТаблицыПострадавшие.Пол);
			СписокПострадавших = СписокПострадавших + СтрЗаменить(СтрокаТаблицыПострадавшие.ФамилияИО, СтрокаТаблицыПострадавшие.Фамилия, ФамилияСклоняемая) + ", ";
			
			СведенияОТрудовыхОтношениях = СведенияОТрудовыхОтношениях + СтрокаТаблицыПострадавшие.ФамилияИО + " - " + СтрокаТаблицыПострадавшие.ВидДоговора + ", ";
			
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПострадавшие, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПострадавшиеФИОПолные, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СведенияОПовреждениях, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СписокПострадавших, 2);
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СведенияОТрудовыхОтношениях, 2);
		
		КоличествоПострадавших = НайденныеСтроки.Количество();
		КоличествоПострадавшихПрописью = ЧислоПрописью(КоличествоПострадавших, , НСтр("ru = ',,,,,,,,0'"));
		ПредставлениеПострадавших = СтрокаСЧислом(НСтр("ru = '; пострадавший; ; пострадавших; пострадавших; пострадавших'"), КоличествоПострадавших , ВидЧисловогоЗначения.Количественное);
		ЧислоПострадавших =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2) %3'"), КоличествоПострадавших , КоличествоПострадавшихПрописью , ПредставлениеПострадавших);
		
		ДанныеПечати.Вставить("Пострадавшие", Пострадавшие);
		ДанныеПечати.Вставить("СтрокаПострадавшие", СтрокаПострадавшие);
		ДанныеПечати.Вставить("СтрокаПострадавшиеФИОПолные", СтрокаПострадавшиеФИОПолные);
		ДанныеПечати.Вставить("СведенияОПовреждениях", СведенияОПовреждениях);
		ДанныеПечати.Вставить("СписокПострадавших", СписокПострадавших);
		ДанныеПечати.Вставить("ЧислоПострадавших", ЧислоПострадавших);
		ДанныеПечати.Вставить("СведенияОТрудовыхОтношениях", СведенияОТрудовыхОтношениях);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеПричиныПроисшествия.Ссылка,
	|	НесчастныйСлучайНаПроизводствеПричиныПроисшествия.Причина,
	// ЗУПК
	|	ЕСТЬNULL(ПричиныПроисшествий.Код, """") КАК КодПричины,
	|	ЕСТЬNULL(ПричиныПроисшествий.ПолноеНаименование, """") КАК НаименованиеПричины,
	// ЗУПК
	|	НесчастныйСлучайНаПроизводствеПричиныПроисшествия.Примечание
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.ПричиныПроисшествия КАК НесчастныйСлучайНаПроизводствеПричиныПроисшествия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеПричиныПроисшествия.Ссылка = ДанныеДокументов.Ссылка
	// ЗУПК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПричиныПроисшествий КАК ПричиныПроисшествий
	|		ПО НесчастныйСлучайНаПроизводствеПричиныПроисшествия.Причина = ПричиныПроисшествий.Ссылка
	// ЗУПК
	|
	|УПОРЯДОЧИТЬ ПО
	|	НесчастныйСлучайНаПроизводствеПричиныПроисшествия.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПричиныПроисшествия = "";
		// ЗУПК
		ОсновныеПричиныПроисшествия = Новый Массив;
		КоличествоОсновныхПричин = 0;
		// ЗУПК
		Пока Выборка.Следующий() Цикл
			СтрокаПричиныПроисшествия = СтрокаПричиныПроисшествия + Выборка.Причина + " " + Выборка.Примечание + ", ";
			// ЗУПК
			Если КоличествоОсновныхПричин < 2 Тогда
				ПричинаПроисшествия = Выборка.НаименованиеПричины;
				ОсновныеПричиныПроисшествия.Добавить(ПричинаПроисшествия);
				КодПричины = """" + Выборка.КодПричины + """";
				ОсновныеПричиныПроисшествия.Добавить(КодПричины);
				КоличествоОсновныхПричин = КоличествоОсновныхПричин + 1;
			КонецЕсли;
			// ЗУПК
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаПричиныПроисшествия, 2);
		ДанныеПечати.Вставить("СтрокаПричиныПроисшествия", СтрокаПричиныПроисшествия);
		// ЗУПК
		ДанныеПечати.Вставить("ОсновныеПричиныПроисшествия", ОсновныеПричиныПроисшествия);
		// ЗУПК
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВиновныеЛица.Ссылка,
	|	ВиновныеЛица.ВиновноеЛицо,
	|	ВиновныеЛица.ДопущенныеНарушения,
	|	ВиновныеЛица.СтепеньВины,
	|	ВиновныеЛица.ФамилияИО,
	|	ВиновныеЛица.Должность,
	|	ВиновныеЛица.ДолжностьНаименование,
	|	ВиновныеЛица.Подразделение
	|ИЗ
	|	ВТВиновныеЛица КАК ВиновныеЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО ВиновныеЛица.Ссылка = ДанныеДокументов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВиновныеЛица.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
	
		СтрокаВиновныеЛица = "";
		Пока Выборка.Следующий() Цикл
			СтрокаВиновныеЛица = СтрокаВиновныеЛица + Выборка.ФамилияИО
				+ Выборка.ДолжностьНаименование + " " + Выборка.Подразделение + ". " + Выборка.ДопущенныеНарушения 
				+ ?(ЗначениеЗаполнено(Выборка.СтепеньВины), " " + НСтр("ru = 'Степень вины'") + " - " + Выборка.СтепеньВины + "%.", "") + "    ";
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаВиновныеЛица, 2);
		ДанныеПечати.Вставить("СтрокаВиновныеЛица", СтрокаВиновныеЛица);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеИнструктажи.Ссылка КАК Ссылка,
	|	НесчастныйСлучайНаПроизводствеИнструктажи.Пострадавший КАК Пострадавший,
	|	НесчастныйСлучайНаПроизводствеИнструктажи.ВидИнструктажа,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НесчастныйСлучайНаПроизводствеИнструктажи.ВидИнструктажа = ЗНАЧЕНИЕ(Справочник.ВидыИнструктажейПоОхранеТруда.Вводный)
	|				ТОГДА НесчастныйСлучайНаПроизводствеИнструктажи.ДатаПрохождения
	|		КОНЕЦ) КАК ДатаВводногоИнструктажа,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НесчастныйСлучайНаПроизводствеИнструктажи.ВидИнструктажа <> ЗНАЧЕНИЕ(Справочник.ВидыИнструктажейПоОхранеТруда.Вводный)
	|				ТОГДА НесчастныйСлучайНаПроизводствеИнструктажи.ДатаПрохождения
	|		КОНЕЦ) КАК ДатаИнструктажаНаРабочемМесте
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Инструктажи КАК НесчастныйСлучайНаПроизводствеИнструктажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеИнструктажи.Ссылка = ДанныеДокументов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	НесчастныйСлучайНаПроизводствеИнструктажи.Ссылка,
	|	НесчастныйСлучайНаПроизводствеИнструктажи.Пострадавший,
	|	НесчастныйСлучайНаПроизводствеИнструктажи.ВидИнструктажа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Пострадавший,
	|	ДатаВводногоИнструктажа,
	|	ДатаИнструктажаНаРабочемМесте";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаИнструктажей = РезультатЗапроса.Выгрузить();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаИнструктажей.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Инструктажи = ТаблицаИнструктажей.Скопировать(НайденныеСтроки);
		
		ДанныеПечати.Вставить("Инструктажи", Инструктажи);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТекстОтсутствияОсмотра", НСтр("ru='не проводился'"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Ссылка КАК Ссылка,
	|	НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Пострадавший КАК Пострадавший,
	|	НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.ВидОсмотра,
	|	МАКСИМУМ(НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.ДатаПройденногоОсмотра) КАК ДатаПройденногоОсмотра
	|ПОМЕСТИТЬ ВТПоследниеМедицинскиеОсмотры
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.МедицинскиеОсмотры КАК НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Ссылка = ДанныеДокументов.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Ссылка,
	|	НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Пострадавший,
	|	НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.ВидОсмотра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоследниеМедицинскиеОсмотры.Ссылка КАК Ссылка,
	|	ПоследниеМедицинскиеОсмотры.Пострадавший КАК Пострадавший,
	|	ПоследниеМедицинскиеОсмотры.ВидОсмотра,
	|	ПоследниеМедицинскиеОсмотры.ДатаПройденногоОсмотра КАК ДатаПройденногоОсмотра,
	|	ЕСТЬNULL(НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.РезультатОсмотра, &ТекстОтсутствияОсмотра) КАК РезультатОсмотра
	|ИЗ
	|	ВТПоследниеМедицинскиеОсмотры КАК ПоследниеМедицинскиеОсмотры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве.МедицинскиеОсмотры КАК
	|			НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры
	|		ПО ПоследниеМедицинскиеОсмотры.Ссылка = НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Ссылка
	|		И ПоследниеМедицинскиеОсмотры.Пострадавший = НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.Пострадавший
	|		И ПоследниеМедицинскиеОсмотры.ВидОсмотра = НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.ВидОсмотра
	|		И ПоследниеМедицинскиеОсмотры.ДатаПройденногоОсмотра = НесчастныйСлучайНаПроизводствеМедицинскиеОсмотры.ДатаПройденногоОсмотра
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Пострадавший,
	|	ДатаПройденногоОсмотра";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаМедосмотров = РезультатЗапроса.Выгрузить();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаМедосмотров.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Медосмотры = ТаблицаМедосмотров.Скопировать(НайденныеСтроки);
		
		ДанныеПечати.Вставить("МедицинскиеОсмотры", Медосмотры);
	КонецЦикла;
	
	// ЗУПК
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка КАК Ссылка,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший КАК Пострадавший,
	|	ДанныеДокументов.Дата КАК Дата
	|ПОМЕСТИТЬ ВТПострадавшиеДляПредварительныхОсмотров
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = ДанныеДокументов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пострадавшие.Ссылка КАК Ссылка,
	|	Пострадавшие.Пострадавший КАК Пострадавший,
	|	МАКСИМУМ(ЕСТЬNULL(МедицинскиеОсмотры.Период, ДАТАВРЕМЯ(1,1,1))) КАК ДатаПройденногоОсмотра
	|ИЗ
	|	ВТПострадавшиеДляПредварительныхОсмотров КАК Пострадавшие
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МедицинскиеОсмотры КАК МедицинскиеОсмотры
	|		ПО Пострадавшие.Пострадавший = МедицинскиеОсмотры.ФизическоеЛицо
	|			И МедицинскиеОсмотры.ТипОсмотра = ЗНАЧЕНИЕ(Перечисление.ТипыМедицинскогоОсмотра.Предварительный)
	|			И Пострадавшие.Дата >= МедицинскиеОсмотры.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Пострадавшие.Ссылка,
	|	Пострадавшие.Пострадавший
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Пострадавший";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаМедосмотров = РезультатЗапроса.Выгрузить();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаМедосмотров.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Медосмотры = ТаблицаМедосмотров.Скопировать(НайденныеСтроки);
		
		ДанныеПечати.Вставить("ПредварительныеМедицинскиеОсмотры", Медосмотры);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка КАК Ссылка,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший КАК Пострадавший,
	|	ЕСТЬNULL(ПоследствияНесчастногоСлучаяПострадавшие.ОкончательныйДиагноз, """") КАК ОкончательныйДиагноз
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоследствияНесчастногоСлучая.Пострадавшие КАК ПоследствияНесчастногоСлучаяПострадавшие
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = ПоследствияНесчастногоСлучаяПострадавшие.Ссылка.ДокументОснование
	|			И НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший = ПоследствияНесчастногоСлучаяПострадавшие.Пострадавший
	|			И ПоследствияНесчастногоСлучаяПострадавшие.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Пострадавший";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаМедосмотров = РезультатЗапроса.Выгрузить();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаМедосмотров.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Медосмотры = ТаблицаМедосмотров.Скопировать(НайденныеСтроки);
		
		ДанныеПечати.Вставить("ОкончательныеДиагнозы", Медосмотры);
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка КАК Ссылка,
	|	НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший КАК Пострадавший,
	|	ЕСТЬNULL(НесчастныйСлучайНаПроизводствеВиновныеЛица.СтепеньВины, 0) КАК СтепеньВиныРаботника,
	|	100 - ЕСТЬNULL(НесчастныйСлучайНаПроизводствеВиновныеЛица.СтепеньВины, 0) КАК СтепеньВиныРаботодателя
	|ИЗ
	|	Документ.НесчастныйСлучайНаПроизводстве.Пострадавшие КАК НесчастныйСлучайНаПроизводствеПострадавшие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = ДанныеДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НесчастныйСлучайНаПроизводстве.ВиновныеЛица КАК НесчастныйСлучайНаПроизводствеВиновныеЛица
	|		ПО НесчастныйСлучайНаПроизводствеПострадавшие.Ссылка = НесчастныйСлучайНаПроизводствеВиновныеЛица.Ссылка
	|			И НесчастныйСлучайНаПроизводствеПострадавшие.Пострадавший = НесчастныйСлучайНаПроизводствеВиновныеЛица.ВиновноеЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Пострадавший";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаСтепениВины = РезультатЗапроса.Выгрузить();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаСтепениВины.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		СтепениВины = ТаблицаСтепениВины.Скопировать(НайденныеСтроки);
		
		ДанныеПечати.Вставить("СтепениВины", СтепениВины);
	КонецЦикла;
	// ЗУПК
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Очевидцы.Ссылка,
	|	Очевидцы.Очевидец,
	|	Очевидцы.АдресПредставление,
	|	Очевидцы.КонтактныйТелефонПредставление,
	// ЗУПК
	|	Очевидцы.ФИОПолные,
	// ЗУПК
	|	Очевидцы.ФамилияИО
	|ИЗ
	|	ВТОчевидцы КАК Очевидцы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очевидцы.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОчевидцы = "";
		// ЗУПК
		СтрокаОчевидцыФИО = "";
		// ЗУПК
		Пока Выборка.Следующий() Цикл
			СтрокаОчевидцы = СтрокаОчевидцы + Выборка.ФамилияИО + " " + Выборка.АдресПредставление + " "
				+ Выборка.КонтактныйТелефонПредставление + ", ";
			// ЗУПК
			СтрокаОчевидцыФИО = СтрокаОчевидцыФИО + Выборка.ФИОПолные + ", ";
			// ЗУПК
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаОчевидцы, 2);
		ДанныеПечати.Вставить("СтрокаОчевидцы", СтрокаОчевидцы);
		// ЗУПК
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаОчевидцыФИО, 2);
		ДанныеПечати.Вставить("СтрокаОчевидцыФИО", СтрокаОчевидцыФИО);
		// ЗУПК
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

Процедура СоздатьПустыеТаблицыОсновныхСотрудников(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка) КАК ВидЗанятости,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ ВТОсновныеСотрудники";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ДополнитьОсновныхСотрудниковПоФизическимЛицам(МенеджерВременныхТаблиц, МассивФизическихЛиц, Организация, ДатаСведений)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация = Организация;
	ПараметрыПолученияСотрудников.НачалоПериода = ДатаСведений;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = ДатаСведений;
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = МассивФизическихЛиц;
	ПараметрыПолученияСотрудников.РаботникиПоДоговорамГПХ = Истина;
	ПараметрыПолученияСотрудников.КадровыеДанные = "ВидЗанятости";
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеСотрудники.Сотрудник,
	|	ОсновныеСотрудники.ФизическоеЛицо,
	|	ОсновныеСотрудники.Период,
	|	ОсновныеСотрудники.ВидЗанятости,
	|	ОсновныеСотрудники.Приоритет
	|ПОМЕСТИТЬ ВТОсновныеСотрудникиВрем
	|ИЗ
	|	ВТОсновныеСотрудники КАК ОсновныеСотрудники
	|ГДЕ
	|	ОсновныеСотрудники.Сотрудник ЕСТЬ НЕ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСотрудникиФизическихЛиц.Сотрудник,
	|	ОсновныеСотрудникиФизическихЛиц.ФизическоеЛицо,
	|	ОсновныеСотрудникиФизическихЛиц.Период,
	|	ОсновныеСотрудникиФизическихЛиц.ВидЗанятости,
	|	ВЫБОР
	|		КОГДА ОсновныеСотрудникиФизическихЛиц.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
	|			ТОГДА 1
	|		КОГДА ОсновныеСотрудникиФизическихЛиц.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)
	|			ТОГДА 2
	|		КОГДА ОсновныеСотрудникиФизическихЛиц.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Подработка)
	|			ТОГДА 3
	|		КОГДА ОсновныеСотрудникиФизическихЛиц.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)
	|			ТОГДА 4
	|		ИНАЧЕ 99
	|	КОНЕЦ
	|ИЗ
	|	ВТСотрудникиОрганизации КАК ОсновныеСотрудникиФизическихЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСотрудникиВрем.Сотрудник,
	|	ОсновныеСотрудникиВрем.ФизическоеЛицо,
	|	ОсновныеСотрудникиВрем.Период,
	|	ОсновныеСотрудникиВрем.ВидЗанятости,
	|	ОсновныеСотрудникиВрем.Приоритет
	|ПОМЕСТИТЬ ВТОсновныеСотрудники
	|ИЗ
	|	ВТОсновныеСотрудникиВрем КАК ОсновныеСотрудникиВрем
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСотрудникиВрем.Сотрудник,
	|	ОсновныеСотрудникиВрем.ФизическоеЛицо,
	|	ОсновныеСотрудникиВрем.Период,
	|	ОсновныеСотрудникиВрем.ВидЗанятости,
	|	ОсновныеСотрудникиВрем.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеСотрудникиВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСотрудникиОрганизации";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПолучитьСотрудниковПоПриоритету(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеСотрудники.Сотрудник,
	|	ОсновныеСотрудники.ФизическоеЛицо,
	|	ОсновныеСотрудники.Период,
	|	ОсновныеСотрудники.ВидЗанятости,
	|	ОсновныеСотрудники.Приоритет
	|ПОМЕСТИТЬ ВТОсновныеСотрудникиВрем
	|ИЗ
	|	ВТОсновныеСотрудники КАК ОсновныеСотрудники
	|ГДЕ
	|	ОсновныеСотрудники.Сотрудник ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСотрудники.Сотрудник,
	|	ОсновныеСотрудники.Период,
	|	МИНИМУМ(ОсновныеСотрудники.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетыСотрудников
	|ИЗ
	|	ВТОсновныеСотрудникиВрем КАК ОсновныеСотрудники
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСотрудники.Сотрудник,
	|	ОсновныеСотрудники.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеСотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСотрудники.Сотрудник,
	|	ОсновныеСотрудники.ФизическоеЛицо,
	|	ОсновныеСотрудники.Период,
	|	ОсновныеСотрудники.ВидЗанятости
	|ПОМЕСТИТЬ ВТОсновныеСотрудники
	|ИЗ
	|	ВТПриоритетыСотрудников КАК ПриоритетыСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеСотрудникиВрем КАК ОсновныеСотрудники
	|		ПО ПриоритетыСотрудников.Сотрудник = ОсновныеСотрудники.Сотрудник
	|			И ПриоритетыСотрудников.Период = ОсновныеСотрудники.Период
	|			И ПриоритетыСотрудников.Приоритет = ОсновныеСотрудники.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОсновныеСотрудникиВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПриоритетыСотрудников";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли