
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пострадавший = Параметры.Пострадавший;
	Организация = Параметры.Организация;
	ФИОПострадавшийСклоняемое = Строка(Пострадавший);
	ФизическиеЛицаЗарплатаКадры.Просклонять(Строка(ФИОПострадавшийСклоняемое), 2, ФИОПострадавшийСклоняемое, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пострадавший, "Пол"));
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Пройденные инструктажи: %1'"), ФИОПострадавшийСклоняемое);
	
	Медосмотры.Очистить();
	Для каждого СтрокаМедосмотра Из Параметры.МедицинскиеОсмотры Цикл
		НоваяСтрока = Медосмотры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМедосмотра);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Пострадавший", Пострадавший);
	
	МассивМедосмотров = Новый Массив;
	Для каждого СтрокаТаблицы Из Медосмотры Цикл
		СтрокаИнструктажа = Новый Структура;
		СтрокаИнструктажа.Вставить("ВидОсмотра", СтрокаТаблицы.ВидОсмотра);
		СтрокаИнструктажа.Вставить("ДатаПройденногоОсмотра", СтрокаТаблицы.ДатаПройденногоОсмотра);
		СтрокаИнструктажа.Вставить("РезультатОсмотра", СтрокаТаблицы.РезультатОсмотра);
		МассивМедосмотров.Добавить(СтрокаИнструктажа);
	КонецЦикла;
	
	ПараметрыЗакрытия.Вставить("МедицинскиеОсмотры", МассивМедосмотров);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ИспользоватьМедицинскиеОсмотры = ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры");
	Если Не ИспользоватьМедицинскиеОсмотры Тогда
		Возврат;
	КонецЕсли;
	
	Медосмотры.Очистить();
	МедосмотрыФизлиц = МедицинскиеОсмотры.МедицинскиеОсмотрыФизическихЛиц(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Пострадавший));
	Для Каждого МедосмотрФизлица Из МедосмотрыФизлиц Цикл
		НоваяСтрока = Медосмотры.Добавить();
		НоваяСтрока.ВидОсмотра = МедосмотрФизлица.ВидОсмотра;
		НоваяСтрока.ДатаПройденногоОсмотра = МедосмотрФизлица.ДатаПройденногоОсмотра;
		НоваяСтрока.РезультатОсмотра = МедосмотрФизлица.РезультатОсмотра;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти
