#Область ПрограммныйИнтерфейс

Функция ВидДокументаФизическогоЛица(ВидДокумента) Экспорт
	
	Если ЭтоКонфигурацияБК() Тогда
		Результат = ВидДокументаФизическогоЛицаБК(ВидДокумента);
	Иначе
		Результат = ВидДокументаФизическогоЛицаЗУП(ВидДокумента);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоКонфигурацияБК() Экспорт
	
	Возврат (Метаданные.Имя = "БухгалтерияДляКазахстана")
			ИЛИ (Метаданные.Имя = "БухгалтерияДляКазахстанаБазовая");
	
КонецФункции

#Область ЗУП_3_1_31_58

// ИнтеграцияУправлениеПерсоналомОбмен
Функция СклоненияПредставленияОбъекта(Представление, Ссылка) Экспорт
	
	Склонения = Новый Структура;
	СоответствиеПадежей = СоответствиеПадежей();
	Для каждого КлючиЗначение Из СоответствиеПадежей Цикл
		Склонения.Вставить(КлючиЗначение.Значение, СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, КлючиЗначение.Ключ));
	КонецЦикла;
	
	Возврат Склонения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗарплатаИУправлениеПерсоналомДляКазахстана

Функция ВидДокументаФизическогоЛицаЗУП(ВидДокумента)
	
	Результат = "other";
	
	Если ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.УдостоверениеЛичностиРК Тогда
		Результат = "identityCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРК Тогда
		Результат = "passport";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.НайтиПоРеквизиту("КодМВД", "10") Тогда
		Результат = "foreignPassport";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство Тогда
		Результат = "residenceCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ВоенныйБилет Тогда
		Результат = "militaryIdentityCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортМоряка Тогда
		Результат = "identityCard";
	ИначеЕсли ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ДипломатическийПаспорт Тогда
		Результат = "passport";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область БухгалтерияДляКазахстана

Функция ВидДокументаФизическогоЛицаБК(ВидДокумента)
	
	Результат = "other";
	
	//Определение вида документа производить по наименованию элемента
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗУП_3_1_31_58

// ИнтеграцияУправлениеПерсоналомОбмен
Функция СоответствиеПадежей()
	
	СоответствиеПадежей = Новый Соответствие;
	// в ЗУП падежи на русском языке (заменяются в обработке МенеджерКонвертацииУправлениеПерсоналом)
	СоответствиеПадежей.Вставить(1, "nominative");
	СоответствиеПадежей.Вставить(2, "genitive");
	СоответствиеПадежей.Вставить(3, "dative");
	СоответствиеПадежей.Вставить(4, "accusative");
	СоответствиеПадежей.Вставить(5, "instrumental");
	СоответствиеПадежей.Вставить(6, "prepositional");
	
	Возврат СоответствиеПадежей;
	
КонецФункции

#КонецОбласти

#КонецОбласти