////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в регламентированном учете.
// Переопределяемое в потребителе поведение.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция предназначена для вычисления процента ЕНВД в текущем месяце по данным бухгалтерского учета.
// 
//
//	Параметры:
//	 Организация - СправочникСсылка.Организации,
//	 ПериодРегистрации - Дата, состав дата.
//
//	Возвращаемое значение:
//		Число или Неопределено
//
Функция ПроцентЕНВД(Организация, ПериодРегистрации) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Процедура предназначена для формирования движений по бухучету.
//
// Параметры:
//	Движения - Коллекция движений документа, 
//	Отказ - булево, признак отказа от проведения документа.
//	Организация - СправочникСсылка.Организации.
//	МесяцНачисления - тип Дата, месяц, зарплата которого отражается в бухучете.
//	ДанныеДляОтражения - структура. Таблицы значений с данными, которые 
//						могут использоваться для формирования движений по бухучету.
//						При вызове процедуры ДанныеДляОтражения может содержать 
//						одно или несколько полей с приведенными ниже именами, т.е.
//						Необходимо проверять наличие того или иного элемента структуры.
//
//		Имена полей структуры ДанныеДляОтражения (таблиц значений):
//			НачисленнаяЗарплатаИВзносы
//			НачисленныйНДФЛ
//			УдержаннаяЗарплата
//			ОценочныеОбязательства - эта таблица формируется документом НачислениеОценочныхОбязательствПоОтпускам
//			Депоненты - эта таблица формируется документом Депонирование.
//
//		Структура таблиц значений:
//			НачисленнаяЗарплатаИВзносы.
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				Подразделение  - СправочникСсылка.ПодразделенияОрганизаций
//				ВидОперации    - ПеречислениеСсылка.ВидыОперацийПоЗарплате
//				СтатьяРасходов - СправочникСсылка.СтатьиРасходовЗарплата
//				СпособОтраженияЗарплатыВБухучете- СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете
//				ОблагаетсяЕНВД - булево
//				ПериодПринятияРасходов - Дата, для учета РБП, определяет месяц, к которому относятся расходы. Передается дата
//				                         начала месяца.
//				ВидНачисленияОплатыТрудаДляНУ - ПеречислениеСсылка.ВидыНачисленийОплатыТрудаДляНУ
//				Сумма - Число 15.2
//				ПФРПоСуммарномуТарифу - Число 15.2   
//				ПФРСПревышения - Число 15.2
//				ПФРСтраховая - Число 15.2
//				ПФРНакопительная - Число 15.2
//				ФСС - Число 15.2
//				ФФОМС - Число 15.2
//				ТФОМС - Число 15.2
//				ПФРНаДоплатуЛетчикам - Число 15.2
//				ПФРНаДоплатуШахтерам - Число 15.2
//				ПФРЗаЗанятыхНаПодземныхИВредныхРаботах - Число 15.2
//				ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах - Число 15.2
//				ФССНесчастныеСлучаи - Число 15.2.
//				ПФРДоПредельнойВеличины - Число 15.2.
//				ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки - Число 15.2.
//				ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка - Число 15.2.
//				ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки - Число 15.2.
//				ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка - Число 15.2.
//				ВзносыПоЕдиномуТарифу - Число 15.2.
//				
//			НачисленныйНДФЛ
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				ВидОперации    - ПеречислениеСсылка.ВидыОперацийПоЗарплате
//				СтатьяРасходов - СправочникСсылка.СтатьиРасходовЗарплата
//				КодПоОКАТО     - Строка, 11
//				КодПоОКТМО     - Строка, 11
//				КПП   - Строка, 9
//				КодНалоговогоОргана - Строка, 4
//				Сумма - Число 15.2
//				РегистрацияВНалоговомОргане - СправочникСсылка.РегистрацияВНалоговомОргане
//												поле может быть не заполнено, тогда регистрацию надо вычислять по КодПоОКАТО,КодПоОКТМО,КПП,КодНалоговогоОргана.
//				
//			УдержаннаяЗарплата
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				Подразделение  - СправочникСсылка.ПодразделенияОрганизаций
//				ВидОперации    - ПеречислениеСсылка.ВидыОперацийПоЗарплате
//				СтатьяРасходов - СправочникСсылка.СтатьиРасходовЗарплата
//				Контрагент     - СправочникСсылка.Контрагенты, контрагент, в пользу которого произведено удержание.
//				Сумма     - Число 15.2.
//				ОписаниеУдержанияДляЧека - Строка.
//				ЯвляетсяОснованиемОформленияКассовогоЧека - Булево.
//				ДокументОснование - ОпределяемыйТип.ОснованиеУдержания
//				
//			ОценочныеОбязательства
//				Подразделение  - СправочникСсылка.ПодразделенияОрганизаций
//				СпособОтраженияЗарплатыВБухучете- СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете
//				СуммаРезерва - Число 15.2
//				СуммаРезерваСтраховыхВзносов - Число 15.2
//				СуммаРезерваНУ - Число 15.2
//				СуммаРезерваСтраховыхВзносовНУ - Число 15.2
//				СуммаРезерваФССНесчастныеСлучаи - Число 15.2
//				СуммаРезерваФССНесчастныеСлучаиНУ - Число 15.2.
//                             
Процедура СформироватьДвижения(Движения, Отказ, Организация, МесяцНачисления, ДанныеДляОтражения) Экспорт
	
КонецПроцедуры

// ЗУПК

Процедура ЗаполнитьПодразделениеПредприятияПени(ДанныеДляОтражения, СтруктураПараметров) Экспорт
	
	Если НЕ ОрганизационнаяСтруктура.СтруктураПредприятияИспользуетсяДляОтраженияЗарплатыВРегламентированномУчете() Тогда
		Возврат;	
	КонецЕсли;

	ПеняПоВзносамИОтчислениям = ДанныеДляОтражения.ПеняПоВзносамИОтчислениям;
	
	Если ПеняПоВзносамИОтчислениям.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета() Тогда
		ИмяЭлементаПодразделение = "МестоВСтруктуреПредприятия";
	Иначе
		ИмяЭлементаПодразделение = "ПодразделениеПредприятия";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПеняПоВзносамИОтчислениям", ПеняПоВзносамИОтчислениям);
	Запрос.УстановитьПараметр("ПериодРегистрации", СтруктураПараметров.ПериодРегистрации);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПеняПериоды.ФизическоеЛицо КАК ФизическоеЛицо,
		|	&ПериодРегистрации КАК Период
		|ПОМЕСТИТЬ ВТФизическиеЛицаПериоды
		|ИЗ
		|	&ПеняПоВзносамИОтчислениям КАК ПеняПериоды";
	
	Запрос.Выполнить();
	
	КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛицВПериодах(
		МенеджерВременныхТаблиц, Истина, СтруктураПараметров.Организация, "ВТФизическиеЛицаПериоды", "ВТСотрудникиПериоды");
		
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");

	КадровыеДанные = "МестоВСтруктуреПредприятия, ДатаПриема";
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ВЫБОР
	               |		КОГДА КадровыеДанныеСотрудников.Период = КадровыеДанныеСотрудников.ДатаПриема
	               |			ТОГДА НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, МЕСЯЦ)
	               |		ИНАЧЕ КадровыеДанныеСотрудников.Период
	               |	КОНЕЦ КАК Период,
	               |	МАКСИМУМ(КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия) КАК МестоВСтруктуреПредприятия
	               |ИЗ
	               |	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КадровыеДанныеСотрудников.ФизическоеЛицо,
	               |	ВЫБОР
	               |		КОГДА КадровыеДанныеСотрудников.Период = КадровыеДанныеСотрудников.ДатаПриема
	               |			ТОГДА НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, МЕСЯЦ)
	               |		ИНАЧЕ КадровыеДанныеСотрудников.Период
	               |	КОНЕЦ
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   // для начисление приема отдельно добавим таблицу с датами приема
				   |ВЫБРАТЬ
	               |	КадровыеДанныеСотрудников.ФизическоеЛицо,
	               |	НАЧАЛОПЕРИОДА(КадровыеДанныеСотрудников.ДатаПриема, ДЕНЬ),
	               |	КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия
	               |ИЗ
	               |	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	               |
				   |ГДЕ
				   |	КадровыеДанныеСотрудников.Период = КадровыеДанныеСотрудников.ДатаПриема";
				   
	МестоВСтруктуреПредприятияСотрудников = Запрос.Выполнить().Выгрузить();
	МестоВСтруктуреПредприятияСотрудников.Индексы.Добавить("ФизическоеЛицо,Период");
	
	ТипСтруктураПредприятия = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");

	Для Каждого СтрокаТаблицы Из ПеняПоВзносамИОтчислениям Цикл 
		
		Отбор = Новый Структура("ФизическоеЛицо,Период", СтрокаТаблицы.ФизическоеЛицо, СтрокаТаблицы.ДатаНачала);
		НайденныеСтроки = МестоВСтруктуреПредприятияСотрудников.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			СтрокаТаблицы[ИмяЭлементаПодразделение] = НайденныеСтроки[0].МестоВСтруктуреПредприятия;
		КонецЕсли;
		
		// в УПК в налоговых регистрах отсутствует ДатаНачала в связи с чем возникают проблемы заполнения подразделения,
		// если сотрудник принят не с первого числа, получим МестоВСтруктуреПредприятия на начало 01.01.0001 - актуальное место
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы[ИмяЭлементаПодразделение]) Тогда
			Отбор = Новый Структура("ФизическоеЛицо,Период", СтрокаТаблицы.ФизическоеЛицо, Дата(1,1,1));
			НайденныеСтроки = МестоВСтруктуреПредприятияСотрудников.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				СтрокаТаблицы[ИмяЭлементаПодразделение] = НайденныеСтроки[0].МестоВСтруктуреПредприятия;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

// ЗУПК

#КонецОбласти
