#Область ПрограммныйИнтерфейс

Процедура ОбновитьРегламентированныеОтчетыВоиснкийУчетПриЗаписи(Источник, Отказ, Замещение) Экспорт

	РегистрыСведений.СкрытыеРегламентированныеОтчеты.СкрытьВосстановитьОтчеты();
	Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление();
	Справочники.РегламентированныеОтчеты.ЗаполнитьСписокРегламентированныхОтчетов();
	
КонецПроцедуры

#Область ПроцедурыИФункцииМеханизмаАтозаполнения

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
// Пример:
//	Если ИДОтчета = "РегламентированныйОтчет210Форма" Тогда
//		Если ИДРедакцииОтчета = "ФормаОтчета2102016Кв1" Тогда
//			ЗаполнитьФорма2102016Кв1(ПараметрыОтчета, Контейнер);
//		КонецЕсли;
//	КонецЕсли;
//
Процедура ЗаполнитьОтчетВоинскийУчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	Если ИДОтчета = "РегламентированныйОтчетВУСписокПризывников" Тогда
		
		Если ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Тогда
			
			ЗаполнитьСписокПризывниковФорма2017Кв1(ПараметрыОтчета, Контейнер);
			
		КонецЕсли;
		
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетВУСписокПринятыхУволенных" Тогда
		
		Если ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Тогда
			
			ЗаполнитьСписокПринятыхУволенныхФорма2017Кв1(ПараметрыОтчета, Контейнер);
			
		КонецЕсли;
		
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетВУСведенияОЧисленностиПризывников" Тогда
		
		Если ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Тогда
			
			ЗаполнитьСведенияОЧисленностиПризывниковФорма2017Кв1(ПараметрыОтчета, Контейнер);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область РегламентированныйОтчетВУСписокПризывников

Процедура ЗаполнитьСписокПризывниковФорма2017Кв1(ПараметрыОтчета, Контейнер) Экспорт

	// Сведения для отчета берутся за последний квартал.
	ПараметрыОтчетаДляЗаполнения = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыОтчета);
	
	Контейнер.ФормаСтраница1.Военкомат = ПараметрыОтчета.Военкомат;
	Контейнер.ФормаСтраница1.ДатаОтчета1 = Формат(ПараметрыОтчета.мДатаКонцаПериодаОтчета, "ДЛФ=DD");

	СтрокаСведений = "ФИОРук";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(ПараметрыОтчета.Организация,,СтрокаСведений);
	
	Контейнер.ФормаСтраница1.ДатаОтчета = Формат(ТекущаяДата(), "ДЛФ=DD");
	Контейнер.ФормаСтраница1.ФИОРуководителя = СведенияОбОрганизации.ФИОРук;

	// Получение зарплатных данных отчета за квартал
	ДанныеОтчета = Новый ДеревоЗначений;
	ПараметрыОтчетаДляЗаполнения.Вставить("ДатаКонцаПериодаВыборки", ПараметрыОтчета.мДатаКонцаПериодаОтчета);
	ПараметрыОтчетаДляЗаполнения.Вставить("ДатаНачалаПериодаВыборки",ПараметрыОтчета.мДатаНачалаПериодаОтчета);
	// 2) ежегодно к 1 декабря запрашивают от юридических лиц района (города) списки граждан, подлежащих приписке к призывному участку, 
	// по форме согласно приложению 11 к настоящим Правилам (далее – списки граждан). 
	// Граждане старших возрастов, не прошедшие ранее приписку к призывному участку, также записываются в список граждан;
	ДанныеДляЗаполненияРегламентированнойОтчетностиВоинскийУчет("СписокПризывников", ПараметрыОтчетаДляЗаполнения, ДанныеОтчета);
	НомерСтроки = 1;

	Если ДанныеОтчета <> Неопределено Тогда

		Для Каждого СтрокаОрганизация Из ДанныеОтчета.Строки Цикл
			
			Для Каждого СтрокаДанные Из СтрокаОрганизация.Строки Цикл
				Если СтрокаДанные.ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ОсновноеМестоРаботы")
					ИЛИ СтрокаДанные.ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.Совместительство") Тогда
					
					СтрокаСведенийСП = "НаимЮЛПол";
					СведенияОбОрганизацииСП = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтрокаДанные.Организация,,СтрокаСведенийСП);
					
					НоваяСтрокаСтр1 = Контейнер.ФормаСтраница1_ДанныеДопСтрок.Добавить();
					
					НоваяСтрокаСтр1.П000000100101  = НомерСтроки;
					НоваяСтрокаСтр1.П000000100102  = СтрокаДанные.ФИОПолные;
					НоваяСтрокаСтр1.П000000100103  = Формат(Год(СтрокаДанные.ДатаРождения),"ЧГ=0");
					НоваяСтрокаСтр1.П000000100104  = Строка(СведенияОбОрганизацииСП.НаимЮЛПол) + ", " 
													+ Строка(СтрокаДанные.Подразделение) + ", " 
													+ Строка( СтрокаДанные.Должность);
													
					НоваяСтрокаСтр1.П000000100105  = СтрокаДанные.АдресМестаПроживанияПредставление;
					
					НомерСтроки = НомерСтроки +1;
					
					
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентированныйОтчетВУСписокПринятыхУволенных

Процедура ЗаполнитьСписокПринятыхУволенныхФорма2017Кв1(ПараметрыОтчета, Контейнер) Экспорт

	// Сведения для отчета берутся за последний квартал.
	ПараметрыОтчетаДляЗаполнения = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыОтчета);
	
	СтрокаСведений = "ФИОРук";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(ПараметрыОтчета.Организация,,СтрокаСведений);
	
	Контейнер.ФормаСтраница1.ДатаОтчета = Формат(ТекущаяДата(), "ДЛФ=DD");
	Контейнер.ФормаСтраница1.ФИОРуководителя = СведенияОбОрганизации.ФИОРук;

	// Получение зарплатных данных отчета за квартал
	ДанныеОтчета = Новый ДеревоЗначений;
	ПараметрыОтчетаДляЗаполнения.Вставить("ДатаКонцаПериодаВыборки", ПараметрыОтчета.мДатаКонцаПериодаОтчета);
	ПараметрыОтчетаДляЗаполнения.Вставить("ДатаНачалаПериодаВыборки",ПараметрыОтчета.мДатаНачалаПериодаОтчета);
	ПараметрыОтчетаДляЗаполнения.Вставить("ПринятыеУволенные", Истина);
	ПараметрыОтчетаДляЗаполнения.Вставить("ВоеннообязанныеИПризывники", Истина);
	ДанныеДляЗаполненияРегламентированнойОтчетностиВоинскийУчет("СписокВоеннообязанныхПризывниковПринятыхУволенных", ПараметрыОтчетаДляЗаполнения, ДанныеОтчета);
	НомерСтроки = 1;
	
	ДатаПриемаУвольнения = '00010101';
	ПриказПриемаУвольнения = "";
	
	Если ДанныеОтчета <> Неопределено Тогда
		
		Для Каждого СтрокаОрганизация Из ДанныеОтчета.Строки Цикл
			Для Каждого СтрокаДанные Из СтрокаОрганизация.Строки Цикл
				
				Если СтрокаДанные.ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ОсновноеМестоРаботы") Тогда
					
					Если СтрокаДанные.ДатаУвольнения <> '00010101' Тогда
						
						Если СтрокаДанные.ДатаУвольнения > ПараметрыОтчета.мДатаКонцаПериодаОтчета Тогда
							ДатаПриемаУвольнения = Формат(СтрокаДанные.ДатаПриема, "ДФ=dd.MM.yyyy"); 
							ПриказПриемаУвольнения = СтрокаДанные.ПриказОПриеме;
						Иначе 
							ДатаПриемаУвольнения = Формат(СтрокаДанные.ДатаУвольнения, "ДФ=dd.MM.yyyy"); 
							ПриказПриемаУвольнения = СтрокаДанные.ПриказОбУвольнении;
						КонецЕсли;
					Иначе
						ДатаПриемаУвольнения = Формат(СтрокаДанные.ДатаПриема, "ДФ=dd.MM.yyyy"); 
						ПриказПриемаУвольнения = СтрокаДанные.ПриказОПриеме;
					КонецЕсли;
					
					НоваяСтрокаСтр1 = Контейнер.ФормаСтраница1_ДанныеДопСтрок.Добавить();
					
					НоваяСтрокаСтр1.П000000100101  = НомерСтроки;
					НоваяСтрокаСтр1.П000000100102  = СтрокаДанные.Звание;
					НоваяСтрокаСтр1.П000000100103  = СтрокаДанные.ФИОПолные;
					НоваяСтрокаСтр1.П000000100104  = Формат(Год(СтрокаДанные.ДатаРождения),"ЧГ=0");
					НоваяСтрокаСтр1.П000000100105  = ДатаПриемаУвольнения;
					НоваяСтрокаСтр1.П000000100106  = СтрокаДанные.Должность;								
					НоваяСтрокаСтр1.П000000100107  = ПриказПриемаУвольнения;					
					НомерСтроки = НомерСтроки +1;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область РегламентированныйОтчетВУСведенияОЧисленностиПризывников

Процедура ЗаполнитьСведенияОЧисленностиПризывниковФорма2017Кв1(ПараметрыОтчета, Контейнер) Экспорт
	// Сведения для отчета берутся за последний квартал.
	ПараметрыОтчетаДляЗаполнения = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыОтчета);
	
	СтрокаСведений = "ФИОРук, НаимЮЛПол";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(ПараметрыОтчета.Организация,,СтрокаСведений);
	
	Контейнер.ФормаСтраница1.ДатаОтчета 		= Формат(ПараметрыОтчета.мДатаКонцаПериодаОтчета, "ДЛФ=DD");
	Контейнер.ФормаСтраница1.ДатаОтчета1 		= Формат(ТекущаяДата(), "ДЛФ=DD");
	Контейнер.ФормаСтраница1.Организация 		= СведенияОбОрганизации.НаимЮЛПол;
	Контейнер.ФормаСтраница1.ФИОРуководителя 	= СведенияОбОрганизации.ФИОРук;

	// Получение зарплатных данных отчета за квартал
	ДанныеОтчета = Новый ДеревоЗначений;
	ПараметрыОтчетаДляЗаполнения.Вставить("ДатаКонцаПериодаВыборки", ПараметрыОтчета.мДатаКонцаПериодаОтчета);
	ПараметрыОтчетаДляЗаполнения.Вставить("ДатаНачалаПериодаВыборки",ПараметрыОтчета.мДатаНачалаПериодаОтчета);
	ДанныеДляЗаполненияРегламентированнойОтчетностиВоинскийУчет("СведенияОЧисленностиПризывниковВоеннообязанных", ПараметрыОтчетаДляЗаполнения, ДанныеОтчета);
	НомерСтроки = 1;

	Если ДанныеОтчета <> Неопределено Тогда
		
		Для Каждого СтрокаКатегорияВоинскогоУчета Из ДанныеОтчета.Строки Цикл
			
			НоваяСтрокаСтр1 = Контейнер.ФормаСтраница1_ДанныеДопСтрок.Добавить();
			
			НоваяСтрокаСтр1.П000000100101  = НомерСтроки;
			НоваяСтрокаСтр1.П000000100102  = СтрокаКатегорияВоинскогоУчета.КатегорияВоинскогоУчета;
			
			Для Каждого СтрокаДанные Из СтрокаКатегорияВоинскогоУчета.Строки Цикл
				
				Если СтрокаДанные.ВидЗанятости = ПредопределенноеЗначение("Перечисление.ВидыЗанятости.ОсновноеМестоРаботы") Тогда
					
					НоваяСтрокаСтр1.П000000100103  = НоваяСтрокаСтр1.П000000100103 + СтрокаДанные.ВсегоВоеннообязанныхНаУчете;
					
					НоваяСтрокаСтр1.П000000100104  = НоваяСтрокаСтр1.П000000100104 + СтрокаДанные.ВсегоОфицеров;
					НоваяСтрокаСтр1.П000000100105  = НоваяСтрокаСтр1.П000000100105 + ?(СтрокаДанные.Возраст <= 50, СтрокаДанные.ВсегоОфицеров, 0);
					НоваяСтрокаСтр1.П000000100106  = НоваяСтрокаСтр1.П000000100106 + ?(СтрокаДанные.Возраст >= 51 И СтрокаДанные.Возраст <= 60, СтрокаДанные.ВсегоОфицеров, 0);
					
					НоваяСтрокаСтр1.П000000100107  = НоваяСтрокаСтр1.П000000100107 + СтрокаДанные.ВсегоСержантов;
					НоваяСтрокаСтр1.П000000100108  = НоваяСтрокаСтр1.П000000100108 + ?(СтрокаДанные.Возраст <= 40, СтрокаДанные.ВсегоСержантов, 0);
					НоваяСтрокаСтр1.П000000100109  = НоваяСтрокаСтр1.П000000100109 + ?(СтрокаДанные.Возраст >= 41 И СтрокаДанные.Возраст <= 50, СтрокаДанные.ВсегоСержантов, 0);
					
					НоваяСтрокаСтр1.П000000100110  = НоваяСтрокаСтр1.П000000100110 + СтрокаДанные.ВсегоСолдат;
					НоваяСтрокаСтр1.П000000100111  = НоваяСтрокаСтр1.П000000100111 + ?(СтрокаДанные.Возраст <= 40, СтрокаДанные.ВсегоСолдат, 0);
					НоваяСтрокаСтр1.П000000100112  = НоваяСтрокаСтр1.П000000100112 + ?(СтрокаДанные.Возраст >= 41 И СтрокаДанные.Возраст <= 50, СтрокаДанные.ВсегоСолдат, 0);
					
					НоваяСтрокаСтр1.П000000100113  = НоваяСтрокаСтр1.П000000100113 + СтрокаДанные.Призывников;
					НоваяСтрокаСтр1.П000000100114  = НоваяСтрокаСтр1.П000000100114 + СтрокаДанные.НеСостоящихНаВоинскомУчете;
					
				КонецЕсли;
			КонецЦикла;
			НомерСтроки = НомерСтроки +1;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДанныеДляЗаполненияРегламентированнойОтчетностиВоинскийУчет(Вариант, ПараметрыОтчета, ДанныеОтчета)
	
	СхемаКомпоновки = Отчеты.ВоинскийУчетОбщий.ПолучитьМакет("СхемаКомпоновкиДанныхРегл");
	
	ПараметрыОтчета.Вставить("Вариант", Вариант);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, СхемаКомпоновки.ВариантыНастроек[Вариант].Настройки);
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, НастройкиВарианта)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.мДатаНачалаПериодаОтчета;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.мДатаКонцаПериодаОтчета;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", Вариант);
	
	ПараметрПериод = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "Период");
	Если ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартныйПериод") Тогда
		ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
		ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;
	Иначе
		ПараметрПериод.Значение = ДатаКонцаПериодаОтчета; 
	КонецЕсли;
	
	ПараметрПериодОтчета = ЗарплатаКадрыОтчеты.НайтиПараметр(КомпоновщикНастроек, "ПериодОтчета");
	Если ПараметрПериодОтчета <> Неопределено Тогда
		ПараметрПериодОтчета.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
		ПараметрПериодОтчета.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.ВСписке, ПараметрыОтчета.СписокСтруктурныхЕдиниц);
	
	// при передаче пустой ссылки нужно делать отбор по пустому военкомату - для отбора не приписанных к военкомату
	Если ПараметрыОтчета.Свойство("Военкомат") И НЕ ПараметрыОтчета.Военкомат = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Военкомат", ВидСравненияКомпоновкиДанных.Равно, ПараметрыОтчета.Военкомат);
	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("ВоеннообязанныеИПризывники") И ПараметрыОтчета.ВоеннообязанныеИПризывники Тогда
		
		ОтношениеКВоинскомуУчету = Новый СписокЗначений;
		ОтношениеКВоинскомуУчету.Добавить(Перечисления.ОтношениеКВоинскомуУчету.Встает);
		ОтношениеКВоинскомуУчету.Добавить(Перечисления.ОтношениеКВоинскомуУчету.НеСостоит);
		ОтношениеКВоинскомуУчету.Добавить(Перечисления.ОтношениеКВоинскомуУчету.Состоит);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "ОтношениеКВоинскомуУчету", ВидСравненияКомпоновкиДанных.ВСписке, ОтношениеКВоинскомуУчету);

	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("ПринятыеУволенные") И ПараметрыОтчета.ПринятыеУволенные Тогда
		
		ГруппаДатыУвольненияИЛИПриема = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			Отбор.Элементы,
			"ДатыУвольненияИ",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

		ГруппаДатыУвольненияИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			ГруппаДатыУвольненияИЛИПриема,
			"ДатыУвольненияИли",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДатыУвольненияИ,
			"ДатаУвольнения",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно, 
			ДатаНачалаПериодаОтчета);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДатыУвольненияИ,
			"ДатаУвольнения",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, 
			ДатаКонцаПериодаОтчета);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДатыУвольненияИ,
			"ДатаУвольнения",
			ВидСравненияКомпоновкиДанных.Заполнено);
		    		
		ГруппаДатыПриемаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			ГруппаДатыУвольненияИЛИПриема,
			"ДатыПриемаИли",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДатыПриемаИ,
			"ДатаПриема",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно, 
			ДатаНачалаПериодаОтчета);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			ГруппаДатыПриемаИ,
			"ДатаПриема",
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, 
			ДатаКонцаПериодаОтчета);
		
	КонецЕсли;
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
